{
  "title": "80th Anniversary of the Battle of Iwo Jima – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "80th Anniversary of the Battle of Iwo Jima",
  "og:description": "By the President of the United States of America A Proclamation On the morning of February 19, 1945, the first wave of United States Marines landed on the",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/80th-anniversary-of-the-battle-of-iwo-jima/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-20T03:10:10+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\t80th Anniversary of the Battle of Iwo Jima\t\t\t\t\n\nFebruary 19, 2025\n\nBy the President of the United States of America\n\nA Proclamation\n\nOn the morning of February 19, 1945, the first wave of United States Marines landed on the island of Iwo Jima — commencing 36 long, perilous days of gruesome warfare, and one of the most consequential campaigns of the Second World War.  With ruthless fervor, the Japanese struck our forces with mortars, heavy artillery, and a steady barrage of small arms fire, but they could not shake the spirit of the Marines, and American forces did not retreat.\n\nFive days into the conflict, six Marines ascended the island’s highest peak and hoisted Old Glory into the summit of Mount Suribachi — a triumphant moment that has stood the test of time as a lasting symbol of the grit, resolve, and unflinching courage of Marines and all of those who serve our Nation in uniform.\n\nAfter five weeks of unrelenting warfare, the island was declared secure, and our victory advanced America’s cause in the Pacific Theater — but at a staggering cost.  Of the 70,000 men assembled for the campaign, nearly 7,000 Marines and Sailors died, and 20,000 more were wounded.\n\nThe battle was defined by massive casualties, but also acts of gallantry — 27 Marines and Sailors received the Medal of Honor for their valor during Iwo Jima.  No other single battle in our Nation’s history bears this distinction.  Eighty years later, we proudly continue to honor their heroism.\n\nAmerican liberty was secured, in part, by young men who stormed the black sand shores of Iwo Jima and defeated the Japanese Imperial Army eight decades ago.  In spite of a brutal war, the United States–Japan Alliance represents the cornerstone of peace and prosperity in the Indo-Pacific.\n\nNonetheless, our victory at Iwo Jima stands as a legendary display of American might and an eternal testament to the unending love, nobility, and fortitude of America’s Greatest Generation.  To every Patriot who selflessly rose to the occasion, left behind his family and his home, and gallantly shed his blood for freedom on the battlefields at Iwo Jima, we vow to never forget your intrepid devotion — and we pledge to build a country, a culture, and a future worthy of your sacrifice.\n\nNOW, THEREFORE, I, DONALD J. TRUMP, President of the United States of America, by virtue of the authority vested in me by the Constitution and the laws of the United States, do hereby proclaim February 19, 2025, as the 80th Anniversary of the Battle of Iwo Jima.  I encourage all Americans to remember the selfless patriots of the Greatest Generation.\n\n     IN WITNESS WHEREOF, I have hereunto set my hand this nineteenth day of February, in the year of our Lord two thousand twenty-five, and of the Independence of the United States of America the two hundred and forty-ninth.\n",
  "summary": "On February 19, 2025, Donald J. Trump, the President of the United States, issued a proclamation commemorating the 80th anniversary of the Battle of Iwo Jima, a pivotal campaign during World War II. The battle began on February 19, 1945, when U.S. Marines landed on Iwo Jima and faced fierce resistance from the Japanese forces. The conflict lasted for 36 days, resulting in nearly 7,000 American deaths and 20,000 injuries, but ultimately led to a significant victory in the Pacific Theater.\n\nThe proclamation highlights the bravery and sacrifices of the 70,000 men involved, noting the momentous raising of the U.S. flag on Mount Suribachi by six Marines as a symbol of American grit and courage. President Trump also emphasized the strategic impact of the battle and the lasting alliance between the United States and Japan as a cornerstone of peace in the Indo-Pacific region. He urges all Americans to honor the valor of the Greatest Generation and remain committed to building a nation worthy of their sacrifices.",
  "eli5": "A long time ago, during a big war, brave American soldiers fought on an island called Iwo Jima. They worked really hard and raised the American flag on a mountain to show they were strong and brave. Today, we remember and thank those soldiers for their courage.",
  "keywords": [
    "Battle of Iwo Jima",
    "80th Anniversary",
    "World War II",
    "U.S. Marines",
    "Mount Suribachi",
    "Donald J. Trump",
    "Proclamation",
    "American Valor",
    "United States-Japan Alliance"
  ],
  "issues": [
    "Clarification on the specific legal or ceremonial authority for issuing such proclamations.",
    "Potential logistic or commemorative events associated with the proclamation."
  ],
  "citations": [],
  "document_type": "Proclamation"
}