{
  "title": "A Plan for Establishing a United States Sovereign Wealth Fund – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "A Plan for Establishing a United States Sovereign Wealth Fund",
  "og:description": "     By the authority vested in me as President by the Constitution and the laws of the United States of America, and in order to promote",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/a-plan-for-establishing-a-united-states-sovereign-wealth-fund/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-04T00:21:26+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tA Plan For Establishing A United States Sovereign Wealth Fund\t\t\t\t\n\nFebruary 3, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, and in order to promote the long-term financial health and international leadership of the United States, it is hereby ordered:\n\nSection 1.  Policy and Purpose.  It is the policy of the United States to maximize the stewardship of our national wealth for the sole benefit of American citizens.  To this end, it is in the interest of the American people that the Federal Government establish a sovereign wealth fund to promote fiscal sustainability, lessen the burden of taxes on American families and small businesses, establish economic security for future generations, and promote United States economic and strategic leadership internationally. \n\nSec. 2.  Sovereign Wealth Fund.  The Secretary of the Treasury and the Secretary of Commerce, in close coordination with the Assistant to the President for Economic Policy, shall develop a plan for the establishment of a sovereign wealth fund consistent with section 1 of this order.  The Secretary of the Treasury and the Secretary of Commerce shall jointly submit this plan to the President within 90 days of the date of this order.  Such plan shall include recommendations for funding mechanisms, investment strategies, fund structure, and a governance model.  The plan shall also include an evaluation of the legal considerations for establishing and managing such a fund, including any need for legislation. \n\nSec. 3.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,    February 3, 2025.\n",
  "summary": "On February 3, 2025, an executive order was issued by the President of the United States to establish a sovereign wealth fund aimed at promoting the financial health and international leadership of the country. The objective is to enhance the national wealth for the benefit of American citizens by ensuring fiscal sustainability, reducing tax burdens for families and small businesses, securing economic futures, and strengthening the nation's global economic leadership. \n\nThe order directs the Secretary of the Treasury and the Secretary of Commerce, in coordination with the Assistant to the President for Economic Policy, to devise a detailed plan for creating and administering the sovereign wealth fund. This plan must include strategies for funding, investment, structuring, and governance, while also assessing legal considerations and potential legislative needs. The plan is expected to be submitted to the President within 90 days of the order's date.\n\nThe general provisions clarify the order's non-impact on existing legal authority and budgetary processes and emphasize that it does not establish enforceable rights or benefits for any parties. The implementation of this order must align with existing laws and available appropriations.",
  "eli5": "The President wants to create a big savings account for the country to help make money, cut taxes, and keep America strong and safe. Some important people have 90 days to come up with a plan for how to do this.",
  "keywords": [
    "sovereign wealth fund",
    "United States",
    "executive order",
    "economic security",
    "financial health",
    "fiscal sustainability",
    "investment strategies"
  ],
  "issues": [
    "No specific funding mechanisms mentioned",
    "Potential need for legislative action",
    "Details on the governance model are pending",
    "Uncertain legal considerations for establishing the fund"
  ],
  "citations": [
    "Authority vested by the Constitution and laws of the United States"
  ],
  "document_type": "Executive Order"
}