{
  "title": "About The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "About The White House",
  "og:description": "The White House is where the President and First Family of the United States live and work — but it's also the People's House. Learn more about The White House and its grounds, Camp David, and Air Force One.",
  "og:url": "https://www.whitehouse.gov/about-the-white-house/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-01-20T21:38:04+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "# \t\t\t\t\tAbout The White House\t\t\t\t\n\n## [The White House](https://www.whitehouse.gov/about-the-white-house/the-white-house/)\n\nFrom the Ground Floor Corridor rooms, transformed from their early use as service areas, to the State Floor rooms, where countless leaders and dignitaries have been entertained, the White House is both the home of the President of the United States and his family, and a living museum of American history. \n\n## [AIR FORCE ONE](https://www.whitehouse.gov/about-the-white-house/air-force-one/)\n\n“Air Force One” is used to designate any Air Force aircraft carrying the President, but it is now standard practice to use the term to refer to specific planes that are equipped to transport the Commander-in-Chief.\n\n## [CAMP DAVID](https://www.whitehouse.gov/about-the-white-house/camp-david/)\n\nCamp David, known formally as the Naval Support Facility Thurmont, is the President’s country residence. Located in Catoctin Mountain Park in Frederick County, Maryland, Camp David has offered Presidents an opportunity for solitude and tranquility, as well as an ideal place to host foreign leaders.\n",
  "summary": "The White House serves as both the residence of the President of the United States and a historic museum, showcasing American culture and history. Its various rooms, from the State Floor to the Ground Floor Corridor, have been utilized for entertaining global leaders and hosting diplomats. Each space has been transformed from early service areas to reflect its role in showcasing the nation's heritage. \n\nAir Force One is the official designation for any Air Force aircraft carrying the President, although it usually refers to the two specialized planes designed for presidential transportation. These aircraft are equipped to ensure the President's security and efficiency of travel.\n\nCamp David, formally known as the Naval Support Facility Thurmont, is the President's countryside retreat located in Frederick County, Maryland. It provides solitude and a tranquil setting for the President while also serving as an ideal venue for hosting foreign leaders and facilitating important discussions.",
  "eli5": "The White House is where the President lives and it's like a big museum about history. Air Force One is a special airplane that the President uses. Camp David is a quiet place in the mountains where the President can rest and meet with other leaders.",
  "keywords": [
    "The White House",
    "Air Force One",
    "Camp David",
    "President",
    "American history",
    "Presidential residence",
    "Naval Support Facility Thurmont",
    "Catoctin Mountain Park"
  ],
  "issues": [
    "No citations to legal documents or specific rules are provided.",
    "More detailed historical background of each facility could enhance understanding.",
    "Locations and access to these venues are not clearly elaborated."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}