{
  "title": "Additional Measures to Combat Anti-Semitism – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Additional Measures to Combat Anti-Semitism",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.  Purpose.  My",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/additional-measures-to-combat-anti-semitism/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-29T23:52:35+00:00",
  "article:modified_time": "2025-01-29T23:52:36+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tAdditional Measures to Combat Anti-Semitism\t\t\t\t\n\nJanuary 29, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.  Purpose.  My Administration has fought and will continue to fight anti-Semitism in the United States and around the world.  On December 11, 2019, I issued Executive Order 13899, my first Executive Order on Combating Anti-Semitism, finding that students, in particular, faced anti-Semitic harassment in schools and on university and college campuses.  Executive Order 13899 provided interpretive assistance on the enforcement of the Nation’s civil rights laws to ensure that they would protect American Jews to the same extent to which all other American citizens are protected.  The prior administration effectively nullified Executive Order 13899 by failing to give the terms of the order full force and effect throughout the Government.  This order reaffirms Executive Order 13899 and directs additional measures to advance the policy thereof in the wake of the Hamas terrorist attacks of October 7, 2023, against the people of Israel.  These attacks unleashed an unprecedented wave of vile anti-Semitic discrimination, vandalism, and violence against our citizens, especially in our schools and on our campuses.  Jewish students have faced an unrelenting barrage of discrimination; denial of access to campus common areas and facilities, including libraries and classrooms; and intimidation, harassment, and physical threats and assault.  A joint report by the House Committees on Education and the Workforce, Energy and Commerce, Judiciary, Oversight and Accountability, Veterans’ Affairs, and Ways and Means calls the Federal Government’s failure to fight anti-Semitism and protect Jewish students “astounding.”  This failure is unacceptable and ends today.Sec. 2.  Policy.  It shall be the policy of the United States to combat anti-Semitism vigorously, using all available and appropriate legal tools, to prosecute, remove, or otherwise hold to account the perpetrators of unlawful anti-Semitic harassment and violence.Sec. 3.  Additional Measures to Combat Campus Anti-Semitism.  (a)  Within 60 days of the date of this order, the head of each executive department or agency (agency) shall submit a report to the President, through the Assistant to the President for Domestic Policy, identifying all civil and criminal authorities or actions within the jurisdiction of that agency, beyond those already implemented under Executive Order 13899, that might be used to curb or combat anti-Semitism, and containing an inventory and analysis of all pending administrative complaints, as of the date of the report, against or involving institutions of higher education alleging civil-rights violations related to or arising from post-October 7, 2023, campus anti-Semitism.(b)  The report submitted by the Attorney General under this section shall additionally include an inventory and an analysis of all court cases, as of the date of the report, against or involving institutions of higher education alleging civil-rights violations related to or arising from post-October 7, 2023, campus anti-Semitism and indicate whether the Attorney General intends to or has taken any action with respect to such matters, including filing statements of interest or intervention.(c)  The Attorney General is encouraged to employ appropriate civil-rights enforcement authorities, such as 18 U.S.C. 241, to combat anti-Semitism. (d)  The report submitted by the Secretary of Education under this section shall additionally include an inventory and an analysis of all Title VI complaints and administrative actions, including in K-12 education, related to anti-Semitism — pending or resolved after October 7, 2023 — within the Department’s Office for Civil Rights.(e)  In addition to identifying relevant authorities to curb or combat anti-Semitism generally required by this section, the Secretary of State, the Secretary of Education, and the Secretary of Homeland Security, in consultation with each other, shall include in their reports recommendations for familiarizing institutions of higher education with the grounds for inadmissibility under 8 U.S.C. 1182(a)(3) so that such institutions may monitor for and report activities by alien students and staff relevant to those grounds and for ensuring that such reports about aliens lead, as appropriate and consistent with applicable law, to investigations and, if warranted, actions to remove such aliens.Sec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "This document outlines an order issued by the President of the United States on January 29, 2025, aimed at combating anti-Semitism, especially in educational institutions. The order reaffirms the initiatives previously laid out in Executive Order 13899, initially issued on December 11, 2019. This reaffirmation was deemed necessary due to a significant increase in anti-Semitic acts following the Hamas attacks on October 7, 2023. The order mandates federal departments to utilize their jurisdictions to form strategies combating anti-Semitism in educational settings and encourages the use of appropriate legal tools against such acts.\n\nIt requires heads of executive departments to report on civil and criminal authorities that could help curb anti-Semitism and also to inventory and analyze cases pending against institutions of higher learning related to post-October 7, 2023, anti-Semitic incidents. The Attorney General and the Secretary of Education are specifically tasked with assessing court cases and Title VI complaints respectively. The Secretary of State, Secretary of Education, and Secretary of Homeland Security are to provide institutes of higher education with guidelines for monitoring activities of non-citizen students that may contravene U.S. laws. The order emphasizes implementation within the bounds of the law and the available budget.",
  "eli5": "The President is making new rules to stop people from being mean to Jewish students in schools and colleges, especially after some bad events happened. They want everyone to use the law to help protect these students.",
  "keywords": [
    "Presidential Action",
    "Anti-Semitism",
    "Executive Order 13899",
    "Higher Education",
    "Civil Rights",
    "January 29, 2025"
  ],
  "issues": [
    "How effective the implementation will be given the limits of current legal frameworks.",
    "Potential challenges in ensuring institutions comply with new measures.",
    "Extent of support from relevant agencies for these initiatives."
  ],
  "citations": [
    "Executive Order 13899",
    "8 U.S.C. 1182(a)(3)",
    "18 U.S.C. 241"
  ],
  "document_type": "Executive Order"
}