{
  "title": "Addressing the Threat to National Security from Imports of Copper – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Addressing the Threat to National Security from Imports of Copper",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 232 of the Trade Expansion",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/addressing-the-threat-to-nationalsecurity-from-imports-of-copper/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-25T22:40:32+00:00",
  "article:modified_time": "2025-02-25T22:42:42+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tADDRESSING THE THREAT TO NATIONALSECURITY FROM IMPORTS OF COPPER\t\t\t\t\n\nFebruary 25, 2025\n\n    By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 232 of the Trade Expansion Act of 1962, as amended (19 U.S.C. 1862) (Trade Expansion Act), it is hereby ordered:\n\nSection1.  Policy*.*  Copper is a critical material essential to the national security, economic strength, and industrial resilience of the United States.  Copper, scrap copper, and copper’s derivative products play a vital role in defense applications, infrastructure, and emerging technologies, including clean energy, electric vehicles, and advanced electronics.  The United States faces significant vulnerabilities in the copper supply chain, with increasing reliance on foreign sources for mined, smelted, and refined copper.\n\n    The United States has ample copper reserves, yet our smelting and refining capacity lags significantly behind global competitors.  A single foreign producer dominates global copper smelting and refining, controlling over 50 percent of global smelting capacity and holding four of the top five largest refining facilities.  This dominance, coupled with global overcapacity and a single producer’s control of world supply chains, poses a direct threat to United States national security and economic stability.\n\n    It is the policy of the United States to ensure a reliable, secure, and resilient domestic copper supply chain.  The United States’ increasing dependence on foreign sources of copper, particularly from a concentrated number of supplier nations, along with the risk of foreign market manipulation, necessitate action under section 232 of the Trade Expansion Act to determine whether imports of copper, scrap copper, and copper’s derivative products threaten to impair national security.\n\nSec. 2.  Investigation Into the National Security Impact of Copper Imports*.*  (a)  The Secretary of Commerce shall initiate an investigation under section 232 of the Trade Expansion Act to determine the effects on national security of imports of copper in all forms, including but not limited to:\n\n          (i)    raw mined copper;\n\n          (ii)   copper concentrates;\n\n          (iii)  refined copper;\n\n          (iv)   copper alloys;\n\n          (v)    scrap copper; and\n\n          (vi)   derivative products.\n\n   (b)  In conducting the investigation described in subsection (a) of this section, the Secretary of Commerce shall assess the factors set forth in 19 U.S.C. 1862(d), labeled “Domestic production for national defense; impact of foreign competition on economic welfare of domestic industries,” as well as other relevant factors, including:\n\n           (i)     the current and projected demand for copper in United States defense, energy, and critical infrastructure sectors;\n\n          (ii)    the extent to which domestic production, smelting, refining, and recycling can meet demand;\n\n         (iii)   the role of foreign supply chains, particularly from major exporters, in meeting United States demand;\n\n          (iv)    the concentration of United States copper imports from a small number of suppliers and the associated risks;\n\n           (v)     the impact of foreign government subsidies, overcapacity, and predatory trade practices on United States industry competitiveness;\n\n           (vi)    the economic impact of artificially suppressed copper prices due to dumping and state-sponsored overproduction;\n\n           (vii)   the potential for export restrictions by foreign nations, including the ability of foreign nations to weaponize their control over refined copper supplies;\n\n          (viii)  the feasibility of increasing domestic copper mining, smelting, and refining capacity to reduce import reliance; and\n\n          (ix)    the impact of current trade policies on domestic copper production and whether additional measures, including tariffs or quotas, are necessary to protect national security.\n\nSec. 3.  Required Actions*.*  (a)  The Secretary of Commerce shall consult with the Secretary of Defense, the Secretary of the Interior, the Secretary of Energy, and the heads of other relevant executive departments and agencies as determined by the Secretary of Commerce to evaluate the national security risks associated with copper import dependency.\n\n   (b)  Within 270 days of the date of this order, the Secretary of Commerce shall submit a report to the President that includes:\n\n          (i)    findings on whether United States dependence on copper imports threatens national security;\n\n          (ii)   recommendations on actions to mitigate such threats, including potential tariffs, export controls, or incentives to increase domestic production; and\n\n          (iii)  policy recommendations for strengthening the United States copper supply chain through strategic investments, permitting reforms, and enhanced recycling initiatives.\n\nSec. 4.  General Provisions*.*  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n             (i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n             (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n   (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n   (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    February 25, 2025.\n",
  "summary": "On February 25, 2025, an order was issued by the President of the United States to address vulnerabilities in the U.S. copper supply chain, which are deemed a threat to national security. The action leverages the Trade Expansion Act of 1962, specifically section 232, to investigate the impact of copper imports on national security. The directive points to the critical role of copper in defense, technology, and infrastructure, coupled with significant reliance on foreign imports.\n\nThe order mandates the Secretary of Commerce to assess the national security implications of various forms of copper imports, considering factors like domestic production capacity, foreign supply chain dependency, and trade policies. A key concern is the U.S.'s reliance on a limited number of foreign suppliers and potential market manipulations. The Secretary of Commerce is required to consult with other government departments and recommend policy actions, such as tariffs or incentives, within 270 days to mitigate these risks.",
  "eli5": "The president is worried that the U.S. doesn't have enough local copper and depends too much on other countries, which could be a problem for safety and the economy. He wants people to study this and suggest ways to make sure we have enough copper.",
  "keywords": [
    "copper supply chain",
    "national security",
    "Trade Expansion Act",
    "imports",
    "domestic production",
    "investigation",
    "policy recommendations"
  ],
  "issues": [
    "Potential over-dependence on foreign copper sources",
    "Dominance of a single foreign nation in copper smelting",
    "Impacts of foreign government subsidies and trade practices",
    "Challenges in increasing domestic copper capacity"
  ],
  "citations": [
    "19 U.S.C. 1862",
    "Trade Expansion Act of 1962"
  ],
  "document_type": "Presidential Action"
}