{
  "title": "Addressing the Threat to National Security from Imports of Timber, Lumber – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Addressing the Threat to National Security from Imports of Timber, Lumber",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 232 of the Trade Expansion",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-the-threat-to-national-security-from-imports-of-timber-lumber/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-02T00:15:30+00:00",
  "article:modified_time": "2025-03-02T00:15:38+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tAddressing The Threat To National Security from Imports of Timber, Lumber\t\t\t\t\n\nMarch 1, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including section 232 of the Trade Expansion Act of 1962, as amended (19 U.S.C. 1862) (Trade Expansion Act), it is hereby ordered:\n\nSection1.  Policy.  The wood products industry, composed of timber, lumber, and their derivative products (such as paper products, furniture, and cabinetry) is a critical manufacturing industry essential to the national security, economic strength, and industrial resilience of the United States.  This industry plays a vital role in key downstream civilian industries, including construction.\n\nThe United States faces significant vulnerabilities in the wood supply chain from imported timber, lumber, and their derivative products being dumped onto the United States market.\n\nThe United States has ample timber resources.  The current United States softwood lumber industry has the practical production capacity to supply 95 percent of the United States’ 2024 softwood consumption.  Yet, since 2016 the United States has been a net importer of lumber.\n\nWood products are a key input used by both the civilian construction industry and the military.  Each year, the United States military spends over 10 billion dollars on construction.  The military also invests in innovative building material technology, including processes to create innovative wood products such as cross-laminated timber.  The procurement of these building materials depends on a strong domestic lumber industry and a manufacturing base capable of meeting both military-specific and wider civilian needs.\n\nIt is the policy of the United States to ensure reliable, secure, and resilient domestic supply chains of timber, lumber, and their derivative products.  Unfair subsidies and foreign government support for foreign timber, lumber, and their derivative products necessitate action under section 232 of the Trade Expansion Act to determine whether imports of these products threaten to impair national security.\n\nSec. 2.  Investigation.  (a)  The Secretary of Commerce shall initiate an investigation under section 232 of the Trade Expansion Act to determine the effects on the national security of imports of timber, lumber, and their derivative products.\n\n(b)  In conducting the investigation described in subsection (a) of this section, the Secretary of Commerce shall assess the factors set forth in 19 U.S.C. 1862(d), labeled “Domestic production for national defense; impact of foreign competition on economic welfare of domestic industries,” as well as other relevant factors, including:\n\n(i)    the current and projected demand for timber and lumber in the United States;\n\n(ii)   the extent to which domestic production of timber and lumber can meet domestic demand;\n\n(iii)  the role of foreign supply chains, particularly of major exporters, in meeting United States timber and lumber demand;\n\n(iv)   the impact of foreign government subsidies and predatory trade practices on United States timber, lumber, and derivative product industry competitiveness;\n\n(v)    the feasibility of increasing domestic timber and lumber capacity to reduce imports; and\n\n(vi)   the impact of current trade policies on domestic timber, lumber, and derivative product production, and whether additional measures, including tariffs or quotas, are necessary to protect national security.\n\nSec. 3.  Required Actions.  (a)  The Secretary of Commerce shall consult with the Secretary of Defense and the heads of other relevant executive departments and agencies as determined by the Secretary of Commerce to evaluate the national security risks associated with imports of timber, lumber, and their derivative products.\n\n(b)  No later than 270 days after the date of this order, the Secretary of Commerce shall submit a report to the President that includes:\n\n(i)    findings on whether imports of timber, lumber, and their derivative products threaten national security;\n\n(ii)   recommendations on actions to mitigate such threats, including potential tariffs, export controls, or incentives to increase domestic production; and\n\n(iii)  policy recommendations for strengthening the United States timber and lumber supply chain through strategic investments and permitting reforms.\n\nSec. 4.  Definitions.  As used in this order:\n\n(a)  The term “timber” refers to wood that has not been processed.\n\n(b)  The term “lumber” refers to wood that has been processed, including wood that has been milled and cut into boards or planks.\n\nSec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,    March 1, 2025.\n",
  "summary": "### Summary\n\nOn March 1, 2025, the President of the United States issued an executive order to address the challenges posed by imported timber, lumber, and their derivative products on national security. The wood products industry is critical to both economic strength and industrial resilience in the United States, supporting vital civilian and military construction efforts. Despite having the capacity to meet domestic demand, the US has been a net importer of lumber since 2016, largely due to foreign subsidies and import dumping, which threaten the domestic market.\n\nThe executive order mandates the Secretary of Commerce to investigate the impact of foreign imports on national security, focusing on aspects such as domestic production capacity, foreign supply chain roles, and trade practices. It requires consultation with various departments, including Defense, and the submission of a report within 270 days detailing security threats and recommended measures to strengthen domestic production. This may include tariffs, export controls, and strategic investments, underscoring the importance of a resilient domestic timber and lumber supply chain.",
  "eli5": "The President wants to make sure the wood we use to build things in the US is safe and grown here. To do that, they're checking how much wood we buy from other places and if we can grow more of it here.",
  "keywords": [
    "Timber",
    "Lumber",
    "National Security",
    "Trade Expansion Act",
    "Imports",
    "Domestic Production",
    "Executive Order"
  ],
  "issues": [
    "Impact of unfair trade practices on US industry",
    "Possible over-reliance on imported wood",
    "Need for increased domestic production",
    "Potential effects of new tariffs or export controls"
  ],
  "citations": [
    "19 U.S.C. 1862",
    "Trade Expansion Act of 1962"
  ],
  "document_type": "Executive Order"
}