{
  "title": "The Trump Administration\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "The Trump Administration",
  "og:description": "Learn more about President Donald J. Trump, First Lady Melania Trump, Vice President JD Vance, Second Lady Usha Vance, and The Cabinet.",
  "og:url": "https://www.whitehouse.gov/administration/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-01-28T16:58:19+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "# \t\t\t\t\tThe Administration\t\t\t\t\n\n[](https://www.whitehouse.gov/administration/donald-j-trump/)\n\n## [Donald J. Trump](https://www.whitehouse.gov/administration/donald-j-trump/)\n\n45th &amp; 47th President of the United States\n\nAfter a landslide election victory in 2024, President Donald J. Trump is returning to the White House to build upon his previous successes and use his mandate to reject the extremist policies of the radical left while providing tangible quality of life improvements for the American people.\n\n[](https://www.whitehouse.gov/administration/jd-vance/)\n\n## [JD Vance](https://www.whitehouse.gov/administration/jd-vance/)\n\nVice President of the United States\n\nIn 2024, President Donald J. Trump extended JD the incredible honor of asking him to serve as the Vice-Presidential Nominee for the Republican Party. JD looks forward to serving with President Trump over the next four years as they work diligently to Make America Great Again.\n\n## [Melania Trump](https://www.whitehouse.gov/administration/melania-trump/)\n\nFIRST Lady of the United States\n\nFirst Lady Melania Trump is the wife of the 45th and 47th President, Donald J. Trump and the mother to their son, Barron Trump. She is the second First Lady born outside of the United States, and she is the only First Lady to become a naturalized United States citizen. \n\n[](https://www.whitehouse.gov/administration/usha-vance/)\n\n## [USHA VANCE](https://www.whitehouse.gov/administration/usha-vance/)\n\nSECOND Lady of the United States\n\nSecond Lady Usha Vance is the proud wife of Vice President JD Vance and the mother of their three beautiful children, Ewan, Vivek, and Mirabel. A native of San Diego, California, Ms. Vance is an experienced litigator whose work involved complex civil litigation and appeals in a wide variety of industries.\n\n[](https://www.whitehouse.gov/administration/the-cabinet/)\n\n## [The Cabinet](https://www.whitehouse.gov/administration/the-cabinet/)\n\nPresident Trump’s Team\n\nEstablished in Article II, Section 2 of the Constitution, the Cabinet’s role is to advise the President on any subject he may require relating to the duties of each member’s respective office.\n",
  "summary": "The webpage outlines the administration of Donald J. Trump, who returned to the White House as the 45th and 47th President of the United States following a 2024 election victory. President Trump is focused on continuing his previous efforts and providing improvements for the American people, rejecting what he describes as extremist policies from opposing political factions. JD Vance has been named Vice President and is prepared to work alongside President Trump with the aim of furthering their administration's goals.\n\nMelania Trump serves as the First Lady, noted for being the first naturalized U.S. citizen to hold this position. She continues her role as a supportive figure within the administration. Additionally, Usha Vance has stepped in as the Second Lady, bringing her professional experience as a litigator to her supportive role alongside Vice President JD Vance. The webpage also highlights the Cabinet's role in advising the President, as specified in the U.S. Constitution.",
  "eli5": "Donald Trump is President again, and JD Vance is his Vice President. They want to make things better in America. Melania Trump is the First Lady, and Usha Vance is the Second Lady.",
  "keywords": [
    "Donald J. Trump",
    "JD Vance",
    "Melania Trump",
    "Usha Vance",
    "2024 election",
    "White House administration",
    "First Lady",
    "Second Lady",
    "Cabinet"
  ],
  "issues": [
    "Speculative nature of the content",
    "Lack of current verification",
    "Politically biased language"
  ],
  "citations": [
    "U.S. Constitution, Article II, Section 2"
  ],
  "document_type": "Fact Sheet"
}