{
  "title": "Amendment to Duties to Address the Situation at our Southern Border – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Amendment to Duties to Address the Situation at our Southern Border",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-situation-at-our-southern-border/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-03T02:43:43+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tAmendment to Duties to Address the Situation at our Southern Border\t\t\t\t\n\nMarch 2, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 *et seq.*), the National Emergencies Act (50 U.S.C. 1601 *et seq.*), section 604 of the Trade Act of 1974, as amended (19 U.S.C. 2483), and section 301 of title 3, United States Code, I hereby determine and order:\n\nSection1.  Amendment.  Executive Order 14194 of February 1, 2025 (Imposing Duties to Address the Situation at Our Southern Border), as amended by Executive Order 14198 of February 3, 2025 (Progress on the Situation at Our Southern Border), is further amended by revising section 2(g) to read as follows:\n\n“(g)  Duty-free *de minimis* treatment under 19 U.S.C. 1321 is available for otherwise eligible covered articles described in subsection (a) of this section.  Such duty-free *de minimis* treatment shall cease to be available for such otherwise eligible covered articles upon notification by the Secretary of Commerce to the President that adequate systems are in place to fully and expeditiously process and collect tariff revenue applicable pursuant to subsection (a) of this section for covered articles otherwise eligible for *de minimis* treatment.”Sec. 2.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    March 2, 2025.\n",
  "summary": "On March 2, 2025, the President of the United States issued an amendment to a previously established order concerning the southern border. The initial Executive Order 14194, issued on February 1, 2025, was focused on imposing duties to address the situation at the border. This was later modified by Executive Order 14198 on February 3, 2025, which made progress on the matter. The latest amendment further modifies section 2(g) to regulate duty-free *de minimis* treatment, specifically ending it once the Secretary of Commerce confirms systems are ready to manage and collect tariffs.\n\nThe amendment aims to refine the handling of tariff duties on imports at the southern border, ensuring that adequate infrastructure is in place for revenue collection. It underscores the Government's intention to maintain a streamlined approach that does not affect existing legal authority or budgetary functions. Additionally, the order clarifies that it does not create any legal rights enforceable against the United States, its agencies, or employees.",
  "eli5": "The President made a change to a rule about getting things into the country without paying taxes if they're small enough. They'll stop this once they're ready to collect money quickly.",
  "keywords": [
    "Amendment",
    "Southern Border",
    "Duties",
    "Executive Order",
    "Trade",
    "Tariff",
    "De Minimis",
    "Revenue Collection"
  ],
  "issues": [
    "Implementation timeline for system readiness",
    "Impact on international trade relations",
    "Potential economic impact on import businesses"
  ],
  "citations": [
    "International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.)",
    "National Emergencies Act (50 U.S.C. 1601 et seq.)",
    "Trade Act of 1974 (19 U.S.C. 2483)",
    "19 U.S.C. 1321",
    "Section 301 of title 3, United States Code"
  ],
  "document_type": "Presidential Action"
}