{
  "title": "Amendment to Duties to Address the Flow of Illicit Drugs across our Northern Border – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Amendment to Duties to Address the Flow of Illicit Drugs across our Northern Border",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/03/amendment-to-duties-to-address-the-flow-of-illicit-drugs-across-our-northern-border/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-03T02:40:56+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tAmendment to Duties to Address the Flow of Illicit Drugs across our Northern Border\t\t\t\t\n\nMarch 2, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.), the National Emergencies Act (50 U.S.C. 1601 et seq.), section 604 of the Trade Act of 1974, as amended (19 U.S.C. 2483), and section 301 of title 3, United States Code, I hereby determine and order:\n\nSection1.  Amendment.  Executive Order 14193 of February 1, 2025 (Imposing Duties to Address the Flow of Illicit Drugs Across Our Northern Border), as amended by Executive Order 14197 of February 3, 2025 (Progress on the Situation at Our Northern Border), is further amended by revising section 2(h) to read as follows:\n\n“(h)  Duty-free de minimis treatment under 19 U.S.C. 1321 is available for otherwise eligible covered articles described in subsection (a) and subsection \n\n(b) of this section.  Such duty free de minimis treatment shall cease to be available for such otherwise eligible covered articles upon notification by the Secretary of Commerce to the President that adequate systems are in place to fully and expeditiously process and collect tariff revenue applicable pursuant to subsection (a) and subsection (b) of this section for covered articles otherwise eligible for de minimis treatment.”Sec. 2.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,    March 2, 2025.\n",
  "summary": "On March 2, 2025, the President of the United States issued an amendment to Executive Order 14193, initially imposed on February 1, 2025, which addresses the movement of illicit drugs across the northern border of the United States. This amendment involves revising section 2(h), allowing duty-free de minimis treatment under 19 U.S.C. 1321 for certain eligible articles. The duty-free treatment is conditional and will cease once the Secretary of Commerce informs the President that adequate systems for processing and collecting tariff revenue are in place.\n\nThe order specifies that its implementation should not interfere with the authority of any executive department or the functions of the Director of the Office of Management and Budget. Moreover, the order must align with existing laws and is dependent on the availability of appropriations. Importantly, the order does not provide any enforceable rights or benefits to any party against the United States or any of its agencies or employees.",
  "eli5": "The President made a rule allowing some goods to pass without paying extra charges if they come from our northern neighbor, but only until we have a better way to manage those charges. This doesn't change other rules or give anyone special rights.",
  "keywords": [
    "Presidential Action",
    "Northern Border",
    "Illicit Drugs",
    "Duty-free",
    "Executive Order Amendment",
    "Tariff",
    "Commerce"
  ],
  "issues": [
    "Impact on trade relations with northern neighbor",
    "Effectiveness of the new systems for tariff collection",
    "Oversight and implementation challenges"
  ],
  "citations": [
    "50 U.S.C. 1701 et seq.",
    "50 U.S.C. 1601 et seq.",
    "19 U.S.C. 2483",
    "19 U.S.C. 1321",
    "Executive Order 14193",
    "Executive Order 14197"
  ],
  "document_type": "Presidential Action"
}