{
  "title": "America First Policy Directive To The Secretary Of State – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "America First Policy Directive To The Secretary Of State",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/america-first-policy-directive-to-the-secretary-of-state/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:47:48+00:00",
  "article:modified_time": "2025-01-21T02:17:59+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tAMERICA FIRST POLICY DIRECTIVE TO THE SECRETARY OF STATE\t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose*.*  From this day forward, the foreign policy of the United States shall champion core American interests and always put America and American citizens first.\n\nSec. 2.  Policy*.* As soon as practicable, the Secretary of State shall issue guidance bringing the Department of State’s policies, programs, personnel, and operations in line with an America First foreign policy, which puts America and its interests first.\n\nSec. 3.  General Provisions*.*  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)  the authority granted by law to an executive department or agency; or\n\n(ii)   the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20, 2025.\n",
  "summary": "### Summary\nOn January 20, 2025, a Presidential directive was issued outlining a strategic shift towards an 'America First' foreign policy. The directive is designed to align the U.S. Department of State's policies, programs, and operations to prioritize core American interests, emphasizing the welfare of the country and its citizens. This strategic pivot mandates the Secretary of State to guide the department in implementing this America-centric approach at the earliest opportunity.\n\nThe directive also includes general provisions to clarify its implementation. It asserts that nothing in this order should contravene existing legal authorities granted to executive departments or the functions managed by the Director of the Office of Management and Budget regarding fiscal, administrative, or legislative activities. Additionally, its implementation is subject to applicable laws and the availability of funds. The order does not establish any legal rights or benefits enforceable against the United States or its representatives.",
  "eli5": "The President told people in charge of U.S. foreign affairs that from now on, they have to think about what's best for America first when making decisions.",
  "keywords": [
    "America First",
    "foreign policy",
    "Presidential directive",
    "United States",
    "Secretary of State",
    "January 20, 2025"
  ],
  "issues": [
    "Lack of details on specific policy changes",
    "Potential conflicts with international agreements",
    "Clarification of what 'America First' entails in practical terms"
  ],
  "citations": [],
  "document_type": "Executive Order"
}