{
  "title": "America Is Back — and President Trump Is Just Getting Started – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "America Is Back — and President Trump Is Just Getting Started",
  "og:description": "President Donald J. Trump took office just one month ago, but has already accomplished more than most presidents do in their entire term as he makes good",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/america-is-back-and-president-trump-is-just-getting-started/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-20T16:18:59+00:00",
  "article:modified_time": "2025-02-20T16:19:42+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/02/Gj2K84QXwAAJtzo.jpg",
  "og:image:width": "3000",
  "og:image:height": "2000",
  "og:image:type": "image/jpeg",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tAmerica Is Back — and President Trump Is Just Getting Started\t\t\t\t\n\nFebruary 20, 2025\n\nPresident Donald J. Trump took office just one month ago, but has already accomplished more than most presidents do in their entire term as he makes good on his promise to usher in the New Golden Age of America.\n\n**Here is a non-comprehensive list of President Trump’s wins after just one month:**\n\n**SECURING OUR HOMELAND:**\n    - President Trump  declared  a national emergency at the border and  deployed  the military,  including the 10th Mountain Division , to secure our nation.\n    - Illegal border crossings have hit  lows not seen in decades  as U.S. Border Patrol is re-empowered to once again enforce the law.       - ABC News : “From Jan. 21 through Jan. 31, the number of U.S. Border Patrol apprehensions along the southwest border dropped 85% from the same period in 2024, according to data obtained by ABC News. In the 11 days after Jan. 20, migrants apprehended at ports of entry declined by 93%.” \n    - Illegal aliens have started  turning around  in droves amid the crackdown.\n    - The Department of Homeland Security  announced  that arrests of criminal illegal immigrants have doubled under President Trump.\n    - President Trump  signed  the Laken Riley Act into law, which  requires  illegal immigrants arrested or charged with theft or violence to be detained — honoring the legacy of Laken Riley, a Georgia college student brutally murdered by an illegal alien released into the country.\n    - President Trump  ended  “catch-and-release,” reversing the dangerous Biden-era policy that released dangerous illegal aliens back into our communities.\n    - President Trump  shut down  the “CBP One” app, which “ paroled ” more than one million illegal immigrants into the country.       - A migrant shelter in San Diego  announced  it will shut down after it has received no new arrivals since President Trump took office. \n    - President Trump  terminated  all taxpayer-funded public benefits for illegal aliens.\n    - President Trump  ramped up  deportation flights of criminal illegal aliens.       - After President Trump  announced  “urgent and decisive retaliatory measures” against Colombia over its refusal to accept deportation flights from the U.S., the country’s president quickly  backtracked  — even offering the use of his personal plane for the deportations.\n      - El Salvadorian President Nayib Bukele  offered  to accept deportees of any nationality, including violent American criminals currently imprisoned in the U.S. \n    - President Trump began  transferring  criminal illegal aliens to Guantanamo Bay ahead of their repatriation back to their own countries.\n    - President Trump  re-established  the successful “Remain in Mexico” policy.\n    - President Trump  restarted  construction of the border wall.\n    - The Trump Administration  officially declared  Tren de Aragua, MS-13, the Sinaloa Cartel, the Jalisco New Generation Cartel, the United Cartels, the Gulf Cartel, the Northeast Cartel, and the Michoacán Family as Foreign Terrorist Organizations.\n    - New York City Mayor Eric Adams (D) agreed to allow federal immigration officials to operate on Rikers Island and deport illegal alien criminals  following  his meeting with Border Czar Tom Homan.\n    - Mexico  announced  a deployment of 10,000 troops to the border to combat illegal immigration and fentanyl trafficking, while Canada  announced  a flurry of measures to combat fentanyl manufacturing and trafficking following President Trump’s  imposition of tariffs  on the two countries.\n    - President Trump  implemented  an additional 10% tariff on imports from China in order to stem the flow of illegal aliens and fentanyl.\n    - President Trump  ordered  an end to birthright citizenship.\n    - President Trump  suspended  the U.S. Refugee Admissions Program.\n    - The Department of Justice  filed suit  against the State of New York and some of its elected officials over their willful failure to follow federal immigration law and  announced  that it will take action against so-called “sanctuary cities” for their obstruction of U.S. law.\n    - The Department of Homeland Security “ clawed back ” tens of millions of dollars in funds paid by rogue FEMA officials to house illegal aliens in luxury New York City hotels.\n    - President Trump  reinstated  the death penalty for federal capital crimes.\n\n**PROTECTING AMERICAN WORKERS AND FOSTERING ECONOMIC GROWTH:**\n    - President Trump  restored  a 25% tariff on steel imports and  elevated  the tariff to 25% on aluminum imports to protect these critical American industries from unfair foreign competition — a move praised by the  Steel Manufacturers Association , the  Aluminum Association , and  businesses  across the country.       - Robert Simon, CEO of JSW Steel USA,  praised  President Trump’s steel and aluminum tariffs, celebrating them “as a project that will flood the U.S. with jobs as trading partners move their industries to U.S. soil to avoid tariffs.” \n    - Makoto Uchida, the CEO of global automaker Nissan, said President Trump’s tariffs could  push  the car manufacturer to move its production from Mexico to the U.S.\n    - President Trump  unveiled  a plan for fair and reciprocal trade, making clear to the world that the United States will no longer tolerate being  ripped off .\n    - President Trump secured hundreds of billions of dollars in new investments.       - President Trump  announced  the largest artificial intelligence infrastructure project in history, securing $500 billion in planned private sector investment — with major CEOs  agreeing  it would not have been possible without President Trump’s leadership.       - Saudi Arabia  declared  its intention to invest $600 billion in the United States over the next four years.       - President Trump  secured  a $20 billion investment by DAMAC Properties to build new U.S.-based data centers.       - Taiwan  pledged  to boost its investment in the United States.        - Electronics giants Samsung and LG “are  considering  moving their plants in Mexico to the U.S.” now that President Trump is back in office. \n    - In February, forecasters from the Federal Reserve Bank of Philadelphia  revised  their economic growth projections for the first quarter of 2025 up from 1.9% to 2.5%, and their unemployment rate projections for the quarter down from 4.2% to 4.1%.\n    - After a meeting with President Trump, Stellantis  announced  it will reopen its assembly plant in Belvidere, Illinois — putting 1,500 employees back to work — and  build  its next-generation Dodge Durango in Detroit, Michigan. The company also announced new investments in their Toledo, Ohio, and Kokomo, Indiana, facilities.\n    - President Trump  laid out  a visionary  plan  to establish a Sovereign Wealth Fund to maximize the stewardship of the  $5+ trillion  in assets held by the United States.\n    - Following President Trump’s victory, the S&amp;P 500 set a  new record  as the stock market  surged  to record highs — while major Wall Street firms like JP Morgan Chase posted their  highest ever  annual profits.\n\n**LOWERING THE COST OF LIVING:**\n    - President Trump  directed  the heads of all executive departments and agencies to “deliver emergency price relief … to the American people and increase the prosperity of the American worker.”\n    - President Trump  established  the National Energy Dominance Council to maximize use of the U.S.’ extensive energy resources, thereby enabling lower energy prices.\n    - Crude oil prices have  fallen  over 5% since President Trump took office.\n    - The Department of Energy postponed burdensome Biden-era efficiency standard rules for the following appliances, saving American consumers large sums:       - Central air conditioners: Biden rules were slated to  make  air conditioners $1,100 more expensive, according to Alliance for Consumers.\n      - Gas water heaters: Biden rules were slated to  make  water heaters $2,800 more expensive.\n      - Clothes washers and dryers: Biden rules were slated to  make  washers $200 more expensive.\n      - Light bulbs: Biden rules were slated to  make  light bulbs $140 more expensive.\n      - Walk-in coolers and freezers, commercial refrigeration equipment, and air compressors. \n    - The total cost of federal regulations in 2023 was a record-breaking $2.1 trillion, or $15,788 per U.S. household,  according to the Competitive Enterprise Institute . By  requiring  agencies to identify at least ten existing rules, regulations, or guidance documents to be repealed for every one rule they promulgate, President Trump has put the U.S. on track to severely reduce regulatory costs for everyday Americans.       - The National Associations of Manufacturers  found  the cost of federal regulations was even greater — at $3.079 trillion in 2022. \n    - Secretary Sean Duffy’s very first action at the Department of Transportation was to initiate rulemaking resetting Corporate Average Fuel Economy (CAFE) standards — effectively eliminating the Biden-era electric vehicle mandate.       - NBER economist Mark R. Jacobsen “ estimates  that a one-mpg increase in CAFE standards costs consumers of all income levels approximately 0.5% of their income in the first year of the increase. By the 10th year following the increase, however, this cost becomes regressive, as the increase drives up the price of used cars. A one-mpg increase in CAFE standards costs consumers earning less than $25,000 per year 1.12% of their income, but only costs consumers earning more than $75,000 per year 0.41% of their income.” \n\n**RE-ESTABLISHING AMERICAN STRENGTH:**\n    - President Trump secured the release of  six American hostages in Venezuela ,  two Americans in Afghanistan , an  American-Israeli citizen in Hamas captivity , a  Pennsylvania teacher in Russian captivity , and an  American citizen in Belarus  — bringing the total number of American hostages released under President Trump to 11.\n    - President Trump  spoke  with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy in pursuit of finally securing peace as negotiations get underway.\n    - President Trump  restored  maximum pressure on Iran, “ sanctioning  an international network for facilitating the shipment of millions of barrels of Iranian crude oil worth hundreds of millions of dollars to the People’s Republic of China.”\n    - President Trump  redesignated  the Iran-backed Houthis as a Foreign Terrorist Organization.\n    - President Trump  hosted  Israeli Prime Minister Benjamin Netanyahu for a visit where he  proposed  a bold vision for securing lasting peace in Gaza.       - Former U.S. Ambassador to Israel David Friedman  described  the proposal as “brilliant, historic and the only idea I have heard in 50 years that has a chance of bringing security, peace and prosperity to this troubled region.” \n    - President Trump hosted Japanese Prime Minister Shigeru Ishiba, who  announced  his intention to “elevate Japan’s investment in the United States to an unprecedented amount of $1 trillion,” import “historic” quantities of LNG from Alaska, and open new auto plants in the U.S.\n    - President Trump  hosted  Jordan’s King Abdullah II, who  announced  that the Kingdom will accept 2,000 sick children from Gaza “as quickly as possible.”\n    - President Trump hosted Indian Prime Minister Narendra Modi for a visit where they  announced  new deals between the two countries on immigration, trade, energy, and artificial intelligence.\n    - President Trump  banned  funding to UNRWA — a United Nations agency that  employed  hundreds of Hamas and jihad operatives.\n    - President Trump  imposed  sanctions on the International Criminal Court, which has illegitimately asserted jurisdiction over internal U.S. matters and baselessly targeted Israeli Prime Minister Benjamin Netanyahu.\n    - President Trump  reinstated  the Mexico City Policy to ensure no taxpayer dollars support foreign organizations that perform, or actively promote, abortion in other nations.\n    - The Department of State  ordered  embassies worldwide to only fly the American flag — not activist flags.\n    - President Trump  declared  all foreign policy must be conducted under the President’s direction, ensuring career diplomats reflect the foreign policy of the United States at all times.\n    - The Department of State  declared  that U.S. foreign policy will be America First going forward.\n    - Following a  visit  from Secretary of State Marco Rubio, Panamanian President José Raúl Mulino agreed to  withdraw  from China’s Belt and Road Initiative, a debt-trap diplomacy scheme the Chinese Communist Party uses to  gain  influence over developing nations.\n    - The U.S.  rejoined  the Geneva Consensus Declaration, which promotes and strengthens opportunities for women and girls around the world, and protects the family as the fundamental unit of society.\n    - President Trump  cracked down  on anti-Semitism by canceling visas for foreign students who are Hamas sympathizers.\n    - President Trump  ordered  the immediate dismissal of the Board of Visitors for the Army, Air Force, Navy, and Coast Guard following years of woke ideologies infiltrating U.S. service academies.\n    - The U.S. Army  barred  transgender people from enlisting and stopped using taxpayer funds for sex change surgeries.\n    - President Trump  reinstated , with backpay, U.S. service members who were discharged under the military’s nonsensical COVID-19 vaccine mandate.\n    - Secretary of Defense Pete Hegseth  restored  Fort Liberty, North Carolina, to “Fort Bragg,” in honor of a World War II hero.\n    - President Trump  withdrew  the U.S. from the World Health Organization.\n    - President Trump  paused  enforcement of the overregulation of American businesses abroad, which negatively impacted national security.\n    - President Trump  proclaimed  “Gulf of America Day” after the Department of the Interior officially  established it  on its mapping databases.\n    - President Trump  initiated  a process to build a next-generation missile defense shield over the United States.\n\n**UNLEASHING AMERICAN ENERGY:**\n    - President Trump  declared  a National Energy Emergency to unlock America’s full energy potential and bring down costs for American families.\n    - President Trump  rescinded  every one of the Biden Administration’s job-killing, pro-China, anti-American energy regulations.\n    - President Trump  empowered  Americans with choice in vehicles, showerheads, toilets, washing machines, light bulbs, and dishwashers, and  killed  Biden-era regulations that restricted water flow and mandated inadequate light bulb standards.\n    - President Trump  terminated  the job-killing Green New Scam.\n    - President Trump  withdrew  from the disastrous Paris Climate Agreement, which unfairly ripped off our country.\n    - President Trump  paused  federal permitting for massive wind farms, which degrade our natural landscapes and fail to serve American consumers.\n    - President Trump  reversed  bureaucratic regulations that impeded Alaska’s ability to develop its vast natural resources.\n    - President Trump  re-opened  625 million acres for offshore drilling, which Biden banned in his waning days, in order to “drill, baby, drill.”\n    - President Trump  scrapped  an Obama-era rule on greenhouse gases.\n    - President Trump  ended  the Liquefied Natural Gas pause and  approved  the first LNG project since the Biden Administration banned them last year.\n\n**BRINGING BACK COMMON SENSE:**\n    - Health systems across the nation stopped or downsized their sex change programs for minors following President Trump’s “ Protecting Children from Chemical and Surgical Mutilation ” executive order.       - In Illinois, Chicago’s Lurie Children’s Hospital  paused  sex-change surgeries for patients under 19 as it “work[s] to understand the rapidly evolving environment.”       - In Colorado, Denver Health  announced  it would stop performing sex change surgeries on minor children, while UCHealth said it was  ending  so-called “gender-affirming care” for all minors.       - In Washington, D.C., Children’s National Hospital “ paused ” prescribing puberty blockers and hormone therapies for minors, while Northwest Washington Hospital  did the same .        - In Virginia, VCU Health and Children’s Hospital of Richmond “ suspended ” providing transgender-related medication and surgeries for minors, while UVA Health also “ suspended ” transgender-related services for minors. \n    - President Trump  ended  the unfair, demeaning practice of forcing women to compete against men in sports — which  resulted  in the NCAA changing its rules.       - The Department of Education  launched  investigations into the California Interscholastic Federation and the Minnesota State High School League over their  failures  to comply. \n    - President Trump made it the  official policy  of the U.S. government that there are only two sexes.\n    - President Trump  banned  COVID-19 vaccine mandates at schools that receive federal funding.\n    - President Trump  rolled back  the Biden-era push to mandate paper straws.\n    - President Trump  instructed  the Secretary of the Treasury to stop production of the penny, which  cost 3.69 cents each  to make.\n    - President Trump  directed  full enforcement of the Hyde Amendment, which bars taxpayer dollars from being used to fund or promote elective abortion.\n    - The Department of Transportation  terminated  the approval for New York City’s burdensome “congestion pricing” scheme.\n\n**RESTORING ACCOUNTABILITY AND TRANSPARENCY IN GOVERNMENT**\n    - President Trump  established  the Department of Government Efficiency (DOGE) to maximize government productivity and ensure the best use of taxpayer funds — which has already achieved  billions of dollars in savings  for taxpayers.\n    - President Trump  commenced  his plan to downsize the federal bureaucracy and eliminate waste, bloat, and insularity.       - President Trump  ordered  federal workers to return to the office five days a week.       - President Trump  ordered  federal agencies hire no more than one employee for every four employees who leave.       - President Trump  ended  the wasteful Federal Executive Institute, which had become a training ground for bureaucrats.        - President Trump  ordered  the termination of all federal Fake News media contracts. \n    - President Trump  ordered  the Consumer Financial Protection Bureau — the brainchild of Elizabeth Warren, which  funneled  cash to left-wing advocacy groups — to halt operations.\n    - President Trump  ordered  an end to anti-Christian bias in the Federal Government.\n    - President Trump  ordered  an examination of all regulations to assess any infringements on Americans’ Second Amendment rights.\n    - The Environmental Protection Agency  canceled  tens of millions of dollars in contracts to left-wing advocacy groups,  announced  an investigation into a scheme by Biden EPA staffers to shield billions of dollars from oversight and accountability, and  put  168 “environmental justice” employees on leave.\n    - President Trump stopped the  waste, fraud, and abuse within USAID  — ensuring taxpayers are no longer on the hook for funding the pet projects of entrenched bureaucrats, such as sex changes in Guatemala.\n    - President Trump  ordered  an end to the weaponization of the Federal Government against American citizens.       - The Department of Justice immediately began  rooting out  politically motivated lawfare that occurred in the Biden Administration. \n    - President Trump  reversed  the massive  over-expansion  of the IRS that took place during the Biden Administration.\n    - President Trump  eliminated  discriminatory DEI offices, employees, and practices across the bureaucracy alongside a  return  to merit-based hiring —  including  at the Federal Aviation Administration, where the Biden Administration specifically recruited individuals with intellectual disabilities and psychiatric issues.       - As a result, taxpayer-funded PBS  closed  its DEI office, Disney  dropped  two of its DEI programs, Goldman Sachs  ended  its DEI policy, and Institutional Shareholder Services  announced  it would no longer consider diversity of company boards when making its voting recommendations.        - The Federal Communications Commission  opened  an investigation into discriminatory DEI policies at Comcast, an entity it regulates. \n    - President Trump  ordered  an end to all censorship of Americans by the federal government.\n    - President Trump  ordered  a review of funding for all non-governmental organizations, so taxpayers are no longer funding those that undermine America’s interests.       - The Department of State issued a “pause” on existing foreign aid grants to ensure accountability and efficiency. \n    - President Trump  lifted  last-minute collective bargaining agreements issued by the Biden Administration, which sought to impede reform.\n    - President Trump  overrode  bureaucratic red tape that limited water availability in California following the failure of the state’s water system during the devastating wildfires.\n    - President Trump  terminated  the Biden-era electric vehicle mandate.       - President Trump  suspended  the Biden-era EV charging program, which had  resulted  in just eight charging stations despite $7.5 billion earmarked for the program. \n    - President Trump  shut down  the wasteful Biden-era “Climate Corps” program.\n    - The Federal Communications Commission  took action  against a Soros-backed radio station that leaked sensitive information about ICE operations.\n    - President Trump  ordered  the declassification of documents related to the assassinations of President John F. Kennedy, Jr., Robert F. Kennedy, and Rev. Dr. Martin Luther King, Jr.\n    - President Trump  opened  the White House Press Briefing Room to non-legacy media outlets as the White House sets a  new standard  for transparency in the digital age.\n    - President Trump  reinstated  press privileges for roughly 440 journalists who the Biden Administration sought to silence.\n    - President Trump  fired  members of The Kennedy Center’s Board of Trustees amid their obsession with perpetuating radical, left-wing ideology at taxpayer expense.\n    - President Trump  revoked  the security clearances of the 51 “spies who lied.”\n\n**EMPOWERING THE AMERICAN PEOPLE**\n    - President Trump  established  the Make America Healthy Again Commission, which redirects the national focus to promoting health rather than simply managing disease.\n    - President Trump took  executive action  to expand access to in vitro fertilization (IVF).\n    - President Trump  established  the White House Faith Office to protect Americans’ religious liberty.\n    - President Trump  ordered  an end to the radical indoctrination of children in K-12 schools that receive federal funding.\n    - President Trump took  executive action  to support parents in choosing the best education for their children.\n    - President Trump  established  the Presidential Working Group on Digital Asset Markets to strengthen U.S. leadership in digital finance.\n    - President Trump  granted  full and unconditional pardons to 23 pro-life Americans who were unjustly persecuted by the Biden Administration.\n    - President Trump  pardoned  two Washington, D.C., police officers who were imprisoned simply for doing their jobs of apprehending criminals.\n    - President Trump has had his cabinet confirmed by the Senate at a  far faster pace  than his predecessors, with a majority of his cabinet earning confirmation in his first month.\n",
  "summary": "President Donald J. Trump, who took office in February 2025, has implemented numerous policies across various sectors, claiming significant achievements within his first month. His administration focused on securing the homeland by declaring a national emergency at the border, reinforcing law enforcement, and enacting stringent immigration policies. Economic measures were introduced, such as restoring tariffs to protect American industries, securing substantial foreign investments, and making efforts to lower living costs through regulatory rollbacks. \n\nAdditionally, President Trump has taken measures to re-establish American strength by engaging in international diplomacy, imposing sanctions, and reinforcing military capabilities. The administration has also focused on restoring accountability and transparency within the government, including the formation of the Department of Government Efficiency. Efforts have been directed towards empowering the American people by establishing commissions for health and religious liberty, supporting educational choices, and granting pardons. These actions present a broad agenda aimed at reforming domestic policies, enhancing economic growth, and asserting international influence.",
  "eli5": "**President Trump** started working as the boss of the country soon and made many big decisions. He wanted to keep people safe at the borders, help Americans get more jobs, and make things cheaper. He also talked to leaders from other countries to keep peace and have strong global friendships.",
  "keywords": [
    "President Trump",
    "homeland security",
    "economic growth",
    "tariffs",
    "immigration policies",
    "foreign relations",
    "accountability",
    "transparency",
    "American strength",
    "empowerment",
    "government efficiency"
  ],
  "issues": [
    "Verification of factual accuracy",
    "Potential bias or political slant",
    "Comprehensiveness of achievements listed",
    "Implications of policy changes on various social groups",
    "Long-term effects of economic and foreign policies"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}