{
  "title": "America First Trade Policy – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "America First Trade Policy",
  "og:description": "January 20, 2025 MEMORANDUM FOR THE SECRETARY OF STATE THE SECRETARY OF THE TREASURY THE SECRETARY OF DEFENSE THE SECRETARY OF COMMERCE THE SECRETARY OF",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/america-first-trade-policy/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:31:29+00:00",
  "article:modified_time": "2025-01-28T22:22:34+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tAmerica First Trade Policy\t\t\t\t\n\nJanuary 20, 2025\n\nJanuary 20, 2025\n\nMEMORANDUM FOR THE SECRETARY OF STATE\n\nTHE SECRETARY OF THE TREASURY\n\nTHE SECRETARY OF DEFENSE\n\nTHE SECRETARY OF COMMERCE\n\nTHE SECRETARY OF HOMELAND SECURITY\n\nTHE DIRECTOR OF THE OFFICE OF MANAGEMENT AND\n\n   BUDGET\n\nTHE UNITED STATES TRADE REPRESENTATIVE\n\nTHE ASSISTANT TO THE PRESIDENT FOR ECONOMIC\n\n   POLICY\n\nTHE SENIOR COUNSELOR FOR TRADE AND MANUFACTURING\n\nSUBJECT:                  America First Trade Policy\n\nSection 1.  Background.  In 2017, my Administration pursued trade and economic policies that put the American economy, the American worker, and our national security first.  This spurred an American revitalization marked by stable supply chains, massive economic growth, historically low inflation, a substantial increase in real wages and real median household wealth, and a path toward eliminating destructive trade deficits.\n\nMy Administration treated trade policy as a critical component to national security and reduced our Nation’s dependence on other countries to meet our key security needs.\n\nAmericans benefit from and deserve an America First trade policy.  Therefore, I am establishing a robust and reinvigorated trade policy that promotes investment and productivity, enhances our Nation’s industrial and technological advantages, defends our economic and national security, and — above all — benefits American workers, manufacturers, farmers, ranchers, entrepreneurs, and businesses. \n\nSec. 2.  Addressing Unfair and Unbalanced Trade.  (a)  The Secretary of Commerce, in consultation with the Secretary of the Treasury and the United States Trade Representative, shall investigate the causes of our country’s large and persistent annual trade deficits in goods, as well as the economic and national security implications and risks resulting from such deficits, and recommend appropriate measures, such as a global supplemental tariff or other policies, to remedy such deficits.\n\n(b)  The Secretary of the Treasury, in consultation with the Secretary of Commerce and the Secretary of Homeland Security, shall investigate the feasibility of establishing and recommend the best methods for designing, building, and implementing an External Revenue Service (ERS) to collect tariffs, duties, and other foreign trade-related revenues.\n\n(c)  The United States Trade Representative, in consultation with the Secretary of the Treasury, the Secretary of Commerce, and the Senior Counselor for Trade and Manufacturing, shall undertake a review of, and identify, any unfair trade practices by other countries and recommend appropriate actions to remedy such practices under applicable authorities, including, but not limited to, the Constitution of the United States; sections 71 through 75 of title 15, United States Code; sections 1337, 1338, 2252, 2253, and 2411 of title 19, United States Code; section 1701 of title 50, United States Code; and trade agreement implementing acts.  \n\n(d)  The United States Trade Representative shall commence the public consultation process set out in section 4611(b) of title 19, United States Code, with respect to the United States-Mexico-Canada Agreement (USMCA) in preparation for the July 2026 review of the USMCA.  Additionally, the United States Trade Representative, in consultation with the heads of other relevant executive departments and agencies, shall assess the impact of the USMCA on American workers, farmers, ranchers, service providers, and other businesses and make recommendations regarding the United States’ participation in the agreement.  The United States Trade Representative shall also report to appropriate congressional committees on the operation of the USMCA and related matters consistent with section 4611(b) of title 19, United States Code.\n\n(e)  The Secretary of the Treasury shall review and assess the policies and practices of major United States trading partners with respect to the rate of exchange between their currencies and the United States dollar pursuant to section 4421 of title 19, United States Code, and section 5305 of title 22, United States Code.  The Secretary of the Treasury shall recommend appropriate measures to counter currency manipulation or misalignment that prevents effective balance of payments adjustments or that provides trading partners with an unfair competitive advantage in international trade, and shall identify any countries that he believes should be designated as currency manipulators.\n\n(f)  The United States Trade Representative shall review existing United States trade agreements and sectoral trade agreements and recommend any revisions that may be necessary or appropriate to achieve or maintain the general level of reciprocal and mutually advantageous concessions with respect to free trade agreement partner countries. \n\n(g)  The United States Trade Representative shall identify countries with which the United States can negotiate agreements on a bilateral or sector-specific basis to obtain export market access for American workers, farmers, ranchers, service providers, and other businesses and shall make recommendations regarding such potential agreements.\n\n(h)  The Secretary of Commerce shall review policies and regulations regarding the application of antidumping and countervailing duty (AD/CVD) laws, including with regard to transnational subsidies, cost adjustments, affiliations, and “zeroing.”  Further, the Secretary of Commerce shall review procedures for conducting verifications pursuant to section 1677m of title 19, United States Code, and assess whether these procedures sufficiently induce compliance by foreign respondents and governments involved in AD/CVD proceedings.  The Secretary of Commerce shall consider modifications to these procedures, as appropriate.\n\n(i)  The Secretary of the Treasury, the Secretary of Commerce, the Secretary of Homeland Security, and the Senior Counselor for Trade and Manufacturing, in consultation with the United States Trade Representative, shall assess the loss of tariff revenues and the risks from importing counterfeit products and contraband drugs, e.g., fentanyl, that each result from the current implementation of the $800 or less, duty-free *de minimis* exemption under section 1321 of title 19, United States Code, and shall recommend modifications as warranted to protect both the revenue of the United States and the public health by preventing unlawful importations.\n\n(j)  The Secretary of the Treasury, in consultation with the Secretary of Commerce and the United States Trade Representative, shall investigate whether any foreign country subjects United States citizens or corporations to discriminatory or extraterritorial taxes pursuant to section 891 of title 26, United States Code.\n\n(k)  The United States Trade Representative, in consultation with the Senior Counselor for Trade and Manufacturing, shall review the impact of all trade agreements — including the World Trade Organization Agreement on Government Procurement — on the volume of Federal procurement covered by Executive Order 13788 of April 18, 2017 (Buy American and Hire American), and shall make recommendations to ensure that such agreements are being implemented in a manner that favors domestic workers and manufacturers, not foreign nations.\n\nSec. 3.  Economic and Trade Relations with the People’s Republic of China (PRC).  (a)  The United States Trade Representative shall review the Economic and Trade Agreement Between the Government of the United States of America and the Government of the People’s Republic of China to determine whether the PRC is acting in accordance with this agreement, and shall recommend appropriate actions to be taken based upon the findings of this review, up to and including the imposition of tariffs or other measures as needed.\n\n(b)  The United States Trade Representative shall assess the May 14, 2024, report entitled “Four-Year Review of Actions Taken in the Section 301 Investigation:  China’s Acts, Policies, and Practices Related to Technology Transfer, Intellectual Property, and Innovation” and consider potential additional tariff modifications as needed under section 2411 of title 19, United States Code — particularly with respect to industrial supply chains and circumvention through third countries, including an updated estimate of the costs imposed by any unfair trade practices identified in such review — and he shall recommend such actions as are necessary to remediate any issues identified in connection with this process.\n\n(c)  The United States Trade Representative shall investigate other acts, policies, and practices by the PRC that may be unreasonable or discriminatory and that may burden or restrict United States commerce, and shall make recommendations regarding appropriate responsive actions, including, but not limited to, actions authorized by section 2411 of title 19, United States Code. \n\n(d)  The Secretary of Commerce and the United States Trade Representative shall assess legislative proposals regarding Permanent Normal Trade Relations with the PRC and make recommendations regarding any proposed changes to such legislative proposals.\n\n(e)  The Secretary of Commerce shall assess the status of United States intellectual property rights such as patents, copyrights, and trademarks conferred upon PRC persons, and shall make recommendations to ensure reciprocal and balanced treatment of intellectual property rights with the PRC.\n\nSec. 4.  Additional Economic Security Matters.  (a)  The Secretary of Commerce, in consultation with the Secretary of Defense and the heads of any other relevant agencies, shall conduct a full economic and security review of the United States’ industrial and manufacturing base to assess whether it is necessary to initiate investigations to adjust imports that threaten the national security of the United States under section 1862 of title 19, United States Code. \n\n(b)  The Assistant to the President for Economic Policy, in consultation with the Secretary of Commerce, the United States Trade Representative, and the Senior Counselor for Trade and Manufacturing, shall review and assess the effectiveness of the exclusions, exemptions, and other import adjustment measures on steel and aluminum under section 1862 of title 19, United States Code, in responding to threats to the national security of the United States, and shall make recommendations based upon the findings of this review. \n\n(c)  The Secretary of State and the Secretary of Commerce, in cooperation with the heads of other agencies with export control authorities, shall review the United States export control system and advise on modifications in light of developments involving strategic adversaries or geopolitical rivals as well as all other relevant national security and global considerations.  Specifically, the Secretary of State and the Secretary of Commerce shall assess and make recommendations regarding how to maintain, obtain, and enhance our Nation’s technological edge and how to identify and eliminate loopholes in existing export controls -– especially those that enable the transfer of strategic goods, software, services, and technology to countries to strategic rivals and their proxies.  In addition, they shall assess and make recommendations regarding export control enforcement policies and practices, and enforcement mechanisms to incentivize compliance by foreign countries, including appropriate trade and national security measures. \n\n(d)  The Secretary of Commerce shall review and recommend appropriate action with respect to the rulemaking by the Office of Information and Communication Technology and Services (ICTS) on connected vehicles, and shall consider whether controls on ICTS transactions should be expanded to account for additional connected products.\n\n(e)  The Secretary of the Treasury, in consultation with the Secretary of Commerce and, as appropriate, the heads of any other relevant agencies, shall review whether Executive Order 14105 of August 9, 2023 (Addressing United States Investments in Certain National Security Technologies and Products in Countries of Concern) should be modified or rescinded and replaced, and assess whether the final rule entitled “Provisions Pertaining to U.S. Investments in Certain National Security Technologies and Products in Countries of Concern,” 89 Fed. Reg. 90398 (November 15, 2024), which implements Executive Order 14105, includes sufficient controls to address national security threats.  The Secretary of the Treasury shall make recommendations based upon the findings of this review, including potential modifications to the Outbound Investment Security Program.\n\n(f)  The Director of the Office of Management and Budget shall assess any distorting impact of foreign government financial contributions or subsidies on United States Federal procurement programs and propose guidance, regulations, or legislation to combat such distortion.\n\n(g)  The Secretary of Commerce and the Secretary of Homeland Security shall assess the unlawful migration and fentanyl flows from Canada, Mexico, the PRC, and any other relevant jurisdictions and recommend appropriate trade and national security measures to resolve that emergency.\n\nSec. 5.  Reports.  The results of the reviews and investigations, findings, identifications, and recommendations identified in:\n\n(a)  sections 2(a), 2(h), 3(d), 3(e), 4(a), 4(b), 4(c), 4(d), and 4(g) shall be delivered to me in a unified report coordinated by the Secretary of Commerce by April 1, 2025;\n\n(b)  sections 2(b), 2(e), 2(i), 2(j), and 4(e) shall be delivered to me in a unified report coordinated by the Secretary of the Treasury by April 1, 2025;\n\n(c)  sections 2(c), 2(d), 2(f), 2(g), 2(k), 3(a), 3(b), and 3(c) shall be delivered to me in a unified report coordinated by the United States Trade Representative by April 1, 2025; and\n\n(d)  section 4(f) shall be delivered to me by the Director of the Office of Management and Budget by April 30, 2025.\n\nSec. 6.  General Provisions.  (a)  Nothing in this memorandum shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This memorandum shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "The document is a presidential memorandum dated January 20, 2025, establishing an 'America First Trade Policy.' It outlines directives for various U.S. officials, including the Secretaries of State, Treasury, Defense, Commerce, and others, to take significant actions aimed at addressing economic and national security concerns related to trade. The memorandum emphasizes reviewing trade deficits, currency manipulation, unfair trade practices, and bilateral agreements, among other economic policies.\n\nThe memorandum mandates investigations into persistent trade deficits, recommends possible tariffs, and suggests the establishment of an External Revenue Service (ERS) for collecting tariffs. It also highlights the need for a review of the USMCA and evaluates currency practices of major trading partners. Issues of intellectual property rights with China and U.S. participation in global trade agreements are also focal areas. Additionally, it calls for a review of the industrial base and export controls to ensure national security.\n\nReports on these actions are to be coordinated and delivered by various department heads by specified dates in 2025. The memorandum makes clear that it does not intend to create legal rights enforceable against the government, ensuring its actions conform to existing laws and available appropriations.",
  "eli5": "The document is like a big plan from the President to make sure America does well in trading with other countries. It asks important people to check if other countries are playing fair and using money rules correctly, and to make sure products made in America get a good chance to sell. They need to see if anything is unfair and report back with ideas to fix it.",
  "keywords": [
    "America First Trade Policy",
    "trade deficits",
    "USMCA",
    "currency manipulation",
    "intellectual property",
    "national security",
    "tariffs",
    "export controls"
  ],
  "issues": [
    "Potential economic impacts of imposing tariffs",
    "Feasibility and implications of establishing an External Revenue Service",
    "Proper assessment of currency manipulation by trading partners",
    "Evaluating the effectiveness of trade agreements in benefiting American interests",
    "Balancing national security concerns with international trade relations"
  ],
  "citations": [
    "sections 71 through 75 of title 15, United States Code",
    "sections 1337, 1338, 2252, 2253, and 2411 of title 19, United States Code",
    "section 1701 of title 50, United States Code",
    "section 4611(b) of title 19, United States Code",
    "section 4421 of title 19, United States Code",
    "section 5305 of title 22, United States Code",
    "section 891 of title 26, United States Code",
    "section 1862 of title 19, United States Code",
    "Executive Order 13788",
    "Executive Order 14105"
  ],
  "document_type": "Presidential Memorandum"
}