{
  "title": "Another Historic Investment Secured Under President Trump – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Another Historic Investment Secured Under President Trump",
  "og:description": "Today, President Donald J. Trump joined Taiwan Semiconductor Manufacturing Company (TSMC) CEO C.C. Wei to announce a historic $100 billion investment by",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/another-historic-investment-secured-under-president-trump/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-03T21:29:10+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tAnother Historic Investment Secured Under President Trump\t\t\t\t\n\nMarch 3, 2025\n\nToday, President Donald J. Trump joined Taiwan Semiconductor Manufacturing Company (TSMC) CEO C.C. Wei to [announce](https://x.com/RapidResponse47/status/1896648385542963549) a historic $100 billion investment by TSMC in its Arizona-based semiconductor chips manufacturing operation — the largest foreign direct investment in U.S. history.\n    - **President Trump** : “This $100 billion in new investment will go into building five cutting-edge fabrication facilities in the great state that we just discussed, Arizona, and will create thousands of jobs — many thousands of jobs, and they’re high-paying jobs. In total, today’s announcement brings Taiwan Semiconductor’s investment to about $165 billion.”\n    - **TSMC CEO C.C. Wei** : “It’s going to create thousands of high-paying jobs … We are going to produce many chips to support AI’s progress and to support the smartphone’s progress. I want to thank President Trump again for his support.”\n    - **Secretary of Commerce Howard Lutnick** :  “President Trump has made it a fundamental objective to bring semiconductor chip manufacturing home to America … You’re seeing the power of Donald Trump’s presidency because TSMC, the greatest manufacturer of chips in the world, is coming to America with a $100 billion investment.”\n\nSince taking office, President Trump has secured nearly $2 trillion in U.S.-based investment — and the best is yet to come.\n",
  "summary": "On March 3, 2025, President Donald J. Trump announced a significant $100 billion investment by Taiwan Semiconductor Manufacturing Company (TSMC) in semiconductor chip production in Arizona. This investment represents the largest foreign direct investment in U.S. history and aims to build five advanced fabrication facilities that will create thousands of high-paying jobs. TSMC's increased commitment raises its total investment in the United States to approximately $165 billion.\n\nPresident Trump emphasized the job creation potential and strategic importance of this investment in reinforcing the U.S. semiconductor industry. TSMC's CEO, C.C. Wei, expressed gratitude for the support and highlighted the role of this investment in advancing artificial intelligence and smartphone technology. Secretary of Commerce Howard Lutnick praised this as a fulfillment of President Trump's objective to bring semiconductor manufacturing back to America, asserting the move demonstrates the strength of Trump's presidency.",
  "eli5": "TSMC is a big company from Taiwan that makes tiny computer parts called chips. They are spending a lot of money to build new factories in Arizona, with help from President Trump, which will give a lot of people jobs.",
  "issues": [
    "The page might present biased approval of Trump's policies without presenting opposing views.",
    "Verification of the investment figures and job creation claims needs to be done.",
    "The article does not mention any environmental impacts this large-scale manufacturing project may have."
  ],
  "citations": [],
  "keywords": [
    "Trump",
    "TSMC",
    "Investment",
    "Semiconductor",
    "Arizona",
    "Jobs",
    "Commerce",
    "Manufacturing"
  ],
  "document_type": "Press Release"
}