{
  "title": "At USAID, Waste and Abuse Runs Deep – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "At USAID, Waste and Abuse Runs Deep – The White House",
  "og:description": "For decades, the United States Agency for International Development (USAID) has been unaccountable to taxpayers as it funnels massive sums of money to the",
  "og:url": "https://www.whitehouse.gov/uncategorized/2025/02/at-usaid-waste-and-abuse-runs-deep/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-04T00:23:56+00:00",
  "article:modified_time": "2025-02-04T00:29:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Uncategorized](https://www.whitehouse.gov/uncategorized/)\n\n# \t\t\t\t\tAt USAID, Waste and Abuse Runs Deep\t\t\t\t\n\nFebruary 3, 2025\n\nFor decades, the United States Agency for International Development (USAID) has been unaccountable to taxpayers as it funnels massive sums of money to the ridiculous — and, in many cases, malicious — pet projects of entrenched bureaucrats, with next-to-no oversight.**Here are only a few examples of the WASTE and ABUSE:**\n    - $1.5 million  to “advance diversity equity and inclusion in Serbia’s workplaces and business communities”\n    - $70,000  for production of a “DEI musical” in Ireland\n    - $2.5 million  for electric vehicles for Vietnam\n    - $47,000  for a “transgender opera” in Colombia\n    - $32,000  for a “transgender comic book” in Peru\n    - $2 million  for sex changes and “LGBT activism” in Guatemala\n    - $6 million  to fund tourism in Egypt\n    - Hundreds of thousands of dollars  for a non-profit linked to designated terrorist organizations — even AFTER an inspector general launched an investigation\n    - Millions  to EcoHealth Alliance — which was involved in research at the Wuhan lab\n    - “Hundreds of thousands of meals that went to al Qaeda-affiliated fighters in Syria”\n    - Funding  to print “personalized” contraceptives birth control devices in developing countries\n    - Hundreds of millions of dollars  to fund “irrigation canals, farming equipment, and even fertilizer used to support the unprecedented poppy cultivation and heroin production in Afghanistan,” benefiting the Taliban\n\n**The list literally goes on and on — and it has all been happening for decades.**Under President Trump, the waste, fraud, and abuse ENDS NOW.\n",
  "summary": "The article discusses longstanding concerns regarding waste and abuse within the United States Agency for International Development (USAID). It highlights specific instances where money has been allocated to projects deemed unnecessary or inappropriate, such as DEI initiatives in Serbia, arts and culture projects in Ireland, Colombia, and Peru, and various forms of activism in Guatemala. Additionally, significant funds have been used to support questionable international associations and controversial agricultural practices in Afghanistan, ultimately benefiting harmful organizations like the Taliban. \n\nThese examples are presented as evidence of systemic financial mismanagement and lack of oversight at USAID. The article asserts that this pattern of wastefulness has persisted for decades and calls for an immediate end to these practices under President Trump's administration. The article suggests that existing oversight mechanisms have failed to prevent misuse of funds, leading to a call for stricter control and accountability measures within USAID.",
  "eli5": "This article talks about how a lot of money given to help people in other countries is being spent on things that don't really help, like plays, operas, or expensive projects. The USA wants to stop wasting money like this.",
  "keywords": [
    "USAID",
    "waste",
    "abuse",
    "international aid",
    "financial mismanagement",
    "oversight",
    "accountability"
  ],
  "issues": [
    "No direct evidence or citations provided for claims.",
    "Potential bias in criticizing specific projects as wasteful.",
    "Lack of context on the potential benefits of some projects listed.",
    "Ambiguity around how past administrations have handled similar claims."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}