{
  "title": "President Trump Announces Cabinet and Cabinet Level Appointments – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Cabinet and Cabinet Level Appointments – The White House",
  "og:description": "To the Senate of the United States, I nominate Scott Bessent, of South Carolina, to be Secretary of the Treasury. Pamela Bondi, of Florida, to be Attorney",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/cabinet-and-cabinet-level-appointments/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T19:30:00+00:00",
  "article:modified_time": "2025-01-20T22:07:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident Trump Announces Cabinet and Cabinet-Level Appointments\t\t\t\t\n\nJanuary 20, 2025\n\nTo the Senate of the United States, I nominate\n\nScott Bessent, of South Carolina, to be Secretary of the Treasury.\n\nPamela Bondi, of Florida, to be Attorney General.\n\nDouglas Burgum, of North Dakota, to be Secretary of the Interior.\n\nLori Chavez-DeRemer, of Oregon, to be Secretary of Labor.\n\nDouglas Collins, of Georgia, to be Secretary of Veterans Affairs.\n\nSean Duffy, of Wisconsin, to be Secretary of Transportation.\n\nPeter Hegseth, of Tennessee, to be Secretary of Defense.\n\nRobert F. Kennedy, Jr., of California, to be Secretary of Health and Human Services.\n\nHoward Lutnick, of New York, to be Secretary of Commerce.\n\nLinda McMahon, of Connecticut, to be Secretary of Education.\n\nKristi Noem, of South Dakota, to be Secretary of Homeland Security.\n\nBrooke Rollins, of Texas, to be Secretary of Agriculture.\n\nMarco Rubio, of Florida, to be Secretary of State.\n\nEric Turner, of Texas, to be Secretary of Housing and Urban Development.\n\nChristopher Wright, of Colorado, to be Secretary of Energy.\n\nTulsi Gabbard, of Hawaii, to be Director of National Intelligence.\n\nJamieson Greer, of Maryland, to be United States Trade Representative, with the rank of Ambassador Extraordinary and Plenipotentiary.\n\nKelly Loeffler, of Georgia, to be Administrator of the Small Business Administration.\n\nJohn Ratcliffe, of Texas, to be Director of the Central Intelligence Agency.\n\nElise Stefanik, of New York, to be the Representative of the United States of America to the United Nations, with the rank and status of Ambassador Extraordinary and Plenipotentiary, and the Representative of the United States of America in the Security Council of the United Nations.\n\nElise Stefanik, of New York, to be Representative of the United States of America to the Sessions of the General Assembly of the United Nations during her tenure of service as Representative of the United States of America to the United Nations.\n\nRussell Vought, of Virginia, to be Director of the Office of Management and Budget.\n\nLee Zeldin, of New York, to be Administrator of the Environmental Protection Agency.\n",
  "summary": "On January 20, 2025, President Trump announced a series of cabinet and cabinet-level appointments. This announcement was directed to the Senate for the confirmation of various individuals nominated for prominent roles within the federal government. Some of the key nominations include Scott Bessent for Secretary of the Treasury, Pamela Bondi for Attorney General, and Marco Rubio for Secretary of State. Additionally, Elise Stefanik was nominated as the U.S. Representative to the United Nations, and Robert F. Kennedy Jr. for Secretary of Health and Human Services.\n\nThe purpose of these appointments is to fill significant positions in the administration, which oversee major departments and play crucial roles in implementing the president's agenda. This process is part of the formal procedure by which the President forms their executive team, subject to Senate approval, to manage various aspects of governance effectively. Each nominee brings their expertise and experience to contribute to the functioning of their respective departments.",
  "eli5": "President Trump picked a team of people to help him run the country, like picking team captains for a sports game. He chose them to do important jobs, like managing money or making sure people are safe.",
  "keywords": [
    "Presidential Appointments",
    "Trump Administration",
    "Cabinet",
    "Senate Confirmation",
    "Nominations",
    "Secretary of State",
    "Secretary of Treasury",
    "United Nations"
  ],
  "issues": [
    "Potential for Senate opposition to certain nominations",
    "Impact of appointments on U.S. domestic and foreign policy",
    "Verification of nominees' qualifications and backgrounds"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}