{
  "title": "Celebrating America's 250th Birthday – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Celebrating America's 250th Birthday – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, and in anticipation of the 250th anniversary",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/celebrating-americas-250th-birthday/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-29T22:34:10+00:00",
  "article:modified_time": "2025-01-29T22:34:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tCelebrating America’s 250th Birthday\t\t\t\t\n\nJanuary 29, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, and in anticipation of the 250th anniversary of American Independence on July 4, 2026, it is hereby ordered:Section 1.  Purpose.  It is the policy of the United States, and a purpose of this order, to provide a grand celebration worthy of the momentous occasion of the 250th anniversary of American Independence on July 4, 2026.  It is also the purpose of this order to take other actions to honor the history of our great Nation.Sec. 2.  Establishing the White House Task Force on Celebrating America’s 250th Birthday. (a)  There is hereby established the White House Task Force on Celebrating America’s 250th Birthday (Task Force 250).(b)  The President shall be the Chair of Task Force 250 and the Vice President will serve as Vice Chair.  The Chair shall appoint an Executive Director, who shall administer and execute the day-to-day operations of Task Force 250, and who shall report through the Assistant to the President for Domestic Policy.  The Chair, the Vice Chair, or a member of Task Force 250 designated by the Chair, shall convene regular meetings of Task Force 250, determine its agenda, and direct its work, consistent with this order.  The Executive Director and the Assistant to the President for Domestic Policy shall assist in the performance of these duties.  The Chair may designate any member of the Task Force to preside over meetings of the Task Force.  (c)  In addition to the Chair and Vice Chair, Task Force 250 shall consist of the following members:(i)     the Secretary of State;(ii)    the Secretary of the Treasury;(iii)   the Secretary of Defense;(iv)    the Secretary of the Interior; (v)     the Secretary of Agriculture;(vi)    the Secretary of Housing and Urban Development;(vii)   the Secretary of Education;(viii)  the Assistant to the President for Domestic Policy;(ix)    the Deputy Chief of Staff for Legislative Affairs;(x)     the Cabinet Secretary and Deputy Chief of Staff;(xi)    the Director of Speechwriting;(xii)   the Chair of the National Endowment for the Humanities;(xiii)  the Chair of the National Endowment for the Arts;(xiv)   the Director of the Institute of Museum and Library Services; and(xv)    the heads of such other executive departments, agencies, and offices that the Chair or the Vice Chair may, from time to time, designate or invite to participate.(d)  The Chair and the Vice Chair, as they deem appropriate, shall invite the Executive Director of the United States Semiquincentennial Commission to provide recommendations and advice to Task Force 250. (e)  Task Force 250 shall coordinate with the executive departments and agencies (agencies) to plan, organize, and execute an extraordinary celebration of the 250th Anniversary of American Independence and shall coordinate agencies’ communications with the United States Semiquincentennial Commission.  In addition, the Executive Director may seek information or advice from such other agencies as Task Force 250 shall direct.(f)  For administrative purposes, the Task Force shall be housed in the Department of Defense, which shall provide funding and administrative support for Task Force 250, to the extent permitted by law and subject to the availability of appropriations.(g)  Agencies shall provide a report to Task Force 250 regarding their respective planning and activities with respect to the celebration of the 250th Anniversary of American Independence.  These reports should be submitted to the Executive Director of Task Force 250 no later than March 1, 2025.(h)  Task Force 250 shall terminate on December 31, 2026, unless extended by the President.Sec. 3.  National Garden of American Heroes.  (a)  Executive Order 13934 of July 3, 2020 (Building and Rebuilding Monuments to American Heroes) and Executive Order 13978 of January 18, 2021 (Building the National Garden of American Heroes) are reinstated as they were prior to issuance of Executive Order 14029 of May 14, 2021. (b)  The Assistant to the President for Domestic Policy shall recommend to the President additional historically significant Americans for inclusion in the National Garden of American Heroes, to bring the total number of heroes to 250.(c)  Section 3(c)(ii) of Executive Order 13934 is amended by striking “prior to the 250th anniversary of the proclamation of the Declaration of Independence on July 4, 2026” and inserting in its place “as expeditiously as possible”.Sec. 4.  Protecting America’s Monuments from Vandalism.  Executive Order 13933 of June 26, 2020 (Protecting American Monuments, Memorials, and Statues and Combatting Recent Criminal Violence) is hereby reinstated as it was prior to the issuance of Executive Order 14029 of May 14, 2021.  Recent examples of conduct necessitating reinstatement of this order include pro-Hamas-related vandalism of historically significant public monuments and related assaults on Federal officers and employees following October 7, 2023, including the vandalism of the exterior of the Department of the Treasury and of statues in Lafayette Square in Washington, D.C. on June 8, 2024, and the assaults on Federal officers and vandalism of the Christopher Columbus Memorial Fountain and Freedom Bell at Union Station in Washington, D.C. on July 24, 2024.   Sec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "The document, dated January 29, 2025, outlines a presidential initiative for celebrating the 250th anniversary of American Independence on July 4, 2026. It establishes the White House Task Force on Celebrating America’s 250th Birthday, referred to as Task Force 250. This task force, led by the President and Vice President, includes several high-ranking members of the U.S. Cabinet and key federal agencies. Their primary goal is to coordinate a nationwide celebration, and they are tasked with working alongside the United States Semiquincentennial Commission.\n\nThe order reinstates previous executive orders related to honoring American heroes and protecting national monuments, while also reinitiating plans for a National Garden of American Heroes. The task force is administratively housed under the Department of Defense and will provide regular reports to track progress. Notably, the order addresses the protection of monuments in light of recent vandalism incidents, underscoring the importance of safeguarding historical sites.\n\nThe document concludes with general provisions clarifying that this order will be enacted in accordance with existing laws and does not create enforceable legal rights. Additionally, it specifies that the task force will be dissolved by the end of 2026 unless otherwise prolonged.",
  "eli5": "The President wants to throw a big birthday party for America turning 250 on July 4, 2026! A special group will plan fun events and make sure everything is ready. They also want to keep important statues safe from harm.",
  "keywords": [
    "250th Anniversary",
    "American Independence",
    "Task Force 250",
    "National Garden of American Heroes",
    "Monument Protection",
    "Executive Order"
  ],
  "issues": [
    "Coordination with multiple government agencies might be challenging.",
    "Dependence on available funding and appropriations.",
    "Addressing vandalism incidents effectively."
  ],
  "citations": [
    "Executive Order 13934",
    "Executive Order 13978",
    "Executive Order 13933",
    "Executive Order 14029"
  ],
  "document_type": "Executive Order"
}