{
  "title": "CFPB Isn’t a Wall Street Regulator, It’s a Main Street Regulator – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "CFPB Isn’t a Wall Street Regulator, It’s a Main Street Regulator",
  "og:description": "The Consumer Financial Protection Bureau (CFPB) — the brainchild of Sen. Elizabeth Warren — has long functioned as another woke, weaponized arm of the",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/cfpb-isnt-a-wall-street-regulator-its-a-main-street-regulator/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-10T17:05:00+00:00",
  "article:modified_time": "2025-02-13T01:47:35+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tCFPB Isn’t a Wall Street Regulator, It’s a Main Street Regulator\t\t\t\t\n\nFebruary 10, 2025\n\nThe Consumer Financial Protection Bureau (CFPB) — the [brainchild](https://dailycaller.com/2021/09/30/rohit-chopra-cfpb-elizabeth-warren-joe-biden/) of Sen. Elizabeth Warren — has long functioned as another woke, weaponized arm of the bureaucracy that leverages its power against certain industries and individuals disfavored by so-called “elites.”\n\nFor example:\n    - CFPB  **used**  its  **slush fund**  — collected from targeting financial institutions — to support radical advocacy groups.  One such group is the  Soros-backed  Mississippi Center for Justice, which  advocates  for “racial and economic justice,”  targets  religious liberty, and  assists  illegal immigrants seeking to skirt our nation’s laws.  Another  is The Legal Aid Society of the District of Columbia, whose board features senior left-wing officials and has lobbied hundreds of times for more welfare spending.\n    - CFBP  **threatened**  banks for refusing to lend to illegal immigrants.\n    - CFPB  **targeted**  a Chicago small business after it complained about the city’s rampant crime.\n    - CFPB was  **accused**  of mining American citizens’ personal financial information — with a 2017 inspector general’s  **report**  raising significant  **concerns**  about its data security.\n    - CFPB  **granted itself**  broad new powers in the waning hours of the lame duck Biden administration.  Described as classic  “government overreach,”  the agency gave itself the authority to regulate Americans’ checking accounts by  dictating  government  price controls  and unilaterally  buried  $50 billion in medical debt.\n\nUnder the administration of President Donald J. Trump, the weaponization ends right now.\n",
  "summary": "The article discusses the role and actions of the Consumer Financial Protection Bureau (CFPB), which was conceived by Senator Elizabeth Warren. It highlights criticisms of the CFPB for allegedly using its resources to support advocacy groups that are perceived as politically radical, such as the Mississippi Center for Justice and The Legal Aid Society of the District of Columbia. The bureau is accused of using a 'slush fund' to back these organizations and for overreaching its authority by threatening financial institutions and mining personal financial data without adequate security measures. \n\nFurthermore, the CFPB, under scrutiny, reportedly expanded its powers during the closing period of the Biden administration by taking steps to regulate Americans' checking accounts and buried a significant amount of medical debt. The article posits that these moves equate to government overreach, setting the stage for a policy shift under President Donald J. Trump's administration to curb what is characterized as the bureau's weaponized activities.",
  "eli5": "The CFPB was doing things some people didn't like, like using money in ways some people thought was unfair or spying on money stuff. Then Trump said they would stop doing those things.",
  "keywords": [
    "CFPB",
    "Consumer Financial Protection Bureau",
    "Elizabeth Warren",
    "financial regulation",
    "government overreach",
    "Trump administration",
    "Biden administration",
    "data privacy"
  ],
  "issues": [
    "Accusations of CFPB's misallocation of funds",
    "Concerns over data privacy violations",
    "Claims of government overreach",
    "Criticism of ties with advocacy groups"
  ],
  "citations": [],
  "document_type": "Articles"
}