{
  "title": "Copyright – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Copyright – The White House",
  "og:description": "Pursuant to federal law, government-produced materials appearing on this site are not copyright protected. The United States Government may receive and",
  "og:url": "https://www.whitehouse.gov/copyright/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-01-20T21:36:49+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "# \t\t\t\t\tCopyright Policy\t\t\t\t\n\nPursuant to federal law, government-produced materials appearing on this site are not copyright protected. The United States Government may receive and hold copyrights transferred to it by assignment, bequest, or otherwise.\n\n## Creative Commons License\n\nExcept where otherwise noted, third-party content on this site is licensed under a [Creative Commons Attribution 3.0 License](https://creativecommons.org/licenses/by/3.0/us/). Visitors to this website agree to grant a non-exclusive, irrevocable, royalty-free license to the rest of the world for their submissions to Whitehouse.gov under the [Creative Commons Attribution 3.0 License](https://creativecommons.org/licenses/by/3.0/us/).\n",
  "summary": "The copyright policy of the White House website clarifies that materials produced by the United States Government, as found on the site, are not subject to copyright due to federal law. However, it notes that the government is permitted to possess copyrights if they are transferred to it by other means such as assignment or bequest. This indicates a distinction between original government materials, which are free from copyright, and those that have been assigned copyrights.\n\nAdditionally, the policy states that third-party content on the website is licensed under a Creative Commons Attribution 3.0 License. This means that such content can be freely shared and adapted by others as long as proper attribution is given. Contributions submitted by visitors to the Whitehouse.gov website are also covered by this license, granting the world a non-exclusive, irrevocable, royalty-free right to use these submissions under the same terms.",
  "eli5": "The government doesn't keep copies of stuff it makes on the site, but visitors can use it for free. If you put something on the site, everyone can use it too, just be sure to say where it came from.",
  "keywords": [
    "Copyright Policy",
    "Government Materials",
    "Creative Commons",
    "Licensing",
    "Federal Law"
  ],
  "issues": [
    "Clarification on the conditions under which the government can hold copyrights",
    "Understanding the implications of the Creative Commons Attribution 3.0 License for user submissions"
  ],
  "citations": [
    "Creative Commons Attribution 3.0 License"
  ],
  "document_type": "Fact Sheet"
}