{
  "title": "Council to Assess the Federal Emergency Management Agency – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Council to Assess the Federal Emergency Management Agency",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows: Section",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/council-to-assess-the-federal-emergency-management-agency/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-24T23:19:12+00:00",
  "article:modified_time": "2025-01-26T23:32:03+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tCOUNCIL TO ASSESS THE FEDERAL EMERGENCY MANAGEMENT AGENCY\t\t\t\t\n\nJanuary 24, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:\n\nSection 1.  Purpose and Policy.  The Federal responses to Hurricane Helene and other recent disasters demonstrate the need to drastically improve the Federal Emergency Management Agency’s (“FEMA’s) efficacy, priorities, and competence, including evaluating whether FEMA’s bureaucracy in disaster response ultimately harms the agency’s ability to successfully respond.  Despite obligating nearly $30 billion in disaster aid each of the past three years, FEMA has managed to leave vulnerable Americans without the resources or support they need when they need it most.\n\nThere are serious concerns of political bias in FEMA.  Indeed, at least one former FEMA responder has stated that FEMA managers directed her to avoid homes of individuals supporting the campaign of Donald J. Trump for President.  And it has lost mission focus, diverting limited staff and resources to support missions beyond its scope and authority, spending well over a billion dollars to welcome illegal aliens.\n\nAmericans deserve an immediate, effective, and impartial response to and recovery from disasters.  FEMA therefore requires a full-scale review, by individuals highly experienced at effective disaster response and recovery, who shall recommend to the President improvements or structural changes to promote the national interest and enable national resilience.\n\nSec. 2.  Establishment.  (a)  There is hereby established the Federal Emergency Management Agency Review Council (“Council”).\n\n(b)  The Council shall be composed of not more than 20 members.  The Secretary of Homeland Security and the Secretary of Defense shall be members of the Council.  The remaining members shall include relevant agency heads and distinguished individuals and representatives from sectors outside of the Federal Government appointed by the President.  These non-Federal members shall have diverse perspectives and expertise in disaster relief and assistance, emergency preparedness, natural disasters, Federal-State relationships, and budget management.\n\n(c)  The Secretary of Homeland Security and the Secretary of Defense shall serve as Co-Chairs of the Council.  The Co-Chairs may designate up to two Vice Chairs of the Council from among the non-Federal members of the Council, to support the Co-Chairs in the leadership and organization of the Council.\n\nSec. 3.  Functions.  (a)  The Council shall advise the President, through the Assistant to the President for National Security Affairs, the Assistant to the President for Homeland Security, and the Director of the Office of Management and Budget, on the existing ability of FEMA to capably and impartially address disasters occurring within the United States and shall advise the President on all recommended changes related to FEMA to best serve the national interest.\n\n(b)  The Council shall meet regularly and shall:\n\n(i)   respond to requests from the President, through the Assistant to the President for National Security Affairs, the Assistant to the President for Homeland Security Affairs, the Director of the Office of Management and Budget, or the Co-Chairs for information, analysis, evaluation, or advice;\n\n(ii)  solicit information and ideas from a broad range of stakeholders, including Americans affected by natural disasters; the research community; the private sector; State, local, and Tribal governments; foundations; and nonprofit organizations;\n\n(c)  The Council shall produce a report for the President that includes the following:\n\n(i)     An assessment of the adequacy of FEMA’s response to disasters during the previous 4 years, including sufficiency of staffing;\n\n(ii)    A comparison of the FEMA responses with State, local, and private sector responses — including timeliness of response, supplies provided, efficacy, and services (including communications and electricity) provided — during the same period;\n\n(iii)   An account of the commentary and debate about the role and operation of FEMA in our Federal system and about the functioning of disaster relief, assistance, and preparedness in the United States;\n\n(iv)    The historical background of other periods in the Nation’s history both before FEMA was part of DHS and before FEMA existed and methods by which disaster aid and relief were then provided;\n\n(v)     The traditional role of States and their coordination with the Federal Government in securing the life, liberty, and property of their citizens in preparation for, during, and after disasters;\n\n(vi)    An evaluation of whether FEMA can serve its functions as a support agency, providing supplemental Federal assistance, to the States rather than supplanting State control of disaster relief;\n\n(vii)   Other recommended improvements to FEMA in the current statutory structure; and\n\n(viii)  An analysis of the principal arguments in the public debate for and against FEMA reform, including an appraisal of the merits and legality of particular reform proposals.\n\n(d)  The Council shall solicit public comment, including other expert views, to ensure that its work is informed by a broad spectrum of ideas.\n\n(e)  The Council shall hold its first public meeting within 90 days of the date of this order and submit its report to the President within 180 days of the date of the Council’s first public meeting.\n\nSec. 4.  Administration.  (a)  The heads of executive departments and agencies shall, to the extent permitted by law, provide the Council with information concerning disaster preparedness and relief matters when requested by the Council Co-Chairs and as required for the purpose of carrying out the Council’s functions.\n\n(b)  In consultation with the Co-Chairs, the Council is authorized to create standing subcommittees and ad hoc groups, including technical advisory groups, to assist the Council and provide preliminary information directly to the Council.\n\n(c)  The Department of Homeland Security shall provide such funding and administrative and technical support as the Council may require, to the extent permitted by law and as authorized by existing appropriations.\n\n(d)  Members of the Council shall serve without any compensation for their work on the Council, but may receive travel expenses, including per diem in lieu of subsistence, as authorized by law for persons serving intermittently in the government service (5 U.S.C. 5701-5707).\n\n(e)  Insofar as the Federal Advisory Committee Act, as amended (5 U.S.C. App.), may apply to the Council, any functions of the President under that Act, except that of reporting to the Congress, shall be performed by the Secretary of Homeland Security, in accordance with the guidelines and procedures established by the Administrator of General Services.\n\nSec. 5.  Termination.  The Council shall terminate 1 year from the date of this order unless extended by the President.\n\nSec. 6.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 24, 2025.\n",
  "summary": "### Summary\n\nOn January 24, 2025, a Presidential order was issued to establish the Federal Emergency Management Agency Review Council. This Council is tasked with conducting a comprehensive review of FEMA's performance, with particular emphasis on its responsiveness, impartiality, and focus during disasters. The order arises from criticisms of FEMA's handling of disaster relief efforts and alleged political bias, particularly concerning the response to Hurricane Helene and other emergencies.\n\nThe Council, led by the Secretary of Homeland Security and the Secretary of Defense, along with up to 20 members from both federal and non-federal backgrounds, will evaluate FEMA's procedures and policies. They aim to provide recommendations for structural changes to improve FEMA's effectiveness, focusing on its relationship with state and local agencies and its ability to supplement rather than replace state-level disaster management. The Council is expected to produce a detailed report within 180 days of its first meeting, which will occur within 90 days of the order.\n\nThe administration of the Council includes collecting and analyzing data from various stakeholders and forming subcommittees as necessary. The Department of Homeland Security will support the Council's operations. Additionally, the order stipulates that the Council will operate for one year unless extended by the President, with its undertakings bound by existing laws and budgetary constraints.",
  "eli5": "### ELI5\n\nThe President wants to see if FEMA is doing a good job helping people during disasters. So, they've set up a group of experts to look into how FEMA works and suggest better ways to do things. This group will talk to lots of people and has to give a special report to the President about what they find out.",
  "keywords": [
    "FEMA",
    "disaster response",
    "Presidential order",
    "review council",
    "emergency management",
    "national resilience"
  ],
  "issues": [
    "Allegations of political bias in FEMA",
    "Effectiveness of FEMA's disaster response",
    "Coordination between federal and state agencies",
    "Funding and resources allocated to FEMA"
  ],
  "citations": [
    "5 U.S.C. 5701-5707",
    "Federal Advisory Committee Act (5 U.S.C. App.)"
  ],
  "document_type": "Executive Order"
}