{
  "title": "Defending American Companies and Innovators From Overseas Extortion and Unfair Fines and Penalties – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Defending American Companies and Innovators From Overseas Extortion and Unfair Fines and Penalties",
  "og:description": "MEMORANDUM FOR THE SECRETARY OF THE TREASURY      THE SECRETARY OF COMMERCE      THE UNITED STATES TRADE REPRESENTATIVE",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/defending-american-companies-and-innovators-from-overseas-extortion-and-unfair-fines-and-penalties/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-21T23:19:28+00:00",
  "article:modified_time": "2025-02-21T23:19:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tDefending American Companies and Innovators From Overseas Extortion and Unfair Fines and Penalties\t\t\t\t\n\nFebruary 21, 2025\n\nMEMORANDUM FOR THE SECRETARY OF THE TREASURY\n\n     THE SECRETARY OF COMMERCE\n\n     THE UNITED STATES TRADE REPRESENTATIVE\n\n     THE SENIOR COUNSELOR TO THE PRESIDENT FOR TRADE\n\n     AND MANUFACTURING\n\nSUBJECT:       Defending American Companies and Innovators From               Overseas Extortion and Unfair Fines and PenaltiesSection1.  Purpose.  In recent years, the gross domestic product of the United States’ digital economy alone, driven by cutting-edge American technology companies, has been bigger than the entire economy of Australia, Canada, or most members of the European Union.  Instead of empowering their own workers and economies, foreign governments have increasingly exerted extraterritorial authority over American companies, particularly in the technology sector, hindering these companies’ success and appropriating revenues that should contribute to our Nation’s well-being, not theirs.       Beginning in 2019, several trading partners enacted digital services taxes (DSTs) that could cost American companies billions of dollars and that foreign government officials openly admit are designed to plunder American companies.  Foreign countries have additionally adopted regulations governing digital services that are more burdensome and restrictive on United States companies than their own domestic companies.  Additional foreign legal regimes limit cross-border data flows, require American streaming services to fund local productions, and charge network usage and Internet termination fees.  All of these measures violate American sovereignty and offshore American jobs, limit American companies’ global competitiveness, and increase American operational costs while exposing our sensitive information to potentially hostile foreign regulators.     My Administration will not allow American companies and workers and American economic and national security interests to be compromised by one-sided, anti-competitive policies and practices of foreign governments.  American businesses will no longer prop up failed foreign economies through extortive fines and taxes.Sec. 2.  Policy.  It is the policy of my Administration that where a foreign government, through its tax or regulatory structure, imposes a fine, penalty, tax, or other burden that is discriminatory, disproportionate, or designed to transfer significant funds or intellectual property from American companies to the foreign government or the foreign government’s favored domestic entities, my Administration will act, imposing tariffs and taking such other responsive actions necessary to mitigate the harm to the United States and to repair any resulting imbalance.     In taking such responsive action, my Administration shall consider:     (a)  taxes imposed on United States companies by foreign governments, including those that may discriminate against United States companies;     (b)  regulations imposed on United States companies by foreign governments that could inhibit the growth or intended operation of United States companies;     (c)  any act, policy, or practice of a foreign government that could require a United States company to jeopardize its intellectual property; and     (d)  Any other act, policy, or practice of a foreign government that serves to undermine the global competitiveness of United States companies.  \n\nSec. 3.  Agency Responsibilities.  (a)  The United States Trade Representative shall determine, in accordance with applicable law, whether to renew investigations under section 301 of the Trade Act of 1974 (19 U.S.C. 2411) of the DSTs of France, Austria, Italy, Spain, Turkey, and the United Kingdom, which were initiated under my Administration on July 16, 2019, and June 5, 2020.  If the United States Trade Representative determines to renew such investigations, he shall take all appropriate and feasible action in response to those DSTs.     (b)  The United States Trade Representative shall determine, consistent with section 302(b) of the Trade Act of 1974 (19 U.S.C. 2412(b)) (section 302(b)), whether to investigate the DST of any other country that may discriminate against United States companies or burden or restrict United States commerce.  He shall further determine whether to pursue a panel under the United States-Mexico-Canada Agreement on the DST imposed by Canada and whether to investigate Canada’s DST under section 302(b).  In making these determinations, the United States Trade Representative shall consult with the Secretary of the Treasury, as appropriate.     (c)  The Secretary of the Treasury, the Secretary of Commerce, and the United States Trade Representative shall jointly identify trade and other regulatory practices by other countries, including, without limitation, those described in section 2 of this memorandum, that discriminate against, disproportionately affect, or otherwise undermine the global competitiveness or intended operation of United States companies, in the digital economy and more generally, and recommend to me appropriate actions to counter such practices under applicable authorities.  The United States Trade Representative shall include the results of this review as part of the report required in section 5(c) of the Presidential Memorandum of January 20, 2025 (America First Trade Policy) (America First Trade Policy Memorandum).     (d)  The Secretary of the Treasury, the Secretary of Commerce, and the United States Trade Representative shall investigate whether any act, policy, or practice of any country in the European Union or the United Kingdom has the effect of requiring or incentivizing the use or development of United States companies’ products or services in ways that undermine freedom of speech and political engagement or otherwise moderate content, and recommend appropriate actions to counter such practices under applicable authorities.  The United States Trade Representative shall include the results of this review as part of the report required in section 5(c) of the America First Trade Policy Memorandum.     (e)  The Secretary of the Treasury, in consultation with the Secretary of Commerce and the United States Trade Representative, shall determine whether any foreign country subjects United States citizens or companies, including, without limitation, in the digital economy, to discriminatory or extraterritorial taxes, or has any tax measure in place that otherwise undermines the global competitiveness of United States companies, is inconsistent with any tax treaty of the United States, or is otherwise actionable under section 891 of title 26, United States Code, or other tax-related legal authority.  The Secretary of the Treasury shall include the results of this determination as part of the report required in section 2 of the Presidential Memorandum of January 20, 2025 (The Organization for Economic Co-Operation and Development (OECD) Global Tax Deal).     (f)  The United States Trade Representative shall identify tools the United States can use to secure among trading partners a permanent moratorium on customs duties on electronic transmissions.  The United States Trade Representative shall include the results of this review as part of the report required in section 5(c) of the America First Trade Policy Memorandum.     (g)  The United States Trade Representative, in consultation with the Secretary of Commerce and the Senior Counselor to the President for Trade and Manufacturing, shall establish a process that allows American businesses to report to the United States Trade Representative foreign tax or regulatory practices that disproportionately harm United States companies.Sec. 4.  General Provisions.  (a)  Nothing in this memorandum shall be construed to impair or otherwise affect:          (i)   the authority granted by law to an executive department or agency, or the head thereof; or          (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.     (b)  This memorandum shall be implemented consistent with applicable law and subject to the availability of appropriations.     (c)  This memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.     (d)  The United States Trade Representative is authorized and directed to publish this memorandum in the *Federal Register*.\n",
  "summary": "# Summary\n\nOn February 21, 2025, a Presidential Memorandum was issued addressing unfair financial impositions on American companies by foreign governments. The memorandum expresses concern over digital services taxes (DSTs) and other regulatory measures that have been enacted by several countries since 2019. These measures, which include taxes and restrictions on data flows and streaming services, target largely U.S. technology firms and often favor local businesses, thus harming American competitiveness and economic interests.\n\nThe policy outlined in the memorandum commits the U.S. administration to taking retaliatory measures such as tariffs if foreign governments continue with such discriminatory practices. Responsibilities are assigned to the United States Trade Representative, Secretary of the Treasury, Secretary of Commerce, and other officials to evaluate and counter these foreign policies. This involves potentially renewing investigations into DSTs imposed by countries like France, Austria, and Italy, and identifying any tax or regulatory practices that undermine American businesses globally.\n",
  "eli5": "*The President wants to stop other countries from being unfair to American companies by making them pay extra money. America plans to respond by finding ways to make things fairer for businesses at home.*",
  "keywords": [
    "Presidential Memorandum",
    "Digital Services Taxes",
    "American Companies",
    "Trade Policy",
    "Foreign Regulations",
    "Economic Competitiveness"
  ],
  "issues": [
    "Potential retaliation causing trade disputes",
    "Impact on digital economy relationships",
    "Ambiguities in identifying discriminatory practices"
  ],
  "citations": [
    "19 U.S.C. 2411",
    "19 U.S.C. 2412(b)",
    "Section 301 of the Trade Act of 1974",
    "United States-Mexico-Canada Agreement",
    "26 U.S.C. 891"
  ],
  "document_type": "Presidential Memorandum"
}