{
  "title": "Delivering Emergency Price Relief for American Families and Defeating the Cost-of-Living Crisis – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Delivering Emergency Price Relief for American Families and Defeating the Cost-of-Living Crisis",
  "og:description": "Over the past 4 years, the Biden Administration's destructive policies inflicted an historic inflation crisis on the American people.  The Biden",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/delivering-emergency-price-relief-for-american-families-and-defeating-the-cost-of-living-crisis/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:54:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\t Delivering Emergency Price Relief for American Families and Defeating the Cost-of-Living Crisis\t\t\t\t\n\nJanuary 20, 2025\n\nOver the past 4 years, the Biden Administration’s destructive policies inflicted an historic inflation crisis on the American people.  The Biden Administration not only exploded Government spending, artificially and unsustainably stimulating demand, but it simultaneously made necessary goods and services scarce through a crushing regulatory burden and radical policies designed to weaken American production.  Hardworking families today are overwhelmed by the cost of fuel, food, housing, automobiles, medical care, utilities, and insurance.\n\nIn particular, the assault on plentiful and reliable American energy through unnecessary and illegal regulatory demands has driven up the cost of transportation and manufacturing.  In addition, the unlawful regulatory mandate on companies to effectively eliminate many or most gas-powered vehicles has resulted in artificial price increases on those popular vehicles to subsidize electric vehicles disfavored by consumers. \n\nMoreover, many Americans are unable to purchase homes due to historically high prices, in part due to regulatory requirements that alone account for 25 percent of the cost of constructing a new home according to recent analysis.\n\nIn sum, unprecedented regulatory oppression from the Biden Administration is estimated to have imposed almost $50,000 in costs on the average American household, whereas my first-term agenda reduced regulatory costs by almost $11,000 per household.  It is critical to restore purchasing power to the American family and improve our quality of life.\n\nI hereby order the heads of all executive departments and agencies to deliver emergency price relief, consistent with applicable law, to the American people and increase the prosperity of the American worker.  This shall include pursuing appropriate actions to:  lower the cost of housing and expand housing supply; eliminate unnecessary administrative expenses and rent-seeking practices that increase healthcare costs; eliminate counterproductive requirements that raise the costs of home appliances; create employment opportunities for American workers, including drawing discouraged workers into the labor force; and eliminate harmful, coercive “climate” policies that increase the costs of food and fuel.  Within 30 days of the date of this memorandum, the Assistant to the President for Economic Policy shall report to me and every 30 days thereafter, on the status of the implementation of this memorandum.\n",
  "summary": "On January 20, 2025, a new presidential action was issued aiming to provide emergency price relief for American families. The statement attributes the current cost-of-living crisis to the policies of the Biden Administration, which are criticized for creating inflation through excessive government spending and stringent regulations. It claims that these policies have made essential goods expensive and scarce, particularly affecting areas like energy, housing, and automobile markets.\n\nThe action orders all executive departments and agencies to implement measures to reduce costs and enhance prosperity for American workers. Proposed actions include lowering housing costs, eliminating unnecessary expenses in healthcare, reducing costs associated with home appliances, and revising climate policies that allegedly inflate the cost of food and fuel. The President requires regular reports on the implementation of these measures every 30 days to ensure compliance and effectiveness.",
  "eli5": "The President said things have become too expensive for people because of some rules from the past. Now, new plans are being made to make things like houses and energy cheaper, so people can afford them better.",
  "keywords": [
    "price relief",
    "inflation",
    "Biden Administration",
    "regulations",
    "housing costs",
    "energy costs",
    "healthcare costs",
    "climate policies"
  ],
  "issues": [
    "Potential bias in attributing inflation solely to the previous administration's policies",
    "Lack of specific details on how costs will be reduced",
    "Possible legal or regulatory challenges in reversing existing policies"
  ],
  "citations": [
    "No specific laws or regulations cited, reliance on general regulatory impacts"
  ],
  "document_type": "Presidential Action"
}