{
  "title": "Democrats Showed Whose Side They’re On — And it’s Not the American People – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Democrats Showed Whose Side They’re On — And it’s Not the American People",
  "og:description": "Tonight, President Donald J. Trump delivered bold, forward-looking remarks before a joint session of Congress — highlighting the historic accomplishments",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/03/democrats-showed-whose-side-theyre-on-and-its-not-the-american-people/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T05:16:28+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tDemocrats Showed Whose Side They’re On — And it’s Not the American People\t\t\t\t\n\nMarch 5, 2025\n\nTonight, President Donald J. Trump delivered bold, forward-looking remarks before a joint session of Congress — highlighting the historic accomplishments already achieved in his second term and setting the course for four years of prosperity and strength.\n\nUnfortunately, Congressional Democrats were too consumed by their own hatred of President Trump, refusing to show support for lowering taxes, fighting childhood cancer, capturing terrorists, protecting women and girls in sports, or law and order — to name only a few.\n\nAs Dana Perino [said](https://x.com/Pfeiffer47/status/1897140004931166311), “The Democratic Party still has no common sense. They have no ideas and they have no heart. They couldn’t even stand for the most inspiring moments of the speech.”\n\n**Tonight, Democrats refused to applaud:**\n    - The  capturing  of an ISIS terrorist that masterminded the Abbey Gate attack\n    - A young boy  fighting  brain cancer\n    - A  call  to lower taxes for middle-class Americans\n    - Americans  joining  the military in record numbers\n    - Law and order\n    - Taking  down illegal revenge  porn\n    - Protecting  women’s sports\n    - The United States of America\n    - Working together  to Make America Great Again\n    - Ending the harmful electric vehicle mandate\n    - Cutting regulations  to unleash American prosperity\n    - Ending censorship and bringing back free speech\n    - Ending discriminatory “diversity, equity, and inclusion”\n    - Recognizing only two sexes\n    - Defeating inflation\n    - Unleashing  American energy\n    - Ending  waste, fraud, and abuse in government\n    - Ending taxes  on tips, overtime, and seniors’ Social Security\n    - Bringing manufacturing home to America\n    - Securing historic investments in American chip manufacturing\n    - Removing illegal alien killers, rapists, and drug dealers from our streets\n    - Securing our border\n    - Declaring the brutal Tren de Aragua gang as a Foreign Terrorist Organization\n    - Waging war on the deadly cartels trafficking deadly drugs into our country\n    - Punishing cop killers with the death penalty\n    - Promoting health and wellness among Americans\n    - Protecting our kids from radical gender ideology\n    - Ending the sexual mutilation of America’s youth\n    - The return of American Marc Fogel\n    - Declaring America’s youth are perfect as God made them\n    - Ending wokeness in the U.S. military\n    - Restoring American shipbuilding\n    - A student getting accepted to West Point\n    - Improving America’s defenses\n    - Pursuing peace  in Ukraine\n",
  "summary": "On March 5, 2025, President Donald J. Trump addressed a joint session of Congress with a speech highlighting the achievements made in his second term and establishing a roadmap for future prosperity and strength. However, Congressional Democrats are criticized for not supporting or applauding various initiatives and accomplishments mentioned by the President. These included efforts such as capturing an ISIS terrorist, lowering taxes for the middle class, encouraging military enlistment, upholding law and order, promoting free speech, and ending certain policies and mandates.\n\nThe Democrats' lack of response was characterized as being driven by disdain for the President, which prevented them from showing approval for initiatives beneficial to the American people. The speech covered a wide array of topics, such as economic growth, energy independence, immigration enforcement, criminal justice, and youth protection. Dana Perino was quoted, describing the Democrat Party as lacking common sense, ideas, and empathy, unable to appreciate uplifting parts of the speech.",
  "eli5": "President Trump gave a speech about all the things he's doing for America, but the Democrats in Congress didn't clap because they don't agree with him or like what he said.",
  "keywords": [
    "Donald Trump",
    "Congress",
    "Democrats",
    "speech",
    "taxes",
    "middle class",
    "terrorism",
    "law and order",
    "American energy",
    "immigration",
    "youth protection"
  ],
  "issues": [
    "Partisan tension between Republicans and Democrats",
    "Lack of bipartisan support for key government initiatives",
    "Potential bias in the portrayal of Democrats",
    "Unverified claims about accomplishments and Democrat responses"
  ],
  "citations": [],
  "document_type": "Press Release"
}