{
  "title": "Designating English as the Official Language of The United States – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Designating English as the Official Language of The United States",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.  Purpose and",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/03/designating-english-as-the-official-language-of-the-united-states/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-02T00:03:16+00:00",
  "article:modified_time": "2025-03-02T00:03:17+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tDesignating English as the Official Language of The United States\t\t\t\t\n\nMarch 1, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection1.  Purpose and Policy.  From the founding of our Republic, English has been used as our national language.  Our Nation’s historic governing documents, including the Declaration of Independence and the Constitution, have all been written in English.  It is therefore long past time that English is declared as the official language of the United States.  A nationally designated language is at the core of a unified and cohesive society, and the United States is strengthened by a citizenry that can freely exchange ideas in one shared language.\n\nIn welcoming new Americans, a policy of encouraging the learning and adoption of our national language will make the United States a shared home and empower new citizens to achieve the American dream.  Speaking English not only opens doors economically, but it helps newcomers engage in their communities, participate in national traditions, and give back to our society.  This order recognizes and celebrates the long tradition of multilingual American citizens who have learned English and passed it to their children for generations to come.\n\nTo promote unity, cultivate a shared American culture for all citizens, ensure consistency in government operations, and create a pathway to civic engagement, it is in America’s best interest for the Federal Government to designate one — and only one — official language.  Establishing English as the official language will not only streamline communication but also reinforce shared national values, and create a more cohesive and efficient society.\n\nAccordingly, this order designates English as the official language of the United States.\n\nSec. 2.  Definitions.  For purposes of this order:(a)  “Agency” has the meaning given to it in section 3502 of title 44, United States Code, except that such term does not include the Executive Office of the President or any components thereof.\n\n(b)  “Agency Head” means the highest-ranking official of an agency, such as the Secretary, Administrator, Chairman, or Director, unless otherwise specified in this order.\n\nSec. 3.  Designating an Official Language for the United States.  (a)  English is the official language of the United States. \n\n(b)  Executive Order 13166 of August 11, 2000 (Improving Access to Services for Persons with Limited English Proficiency), is hereby revoked; nothing in this order, however, requires or directs any change in the services provided by any agency.  Agency heads should make decisions as they deem necessary to fulfill their respective agencies’ mission and efficiently provide Government services to the American people.  Agency heads are not required to amend, remove, or otherwise stop production of documents, products, or other services prepared or offered in languages other than English.  \n\n(c)  The Attorney General shall rescind any policy guidance documents issued pursuant to Executive Order 13166 and provide updated guidance, consistent with applicable law.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,    March 1, 2025.\n",
  "summary": "On March 1, 2025, a presidential order was issued designating English as the official language of the United States. This action, taken by the President, aims to unify the nation by encouraging the use of a single language for communication, rooted in the historical use of English in foundational documents like the Declaration of Independence and the Constitution. The order revokes Executive Order 13166, which was focused on improving access to services for those with limited English proficiency, but does not require changes to the services provided by any agency.\n\nAgencies retain the discretion to continue offering services and producing documents in languages other than English if deemed necessary for their operations. The Attorney General is directed to rescind related guidance documents and provide new guidelines consistent with the new order. The order stresses that it should not affect existing legal authorities or impede agency functions, and does not intend to create enforceable rights against the U.S. government.",
  "eli5": "The President decided that everyone in the U.S. should use English as the main language to help us understand each other better. This means government things like forms and signs will mostly be in English, but they can still use other languages if needed.",
  "keywords": [
    "English language",
    "official language",
    "presidential order",
    "Executive Order 13166",
    "government services",
    "American society",
    "national unity"
  ],
  "issues": [
    "Potential impact on non-English speaking communities",
    "Revocation of Executive Order 13166",
    "Implementation challenges for government agencies"
  ],
  "citations": [
    "Executive Order 13166",
    "Section 3502 of title 44, United States Code"
  ],
  "document_type": "Executive Order"
}