{
  "title": "President Trump Designates Chairmen and Acting Chairmen – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Designates Chairmen and Acting Chairmen",
  "og:description": "I hereby designate the following: Brendan CarrChairman of the Federal Communications CommissionMark ChristieChairman of Federal Energy Regulatory",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/designation-of-chairmen-and-acting-chairmen/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T19:45:00+00:00",
  "article:modified_time": "2025-01-20T22:15:13+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident Trump Designates Chairmen and Acting Chairmen\t\t\t\t\n\nJanuary 20, 2025\n\nI hereby designate the following:\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n",
  "summary": "On January 20, 2025, the White House made an announcement regarding the designation of chairmen and acting chairmen under President Trump. This action took place at the White House, where it was formally declared as part of the administrative process. Such actions are typically done to organize leadership and ensure effective governance within certain committees or federal parts of the administration.\n\nThis designation is part of the routine duties of the presidency, where the President appoints individuals to lead or temporarily lead important panels or federal agencies. These designations help in maintaining functional leadership which is necessary for smooth policy execution and administrative management.",
  "eli5": "President Trump picked some people to be in charge of important groups at the White House to help things run smoothly.",
  "keywords": [
    "President Trump",
    "chairmen",
    "acting chairmen",
    "White House",
    "January 20, 2025",
    "designation"
  ],
  "issues": [
    "Lack of specific names or roles mentioned in the text",
    "No specific details about the committees or agencies involved"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}