{
  "title": "President Donald J. Trump\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Donald J. Trump",
  "og:description": "After a landslide election victory in 2024, President Donald J. Trump is returning to the White House to build upon his previous successes and use his mandate to reject the extremist policies of the radical left while providing tangible quality of life improvements for the American people.",
  "og:url": "https://www.whitehouse.gov/administration/donald-j-trump/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-01-20T21:38:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Administration](https://www.whitehouse.gov/administration/)\n\n# \t\t\t\t\tDonald J. Trump\t\t\t\t\n\n45th &amp; 47th President of the United States\n\nAfter a landslide election victory in 2024, President Donald J. Trump is returning to the White House to build upon his previous successes and use his mandate to reject the extremist policies of the radical left while providing tangible quality of life improvements for the American people.\n\nThis includes putting a stop to endless wars, defending our nation’s borders, and unleashing the potential of the American economy, affording ALL Americans the opportunity to pursue THEIR version of the American dream.\n\nIn his first administration, President Trump passed record-setting tax cuts and regulation cuts, achieved energy independence, replaced NAFTA with the United-States-Mexico-Canada Agreement, invested $2 trillion to completely rebuild the Military, launched the Space Force, obliterated the ISIS Caliphate, achieved a major breakthrough for peace in the Middle East, passed the most significant Veterans Affairs reforms in half a century, confirmed over 250 federal judges, including 3 Supreme Court Justices, signed bipartisan Criminal Justice Reform, lowered drug prices, protected Medicare and Social Security, and secured our nation’s borders in his first four years in office.  This was only the beginning.\n\nDonald J. Trump defines the American success story. Throughout his life he has continually set the standards of business and entrepreneurial excellence, especially in real estate, sports, and entertainment. President Trump built on his success in private life when he entered into politics and public service. \n\nHe remarkably won the Presidency in his first ever run for any political office.  He won a second time despite several assassination attempts and the unprecedented weaponization of law fare against him.  Time after time President Trump has defied the odds because he fundamentally believes in the exceptionalism of the American spirit and wants to see our great country succeed.\n\nA graduate of the University of Pennsylvania’s Wharton School of Finance, President Trump followed in his father’s footsteps into the world of real estate development, making his mark in New York City. There, the Trump name soon became synonymous with the most prestigious of addresses in Manhattan and, subsequently, throughout the world.\n\nPresident Trump is also an accomplished author. He has written more than fourteen bestsellers. His first book, The Art of the Deal, is considered a business classic.\n\nPresident Trump has five children, Barron, Don Jr., Ivanka, Eric, and Tiffany, as well as 10 grandchildren.\n\n[Learn more about First Lady Melania Trump here.](https://www.whitehouse.gov/the-administration/melania-trump/)\n",
  "summary": "Donald J. Trump is highlighted as the 45th and 47th President of the United States following a proclaimed landslide victory in the 2024 election. The text emphasizes Trump's return to the White House with the intention of building on his previous successes, rejecting extremist policies, and improving the quality of life for Americans by ending wars, defending borders, and boosting the economy. During his first term, he achieved several milestones, including tax cuts, regulatory cuts, energy independence, and military investment.\n\nThe text also covers Trump's career before politics, detailing his background in real estate development and business successes, particularly in New York City, and his transition into politics where he won the presidency in his first political run. Trump's educational background is noted, including his graduation from the University of Pennsylvania's Wharton School of Finance. The personal aspect of his life, including his family, publication of bestsellers, and significant policy reforms carried out during his presidency, are mentioned to showcase his multifaceted career and accomplishments.\n\nTrump is portrayed as a figure who defied odds with a steadfast belief in the American spirit, having faced various challenges, such as assassination attempts and legal scrutiny. The narrative underscores his commitment to realizing the American dream and his influence in different fields, from real estate to politics.",
  "eli5": "Donald Trump was the 45th President and is back to be the 47th after winning another election. Before politics, he was really good at real estate and wrote books. He has a big family and wants to make America better by stopping wars and making new jobs.",
  "keywords": [
    "Donald Trump",
    "Presidency",
    "Election 2024",
    "Real Estate",
    "American Dream",
    "Economic Policy",
    "Military Investment",
    "Political Achievements",
    "Family",
    "Business"
  ],
  "issues": [
    "Unverified claims about 2024 landslide victory and 47th presidency",
    "Lack of specific data or evidence for claims of achievements",
    "Potential bias in presentation of achievements and challenges"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}