{
  "title": "Eliminating the Federal Executive Institute – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Eliminating the Federal Executive Institute",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 301 of title 3, United",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/eliminating-the-federal-executive-institute/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T00:02:28+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tELIMINATING THE FEDERAL EXECUTIVE INSTITUTE\t\t\t\t\n\nFebruary 10, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including section 301 of title 3, United States Code, and section 4117 of title 5, United States Code, it is hereby ordered:\n\nSection 1.  Purpose and Policy.  It is the policy of the United States to treat taxpayer dollars responsibly and advance unifying priorities like a stronger and safer America.  Accordingly, it is the policy of my Administration to eliminate, to the greatest extent permitted by law, executive departments and agencies and programs that do not directly benefit the American people or further our Nation’s interests.\n\n     In particular, the Federal Executive Institute, which was created by the Administration of President Lyndon B. Johnson more than 50 years ago, is a Government program purportedly designed to provide leadership training to bureaucrats.  But bureaucratic leadership over the past half-century has led to Federal policies that enlarge and entrench the Washington, D.C., managerial class, a development that has not benefited the American family.  The Federal Executive Institute should therefore be eliminated to refocus Government on serving taxpayers, competence, and dedication to our Constitution, rather than serving the Federal bureaucracy.\n\nSec. 2.  Elimination of the Federal Executive Institute.  (a)  The Director of the Office of Personnel Management shall take all necessary steps to eliminate the Federal Executive Institute, in accordance with applicable law.\n\n(b)  All prior Presidential or other executive branch documents establishing or requiring the existence of the Federal Executive Institute, including the Presidential Memorandum of May 9, 1968, regarding the Federal Executive Institute, and any applicable provisions of Executive Order 11348 of April 20, 1967 (Providing for the Further Training of Government Employees), are hereby revoked.\n\nSec. 3.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    February 10, 2025.\n",
  "summary": "## Summary\n\nOn February 10, 2025, a presidential order was issued to eliminate the Federal Executive Institute, a government program established over 50 years ago during President Lyndon B. Johnson's administration. The order cited the need for responsible use of taxpayer dollars and a focus on government initiatives that directly benefit the American people. The Federal Executive Institute was intended to provide leadership training for federal bureaucrats, but the order argues that such bureaucratic leadership has not served the interests of the American family.\n\nIn accordance with this directive, the Director of the Office of Personnel Management is tasked with dismantling the Federal Executive Institute, ensuring the process adheres to existing laws. Any previous documents or executive orders related to the establishment of this institute, like the Presidential Memorandum of 1968 and certain provisions from Executive Order 11348 of 1967, are revoked. The order also clarifies that it should not affect existing legal authorities or create any legal rights enforceable by parties against the U.S. government.",
  "eli5": "The President decided to close a school for government workers that was teaching them how to be leaders because it has been around for a long time and he thinks it doesn't help regular people enough.",
  "keywords": [
    "Federal Executive Institute",
    "Executive Order",
    "taxpayer dollars",
    "bureaucracy",
    "leadership training",
    "Office of Personnel Management",
    "government programs",
    "revocation",
    "cost efficiency"
  ],
  "issues": [
    "Potential impact on federal employee training",
    "Concerns about the long-term effects on government operations",
    "Legal challenges regarding authority to close an institute",
    "Effects on existing executive and administrative functions"
  ],
  "citations": [
    "Section 301 of Title 3, United States Code",
    "Section 4117 of Title 5, United States Code",
    "Presidential Memorandum of May 9, 1968",
    "Executive Order 11348 of April 20, 1967"
  ],
  "document_type": "Executive Order"
}