{
  "title": "Ending Procurement and Forced Use of Paper Straws – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Ending Procurement and Forced Use of Paper Straws",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/ending-procurement-and-forced-use-of-paper-straws/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-10T14:42:48+00:00",
  "article:modified_time": "2025-02-11T14:44:08+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tENDING PROCUREMENT AND FORCED USE OF PAPER STRAWS\t\t\t\t\n\nFebruary 10, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.  Policy.  An irrational campaign against plastic straws has resulted in major cities, States, and businesses banning the use or automatic inclusion of plastic straws with beverages.  Plastic straws are often replaced by paper straws, which are nonfunctional, use chemicals that may carry risks to human health, are more expensive to produce than plastic straws, and often force users to use multiple straws.  Additionally, paper straws sometimes come individually wrapped in plastic, undermining the environmental argument for their use.It is therefore the policy of the United States to end the use of paper straws.  Sec. 2.  Purchases of Paper Straws by the Federal Government.  (a)  The heads of executive departments and agencies (agencies) shall take all appropriate action to eliminate the procurement of paper straws and otherwise ensure that paper straws are no longer provided within agency buildings.(b)  Agencies shall take appropriate action to eliminate policies designed to disfavor plastic straws issued to further Executive Order 14057 of December 8, 2021 (Catalyzing Clean Energy Industries and Jobs Through Federal Sustainability), which I revoked on January 20, 2025.(c)  Within 45 days of the date of this order, the Assistant to the President for Domestic Policy, in coordination with relevant agencies, shall issue a National Strategy to End the Use of Paper Straws.  This strategy shall address:(i)    The elimination of all policies within the executive branch designed to disfavor plastic straws;(ii)   Contract policies and terms with entities, including States, that ban or penalize plastic straw purchase or use; and(iii)  All other available tools to achieve the policy of this order nationwide.Sec. 3. General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:  (i)   the authority granted by law to an executive department, agency, or the head thereof; or (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.  (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.  (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.  THE WHITE HOUSE,    February 10, 2025.\n",
  "summary": "On February 10, 2025, the President of the United States issued an executive order to terminate the use of paper straws by the federal government. This decision stems from concerns that paper straws, often replacing plastic ones due to environmental campaigns, are less functional, potentially harmful due to their chemical composition, more costly, and sometimes involve plastic in their packaging. Hence, it is the policy of the U.S. government to end the usage of paper straws.\n\nThe order mandates that all executive departments and agencies take necessary actions to stop procuring paper straws and ensure they are no longer supplied in federal buildings. Moreover, it calls for the disbandment of policies disfavouring plastic straws that were influenced by a previous executive order, which was revoked in January 2025. A National Strategy to End the Use of Paper Straws is to be developed within 45 days, focusing on eliminating internal policies against plastic straws, addressing states' and entities' contract policies penalizing plastic straw usage, and utilizing all possible tools to enforce the new directive across the nation.\n\nLastly, the order clarifies that it does not affect any existing legal authorities or create any enforceable rights, and it must be carried out according to applicable laws and subject to budgetary considerations.",
  "eli5": "The President decided that paper straws are not great because they break easily and sometimes come wrapped in plastic. So, they said that government buildings won't use them anymore and will find a better way to give out straws.",
  "keywords": [
    "Presidential Action",
    "Paper straws",
    "Plastic straws",
    "Federal policy",
    "Environmental concerns"
  ],
  "issues": [
    "Potential impact on environmental policies",
    "Health risks associated with paper straws",
    "Budgetary implications for switching straw materials",
    "Reaction from cities and states with bans on plastic straws"
  ],
  "citations": [
    "Executive Order 14057",
    "Constitution and laws of the United States"
  ],
  "document_type": "Presidential Action"
}