{
  "title": "Ending The Weaponization Of The Federal Government – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Ending The Weaponization Of The Federal Government",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, and section 301 of title 3, United States",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-the-weaponization-of-the-federal-government/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:53:59+00:00",
  "article:modified_time": "2025-01-21T00:01:14+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tENDING THE WEAPONIZATION OF THE FEDERAL GOVERNMENT\t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, and section 301 of title 3, United States Code, it is hereby ordered as follows:\n\nSection 1.  Purpose*.*  The American people have witnessed the previous administration engage in a systematic campaign against its perceived political opponents, weaponizing the legal force of numerous Federal law enforcement agencies and the Intelligence Community against those perceived political opponents in the form of investigations, prosecutions, civil enforcement actions, and other related actions.  These actions appear oriented more toward inflicting political pain than toward pursuing actual justice or legitimate governmental objectives.  Many of these activities appear to be inconsistent with the Constitution and/or the laws of the United States, including those activities directed at parents protesting at school board meetings, Americans who spoke out against the previous administration’s actions, and other Americans who were simply exercising constitutionally protected rights.\n\nThe prior administration and allies throughout the country engaged in an unprecedented, third-world weaponization of prosecutorial power to upend the democratic process.  It targeted individuals who voiced opposition to the prior administration’s policies with numerous Federal investigations and politically motivated funding revocations, which cost Americans access to needed services.  The Department of Justice even jailed an individual for posting a political meme.  And while the Department of Justice has ruthlessly prosecuted more than 1,500 individuals associated with January 6, and simultaneously dropped nearly all cases against BLM rioters.  \n\nTherefore, this order sets forth a process to ensure accountability for the previous administration’s weaponization of the Federal Government against the American people.\n\nSec. 2.  Policy*.*  It is the policy of the United States to identify and take appropriate action to correct past misconduct by the Federal Government related to the weaponization of law enforcement and the weaponization of the Intelligence Community.\n\nSec. 3.  Ending the Weaponization of the Federal Government.  (a)  The Attorney General, in consultation with the heads of all departments and agencies of the United States, shall take appropriate action to review the activities of all departments and agencies exercising civil or criminal enforcement authority of the United States, including, but not limited to, the Department of Justice, the Securities and Exchange Commission, and the Federal Trade Commission, over the last 4 years and identify any instances where a department’s or agency’s conduct appears to have been contrary to the purposes and policies of this order, and prepare a report to be submitted to the President, through the Deputy Chief of Staff for Policy and the Counsel to the President, with recommendations for appropriate remedial actions to be taken to fulfill the purposes and policies of this order.\n\n(b)  The Director of National Intelligence, in consultation with the heads of the appropriate departments and agencies within the Intelligence Community, shall take all appropriate action to review the activities of the Intelligence Community over the last 4 years and identify any instances where the Intelligence Community’s conduct appears to have been contrary to the purposes and policies of this order, and prepare a report to be submitted to the President, through the Deputy Chief of Staff for Policy and the National Security Advisor, with recommendations for appropriate remedial actions to be taken to fulfill the purposes and policies of this order.  The term “Intelligence Community” has the meaning given the term in section 3003 of title 50, United States Code.\n\n(c)  In furtherance of these policies, departments and agencies are directed to comply with applicable document-retention policies and legal obligations.  Instances of noncompliance with document-retention policies or legal obligations will be referred to the Attorney General. \n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20, 2025.\n",
  "summary": "The document, dated January 20, 2025, outlines a presidential order aimed at ending the perceived weaponization of the federal government by the previous administration. It asserts that the former administration used federal law enforcement and intelligence agencies to target political opponents, interfere with democratic processes, and suppress free speech. This order sets forth a process to hold accountable those involved in such actions.\n\nTo achieve this, the current administration mandates the Attorney General and the Director of National Intelligence to review the past activities of relevant agencies over the last four years. They are tasked with identifying misconduct contrary to the objectives of this order, particularly instances where civil or criminal enforcement actions were politically motivated. Reports are to be prepared with recommendations for remedial measures. This process underscores a commitment to document retention policies and legal compliance.\n\nThe order clarifies that it should not negate existing legal authority or budgetary roles and does not create new legal rights for individuals. Any implementation must comply with existing laws and budgetary constraints.",
  "eli5": "The President wants to make sure government workers are fair to everyone and not use their power to hurt people who don't agree with them. So, he is asking the government to check how they acted before and fix any mistakes.",
  "keywords": [
    "Presidential Order",
    "Weaponization",
    "Federal Government",
    "Law Enforcement",
    "Intelligence Community",
    "Accountability",
    "Political Opponents"
  ],
  "issues": [
    "Potential bias in determining 'weaponization'",
    "Impartiality in reviewing previous administration's actions",
    "Challenges in enforcing compliance with document-retention policies"
  ],
  "citations": [
    "section 301 of title 3, United States Code",
    "section 3003 of title 50, United States Code"
  ],
  "document_type": "Executive Order"
}