{
  "title": "Ending Illegal Discrimination And Restoring Merit-Based Opportunity – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Ending Illegal Discrimination And Restoring Merit-Based Opportunity",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.  Purpose. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T03:00:00+00:00",
  "article:modified_time": "2025-01-22T14:20:53+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tENDING ILLEGAL DISCRIMINATION ANDRESTORING MERIT-BASED OPPORTUNITY\t\t\t\t\n\nJanuary 21, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.  Purpose.  Longstanding Federal civil-rights laws protect individual Americans from discrimination based on race, color, religion, sex, or national origin.  These civil-rights protections serve as a bedrock supporting equality of opportunity for all Americans.  As President, I have a solemn duty to ensure that these laws are enforced for the benefit of all Americans. Yet today, roughly 60 years after the passage of the Civil Rights Act of 1964, critical and influential institutions of American society, including the Federal Government, major corporations, financial institutions, the medical industry, large commercial airlines, law enforcement agencies, and institutions of higher education have adopted and actively use dangerous, demeaning, and immoral race- and sex-based preferences under the guise of so-called “diversity, equity, and inclusion” (DEI) or “diversity, equity, inclusion, and accessibility” (DEIA) that can violate the civil-rights laws of this Nation.Illegal DEI and DEIA policies not only violate the text and spirit of our longstanding Federal civil-rights laws, they also undermine our national unity, as they deny, discredit, and undermine the traditional American values of hard work, excellence, and individual achievement in favor of an unlawful, corrosive, and pernicious identity-based spoils system.  Hardworking Americans who deserve a shot at the American Dream should not be stigmatized, demeaned, or shut out of opportunities because of their race or sex.These illegal DEI and DEIA policies also threaten the safety of American men, women, and children across the Nation by diminishing the importance of individual merit, aptitude, hard work, and determination when selecting people for jobs and services in key sectors of American society, including all levels of government, and the medical, aviation, and law-enforcement communities.  Yet in case after tragic case, the American people have witnessed first-hand the disastrous consequences of illegal, pernicious discrimination that has prioritized how people were born instead of what they were capable of doing.The Federal Government is charged with enforcing our civil-rights laws.  The purpose of this order is to ensure that it does so by ending illegal preferences and discrimination.Sec. 2.  Policy.  It is the policy of the United States to protect the civil rights of all Americans and to promote individual initiative, excellence, and hard work.  I therefore order all executive departments and agencies (agencies) to terminate all discriminatory and illegal preferences, mandates, policies, programs, activities, guidance, regulations, enforcement actions, consent orders, and requirements.  I further order all agencies to enforce our longstanding civil-rights laws and to combat illegal private-sector DEI preferences, mandates, policies, programs, and activities.Sec. 3.  Terminating Illegal Discrimination in the Federal Government.  (a)  The following executive actions are hereby revoked:(i)    Executive Order 12898 of February 11, 1994 (Federal Actions to Address Environmental Justice in Minority Populations and Low-Income Populations);(ii)   Executive Order 13583 of August 18, 2011 (Establishing a Coordinated Government-wide Initiative to Promote Diversity and Inclusion in the Federal Workforce);(iii)  Executive Order 13672 of July 21, 2014 (Further Amendments to Executive Order 11478, Equal Employment Opportunity in the Federal Government, and Executive Order 11246, Equal Employment Opportunity); and(iv)   The Presidential Memorandum of October 5, 2016 (Promoting Diversity and Inclusion in the National Security Workforce).(b)  The Federal contracting process shall be streamlined to enhance speed and efficiency, reduce costs, and require Federal contractors and subcontractors to comply with our civil-rights laws.  Accordingly:(i)    Executive Order 11246 of September 24, 1965 (Equal Employment Opportunity), is hereby revoked.  For 90 days from the date of this order, Federal contractors may continue to comply with the regulatory scheme in effect on January 20, 2025.(ii)   The Office of Federal Contract Compliance Programs within the Department of Labor shall immediately cease:(A)  Promoting “diversity”;(B)  Holding Federal contractors and subcontractors responsible for taking “affirmative action”; and(C)  Allowing or encouraging Federal contractors and subcontractors to engage in workforce balancing based on race, color, sex, sexual preference, religion, or national origin.(iii)  In accordance with Executive Order 13279 of December 12, 2002 (Equal Protection of the Laws for Faith-Based and Community Organizations), the employment, procurement, and contracting practices of Federal contractors and subcontractors shall not consider race, color, sex, sexual preference, religion, or national origin in ways that violate the Nation’s civil rights laws.(iv)   The head of each agency shall include in every contract or grant award:(A)  A term requiring the contractual counterparty or grant recipient to agree that its compliance in all respects with all applicable Federal anti-discrimination laws is material to the government’s payment decisions for purposes of section 3729(b)(4) of title 31, United States Code; and(B)  A term requiring such counterparty or recipient to certify that it does not operate any programs promoting DEI that violate any applicable Federal anti-discrimination laws.(c)  The Director of the Office of Management and Budget (OMB), with the assistance of the Attorney General as requested, shall:(i)    Review and revise, as appropriate, all Government-wide processes, directives, and guidance;(ii)   Excise references to DEI and DEIA principles, under whatever name they may appear, from Federal acquisition, contracting, grants, and financial assistance procedures to streamline those procedures, improve speed and efficiency, lower costs, and comply with civil-rights laws; and(iii)  Terminate all “diversity,” “equity,” “equitable decision-making,” “equitable deployment of financial and technical assistance,” “advancing equity,” and like mandates, requirements, programs, or activities, as appropriate.Sec. 4.  Encouraging the Private Sector to End Illegal DEI Discrimination and Preferences.  (a)  The heads of all agencies, with the assistance of the Attorney General, shall take all appropriate action with respect to the operations of their agencies to advance in the private sector the policy of individual initiative, excellence, and hard work identified in section 2 of this order.(b)  To further inform and advise me so that my Administration may formulate appropriate and effective civil-rights policy, the Attorney General, within 120 days of this order, in consultation with the heads of relevant agencies and in coordination with the Director of OMB, shall submit a report to the Assistant to the President for Domestic Policy containing recommendations for enforcing Federal civil-rights laws and taking other appropriate measures to encourage the private sector to end illegal discrimination and preferences, including DEI.  The report shall contain a proposed strategic enforcement plan identifying:(i)    Key sectors of concern within each agency’s jurisdiction;(ii)   The most egregious and discriminatory DEI practitioners in each sector of concern;(iii)  A plan of specific steps or measures to deter DEI programs or principles (whether specifically denominated “DEI” or otherwise) that constitute illegal discrimination or preferences.  As a part of this plan, each agency shall identify up to nine potential civil compliance investigations of publicly traded corporations, large non-profit corporations or associations, foundations with assets of 500 million dollars or more, State and local bar and medical associations, and institutions of higher education with endowments over 1 billion dollars;(iv)   Other strategies to encourage the private sector to end illegal DEI discrimination and preferences and comply with all Federal civil-rights laws;(v)    Litigation that would be potentially appropriate for Federal lawsuits, intervention, or statements of interest; and(vi)   Potential regulatory action and sub-regulatory guidance.Sec. 5.  Other Actions.  Within 120 days of this order, the Attorney General and the Secretary of Education shall jointly issue guidance to all State and local educational agencies that receive Federal funds, as well as all institutions of higher education that receive Federal grants or participate in the Federal student loan assistance program under Title IV of the Higher Education Act, 20 U.S.C. 1070 et seq., regarding the measures and practices required to comply with Students for Fair Admissions, Inc. v. President and Fellows of Harvard College, 600 U.S. 181 (2023).Sec. 6.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.Sec. 7.  Scope.  (a)  This order does not apply to lawful Federal or private-sector employment and contracting preferences for veterans of the U.S. armed forces or persons protected by the Randolph-Sheppard Act, 20 U.S.C. 107 et seq.(b)  This order does not prevent State or local governments, Federal contractors, or Federally-funded State and local educational agencies or institutions of higher education from engaging in First Amendment-protected speech.(c)  This order does not prohibit persons teaching at a Federally funded institution of higher education as part of a larger course of academic instruction from advocating for, endorsing, or promoting the unlawful employment or contracting practices prohibited by this order.Sec. 8.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department, agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to and does not create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE, January 21, 2025.\n",
  "summary": "On January 21, 2025, the President issued an executive order aimed at ending practices of discrimination and restoring merit-based opportunities. The order asserts that Federal civil-rights laws protect individuals from discrimination based on race, color, religion, sex, or national origin, and emphasizes the President's duty to ensure these laws are enforced. It criticizes the use of diversity, equity, inclusion, and accessibility (DEI and DEIA) policies in major societal institutions, arguing that such practices violate civil-rights protections and threaten safety by diminishing the value of merit and hard work.\n\nThe order mandates all executive departments and agencies to terminate illegal and discriminatory DEI preferences and to enforce existing civil-rights laws. It also revokes certain previous executive orders and memoranda related to diversity and inclusion. The document emphasizes streamlining Federal contracting processes and requires compliance with anti-discrimination laws by Federal contractors and subcontractors. The order seeks to encourage the private sector to cease illegal DEI practices through agency oversight and coordinated efforts, and sets a roadmap for further actions to ensure compliance across diverse sectors.\n\nAdditionally, the order includes specific guidelines on how to handle federal procurement, education, and compliance reviews, all in line with protecting civil rights. It excludes preferences for veterans and does not prohibit First Amendment-protected speech, while setting boundaries for how such policies and practices are implemented.",
  "eli5": "The President wants to make sure everyone is treated fairly and gets opportunities based on how hard they work. He believes some rules about making people different aren’t fair and wants to stop them.",
  "keywords": [
    "civil rights",
    "discrimination",
    "merit-based opportunity",
    "diversity and inclusion",
    "DEI",
    "executive order",
    "federal laws",
    "equality",
    "workforce policies"
  ],
  "issues": [
    "Potential backlash or controversy regarding dismantling DEI programs",
    "Legal challenges in redefining equality and anti-discrimination measures",
    "Impact on existing diversity initiatives in various sectors"
  ],
  "citations": [
    "Civil Rights Act of 1964",
    "Executive Order 12898",
    "Executive Order 13583",
    "Executive Order 13672",
    "Executive Order 11246",
    "Executive Order 13279",
    "20 U.S.C. 107 et seq.",
    "31 U.S.C. 3729(b)(4)"
  ],
  "document_type": "Executive Order"
}