{
  "title": "Ending Radical And Wasteful Government DEI Programs And Preferencing – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Ending Radical And Wasteful Government DEI Programs And Preferencing – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-and-wasteful-government-dei-programs-and-preferencing/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:54:14+00:00",
  "article:modified_time": "2025-01-21T02:16:47+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tEnding Radical And Wasteful Government DEI Programs And Preferencing\t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose and Policy.  The Biden Administration forced illegal and immoral discrimination programs, going by the name “diversity, equity, and inclusion” (DEI), into virtually all aspects of the Federal Government, in areas ranging from airline safety to the military.  This was a concerted effort stemming from President Biden’s first day in office, when he issued Executive Order 13985, “Advancing Racial Equity and Support for Underserved Communities Through the Federal Government.”\n\nPursuant to Executive Order 13985 and follow-on orders, nearly every Federal agency and entity submitted “Equity Action Plans” to detail the ways that they have furthered DEIs infiltration of the Federal Government.  The public release of these plans demonstrated immense public waste and shameful discrimination.  That ends today.  Americans deserve a government committed to serving every person with equal dignity and respect, and to expending precious taxpayer resources only on making America great.\n\nSec. 2.  Implementation.  (a)  The Director of the Office of Management and Budget (OMB), assisted by the Attorney General and the Director of the Office of Personnel Management (OPM), shall coordinate the termination of all discriminatory programs, including illegal DEI and “diversity, equity, inclusion, and accessibility” (DEIA) mandates, policies, programs, preferences, and activities in the Federal Government, under whatever name they appear.  To carry out this directive, the Director of OPM, with the assistance of the Attorney General as requested, shall review and revise, as appropriate, all existing Federal employment practices, union contracts, and training policies or programs to comply with this order.  Federal employment practices, including Federal employee performance reviews, shall reward individual initiative, skills, performance, and hard work and shall not under any circumstances consider DEI or DEIA factors, goals, policies, mandates, or requirements.\n\n(b)  Each agency, department, or commission head, in consultation with the Attorney General, the Director of OMB, and the Director of OPM, as appropriate, shall take the following actions within sixty days of this order:~~~~\n\n(i)    terminate, to the maximum extent allowed by law, all DEI, DEIA, and “environmental justice” offices and positions (including but not limited to “Chief Diversity Officer” positions); all “equity action plans,” “equity” actions, initiatives, or programs, “equity-related” grants or contracts; and all DEI or DEIA performance requirements for employees, contractors, or grantees.\n\n(ii)   provide the Director of the OMB with a list of all:\n\n(A)  agency or department DEI, DEIA, or “environmental justice” positions, committees, programs, services, activities, budgets, and expenditures in existence on November 4, 2024, and an assessment of whether these positions, committees, programs, services, activities, budgets, and expenditures have been misleadingly relabeled in an attempt to preserve their pre-November 4, 2024 function;\n\n(B)  Federal contractors who have provided DEI training or DEI training materials to agency or department employees; and\n\n(C)  Federal grantees who received Federal funding to provide or advance DEI, DEIA, or “environmental justice” programs, services, or activities since January 20, 2021.\n\n(iii)  direct the deputy agency or department head to:\n\n(A) assess the operational impact (e.g., the number of new DEI hires) and cost of the prior administration’s DEI, DEIA, and “environmental justice” programs and policies; and\n\n(B) recommend actions, such as Congressional notifications under 28 U.S.C. 530D, to align agency or department programs, activities, policies, regulations, guidance, employment practices, enforcement activities, contracts (including set-asides), grants, consent orders, and litigating positions with the policy of equal dignity and respect identified in section 1 of this order.  The agency or department head and the Director of OMB shall jointly ensure that the deputy agency or department head has the authority and resources needed to carry out this directive.\n\n(c)  To inform and advise the President, so that he may formulate appropriate and effective civil-rights policies for the Executive Branch, the Assistant to the President for Domestic Policy shall convene a monthly meeting attended by the Director of OMB, the Director of OPM, and each deputy agency or department head to:\n\n(i)    hear reports on the prevalence and the economic and social costs of DEI, DEIA, and “environmental justice” in agency or department programs, activities, policies, regulations, guidance, employment practices, enforcement activities, contracts (including set-asides), grants, consent orders, and litigating positions;\n\n(ii)   discuss any barriers to measures to comply with this order; and\n\n(iii)  monitor and track agency and department progress and identify potential areas for additional Presidential or legislative action to advance the policy of equal dignity and respect.\n\nSec. 3.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,     \n\nJanuary 20, 2025.\n",
  "summary": "On January 20, 2025, a presidential order was issued to terminate all diversity, equity, inclusion, and accessibility (DEI and DEIA) programs within the U.S. Federal Government. This order aims to reverse the initiatives started under Executive Order 13985 by the Biden Administration, which mandated agencies to submit Equity Action Plans involving DEI measures. The President's directive stresses the reallocation of resources towards programs promoting individual merit without considering DEI factors.\n\nThe order tasks the Director of the Office of Management and Budget, along with the Attorney General and the Director of the Office of Personnel Management, to spearhead the dismantling of these programs. Each federal agency is instructed to identify DEI-related roles, programs, and activities by a set deadline, and terminate them to the extent legally possible. A monthly meeting will be held to evaluate the order’s implementation, addressing any barriers or areas requiring further presidential or legislative action.\n\nThe order also contains provisions ensuring its alignment with existing laws and appropriations and states that it should not create enforceable rights against the United States. Its severability clause ensures that any invalid portion does not affect the remainder of the order's provisions.",
  "eli5": "The President ordered to stop all the diversity and inclusion projects in the government to focus on rewarding hard work and skills instead.\n\nPeople working on these projects will have to end them soon, and there will be meetings to see how things are going.",
  "keywords": [
    "DEI",
    "Federal Government",
    "Executive Order",
    "Presidential Action",
    "Diversity",
    "Equity",
    "January 20, 2025"
  ],
  "issues": [
    "Impact on existing Federal agency programs",
    "Possible legal challenges to the order",
    "Transition plan for roles and offices affected by the termination",
    "Potential controversies related to reversing diversity initiatives"
  ],
  "citations": [
    "Executive Order 13985",
    "28 U.S.C. 530D"
  ],
  "document_type": "Executive Order"
}