{
  "title": "Ensuring Accountability for All Agencies – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Ensuring Accountability for All Agencies",
  "og:description": " By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:      ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-19T02:30:25+00:00",
  "article:modified_time": "2025-02-19T02:32:26+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tEnsuring Accountability for All Agencies\t\t\t\t\n\nFebruary 18, 2025\n\n By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  \n\nSection1.  Policy and Purpose.  The Constitution vests all executive power in the President and charges him with faithfully executing the laws.  Since it would be impossible for the President to single-handedly perform all the executive business of the Federal Government, the Constitution also provides for subordinate officers to assist the President in his executive duties.  In the exercise of their often-considerable authority, these executive branch officials remain subject to the President’s ongoing supervision and control.  The President in turn is regularly elected by and accountable to the American people.  This is one of the structural safeguards, along with the separation of powers between the executive and legislative branches, regular elections for the Congress, and an independent judiciary whose judges are appointed by the President by and with the advice and consent of the Senate, by which the Framers created a Government accountable to the American people.   \n\n     However, previous administrations have allowed so-called “independent regulatory agencies” to operate with minimal Presidential supervision.  These regulatory agencies currently exercise substantial executive authority without sufficient accountability to the President, and through him, to the American people.  Moreover, these regulatory agencies have been permitted to promulgate significant regulations without review by the President.  \n\n     These practices undermine such regulatory agencies’ accountability to the American people and prevent a unified and coherent execution of Federal law.  For the Federal Government to be truly accountable to the American people, officials who wield vast executive power must be supervised and controlled by the people’s elected President.   \n\n     Therefore, in order to improve the administration of the executive branch and to increase regulatory officials’ accountability to the American people, it shall be the policy of the executive branch to ensure Presidential supervision and control of the entire executive branch.  Moreover, all executive departments and agencies, including so-called independent agencies, shall submit for review all proposed and final significant regulatory actions to the Office of Information and Regulatory Affairs (OIRA) within the Executive Office of the President before publication in the *Federal Register*. \n\nSec. 2.  Definitions.  For the purposes of this order:\n\n     (a)  The term “employees” shall have the meaning given that term in section 2105 of title 5, United States Code.   \n\n     (b)  The term “independent regulatory agency” shall have the meaning given that term in section 3502(5) of title 44, United States Code.  This order shall not apply to the Board of Governors of the Federal Reserve System or to the Federal Open Market Committee in its conduct of monetary policy.  This order shall apply to the Board of Governors of the Federal Reserve System only in connection with its conduct and authorities directly related to its supervision and regulation of financial institutions.  \n\n     (c)  The term “independent regulatory agency chairman” shall mean, with regard to a multi-member independent regulatory agency, the chairman of such agency, and shall mean, with regard to a single-headed independent regulatory agency, such agency’s chairman, director, or other presiding officer.    \n\n     (d)  The term “head” of an independent regulatory agency shall mean those appointed to supervise independent regulatory agencies and in whom the agencies’ authorities are generally vested, encompassing the chairman, director, or other presiding officer, and, as applicable, other members, commissioners, or similar such officials with responsibility for supervising such agencies.   \n\n     Sec. 3.  OIRA Review of Agency Regulations.  (a)  Section 3(b) of Executive Order 12866 of September 30, 1993 (“Regulatory Planning and Review”), as amended, is hereby amended to read as follows:   \n\n     “(b)  “Agency,” unless otherwise indicated, means any authority of the United States that is an “agency” under 44 U.S.C. 3502(1), and shall also include the Federal Election Commission.  This order shall not apply to the Board of Governors of the Federal Reserve System or to the Federal Open Market Committee in its conduct of monetary policy.  This order shall apply to the Board of Governors of the Federal Reserve System only in connection with its conduct and authorities directly related to its supervision and regulation of financial institutions.”.\n\n     (b)  The Director of the Office of Management and Budget (OMB) shall provide guidance on implementation of this order to the heads of executive departments and agencies newly submitting regulatory actions under section 3(b) of Executive Order 12866.  Agency submissions by independent regulatory agencies under such section shall commence within the earlier of 60 days from the date of this order, or completion of such implementation guidance.  \n\nSec. 4.  Performance Standards and Management Objectives.  The Director of OMB shall establish performance standards and management objectives for independent agency heads, as appropriate and consistent with applicable law, and report periodically to the President on their performance and efficiency in attaining such standards and objectives. \n\nSec. 5.  Apportionments for Independent Regulatory Agencies.  The Director of OMB shall, on an ongoing basis:   \n\n     (a)  review independent regulatory agencies’ obligations for consistency with the President’s policies and priorities; and   \n\n     (b)  consult with independent regulatory agency chairmen and adjust such agencies’ apportionments by activity, function, project, or object, as necessary and appropriate, to advance the President’s policies and priorities.  Such adjustments to apportionments may prohibit independent regulatory agencies from expending appropriations on particular activities, functions, projects, or objects, so long as such restrictions are consistent with law. \n\nSec. 6.  Additional Consultation with the Executive Office of the President.  (a)  Subject to subsection (b), independent regulatory agency chairmen shall regularly consult with and coordinate policies and priorities with the directors of OMB, the White House Domestic Policy Council, and the White House National Economic Council.  \n\n     (b)  The heads of independent regulatory agencies shall establish a position of White House Liaison in their respective agencies.  Such position shall be in grade 15 of the General Schedule and shall be placed in Schedule C of the excepted service.  \n\n     (c)  Independent regulatory agency chairmen shall submit agency strategic plans developed pursuant to the Government Performance and Results Act of 1993 to the Director of OMB for clearance prior to finalization. \n\nSec. 7.  Rules of Conduct Guiding Federal Employees’ Interpretation of the Law. The President and the Attorney General, subject to the President’s supervision and control, shall provide authoritative interpretations of law for the executive branch.  The President and the Attorney General’s opinions on questions of law are controlling on all employees in the conduct of their official duties.  No employee of the executive branch acting in their official capacity may advance an interpretation of the law as the position of the United States that contravenes the President or the Attorney General’s opinion on a matter of law, including but not limited to the issuance of regulations, guidance, and positions advanced in litigation, unless authorized to do so by the President or in writing by the Attorney General. \n\nSec. 8.  General Provisions.  (a)  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.  \n\n     (b)  Nothing in this order shall be construed to impair or otherwise affect:  \n\n     (i)   the authority granted by law to an executive department, agency, or the head thereof; or \n\n     (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.  \n\n     (c)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.  \n\n     (d)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "This order issued on February 18, 2025, by the President of the United States aims to increase accountability across all federal agencies and ensure their alignment with the President's intentions. The order targets independent regulatory agencies, which have previously operated with considerable autonomy, often exercising significant executive power without oversight from the President. To address this, the order mandates that all significant regulatory actions be reviewed by the Office of Information and Regulatory Affairs (OIRA) within the Executive Office before publication.\n\nThe directive also involves modifying existing rules from a 1993 Executive Order, requiring independent regulatory agency submissions to be reviewed by the OIRA. The Office of Management and Budget (OMB) is tasked with establishing performance standards for agency heads and ensuring agency activities reflect presidential policies. Consultation between agencies and various offices in the Executive Office of the President is required, ensuring coordination of policy direction and strategic plans. Furthermore, the order emphasizes that the President's and Attorney General’s legal interpretations are binding for all federal employees, reflecting the order's broader intent to centralize executive accountability.",
  "eli5": "The President made a new rule saying that all government agencies need to follow his instructions more closely. This way, he can make sure everything they do is what he wants and helps the people.",
  "keywords": [
    "Presidential accountability",
    "Independent regulatory agencies",
    "Executive oversight",
    "OIRA review",
    "OMB guidance",
    "Regulatory actions",
    "Executive branch"
  ],
  "issues": [
    "Potential overreach of executive power over independent agencies",
    "Impact on the autonomy of regulatory bodies",
    "Implementation challenges for agencies",
    "Potential legal challenges to new oversight measures"
  ],
  "citations": [
    "Title 5, United States Code, Section 2105",
    "Title 44, United States Code, Section 3502(5)",
    "Executive Order 12866 of 1993",
    "Government Performance and Results Act of 1993"
  ],
  "document_type": "Executive Order"
}