{
  "title": "Eradicating Anti-Christian Bias – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Eradicating Anti-Christian Bias",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1.  Purpose",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/eradicating-anti-christian-bias/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-06T22:35:01+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tEradicating Anti-Christian Bias\t\t\t\t\n\nFebruary 6, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1.  Purpose and Policy.  It is the policy of the United States, and the purpose of this order, to protect the religious freedoms of Americans and end the anti-Christian weaponization of government.  The Founders established a Nation in which people were free to practice their faith without fear of discrimination or retaliation by their government.      For that reason, the United States Constitution enshrines the fundamental right to religious liberty in the First Amendment.  Federal laws like the Religious Freedom Restoration Act of 1993, as amended (42 U.S.C. 2000bb *et seq.*), further prohibit government interference with Americans’ rights to exercise their religion.  Title VII of the Civil Rights Act of 1964, as amended (42 U.S.C. 2000e *et seq.*), prohibits religious discrimination in employment while Federal hate-crime laws prohibit offenses committed due to religious animus.     Yet the previous Administration engaged in an egregious pattern of targeting peaceful Christians, while ignoring violent, anti-Christian offenses.  The Biden Department of Justice sought to squelch faith in the public square by bringing Federal criminal charges and obtaining in numerous cases multi-year prison sentences against nearly two dozen peaceful pro-life Christians for praying and demonstrating outside abortion facilities.  Those convicted included a Catholic priest and 75-year-old grandmother, as well as an 87-year-old woman and a father of 11 children who were arrested 18 months after praying and singing hymns outside an abortion facility in Tennessee as a part of a politically motivated prosecution campaign by the Biden Administration.  I rectified this injustice on January 23, 2025, by issuing pardons in these cases.      At the same time, Catholic churches, charities, and pro-life centers sought justice for violence, theft, and arson perpetrated against them, which the Biden Department of Justice largely ignored.  After more than 100 attacks, the U.S. House of Representatives passed a resolution condemning this violence and calling on the Biden Administration to enforce the law.     Then, in 2023, a Federal Bureau of Investigation (FBI) memorandum asserted that “radical-traditionalist” Catholics were domestic-terrorism threats and suggested infiltrating Catholic churches as “threat mitigation.”  This later-retracted FBI memorandum cited as support evidence propaganda from highly partisan sources.     The Biden Department of Education sought to repeal religious-liberty protections for faith-based organizations on college campuses.  The Biden Equal Employment Opportunity Commission sought to force Christians to affirm radical transgender ideology against their faith.  And the Biden Department of Health and Human Services sought to drive Christians who do not conform to certain beliefs on sexual orientation and gender identity out of the foster-care system.  The Biden Administration declared March 31, 2024 — Easter Sunday — as “Transgender Day of Visibility.”      In this atmosphere of anti-Christian government, hostility and vandalism against Christian churches and places of worship surged, with the number of such identified acts in 2023 exceeding by more than eight times the number from 2018.  Catholic churches and institutions have been aggressively targeted with hundreds of acts of hostility, violence, and vandalism.     My Administration will not tolerate anti-Christian weaponization of government or unlawful conduct targeting Christians.  The law protects the freedom of Americans and groups of Americans to practice their faith in peace, and my Administration will enforce the law and protect these freedoms.  My Administration will ensure that any unlawful and improper conduct, policies, or practices that target Christians are identified, terminated, and rectified.     Sec. 2.  Establishing a Task Force to Eradicate Anti-Christian Bias.  (a)  There is hereby established within the Department of Justice the Task Force to Eradicate Anti-Christian Bias (Task Force).     (b)  The Attorney General shall serve as Chair of the Task Force.     (c)  In addition to the Chair, the Task Force shall consist of the following other members:          (i)     the Secretary of State;          (ii)    the Secretary of the Treasury;          (iii)   the Secretary of Defense;          (iv)    the Secretary of Labor;          (v)     the Secretary of Health and Human Services;          (vi)    the Secretary of Housing and Urban Development;          (vii)   the Secretary of Education;          (viii)  the Secretary of Veterans Affairs;          (ix)    the Secretary of Homeland Security;          (x)     the Director of the Office of Management and Budget;          (xi)    Representative of the United States of America to the United Nations;          (xii)   the Administrator of the Small Business Administration;          (xiii)  the Director of the Federal Bureau of Investigation;          (xiv)   the Assistant to the President for Domestic Policy;          (xv)    the Administrator of the Federal Emergency Management Agency;          (xvi)   the Chair of the Equal Employment Opportunity Commission; and          (xvii)  the heads of such other executive departments, agencies, and offices that the Chair may, from time to time, invite to participate.     Sec. 3.  Task Force Functions.  (a)  The Task Force shall meet as required by the Chair and shall take appropriate action to:          (i)    review the activities of all executive departments and agencies (agencies), including the Department of State, the Department of Justice, including the Federal Bureau of Investigation, the Department of Labor, the Department of Health and Human Services, the Department of Education, the Department of Homeland Security, and the Equal Employment Opportunity Commission, over the previous Administration and identify any unlawful anti-Christian policies, practices, or conduct by an agency contrary to the purpose and policy of this order;          (ii)   recommend to the head of the relevant agency steps to revoke or terminate any violative policies, practices, or conduct identified under subsection (3)(a)(i) of this section and remedial actions to fulfill the purpose and policy of this order;          (iii)  share information and develop strategies to protect the religious liberties of Americans and advance the purpose and policy of this order;          (iv)   solicit information and ideas from a broad range of individuals and groups, including Americans affected by anti-Christian conduct, faith-based organizations, and State, local, and Tribal governments, in order to ensure that its work is informed by a broad spectrum of ideas and experiences;          (v)    identify deficiencies in existing laws and enforcement and regulatory practices that have contributed to unlawful anti-Christian governmental or private conduct and recommend to the relevant agency head, or recommend to the President, through the Deputy Chief of Staff for Policy and the Assistant to the President for Domestic Policy, as applicable, appropriate actions that agencies may take to remedy failures to fully enforce the law against acts of anti-Christian hostility, vandalism, and violence; and          (vi)     recommend to the President, through the Deputy Chief of Staff for Policy and the Assistant to the President for Domestic Policy, any additional Presidential or legislative action necessary to rectify past improper anti-Christian conduct, protect religious liberty, or otherwise fulfill the purpose and policy of this order.     (b)  In order to advise the President regarding its work and assist the President in formulating future policy, the Task Force shall submit to the President, through the Deputy Chief of Staff for Policy and the Assistant to the President for Domestic Policy:          (i)    a report within 120 days from the date of this order regarding the Task Force’s initial work;            (ii)   a report within 1 year from the date of this order that summarizes the Task Force’s work; and          (iii)  a final report upon the dissolution of the Task Force.     Sec. 4.  Administration.  (a)  The heads of agencies shall, to the extent permitted by law, upon the request of the Chair, provide the Task Force with any information required by the Task Force for the purpose of carrying out its functions.     (b)  The Department of Justice shall provide such funding and administrative and technical support as the Task Force may require, to the extent permitted by law and as authorized by existing appropriations.     Sec. 5.  Termination.  The Task Force shall terminate 2 years from the date of this order unless extended by the President.     Sec. 6.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:          (i)   the authority granted by law to an executive department or agency, or the head thereof; or          (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    February 6, 2025.\n",
  "summary": "On February 6, 2025, a Presidential Action was issued to address anti-Christian bias and protect religious freedoms in the United States. The order outlines a policy to stop governmental actions perceived as targeting Christian practices and individuals, especially those who were accused of anti-abortion activities under the previous administration. The current administration emphasizes the protection of religious liberty, citing U.S. constitutional rights and other laws like the Religious Freedom Restoration Act.\n\nTo implement these changes, the order establishes a Task Force within the Department of Justice to identify and rectify alleged anti-Christian conduct by governmental bodies. The task force is chaired by the Attorney General and includes several cabinet members and agency heads. It will review past governmental actions, develop protective strategies for religious liberties, and report its findings to the President. The task force aims to enhance enforcement against anti-Christian acts and suggest necessary legislative or executive measures to safeguard religious practices.\n\nMoreover, the order mandates that the Task Force submits various reports on their findings and progress within specified timeframes. This executive move comes amid reported increases in hostility against Christian institutions and aims to ensure that the government upholds protections against discrimination and hostility based on religion.",
  "eli5": "The President made a plan to stop the government from being unfair to Christian people and their churches. They made a group of important people in the government to help make sure everyone can practice their religion safely.",
  "issues": [
    "Potential bias in addressing only anti-Christian concerns, excluding other religious groups.",
    "The challenge of defining the terms 'anti-Christian bias' and 'weaponization' used in the order.",
    "The implications of establishing such a specific task force on the separation of church and state."
  ],
  "citations": [
    "First Amendment",
    "Religious Freedom Restoration Act of 1993 (42 U.S.C. 2000bb et seq.)",
    "Title VII of the Civil Rights Act of 1964 (42 U.S.C. 2000e et seq.)"
  ],
  "keywords": [
    "Presidential Action",
    "Religious Freedom",
    "Anti-Christian Bias",
    "Task Force",
    "Government Policy",
    "Religious Liberty"
  ],
  "document_type": "Presidential Action"
}