{
  "title": "Establishing the National Energy Dominance Council – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Establishing the National Energy Dominance Council",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:      Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-national-energy-dominance-council/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-14T22:41:24+00:00",
  "article:modified_time": "2025-02-14T22:41:25+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tESTABLISHING THE NATIONAL ENERGY DOMINANCE COUNCIL\t\t\t\t\n\nFebruary 14, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection1.  Policy*.*  America is blessed with an abundance of natural resources and is a leader in energy technologies and innovation that are critical to the economic prosperity and national security of the American people, as well as our partners and allies.  We must expand all forms of reliable and affordable energy production to drive down inflation, grow our economy, create good-paying jobs, reestablish American leadership in manufacturing, lead the world in artificial intelligence, and restore peace through strength by wielding our commercial and diplomatic levers to end wars across the world.  By utilizing our amazing national assets, including our crude oil, natural gas, lease condensates, natural gas liquids, refined petroleum products, uranium, coal, biofuels, geothermal heat, the kinetic movement of flowing water, and critical minerals, we will preserve and protect our most beautiful places, reduce our dependency on foreign imports, and grow our economy — thereby enabling the reduction of our deficits and our debt.It shall be the policy of my Administration to make America energy dominant.\n\nSec. 2.  Establishment.  There is hereby established within the Executive Office of the President the National Energy Dominance Council (Council).\n\nSec. 3.  Membership.  (a)  The Secretary of the Interior shall serve as Chair of the Council.  The Secretary of Energy shall serve as Vice Chair of the Council.(b)  In addition to the Chair and the Vice Chair, the Council shall consist of the following members:(i)      the Secretary of State;(ii)     the Secretary of the Treasury;(iii)    the Secretary of Defense;(iv)     the Attorney General;(v)      the Secretary of Agriculture;(vi)     the Secretary of Commerce;(vii)    the Secretary of Transportation;(viii)   the Administrator of the Environmental Protection Agency;(ix)     the Director of the Office of Management and Budget;(x)      the United States Trade Representative;(xi)     the Deputy Chief of Staff for Policy;(xii)    the Assistant to the President for Economic Policy;(xiii)   the Assistant to the President for National Security Affairs;(xiv)    the Assistant to the President for Domestic Policy;(xv)     the Chairman of the Council on Environmental Quality;(xvi)    the Chairman of the Council of Economic Advisers;(xvii)   the Director of the Office of Science and Technology Policy; and(xviii)  the heads of such other executive departments and agencies (agencies) as the President may, from time to time, designate.\n\nSec. 4.  Functions.  (a)  The Chair shall convene and preside over meetings of the Council, in consultation with the Office of the Chief of Staff, provided that in his absence the Vice Chair shall preside.(b)  The Council shall:(i)    advise the President on how best to exercise his authority to produce more energy to make America energy dominant;(ii)   advise the President on improving the processes for permitting, production, generation, distribution, regulation, transportation, and export of all forms of American energy, including critical minerals;(iii)  provide to the President a recommended National Energy Dominance Strategy to produce more energy that includes long-range goals for achieving energy dominance by cutting red tape, enhancing private sector investments across all sectors of the energy-producing economy, focusing on innovation, and seeking to eliminate longstanding, but unnecessary, regulation;(iv)   advise and assist the President in facilitating cooperation among the Federal Government and domestic private sector energy partners; and(v)    advise the President on facilitating consistency in energy production policies included in the Strategy developed under subsection (b)(iii) of this section.(c)  In performing the advisory functions listed under subsection (b) of this section, the Council, through the Chair, shall, when appropriate, coordinate with the Assistant to the President for Economic Policy, the Assistant to the President for Domestic Policy, and the Assistant to the President for National Security Affairs.  The functions of the Council shall report to the Office of the Chief of Staff.(d)  Within 100 days of the date of this order, and from time to time thereafter as deemed appropriate by the Chair, the Council shall:(i)    recommend to the President a plan to raise awareness on a national level of matters related to energy dominance, such as the urgency of reliable energy; the improvements in technology achieved through reliable energy sources; the national security concerns with removing reliable and affordable energy sources; the jobs supported by the energy sector; and the regulatory constraints driving up the cost of reliable energy to consumers;(ii)   advise the President regarding the actions each agency can take under existing authorities to prioritize the policy objective of increasing energy production, such as rapidly and significantly increasing electricity capacity; rapidly facilitating approvals for energy infrastructure; approving the construction of natural gas pipelines to, or in, New England, California, Alaska, and other areas of the country underserved by American natural gas; facilitating the reopening of closed power plants; and bringing Small Modular Nuclear Reactors online;(iii)  provide to the President a review of markets most critical to power American homes, cars, and factories with reliable, abundant, and affordable energy;(iv)   advise the President regarding incentives to attract and retain private sector energy-production investments;(v)    advise the President on identifying and ending practices that raise the cost of energy; and(vi)   consult with officials from State, local, and Tribal governments and individuals from the private sector to solicit feedback on how best to expand all forms of energy production.\n\nSec. 5.  Administration.  (a)  The Council shall have such staff and other assistance as may be necessary to carry out its functions.(b)  Agencies shall cooperate with the Council and provide such assistance, information, and advice to the Council related to policies that affect energy dominance as the Chair or, at the Chair’s direction, the Vice Chair, shall reasonably request, to the extent permitted by law.\n\nSec. 6.  Representation on the National Security Council*.*  The Secretary of the Interior, as Chair of the Council, shall serve as a standing member of the National Security Council.\n\n     Sec. 7.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    February 14, 2025.\n",
  "summary": "On February 14, 2025, a Presidential Executive Order was issued to establish the National Energy Dominance Council. The council's primary goal is to position America as a leading global force in energy production. By enhancing energy production from various sources such as crude oil, natural gas, coal, and renewable resources, the nation aims to secure economic prosperity and national security. The council, coordinated by the Secretary of the Interior as Chair and the Secretary of Energy as Vice Chair, includes key members from several governmental departments.\n\nThe council will advise the President on promoting reliable and affordable energy by streamlining processes related to energy production and exports and proposing a strategy for energy dominance. This strategy will focus on reducing regulatory burdens and fostering private sector investments. The council will also work to encourage interagency cooperation to enhance energy production and address constraints that could drive higher consumer costs.\n\nImportantly, the council is tasked with reviewing and advising on policies related to energy markets and national awareness of the significance of energy dominance. It will seek feedback from state and local governments, as well as private sector stakeholders, to refine and expand energy production initiatives across the country.",
  "eli5": "A new group called the National Energy Dominance Council was created to help America become the best at making energy, like oil and electricity, so people have jobs and things stay affordable. Lots of important people will get together to figure out the best way to do this.",
  "keywords": [
    "National Energy Dominance Council",
    "energy production",
    "Executive Office",
    "renewable resources",
    "national security",
    "economic prosperity",
    "regulatory reform",
    "private sector investment",
    "energy innovation",
    "American leadership"
  ],
  "issues": [
    "Impact on environmental regulations",
    "Coordination among diverse council members",
    "Potential conflict with existing energy policies",
    "Involvement of the private sector"
  ],
  "citations": [
    "Constitution and laws of the United States of America"
  ],
  "document_type": "Executive Order"
}