{
  "title": "Establishing the President's Make America Healthy Again Commission – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Establishing the President's Make America Healthy Again Commission",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/establishing-the-presidents-make-america-healthy-again-commission/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-13T20:49:14+00:00",
  "article:modified_time": "2025-02-13T20:54:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tESTABLISHING THE PRESIDENT’SMAKE AMERICA HEALTHY AGAIN COMMISSION\t\t\t\t\n\nFebruary 13, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection1.  Purpose.  American life expectancy significantly lags behind other developed countries, with pre‑COVID-19 United States life expectancy averaging 78.8 years and comparable countries averaging 82.6 years.  This equates to 1.25 billion fewer life years for the United States population.  Six in 10 Americans have at least one chronic disease, and four in 10 have two or more chronic diseases.  An estimated one in five United States adults lives with a mental illness.\n\nThese realities become even more painful when contrasted with nations around the globe.  Across 204 countries and territories, the United States had the highest age-standardized incidence rate of cancer in 2021, nearly double the next-highest rate.  Further, from 1990-2021, the United States experienced an 88 percent increase in cancer, the largest percentage increase of any country evaluated.  In 2021, asthma was more than twice as common in the United States than most of Europe, Asia, or Africa.  Autism spectrum disorders had the highest prevalence in high-income countries, including the United States, in 2021.  Similarly, autoimmune diseases such as inflammatory bowel disease, psoriasis, and multiple sclerosis are more commonly diagnosed in high-income areas such as Europe and North America.  Overall, the global comparison data demonstrates that the health of Americans is on an alarming trajectory that requires immediate action.\n\nThis concern applies urgently to America’s children.  In 2022, an estimated 30 million children (40.7 percent) had at least one health condition, such as allergies, asthma, or an autoimmune disease.  Autism spectrum disorder now affects 1 in 36 children in the United States — a staggering increase from rates of 1 to 4 out of 10,000 children identified with the condition during the 1980s.  Eighteen percent of late adolescents and young adults have fatty liver disease, close to 30 percent of adolescents are prediabetic, and more than 40 percent of adolescents are overweight or obese.\n\nThese health burdens have continued to increase alongside the increased prescription of medication.  For example, in the case of Attention Deficit Disorder/Attention Deficit Hyperactivity Disorder, over 3.4 million children are now on medication for the disorder — up from 3.2 million children in 2019-2020 — and the number of children being diagnosed with the condition continues to rise.  \n\nThis poses a dire threat to the American people and our way of life.  Seventy-seven percent of young adults do not qualify for the military based in large part on their health scores.  Ninety percent of the Nation’s $4.5 trillion in annual healthcare expenditures is for people with chronic and mental health conditions.  In short, Americans of all ages are becoming sicker, beset by illnesses that our medical system is not addressing effectively.  These trends harm us, our economy, and our security.\n\nTo fully address the growing health crisis in America, we must re-direct our national focus, in the public and private sectors, toward understanding and drastically lowering chronic disease rates and ending childhood chronic disease.  This includes fresh thinking on nutrition, physical activity, healthy lifestyles, over-reliance on medication and treatments, the effects of new technological habits, environmental impacts, and food and drug quality and safety.  We must restore the integrity of the scientific process by protecting expert recommendations from inappropriate influence and increasing transparency regarding existing data.  We must ensure our healthcare system promotes health rather than just managing disease.\n\nSec. 2.  Policy.  It shall be the policy of the Federal Government to aggressively combat the critical health challenges facing our citizens, including the rising rates of mental health disorders, obesity, diabetes, and other chronic diseases.  To do so, executive departments and agencies (agencies) that address health or healthcare must focus on reversing chronic disease.  Under this policy:\n\n(a)  all federally funded health research should empower Americans through transparency and open-source data, and should avoid or eliminate conflicts of interest that skew outcomes and perpetuate distrust;\n\n(b)  the National Institutes of Health and other health-related research funded by the Federal Government should prioritize gold-standard research on the root causes of why Americans are getting sick;\n\n(c)  agencies shall work with farmers to ensure that United States food is the healthiest, most abundant, and most affordable in the world; and\n\n(d)  agencies shall ensure the availability of expanded treatment options and the flexibility for health insurance coverage to provide benefits that support beneficial lifestyle changes and disease prevention.\n\nSec. 3.  Establishment and Composition of the President’s Make America Healthy Again Commission*.*  (a)  There is hereby established the President’s Make America Healthy Again Commission (Commission), chaired by the Secretary of Health and Human Services (Chair), with the Assistant to the President for Domestic Policy serving as Executive Director (Executive Director).\n\n(b)  In addition to the Chair and the Executive Director, the Commission shall include the following officials, or their designees:\n\n(i)     the Secretary of Agriculture;\n\n(ii)    the Secretary of Housing and Urban Development;\n\n(iii)   the Secretary of Education;\n\n(iv)    the Secretary of Veterans Affairs;\n\n(v)     the Administrator of the Environmental Protection Agency;\n\n(vi)    the Director of the Office of Management and Budget;\n\n(vii)   the Assistant to the President and Deputy Chief of Staff for Policy;\n\n(viii)  the Director of the National Economic Council;\n\n(ix)    the Chairman of the Council of Economic Advisers;\n\n(x)     the Director of the Office of Science and Technology Policy;\n\n(xi)    the Commissioner of Food and Drugs;\n\n(xii)   the Director for the Centers for Disease Control and Prevention;\n\n(xiii)  the Director of the National Institutes of Health; and\n\n(xiv)   other members of my Administration invited to participate, at the discretion of the Chair and the Executive Director.\n\nSec. 4.  Fighting Childhood Chronic Disease.  The initial mission of the Commission shall be to advise and assist the President on how best to exercise his authority to address the childhood chronic disease crisis.  Therefore, the Commission shall:\n\n(a)  study the scope of the childhood chronic disease crisis and any potential contributing causes, including the American diet, absorption of toxic material, medical treatments, lifestyle, environmental factors, Government policies, food production techniques, electromagnetic radiation, and corporate influence or cronyism;  \n\n(b)  advise and assist the President on informing the American people regarding the childhood chronic disease crisis, using transparent and clear facts; and\n\n(c)  provide to the President Government-wide recommendations on policy and strategy related to addressing the identified contributing causes of and ending the childhood chronic disease crisis.\n\nSec. 5.  Initial Assessment and Strategy from the Make America Healthy Again Commission.  (a)  *Make our Children Healthy Again Assessment.*  Within 100 days of the date of this order, the Commission shall submit to the President, through the Chair and the Executive Director, the Make Our Children Healthy Again Assessment, which shall:\n\n(i)     identify and describe childhood chronic disease in America compared to other countries;\n\n(ii)    assess the threat that potential over-utilization of medication, certain food ingredients, certain chemicals, and certain other exposures pose to children with respect to chronic inflammation or other established mechanisms of disease, using rigorous and transparent data, including international comparisons;\n\n(iii)   assess the prevalence of and threat posed by the prescription of selective serotonin reuptake inhibitors, antipsychotics, mood stabilizers, stimulants, and weight-loss drugs;\n\n(iv)    identify and report on best practices for preventing childhood health issues, including through proper nutrition and the promotion of healthy lifestyles;\n\n(v)     evaluate the effectiveness of existing educational programs with regard to nutrition, physical activity, and mental health for children;\n\n(vi)    identify and evaluate existing Federal programs and funding intended to prevent and treat childhood health issues for their scope and effectiveness;\n\n(vii)   ensure transparency of all current data and unpublished analyses related to the childhood chronic disease crisis, consistent with applicable law;\n\n(viii)  evaluate the effectiveness of current Federal Government childhood health data and metrics, including those from the Federal Interagency Forum on Child and Family Statistics and the National Survey of Children’s Health;\n\n(ix)    restore the integrity of science, including by eliminating undue industry influence, releasing findings and underlying data to the maximum extent permitted under applicable law, and increasing methodological rigor; and\n\n(x)     establish a framework for transparency and ethics review in industry-funded projects.\n\n(b)  *Make our Children Healthy Again Strategy.*  Within 180 days of the date of this order, the Commission shall submit to the President, through the Chair and the Executive Director, a Make Our Children Healthy Again Strategy (Strategy), based on the findings from the Make Our Children Healthy Again Assessment described in subsection (a) of this section.  The Strategy shall address appropriately restructuring the Federal Government’s response to the childhood chronic disease crisis, including by ending Federal practices that exacerbate the health crisis or unsuccessfully attempt to address it, and by adding powerful new solutions that will end childhood chronic disease.\n\n(c)  The Chair may hold public hearings, meetings, roundtables, and similar events, as appropriate, and may receive expert input from leaders in public health and Government accountability. \n\nSec. 6.  Additional Reports.  (a)  Following the submission to the President of the Strategy, and any final strategy reports thereafter, the Chair and the Executive Director shall recommend to the President updates to the Commission’s mission, including desired reports.\n\n(b)  The Commission shall not reconvene, following submission of the Strategy, until an updated mission is submitted to the President through the Executive Director.\n\nSec. 7.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    February 13, 2025.\n",
  "summary": "The document is an Executive Order issued on February 13, 2025, that establishes the President’s Make America Healthy Again Commission. The order is a response to alarming health statistics in the United States compared to other developed countries, aiming to address chronic disease and mental health issues. It highlights that American life expectancy is lower than that of similar nations, and various chronic diseases are prevalent, with significant impacts on children and young adults. \n\nThe document mandates the creation of a commission chaired by the Secretary of Health and Human Services and consisting of various key government officials. The commission's mission is to advise and assist the President in combating childhood chronic disease. The commission is directed to consider factors like nutrition, environmental impacts, and government policies and make recommendations within set timeframes. Additionally, the order emphasizes transparency, eliminating conflicts of interest, and promoting healthy lifestyles.",
  "eli5": "The President wants to help Americans be healthier because in the US, many people get sick more often than in other countries. A team of experts will work together to figure out why and how we can make kids and adults healthier.",
  "keywords": [
    "Health",
    "Chronic Disease",
    "Mental Health",
    "Executive Order",
    "Make America Healthy Again",
    "Public Health",
    "Children's Health",
    "Nutrition"
  ],
  "issues": [
    "The effectiveness of current healthcare strategies.",
    "The increasing prevalence of chronic diseases.",
    "Transparency in scientific processes and influencing factors.",
    "The implications of health issues on national security."
  ],
  "citations": [],
  "document_type": "Executive Order"
}