{
  "title": "Establishing And Implementing The President's \"Department Of Government Efficiency\" – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Establishing And Implementing The President's \"Department Of Government Efficiency\"",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/establishing-and-implementing-the-presidents-department-of-government-efficiency/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:50:14+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tESTABLISHING AND IMPLEMENTING THE PRESIDENT’S“DEPARTMENT OF GOVERNMENT EFFICIENCY”\t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose.  This Executive Order establishes the Department of Government Efficiency to implement the President’s DOGE Agenda, by modernizing Federal technology and software to maximize governmental efficiency and productivity.\n\nSec. 2.  Definitions.  As used in this order:\n\n(a) **“Agency” has the meaning given to it in section 551 of title 5, United States Code, except that such term does not include the Executive Office of the President or any components thereof.\n\n(b)  “Agency Head” means the highest-ranking official of an agency, such as the Secretary, Administrator, Chairman, or Director, unless otherwise specified in this order.\n\nSec. 3.  DOGE Structure.  (a)  *Reorganization and Renaming of the United States Digital Service.*The United States Digital Service is hereby publicly renamed as the United States DOGE Service (USDS) and shall be established in the Executive Office of the President.\n\n(b) *Establishment of a Temporary Organization*.  There shall be a USDS Administrator established in the Executive Office of the President who shall report to the White House Chief of Staff. There is further established within USDS, in accordance with section 3161 of title 5, United States Code, a temporary organization known as “the U.S. DOGE Service Temporary Organization”.  The U.S. DOGE Service Temporary Organization shall be headed by the USDS Administrator and shall be dedicated to advancing the President’s 18-month DOGE agenda.  The U.S. DOGE Service Temporary Organization shall terminate on July 4, 2026. The termination of the U.S. DOGE Service Temporary Organization shall not be interpreted to imply the termination, attenuation, or amendment of any other authority or provision of this order.\n\n(c) *DOGE Teams*.  In consultation with USDS, each Agency Head shall establish within their respective Agencies a DOGE Team of at least four employees, which may include Special Government Employees, hired or assigned within thirty days of the date of this Order. Agency Heads shall select the DOGE Team members in consultation with the USDS Administrator.  Each DOGE Team will typically include one DOGE Team Lead, one engineer, one human resources specialist, and one attorney.  Agency Heads shall ensure that DOGE Team Leads coordinate their work with USDS and advise their respective Agency Heads on implementing the President ‘s DOGE Agenda.\n\nSec. 4.  *Modernizing Federal Technology and Software to Maximize Efficiency and Productivity*.  (a)  The USDS Administrator shall commence a Software Modernization Initiative to improve the quality and efficiency of government-wide software, network infrastructure, and information technology (IT) systems.  Among other things, the USDS Administrator shall work with Agency Heads to promote inter-operability between agency networks and systems, ensure data integrity, and facilitate responsible data collection and synchronization.\n\n(b)  Agency Heads shall take all necessary steps, in coordination with the USDS Administrator and to the maximum extent consistent with law, to ensure USDS has full and prompt access to all unclassified agency records, software systems, and IT systems.  USDS shall adhere to rigorous data protection standards.\n\n(c)  This Executive Order displaces all prior executive orders and regulations, insofar as they are subject to direct presidential amendment, that might serve as a barrier to providing USDS access to agency records and systems as described above.\n\nSec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n      January 20, 2025.\n",
  "summary": "On January 20, 2025, the President signed an Executive Order establishing the Department of Government Efficiency (named **DOGE**) as part of efforts to modernize federal technology and enhance governmental efficiency. This initiative, known as the DOGE Agenda, aims to improve the productivity of federal agencies by upgrading software and technology infrastructure. The order mandates the reorganization and renaming of the United States Digital Service to the United States DOGE Service (USDS), which will operate within the Executive Office of the President.\n\nThe order details the structure of the USDS, including the appointment of a USDS Administrator who will oversee a temporary organization dedicated to advancing the DOGE agenda over an 18-month period, concluding on July 4, 2026. Each federal agency shall form a DOGE Team comprised of personnel such as engineers and human resources specialists to work collaboratively with the USDS Administrator. These teams are tasked with ensuring data integrity, fostering interoperability between agency systems, and adhering to stringent data protection guidelines.\n\nThe order authorizes the displacement of previous executive orders and regulations that might restrict USDS's access to agency data and systems. It specifies that its implementation should not interfere with existing legal authorities of executive departments and must be executed within the confines of available appropriations. Furthermore, the order clarifies that it does not confer legal rights enforceable by individuals against the government.",
  "eli5": "The President made a new rule to help the government use technology better, like making sure computers talk to each other properly. He also started a special team called the DOGE Service to make this happen, and every part of the government has to help them out.",
  "keywords": [
    "Executive Order",
    "Department of Government Efficiency",
    "USDS",
    "Technology Modernization",
    "Federal Agencies",
    "DOGE Agenda",
    "Data Protection"
  ],
  "issues": [
    "Potential conflicts with existing laws or authorities may arise, necessitating careful legal navigation.",
    "Funding and resources for implementation may present challenges, as adherence to budgetary restrictions is required.",
    "The timeline, with an end date of July 4, 2026, may be ambitious for achieving comprehensive modernization goals."
  ],
  "citations": [
    "Section 551 of title 5, United States Code",
    "Section 3161 of title 5, United States Code"
  ],
  "document_type": "Executive Order"
}