{
  "title": "Establishment of The White House Faith Office – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Establishment of The White House Faith Office",
  "og:description": "     By the authority vested in me as President by the Constitution and the laws of the United States of America, and to assist faith-based entities,",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/establishment-of-the-white-house-faith-office/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-08T00:03:18+00:00",
  "article:modified_time": "2025-02-08T00:05:40+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tEstablishment of The White House Faith Office\t\t\t\t\n\nFebruary 7, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, and to assist faith-based entities, community organizations, and houses of worship in their efforts to strengthen American families, promote work and self-sufficiency, and protect religious liberty, it is hereby ordered:     Section 1.  Policy*.*  Faith-based entities, community organizations, and houses of worship have tremendous ability to serve individuals, families, and communities through means that are different from those of government and with capacity and effectiveness that often exceeds that of government.  These organizations lift people up, keep families strong, and solve problems at the local level.  The executive branch wants faith-based entities, community organizations, and houses of worship, to the fullest extent permitted by law, to compete on a level playing field for grants, contracts, programs, and other Federal funding opportunities.  The efforts of faith-based entities, community organizations, and houses of worship are essential to strengthening families and revitalizing communities, and the Federal Government welcomes opportunities to partner with such organizations through innovative, measurable, and outcome-driven initiatives.The executive branch is committed to ensuring that all executive departments and agencies (agencies) honor and enforce the Constitution’s guarantee of religious liberty and to ending any form of religious discrimination by the Federal Government.     Sec. 2.  Amendments to Executive Orders*.*  (a)  Executive Order 13198 of January 29, 2001 (Agency Responsibilities With Respect to Faith-Based and Community Initiatives); Executive Order 13279 of December 12, 2002 (Equal Protection of the Laws for Faith-Based and Community Organizations), as amended by Executive Order 13559 of November 17, 2010 (Fundamental Principles and Policymaking Criteria for Partnerships With Faith-Based and Other Neighborhood Organizations); Executive Order 13280 of December 12, 2002 (Responsibilities of the Department of Agriculture and the Agency for International Development With Respect to Faith-Based and Community Initiatives); Executive Order 13342 of June 1, 2004 (Responsibilities of the Departments of Commerce and Veterans Affairs and the Small Business Administration With Respect to Faith-Based and Community Initiatives); and Executive Order 13397 of March 7, 2006 (Responsibilities of the Department of Homeland Security With Respect to Faith-Based and Community Initiatives), are hereby amended by:          (i)   substituting “White House Faith Office” for “White House Office of Faith-Based and Community Initiatives” or “White House OFBCI” each time it appears in those orders; and          (ii)  substituting “Center for Faith” for “Center for Faith-based and Community Initiatives,” and “Centers for Faith” for “Centers for Faith-based and Community Initiatives” each time they appear in those orders.          (b)  Executive Order 13279, as amended by Executive Order 13559, is further amended by striking section 2(h) and redesignating sections 2(i) and 2(j) as sections 2(h) and 2(i), respectively.     Sec. 3.  Establishment of the White House Faith Office*.*  (a)  There is established within the Executive Office of the President (EOP) the White House Faith Office (Office).  The Office shall have lead responsibility in the executive branch to empower faith-based entities, community organizations, and houses of worship to serve families and communities.(b)  The Office shall be housed in the Domestic Policy Council and headed by a Senior Advisor to the White House Faith Office, and supported by other positions as the President considers appropriate.  In carrying out this order, the Office shall work with the Domestic Policy Council, the Office of Public Liaison, and the Centers for Faith established by Executive Order 13198, Executive Order 13280, Executive Order 13342, and Executive Order 13397, as amended by section 2(a)(ii) of this order.     Sec. 4.  White House Faith Office Functions*.*  (a)  To the extent permitted by law, the Office shall:     (i)     from time to time, consult with and seek information from experts and various faith and community leaders identified by the White House Faith Office and other EOP components, including those from outside the Federal Government and those from State, local, and Tribal governments.  These experts and leaders shall be identified based on their expertise in a broad range of areas in which faith-based entities, community organizations, and houses of worship operate, including protecting women and children; strengthening marriage and family; lifting up individuals through work and self-sufficiency, defending religious liberty; combatting anti-Semitic, anti-Christian, and additional forms of anti-religious bias; promoting foster care and adoption programs in partnership with faith-based entities; providing wholesome and effective education; preventing and reducing crime and facilitating prisoner reentry; promoting recovery from substance use disorder; and fostering flourishing minds;     (ii)    make recommendations to the President, through the Assistant to the President for Domestic Policy, regarding changes to policies, programs, and practices, and aspects of my Administration’s policy agenda, that affect the ability of faith-based entities, community organizations, and houses of worship to serve families and communities;     (iii)   convene meetings with representatives from the Centers for Faith and other representatives from across agencies as appropriate;     (iv)    advise on the implementation throughout the Federal Government of those aspects of my Administration’s policy agenda aimed at enabling faith-based entities, community organizations, and houses of worship to better serve families and communities;     (v)     showcase innovative initiatives by faith-based entities, community organizations, and houses of worship that serve and strengthen individuals, families, and communities throughout the United States;     (vi)    coordinate with all agencies to implement training and education throughout the country for faith-based entity grantees to build their capacity to procure grants;     (vii)   support agencies in developing and implementing training and education regarding religious liberty exceptions, accommodations, or exemptions;     (viii)  consult with public and private businesses regarding their policies for employee volunteerism, charitable giving, and payroll deductions;     (ix)    coordinate with agencies on identifying and promoting grant opportunities for non-profit faith-based entities, community organizations, and houses of worship, especially those inexperienced with public funding but that operate effective programs;     (x)     work in collaboration with the Attorney General, or a designee of the Attorney General, to identify concerns raised by faith-based entities, community organizations, and houses of worship about any failures of the executive branch to enforce constitutional and Federal statutory protections for religious liberty; and     (xi)    identify and propose means to reduce burdens on the free exercise of religion, including legislative, regulatory, and other barriers to the full and active participation of faith-based entities, community organizations, and houses of worship in government-funded or government-conducted activities and programs.     (b)  Agencies shall, to the extent permitted by law, provide such information, support, and assistance to the Office as may assist the Office in fulfilling this order.       (c)  The Directors of each Center of Faith shall oversee their respective agency’s efforts to assist the Office in carrying out this order, and shall report on such efforts to agency leadership and the Office.  Agencies that lack a Center for Faith shall designate or appoint a Faith Liaison within the agency to oversee the agency’s efforts to assist the Office in carrying out this order and to report on such efforts to agency leadership and the Office.  All such agencies shall designate or appoint such a Faith Liaison within 90 days of the date of this order.     Sec. 5.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.     Sec. 6. General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department, agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    February 7, 2025.\n",
  "summary": "# Establishment of The White House Faith Office\n\nOn February 7, 2025, a Presidential action was established to create the White House Faith Office to empower faith-based entities, community organizations, and houses of worship. This initiative seeks to enhance these groups' ability to serve families and communities by providing them with equal opportunities to participate in federal grant and funding programs. The aim is to leverage these organizations' unique capabilities to strengthen families, uplift individuals through employment and self-sufficiency, protect religious freedom, and address local problems effectively.\n\nThe order amends several previous executive orders to rename existing faith-based initiatives under the new White House Faith Office and Centers for Faith. The office's responsibilities include advising on policy, coordinating federal efforts, and ensuring the protection of religious liberties. It outlines the creation of a supportive network across federal agencies to align with the White House's goals, ensuring full participation of faith-based organizations in government programs.\n\nKey roles within the White House Faith Office include consulting with experts, recommending policy changes, and showcasing innovative community programs. It plans to work collaboratively with various agencies to provide training and identify grants for organizations inexperienced with public funding. Additionally, the order is positioned to empower these faith-based entities by reducing barriers to their participation in federal programs and safeguarding their religious freedoms.",
  "eli5": "The President made a new office to help religious and community groups do good jobs helping people and getting money from the government to help more families. It's all about helping them do their best work.",
  "keywords": [
    "White House Faith Office",
    "faith-based organizations",
    "community initiatives",
    "religious liberty",
    "federal funding",
    "executive order"
  ],
  "issues": [
    "Potential challenges in implementing equal opportunities for federal funding access.",
    "Ensuring the protection against religious discrimination.",
    "Effectiveness in showcasing and scaling local community innovations."
  ],
  "citations": [
    "Executive Order 13198",
    "Executive Order 13279",
    "Executive Order 13559",
    "Executive Order 13280",
    "Executive Order 13342",
    "Executive Order 13397"
  ],
  "document_type": "Executive Order"
}