{
  "title": "Executive Grant of Clemency for Terence Sutton – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Executive Grant of Clemency for Terence Sutton – The White House",
  "og:description": "Executive Grant of ClemencyDonald J. TrumpPresident of the United States of AmericaTo All to Whom These Presents Shall Come, Greeting:    Be it Known,",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/executive-grant-of-clemency-for-terence-sutton/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T23:19:33+00:00",
  "article:modified_time": "2025-01-22T23:26:10+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tExecutive Grant of Clemency for TERENCE SUTTON\t\t\t\t\n\nJanuary 22, 2025\n\nExecutive Grant of Clemency**Donald J. Trump*****President of the United States of America***To All to Whom These Presents Shall Come, Greeting:**Be it Known, that This Day, I, Donald J. Trump, President of the United States, Pursuant to My Powers Under Article II, Section 2, Clause 1, of the Constitution, Have Granted Unto**TERENCE SUTTON**A Full and Unconditional Pardon****For His****convictions** in the United States District Court for the District of Columbia, on an indictment (Docket No. 1:21-cr-00598-PLF), of violations of section 2103, title 22, District of Columbia Code; section 371, title 18, United States Code; and section 1512, title 18, United States Code; for which he was sentenced on September 12, 2024, to 66, 48, and 48 months of imprisonment, respectively (all to run concurrently); 3 years of supervised release; and a special assessment of three hundred dollars ($300).**I HEREBY DESIGNATE**, direct, and empower, the Pardon Attorney, as my representative, to sign a grant of clemency to the person named herein. The Pardon Attorney shall declare that her action is the act of the President, being performed at my direction.**IN TESTIMONY WHEREOF**, I have hereunto signed my name and caused the seal of the Department of Justice to be affixed.Done at the City of Washington in the District of Columbia this 22nd day of January in the Year of our Lord two thousand twenty-five, and of the Independence of the United States the two hundred forty-ninth.\n",
  "summary": "On January 22, 2025, Donald J. Trump, in his capacity as President of the United States, issued a full and unconditional pardon to Terence Sutton. This act of clemency was conferred in accordance with the President's constitutional powers under Article II, Section 2, Clause 1. Terence Sutton had been convicted in the United States District Court for the District of Columbia on several charges, specifically violations of sections 2103 and 371 of the District of Columbia Code, and section 1512 of Title 18, United States Code. Sutton's sentence included 66 months of imprisonment for one charge, and 48 months each for the others, all running concurrently. In addition to imprisonment, he was sentenced to three years of supervised release and a $300 special assessment.\n\nThe pardon was formally executed through the President's designation of a Pardon Attorney, who was directed to sign the clemency grant on behalf of the President. This document highlights the procedural aspects of the presidential pardon, detailing the involvement of both the Presidential and the Department of Justice's authorities. The document was finalized and sealed in Washington, D.C., and carries the symbol of the Department of Justice, ensuring its authenticity and adherence to official protocols.",
  "eli5": "The President of the United States, Donald Trump, decided to forgive Terence Sutton for the crimes he was punished for and released him from his jail time. This happened on January 22, 2025, and it was officially approved with a special seal.",
  "keywords": [
    "Donald Trump",
    "Presidential Pardon",
    "Clemency",
    "Terence Sutton",
    "Constitutional Powers",
    "District of Columbia",
    "US Code"
  ],
  "issues": [
    "Clarity on rationale behind granting pardon",
    "Understanding the criteria used for granting clemency",
    "Impact of pardon on public perception and legal precedents"
  ],
  "citations": [
    "Article II, Section 2, Clause 1 of the Constitution",
    "Section 2103, Title 22, District of Columbia Code",
    "Section 371, Title 18, United States Code",
    "Section 1512, Title 18, United States Code"
  ],
  "document_type": "Presidential Action"
}