{
  "title": "Executive Grant of Clemency for Andrew Zabavsky – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Executive Grant of Clemency for Andrew Zabavsky – The White House",
  "og:description": "Executive Grant of ClemencyDonald J. TrumpPresident of the United States of AmericaTo All to Whom These Presents Shall Come, Greeting:   ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/executive-grant-of-clemency-for-andrew-zabavsky/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T22:40:57+00:00",
  "article:modified_time": "2025-01-22T22:40:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tExecutive Grant of Clemency for Andrew Zabavsky\t\t\t\t\n\nJanuary 22, 2025\n\nExecutive Grant of Clemency**Donald J. Trump*****President of the United States of America***To All to Whom These Presents Shall Come, Greeting:**Be it Known, that This Day, I, Donald J. Trump, President of the United States, Pursuant to My Powers Under Article II, Section 2, Clause 1, of the Constitution, Have Granted Unto**Andrew Zabavsky**A Full and Unconditional Pardon****For His****convictions** in the United States District Court for the District of Columbia, on an indictment (Docket No. 1:21-cr-00598-PLF), of violations of section 371, title 18, United States Code, and section 1512, title 18, United States Code, for which he was sentenced on September 12, 2024, to 48 months of imprisonment on each count (to run concurrently); 3 years of supervised release; and a special assessment of two hundred dollars ($200).**I HEREBY DESIGNATE**, direct, and empower, the Pardon Attorney, as my representative, to sign a grant of clemency to the person named herein. The Pardon Attorney shall declare that her action is the act of the President, being performed at my direction.**IN TESTIMONY WHEREOF**, I have hereunto signed my name and caused the seal of the Department of Justice to be affixed.Done at the City of Washington in the District of Columbia this 22nd day of January in the Year of our Lord two thousand twenty-five, and of the Independence of the United States the two hundred forty-ninth.\n",
  "summary": "On January 22, 2025, President Donald J. Trump issued an Executive Grant of Clemency to Andrew Zabavsky. Zabavsky had been convicted in the United States District Court for the District of Columbia for violating sections 371 and 1512 of title 18 of the United States Code. These convictions resulted in a sentence of 48 months of imprisonment on each count to be served concurrently, along with three years of supervised release and a special assessment of $200.\n\nBy utilizing his powers under Article II, Section 2, Clause 1 of the U.S. Constitution, President Trump granted a full and unconditional pardon to Zabavsky. This action was formalized with instructions for the Pardon Attorney to sign the grant of clemency, acting as the President's representative. The pardon document was executed in Washington, D.C., with the Department of Justice's seal and was intended to count as an official act of the President.",
  "eli5": "The President, Donald Trump, decided to forgive a person named Andrew Zabavsky for breaking some rules, so Zabavsky doesn't have to be punished anymore.",
  "keywords": [
    "Executive Grant of Clemency",
    "Donald J. Trump",
    "Andrew Zabavsky",
    "Pardon",
    "United States District Court",
    "Section 371",
    "Section 1512",
    "Article II Constitution",
    "Presidential Powers"
  ],
  "issues": [
    "Why was Andrew Zabavsky granted clemency?",
    "What were the specific circumstances leading to Andrew Zabavsky's convictions?",
    "What impact does this clemency have on future legal proceedings?"
  ],
  "citations": [
    "section 371, title 18, United States Code",
    "section 1512, title 18, United States Code",
    "Article II, Section 2, Clause 1 of the Constitution"
  ],
  "document_type": "Presidential Action"
}