{
  "title": "Expanding Access to In Vitro Fertilization – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Expanding Access to In Vitro Fertilization",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:      Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/expanding-access-to-in-vitro-fertilization/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-19T02:29:18+00:00",
  "article:modified_time": "2025-02-19T02:29:19+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tExpanding Access to In Vitro Fertilization\t\t\t\t\n\nFebruary 18, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection1.  Purpose and Policy.  Today, many hopeful couples dream of starting a family, but as many as one in seven are unable to conceive a child.  Despite their hopes and efforts, infertility struggles can make conception difficult, turning what should be a joyful experience into an emotional and financial struggle.  My Administration recognizes the importance of family formation, and as a Nation, our public policy must make it easier for loving and longing mothers and fathers to have children.     In vitro fertilization (IVF) offers hope to men and women experiencing fertility challenges.  Americans need reliable access to IVF and more affordable treatment options, as the cost per cycle can range from $12,000 to $25,000.  Providing support, awareness, and access to affordable fertility treatments can help these families navigate their path to parenthood with hope and confidence.     Therefore, to support American families, it is the policy of my Administration to ensure reliable access to IVF treatment, including by easing unnecessary statutory or regulatory burdens to make IVF treatment drastically more affordable.\n\nSec. 2.  Lowering Costs and Reducing Barriers to IVF.  Within 90 days of the date of this order, the Assistant to the President for Domestic Policy shall submit to the President a list of policy recommendations on protecting IVF access and aggressively reducing out-of-pocket and health plan costs for IVF treatment.\n\nSec. 3.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n             (i)  the authority granted by law to an executive department or agency, or the head thereof; or\n\n             (ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "On February 18, 2025, the President issued an order to emphasize the importance of expanding access to In Vitro Fertilization (IVF) for Americans experiencing fertility challenges. Recognizing the emotional and financial struggles associated with infertility, the administration aims to make IVF treatments more affordable and accessible. Due to the high costs of IVF, which can range from $12,000 to $25,000 per cycle, the administration seeks to ease unnecessary statutory and regulatory burdens to support family formation. \n\nAs part of this initiative, the Assistant to the President for Domestic Policy is tasked with providing recommendations within 90 days on ways to ensure the protection of IVF access while reducing out-of-pocket and health plan expenses. The executive order clarifies that it does not interfere with existing legal authorities and should be implemented according to the law and budgetary constraints. This order does not establish legally enforceable rights or benefits for individuals against the government.",
  "eli5": "The President wants to make it easier and cheaper for people who can't have babies naturally to get special help called IVF, so more families can have kids even if it's hard for them.",
  "keywords": [
    "IVF",
    "fertility",
    "access",
    "affordability",
    "regulations",
    "Presidential Order",
    "family formation"
  ],
  "issues": [
    "Potential high costs and availability of IVF treatments",
    "Regulatory barriers affecting IVF accessibility",
    "Clarification on how budgetary constraints might impact implementation"
  ],
  "citations": [],
  "document_type": "Executive Order"
}