{
  "title": "Expanding Educational Freedom and Opportunity for Families – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Expanding Educational Freedom and Opportunity for Families – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, and to improve the education, well-being, and",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/expanding-educational-freedom-and-opportunity-for-families/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-29T22:31:42+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tExpanding Educational Freedom and Opportunity for Families\t\t\t\t\n\nJanuary 29, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, and to improve the education, well-being, and future success of America’s most prized resource, her young citizens, it is hereby ordered:Section 1.  Purpose.  Parents want and deserve the best education for their children.  But too many children do not thrive in their assigned, government-run K-12 school.  According to this year’s National Assessment of Educational Progress (NAEP), 70 percent of 8th graders were below proficient in reading, and 72 percent were below proficient in math.  Moreover, geographically based school assignments exacerbate the cost of housing in districts with preferred schools, straining the finances of millions of American families sacrificing for their children’s futures. When our public education system fails such a large segment of society, it hinders our national competitiveness and devastates families and communities.  For this reason, more than a dozen States have enacted universal K-12 scholarship programs, allowing families — rather than the government — to choose the best educational setting for their children.  These States have highlighted the most promising avenue for education reform:  educational choice for families and competition for residentially assigned, government-run public schools.  The growing body of rigorous research demonstrates that well-designed education-freedom programs improve student achievement and cause nearby public schools to improve their performance. Sec. 2.  Policy.  It is the policy of my Administration to support parents in choosing and directing the upbringing and education of their children. Sec. 3.  Guidance on Supporting State-based K-12 Educational Choice.  Within 60 days of the date of this order, the Secretary of Education shall issue guidance regarding how States can use Federal formula funds to support K-12 educational choice initiatives.Sec. 4.  Encouraging Education Freedom through Discretionary Grant Programs.  (a)  The Secretary of Education shall include education freedom as a priority in discretionary grant programs, as appropriate and consistent with applicable law. (b)  Within 90 days of the date of this order, the Secretary of Labor and the Secretary of Education shall review their respective discretionary grant programs and each submit a plan to the President, through the Assistant to the President for Domestic Policy, that identifies, evaluates, and makes recommendations regarding using relevant discretionary grant programs to expand education freedom for America’s families and teachers. Sec. 5.  Expanding Opportunities for Low-Income, Working Families.  Within 90 days of the date of this order, the Secretary of Health and Human Services shall issue guidance regarding whether and how States receiving block grants for families and children from the Department, including the Child Care and Development Block Grant (CCDGB), can use them to expand educational choice and support families who choose educational alternatives to governmental entities, including private and faith-based options.Sec. 6.  Helping Military Families.  Within 90 days of the date of this order, the Secretary of Defense shall review any available mechanisms under which military-connected families may use funds from the Department of Defense to attend schools of their choice, including private, faith-based, or public charter schools, and submit a plan to the President describing such mechanisms and the steps that would be necessary to implement them beginning in the 2025-26 school year.Sec. 7.  Helping Children Eligible for Bureau of Indian Education (BIE) Schools.  Within 90 days of the date of this order, the Secretary of the Interior shall review any available mechanisms under which families of students eligible to attend BIE schools may use their Federal funding for educational options of their choice, including private, faith-based, or public charter schools, and submit a plan to the President describing such mechanisms and the steps that would be necessary to implement them for the 2025-26 school year.  The Secretary shall report on the current performance of BIE schools and identify educational options in nearby areas.  Sec. 8.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "On January 29, 2025, a presidential order was issued to expand educational freedom and opportunities for families in the United States. Concerned with the inadequate performance of many government-run K-12 schools in addressing essential reading and math skills, the new policy aims to empower parents with greater control over their children’s education. Through initiatives like state-driven K-12 scholarship programs and educational choice, the government seeks to enhance the educational landscape by promoting competition and choice.\n\nThe order sets out several actionable steps for different federal departments. The Secretary of Education, Labor, Health and Human Services, Defense, and Interior are instructed to review and potentially allocate federal funds towards supporting educational choice. These funds could be used for alternatives like private and faith-based schools, particularly to benefit low-income families, military families, and children eligible for Bureau of Indian Education schools. All actions must comply with existing laws and are subject to budgetary considerations.\n\nThis initiative underscores the administration's commitment to educational reform by involving federal support in state-led educational alternatives. It emphasizes better performance, equity in educational access, and improved national competitiveness through diverse educational options.",
  "eli5": "The President wants to make it easier for families to choose where their kids go to school. This means helping states use money so parents can pick the best school for their kids, whether it's public, private, or religious.",
  "keywords": [
    "Educational freedom",
    "K-12 schools",
    "Parental choice",
    "Scholarship programs",
    "Federal funds",
    "Private schools",
    "Faith-based schools",
    "Education policy"
  ],
  "issues": [
    "Potential impacts on public school funding",
    "Implementation challenges at state levels",
    "Equity and accessibility of educational choices",
    "Compliance with existing laws and guidelines"
  ],
  "citations": [
    "National Assessment of Educational Progress (NAEP)",
    "Child Care and Development Block Grant (CCDGB)"
  ],
  "document_type": "Executive Order"
}