{
  "title": "Fact Sheet: President Donald J. Trump Establishes One Voice for America’s Foreign Relations – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Establishes One Voice for America’s Foreign Relations",
  "og:description": "A UNIFIED VOICE FOR AMERICA’S FOREIGN RELATIONS: Today, President Donald J. Trump signed an Executive Order establishing one clear, unified voice for",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-establishes-one-voice-for-americas-foreign-relations/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-12T22:33:18+00:00",
  "article:modified_time": "2025-02-12T22:33:19+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Establishes One Voice for America’s Foreign Relations**\n\nFebruary 12, 2025\n\n**A UNIFIED VOICE FOR AMERICA’S FOREIGN RELATIONS:** Today, President Donald J. Trump signed an Executive Order establishing one clear, unified voice for America’s foreign relations.\n    - The Order reaffirms that all individuals involved in implementing the President’s foreign policy do so under his authority and direction.\n    - It reasserts the Secretary of State’s authority over Foreign Service Officers, Civil Service Officers, or other staff, under the supervision of the President.\n    - It directs the Secretary of State to reform the foreign service in areas such as recruiting, performance, evaluation, and retention standards to ensure only the most qualified and committed individuals represent American interests abroad.\n    - The Secretary of State is tasked with ensuring the faithful and effective implementation of the President’s foreign policy agenda, in accordance with applicable law.\n    - The Order empowers the Secretary of State to revise or replace the Foreign Affairs Manual and any other procedural documents that guide the operations of the foreign service.\n\n**ALIGNING DIPLOMACY WITH AMERICA’S INTERESTS:**President Trump is committed to safeguarding the integrity of U.S. foreign policy by ensuring that America’s interests are prioritized through a unified diplomatic voice, with related personnel held accountable to the President’s vision.\n    - This Executive Order reaffirms the constitutional authority of the President over foreign policy, duly ensuring that diplomatic actions align with President Trump’s directives.\n    - The personnel procedures of agencies charged with implementing the President’s foreign policy must provide an effective and efficient means for ensuring that officers and employees faithfully implement the President’s policies.\n    - The Order guarantees a strong and effective approach to international relations that always serves U.S. interests first.\n    - No longer will America be taken advantage of by foreign nations or by rogue actors who undermine our sovereignty or security.\n\n**KEEPING HIS PROMISE TO PUT AMERICA FIRST:**This Executive Order builds on bold actions already taken by President Trump and reinforces his promise to put America first in every aspect of foreign relations.   \n    - On Day One, President Trump signed an “America First Policy Directive” to the Secretary of State that declared that the United States’ foreign policy must always put the interests of America and its citizens first.\n    - President Trump was elected to achieve peace through strength and ensure foreign policy reflects U.S. values, sovereignty, and security.\n    - This Executive Order solidifies President Trump’s commitment to accountability and effectiveness in America’s diplomatic service.\n",
  "summary": "On February 12, 2025, President Donald J. Trump signed an executive order to establish a clear and unified voice for America's foreign relations. This order emphasizes the President's control over foreign policy, mandating that all personnel involved in its implementation operate under his direction. It also grants the Secretary of State the authority to revise Foreign Service procedures, including recruitment and evaluation, to ensure that only the most qualified individuals represent America abroad.\n\nThe executive order aims to align U.S. diplomacy with national interests, prioritizing America's interests in foreign policy decisions. The order strengthens accountability for personnel and procedures involved in implementing foreign policy, reinforcing the President's constitutional authority. This initiative is part of a broader effort to ensure foreign policy reflects U.S. values and enhances national security.\n\nBuilding on previous initiatives such as the 'America First Policy Directive,' this order reiterates President Trump's commitment to prioritizing American interests and ensuring a strong diplomatic stance that protects sovereignty and security. The order's provisions aim to prevent foreign nations or actors from undermining U.S. sovereignty, strengthening America’s position on the international stage.",
  "eli5": "President Trump made a new rule to make sure that people working on America's relationships with other countries follow his plans closely. This rule is meant to keep America safe and strong when dealing with other nations.",
  "keywords": [
    "Executive Order",
    "Foreign Relations",
    "Donald Trump",
    "America First",
    "Diplomacy",
    "Secretary of State",
    "Foreign Policy"
  ],
  "issues": [
    "Potential overcentralization of authority under the President and Secretary of State",
    "Impact on existing diplomatic procedures and international relationships",
    "Assessment of the effectiveness of the proposed recruitment and evaluation reforms"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}