{
  "title": "Fact Sheet: President Donald J. Trump Requires Transparency for the American People About Wasteful Spending – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Requires Transparency for the American People About Wasteful Spending",
  "og:description": "PROMOTING TRANSPRENCY AND ACCOUNTABILITY: Today, President Donald J. Trump signed a memorandum requiring radical transparency regarding wasteful spending",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-requires-transparency-for-the-american-people-about-wasteful-spending/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-18T21:46:01+00:00",
  "article:modified_time": "2025-02-18T21:46:02+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Requires Transparency for the American People About Wasteful Spending\t\t\t\t\n\nFebruary 18, 2025\n\n**PROMOTING TRANSPRENCY AND ACCOUNTABILITY:** Today, President Donald J. Trump signed a memorandum requiring radical transparency regarding wasteful spending of taxpayer dollars by the federal government.\n    - It requires all departments and agencies to disclose details about terminated programs, cancelled contracts, and discontinued grants to the fullest extent allowed by law.\n\n**PUTTING AN END TO WASTEFUL SPENDING:**By signing this memorandum, President Trump recognizes that the American people have a right to see how the federal government has wasted their hard-earned wages.\n    - The United States government has wasted taxpayer dollars on programs, contracts, and grants that do not serve the American public’s interests.\n    - For too long, taxpayers have subsidized ideological projects overseas and domestic organizations engaged in actions that undermine the national interest.\n    - The Biden Administration spent billions on electric vehicle charging stations, yet only a fraction were completed.\n    - The Trump Administration recently canceled a Biden-era $50 million environmental justice grant to an organization that believes “climate justice travels through a Free Palestine.”\n    - Numerous USAID grants have come under review, including $1.5 million to “advance diversity equity and inclusion in Serbia’s workplaces and business communities.”\n    - The Biden Administration gave nearly $4.6 million to help foreign groups promote LGBT projects like drag shows and pride parades. \n    - The Trump Administration found $20 billion parked at a financial institution by the Biden Administration to fund partisan pet projects.\n    - President Trump’s Department of Education canceled $881 million in unnecessary contracts that were not benefiting students, including a $4.6 million contract just to coordinate Zoom and in-person meetings.\n    - President Trump’s Department of Government Efficiency (DOGE) has already recovered $1.9 billion in taxpayer funds “misplaced” by the Biden Administration.\n    - The Government Accountability Office released a report last year estimating that the federal government “could lose between $233 billion and $521 billion annually to fraud.”\n\n**KEEPING HIS PROMISE TO THE AMERICAN PEOPLE:** President Trump campaigned on a promise to return power back to the American people by “cleaning out the Deep State, firing rogue bureaucrats and career politicians, and targeting government corruption.”\n    - President Trump recently signed a memorandum to stop last-minute collective bargaining agreements issued by the Biden Administration designed to constrain the incoming Trump Administration from reforming government.\n    - President Trump created the Department of Government Efficiency (DOGE) to bring accountability and transparency to federal spending, ensuring taxpayer dollars are spent wisely and effectively.\n    - President Trump launched a 10-to-1 deregulation initiative, ensuring every new rule is justified by clear benefits for taxpayers.\n    - The Trump Administration is aggressively investigating Biden-era programs that wasted billions of taxpayer dollars on inefficient and politically-driven projects, including canceling unnecessary government contracts and grants that do not serve the national interest.\n",
  "summary": "President Donald J. Trump signed a memorandum on February 18, 2025, aimed at increasing transparency and accountability in federal spending. This action mandates federal departments and agencies to disclose information regarding wasteful expenditures in terminated programs, canceled contracts, and discontinued grants. The initiative emphasizes the right of the American people to understand how their tax money is used and aims to eliminate expenditure on programs that do not serve the nation's interest.\n\nThe memorandum highlights specific examples of wasteful spending from the previous Biden Administration, such as funding for electric vehicle charging stations and environmental justice grants that Trump labeled as unnecessary or ideologically driven. It also reviews funds labeled ‘misplaced’ and reclaims billions in taxpayer funds. To further these efforts, President Trump created the Department of Government Efficiency (DOGE) to ensure that government spending is efficient and effective, and to eliminate waste.\n\nThis action is part of President Trump's broader effort to reform government by reducing regulatory burdens and targeting perceived inefficiencies within government spending practices. The aim is to cut down on what he views as politically-motivated projects that do not align with national interests, thereby restoring power and reducing financial waste.",
  "eli5": "President Trump wants to make sure the US government tells everyone about money it's wasting and stops doing that. He asks different parts of the government to check where money is spent badly and fix it, making sure people's taxes are used wisely.",
  "keywords": [
    "Transparency",
    "Accountability",
    "Wasteful Spending",
    "Federal Government",
    "Trump Administration",
    "Biden Administration",
    "Taxpayer Funds",
    "Department of Government Efficiency",
    "Fraud",
    "Government Contracts",
    "Grants"
  ],
  "issues": [
    "Verification of claims regarding wasteful spending",
    "Impact on existing federal programs",
    "Potential political biases in defining wasteful spending",
    "Implementation of transparency measures",
    "Effect on relations with international organizations"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}