{
  "title": "Fact Sheet: President Donald J. Trump Proceeds with Tariffs on Imports from Canada and Mexico – ]\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Proceeds with Tariffs on Imports from Canada and Mexico",
  "og:description": "SAFEGUARDING THE NATION: President Donald J. Trump is proceeding with implementing tariffs on Canada and Mexico under the International Emergency Economic",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-proceeds-with-tariffs-on-imports-from-canada-and-mexico/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-04T04:59:00+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Proceeds with Tariffs on Imports from Canada and Mexico\t\t\t\t\n\nMarch 3, 2025\n\n**SAFEGUARDING THE NATION:**President Donald J. Trump is proceeding with implementing tariffs on Canada and Mexico under the International Emergency Economic Powers Act (IEEPA) to combat the extraordinary threat to U.S. national security, including our public health posed by unchecked drug trafficking.\n    - While President Trump gave both Canada and Mexico ample opportunity to curb the dangerous cartel activity and influx of lethal drugs flowing into our country, they have failed to adequately address the situation.\n    - The flow of contraband drugs like fentanyl into the United States, through illicit distribution networks, has created a national emergency, including a public health crisis.\n    - Mexican drug trafficking organizations, the world’s leading fentanyl traffickers, operate unhindered due to an intolerable relationship with the government of Mexico.       - The government of Mexico has afforded safe havens for the cartels to engage in the manufacturing and transportation of dangerous narcotics, which collectively have led to the overdose deaths of hundreds of thousands of American victims.\n      - Mexican drug cartels are known for extreme brutality, corruption, and control over entire regions of Mexico.\n      - The Sinaloa and Jalisco cartels manufacture fentanyl in clandestine labs they oversee in Mexico, in both powder form and pressed into fake pills, and traffic it into the United States through the many entry points they control. 97% of seizures occur at the U.S.-Mexico border.\n      - Cartel violence, including armed drones and roadside IEDs, are coming in closer and closer proximity to the U.S.-Mexico border as cartels are more actively targeting one another as well as Mexican military and law enforcement personnel.\n      - This alliance with the Mexican government endangers the national security of the United States, and we must eradicate the influence of these dangerous cartels. \n    - There is also a growing presence of Mexican cartels operating fentanyl and nitazene synthesis labs in Canada.        - A recent study recognized Canada’s heightened domestic production of fentanyl, and its growing footprint within international narcotics distribution.\n      - Canada-based drug trafficking organizations maintain robust “super labs,” mostly in rural and dense areas in western Canada, some of which can produce 44 to 66 pounds of fentanyl weekly.\n      - Last year’s northern border fentanyl seizures, though smaller than Mexico’s, could kill 9.5 million Americans due to the drug’s potency—proof of Canada’s growing role in this crisis.\n      - Fentanyl seizures at the northern border in the first four months of this fiscal year are quickly closing in on what was seized the entirety of  fiscal year 2022. \n    - Both nations’ failure to arrest traffickers, seize drugs, or coordinate with U.S. law enforcement constitutes an unusual and extraordinary threat to America’s security—demanding IEEPA action to force accountability and protect American lives.\n\n**PRESIDENT TRUMP IS KEEPING HIS PROMISE TO STOP THE FLOOD OF ILLEGAL ALIENS AND DRUGS:**When voters overwhelmingly elected Donald J. Trump as President, they gave him a mandate to seal the border. That is exactly what he is doing.\n    - The Biden Administration’s policies fueled the worst border crisis in U.S. history.       - More than 10 million illegal aliens attempted to enter the United States under Biden’s leadership.\n      - This problem is not confined to the southern border—encounters at the northern border with Canada are rising as well.\n      - The sustained influx of illegal aliens has profound consequences on every aspect of our national life—overwhelming our schools, lowering our wages, reducing our housing supply and raising rents, overcrowding our hospitals, draining our welfare system, and causing crime.  \n      - Gang members, smugglers, human traffickers, and illegal drugs and narcotics of all kinds are pouring across our borders and into our communities.          - Last fiscal year, Customs and Border Protection (CBP) apprehended more than 21,000 pounds of fentanyl at our borders, enough fentanyl to kill more than 4 billion people.\n        - Since 2023, the Drug Enforcement Administration (DEA) has seized more than 25,697 kilograms of fentanyl pills and more than 7,272 kilograms of fentanyl powder at the southern border, and more than 659 kilograms of fentanyl pills and more than 650 kilograms of fentanyl powder at the northern border.\n        - From 2021 to present, fentanyl has been the leading cause of drug overdose deaths in the U.S., followed by methamphetamine, cocaine, and heroin in that order.\n        - According to the CDC, 68 percent of all drug poisoning deaths in 2022 and 2023—216,294 total—were caused by synthetic opioids, primarily fentanyl.\n        - It is estimated that federal officials are only able to seize a fraction of the fentanyl smuggled across the southern border.  \n        - More Americans are dying from fentanyl overdoses each year than the number of American lives lost in the entirety of the Vietnam War. \n\n**BUILDING ON PAST SUCCESS:**President Trump continues to demonstrate his commitment to ensuring U.S. trade policy serves the national interest.\n    - As President Trump said in the Presidential Memorandum on American First Trade Policy, trade policy is a critical component in national security.\n    - President Trump promised in November to “sign all necessary documents to charge Mexico and Canada a 25% Tariff on ALL products coming into the United States, and its ridiculous Open Borders. This Tariff will remain in effect until such time as Drugs, in particular Fentanyl, and all Illegal Aliens stop this Invasion of our Country!”\n    - During his first term as President of the United States, President Trump established the President’s Commission on Combating Drug Addiction and the Opioid Crisis and declared the Opioid Crisis a public health emergency.\n    - President Trump also has a long record of putting America first on trade. In his first term, President Trump successfully used threats of tariffs on Mexico to help secure our border.\n    - When our national security was threatened by a global oversupply of steel and aluminum, President Trump took swift action to protect America’s national security by implementing tariffs on imports of these goods.\n",
  "summary": "President Donald J. Trump announced the imposition of tariffs on imports from Canada and Mexico on March 3, 2025, under the International Emergency Economic Powers Act (IEEPA). This action is part of an effort to combat the national security threat posed by drug trafficking, particularly involving fentanyl. Trump's administration argues that both Canada and Mexico have failed to prevent drug trafficking cartels from operating within their borders, resulting in a public health crisis in the United States.\n\nThe decision to enforce tariffs is seen as a measure to hold these countries accountable and curb the influx of drugs and illegal immigration. The administration claims that the Biden administration's border policies led to a severe border crisis and increased illegal entries at both northern and southern borders. Trump's approach builds on his earlier policies focused on national security and trade, emphasizing tariffs as a tool to press foreign governments to take action against drug cartels.\n\nAdditionally, the statement highlights the dramatic impact of fentanyl on American public health, with fentanyl overdoses leading to more deaths than those seen in the Vietnam War. The administration's strategy is framed as fulfilling Trump's promise to secure American borders and reduce illegal drugs by leveraging economic sanctions through trade policies.",
  "eli5": "President Trump put new taxes on things we buy from Canada and Mexico. He wants them to help stop the bad guys sending dangerous drugs to America.",
  "keywords": [
    "Trump",
    "tariffs",
    "Canada",
    "Mexico",
    "IEEPA",
    "drug trafficking",
    "fentanyl",
    "national security",
    "border crisis",
    "trade policy"
  ],
  "issues": [
    "The efficacy and impact of tariffs as a tool to combat drug trafficking.",
    "Impact of these measures on U.S. international relations with Canada and Mexico.",
    "The overall strategy to address the drug crisis beyond tariffs.",
    "Potential economic consequences of tariffs on U.S. consumers and businesses."
  ],
  "citations": [
    "International Emergency Economic Powers Act (IEEPA)"
  ],
  "document_type": "Fact Sheet"
}