{
  "title": "Fact Sheet: President Donald J. Trump Announces Actions to Make Healthcare Prices Transparent – ]\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Announces Actions to Make Healthcare Prices Transparent",
  "og:description": "EMPOWERING PATIENTS THROUGH RADICAL PRICE TRANSPARENCY: Today, President Donald J. Trump signed an Executive Order to empower patients with clear,",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-announces-actions-to-make-healthcare-prices-transparent/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-25T22:47:25+00:00",
  "article:modified_time": "2025-02-25T22:47:26+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Announces Actions to Make Healthcare Prices Transparent**\n\nFebruary 25, 2025\n\n**EMPOWERING PATIENTS THROUGH RADICAL PRICE TRANSPARENCY:**Today, President Donald J. Trump signed an Executive Order to empower patients with clear, accurate, and actionable healthcare pricing information.\n    - The order directs the Departments of the Treasury, Labor, and Health and Human Services to rapidly implement and enforce the Trump healthcare price transparency regulations, which were slow walked by the prior administration.       - The departments will ensure hospitals and insurers disclose actual prices, not estimates, and take action to make prices comparable across hospitals and insurers, including prescription drug prices.\n      - The departments will update their enforcement policies to ensure hospitals and insurers are in compliance with requirements to make prices transparent. \n\n**LOWERING COSTS FOR AMERICAN FAMILIES:**When healthcare prices are hidden, large corporate entities like hospitals and insurance companies benefit at the expense of American patients. Price transparency will lower healthcare prices and help patients and employers get the best deal on healthcare.\n    - Prices vary widely from hospital to hospital in the same region. One patient in Wisconsin saved $1,095 by shopping for two tests between two hospitals located within 30 minutes of one another.\n    - One economic analysis found that President Trump’s original price transparency rules, if fully implemented, could deliver savings of $80 billion for consumers, employers, and insurers by 2025.\n    - Employers can lower their healthcare costs by an average of 27% on 500 common services by better shopping for care.\n    - The Biden Administration was sued in 2023 for not enforcing the prescription drug transparency requirements. The Trump Administration will work to hold health plans accountable for making drug prices transparent.\n\n**DELIVERING ON PROMISES TO PUT AMERICAN PATIENTS FIRST:**President Trump is delivering on his promise to once again put American patients first by holding the healthcare industrial complex accountable for delivering transparent prices.\n    - In his first Administration, President Trump took historic action by mandating that hospitals and insurers make prices public.\n    - While the prior Administration failed to prioritize further implementation and enforcement of these requirements, President Trump is delivering on his promises to make the healthcare system more affordable and easier to navigate for patients.\n    - American patients are fed up with the status quo – 95% deem healthcare price transparency an important priority, with six in ten saying it should be a top priority of the government.\n    - President Trump has long pushed for radical price transparency to ensure the healthcare system puts American patients first:       - President Trump: “Our goal was to give patients the knowledge they need about the real price of healthcare services.  They’ll be able to check them, compare them, go to different locations, so they can shop for the highest-quality care at the lowest cost.  And this is about high-quality care.  You’re also looking at that.  You’re looking at comparisons between talents, which is very important.  And then, you’re also looking at cost.  And, in some cases, you get the best doctor for the lowest cost.  That’s a good thing.”\n",
  "summary": "On February 25, 2025, President Donald J. Trump signed an executive order to enhance healthcare price transparency, aimed at empowering patients by ensuring they have access to clear and actionable pricing information. This executive order mandates the Departments of the Treasury, Labor, and Health and Human Services to implement these regulations promptly and enforce compliance. The goal is to make hospitals and insurers disclose actual prices and promote comparability, including for prescription drugs.\n\nThe initiative seeks to reduce healthcare costs for American families by eliminating hidden prices that benefit large corporate entities. With price transparency, patients and employers can identify more affordable healthcare options, potentially saving billions. In 2023, the Biden Administration faced legal challenges for not meeting drug price transparency requirements, and the Trump Administration intends to hold entities accountable.\n\nPresident Trump reiterates his commitment to prioritizing patient needs by ensuring that healthcare pricing is accessible, allowing patients to make informed decisions about their care. The initiative builds on his previous actions, emphasizing the need for a healthcare system that offers high-quality care at competitive prices, benefiting consumers financially and providing access to the best medical talent.",
  "eli5": "President Trump made a rule to show clear prices for healthcare so people can choose better and cheaper doctors and medicines. This helps everyone save money and find good doctors more easily.",
  "keywords": [
    "Donald Trump",
    "healthcare",
    "price transparency",
    "executive order",
    "patients",
    "hospitals",
    "insurers",
    "prescription drugs",
    "cost reduction",
    "American families"
  ],
  "issues": [
    "Enforcement of pricing transparency regulations",
    "Potential legal challenges related to compliance",
    "Impact on hospitals and insurers revealing actual pricing"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}