{
  "title": "Fact Sheet: President Donald J. Trump Rapidly Expands Timber Production – ]\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Rapidly Expands Timber Production",
  "og:description": "FREEING OUR FORESTS: Today, President Donald J. Trump signed an Executive Order to immediately increase domestic timber production and streamline federal",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-rapidly-expands-timber-production/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-01T15:27:56+00:00",
  "article:modified_time": "2025-03-03T15:28:30+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Rapidly Expands Timber Production\t\t\t\t\n\nMarch 1, 2025\n\n**FREEING OUR FORESTS:** Today, President Donald J. Trump signed an Executive Order to immediately increase domestic timber production and streamline federal policies to enhance forest management, reduce wildfire risks, and decrease reliance on imported timber.\n    - The Order calls for new or updated agency guidance to facilitate increased timber production, sound forest management, reduced delivery times, and decreased timber supply uncertainty.\n    - It cuts red tape in order to streamline timber production and identifies measures to boost timber sales from public lands.\n    - It pushes for quicker approvals under the Endangered Species Act so that forestry projects are not delayed by slow reviews.\n\n**BOOSTING DOMESTIC TIMBER PRODUCTION:**President Trump is committed to creating jobs, lowering constructions costs, and making the United States more self-reliant by tapping into its abundant timber resources.\n    - Timber production is essential for the construction, energy, manufacturing, and shipping industries.  \n    - The United States has an abundance of timber resources that can more than meet domestic timber production needs, but burdensome Federal policies have prevented full utilization of these resources while the unfair trade practices of exporters into our country are depressing demand.\n    - Increased timber production will help reduce foreign dependency, lower costs, and enhance economic security.       - Currently, the United States imports billions of dollars’ worth of lumber annually, which could be produced domestically. \n    - Strong national security requires a reliable domestic wood industry for military and civilian needs.\n    - The wood industry is a crucial part of the U.S. manufacturing and defense industrial base, supporting 500 facilities and over 750,000 direct and indirect jobs.\n    - As the recent California wildfires have shown, forest management and wildfire risk reduction are essential to protecting American lives and communities.\n\n**IMPROVING FOREST MANAGEMENT:** President Trump has long been an advocate for improving forest management to protect communities and natural resources.\n    - In his first term, President Trump signed legislation to improve the funding process for the Forest Service and the Department of the Interior’s wildfire suppression operations.       - Before this fix, the funding structure forced firefighting agencies to take funds from prevention programs to cover the rising costs of responding to wildfires. \n    - President Trump took strong action to prevent and combat the spread of wildfires, focusing on strategies to reduce fire risks and improve forest conditions.\n    - As part of his broader America First agenda, President Trump is focused on reducing foreign dependency on foreign goods across various sectors, including steel, aluminum, and copper.\n",
  "summary": "On March 1, 2025, President Donald J. Trump signed an Executive Order aimed at increasing domestic timber production and improving forest management. The order seeks to streamline federal policies, reduce wildfire risks, and decrease the United States' reliance on imported timber. Key measures include cutting regulatory red tape, boosting timber sales from public lands, and expediting approvals under the Endangered Species Act to prevent delays in forestry projects. The initiative is part of President Trump's broader goal to create jobs, reduce construction costs, and make the United States more self-reliant in various industrial sectors.\n\nThe Executive Order emphasizes the strategic importance of the wood industry to national security and economic stability, noting that a robust domestic timber industry could meet most of the country's needs and reduce foreign dependency. It also supports over 750,000 jobs and is integral to the U.S. manufacturing and defense sectors. This directive builds on Trump's previous efforts to improve forest management and address wildfire risks, highlighting the connection between proper forest management and the safety of American communities, as evidenced by recent wildfires in California.",
  "eli5": "President Trump signed a paper to help America make more of its own wood from trees so we don't have to buy it from other countries. This will help make jobs and keep forests safe from fires.",
  "keywords": [
    "Donald Trump",
    "Executive Order",
    "timber production",
    "forest management",
    "wildfire risk",
    "domestic industry",
    "economic security",
    "Endangered Species Act"
  ],
  "issues": [
    "Impact on endangered species due to streamlined approval processes.",
    "Effectiveness of increased timber production on reducing wildfire risks.",
    "Environmental concerns related to increased logging."
  ],
  "citations": [
    "Endangered Species Act"
  ],
  "document_type": "Fact Sheet"
}