{
  "title": "Fact Sheet: President Donald J. Trump Directs Administration to Advance Lumbee Tribe Recognition – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Directs Administration to Advance Lumbee Tribe Recognition",
  "og:description": "DIRECTING PLAN FOR RECOGNITION OF LARGEST TRIBE EAST OF MISSISSIPPI RIVER: Today, President Donald J. Trump signed a Presidential Memorandum to the",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-directs-administration-to-advance-lumbee-tribe-recognition/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T20:41:10+00:00",
  "article:modified_time": "2025-01-28T17:00:34+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Directs Administration to Advance Lumbee Tribe Recognition \t\t\t\t\n\nJanuary 23, 2025\n\nDIRECTING PLAN FOR RECOGNITION OF LARGEST TRIBE EAST OF MISSISSIPPI RIVER: Today, President Donald J. Trump signed a Presidential Memorandum to the Secretary of the Interior to submit a plan to advance full federal recognition of the Lumbee Tribe of North Carolina.\n    - The memorandum establishes that it is the policy of the United States to support federal recognition and full tribal benefits for the Lumbee Tribe of North Carolina.\n    - It directs the Secretary of the Interior to submit a plan to assist the Lumbee Tribe in obtaining full federal recognition through legislation or other available mechanisms, including the right to receive full federal benefits.  \n\nFULL FEDERAL RECOGNITION IS LONG OVERDUE: The Lumbee have long been recognized at the state and federal level, but further federal action is required for full federal recognition and the accompanying benefits and protections.\n    - The State of North Carolina recognized the Lumbee Tribe in 1885, and in 1956, President Dwight D. Eisenhower signed the 1956 Lumbee Act, which recognized the Lumbee but denied them some federal benefits.\n    - Tribes can gain federal recognition by: (1) Act of Congress; (2) the Department of the Interior’s Office of Federal Acknowledgement process; or (3) federal court decision.       - President Trump’s memorandum directs the Secretary of the Interior to analyze these legal pathways for advancing Lumbee recognition. \n    - Federal recognition grants tribes’ certain governmental autonomy, land protections, and access to federal programs and services, like health care through the Indian Health Service.\n\nDELIVERING ON PROMISE TO SUPPORT RECOGNITION: President Trump promised to support federal recognition of the Lumbee Tribe.\n\nOn September 23, 2024, President Trump stated: “Today, I’m officially announcing that, if I am elected in November, I will sign legislation granting the great Lumbee Tribe federal recognition that it deserves.”\n",
  "summary": "President Donald J. Trump signed a Presidential Memorandum on January 23, 2025, directing the Secretary of the Interior to devise a plan to advance the federal recognition of the Lumbee Tribe of North Carolina. This action underscores the United States' policy to support tribal recognition and benefits. The memorandum necessitates that the Interior Secretary explores legal avenues, such as congressional action or other mechanisms, to achieve full recognition and access to federal benefits for the tribe.\n\nThe Lumbee Tribe has a history of partial recognition, being acknowledged by North Carolina since 1885 and through the 1956 Lumbee Act signed by President Dwight D. Eisenhower, which denied some federal benefits. The federal recognition process can occur through congressional acts, Interior Department processes, or court decisions. The President's directive aims at ensuring the tribe receives governmental autonomy, land protections, and access to federal programs like those provided by the Indian Health Service, addressing a long-standing promise to support the Lumbee Tribe.",
  "eli5": "President Trump wants to make sure the Lumbee Tribe is fully recognized by the government so they can get special help and benefits, just like other tribes.",
  "keywords": [
    "Lumbee Tribe",
    "federal recognition",
    "Presidential Memorandum",
    "Donald Trump",
    "Secretary of the Interior",
    "North Carolina",
    "tribal benefits"
  ],
  "issues": [
    "The specific plan for achieving recognition is not detailed.",
    "Potential political, legal, and bureaucratic hurdles in achieving recognition.",
    "Impact of previous recognition attempts and failures."
  ],
  "citations": [
    "1956 Lumbee Act"
  ],
  "document_type": "Presidential Memorandum"
}