{
  "title": "Fact Sheet: President Donald J. Trump Expands Educational Opportunities for American Families – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Expands Educational Opportunities for American Families",
  "og:description": "DEFENDING PARENTAL RIGHTS AND EDUCATIONAL OPPORTUNITY: Today, President Donald J. Trump signed an Executive Order expanding educational freedom and",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-expands-educational-opportunities-for-american-families/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-30T20:16:02+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# ********Fact Sheet: President Donald J. Trump Expands Educational Opportunities for American Families********\n\nJanuary 30, 2025\n\n**DEFENDING PARENTAL RIGHTS AND EDUCATIONAL OPPORTUNITY:**Today, President Donald J. Trump signed an Executive Order expanding educational freedom and opportunity for families. It recognizes that parents, not the government, play a fundamental role in choosing and directing the upbringing and education of their children.\n    - It directs the Department of Education to issue guidance on how the States can use federal funding formulas to support their K-12 scholarship programs.\n    - It directs the Secretary of Education to prioritize school choice programs in the Department’s discretionary grant programs.\n    - The Order requires the Department of Health and Human Services to issue guidance on how states receiving block grants for children and families can use those funds to support educational alternatives, including private and faith-based options.\n    - It directs the Secretary of Defense to submit a plan to the President for how military families can use Department of Defense funds to send their children to the school of their choice.\n    - The Order also directs the Secretary of the Interior to submit a plan to the President for how families with students attending Bureau of Indian Education schools can use federal funds to send their children to the school of their choice.\n\n**EMPOWERING PARENTS AND STUDENTS THROUGH SCHOOL CHOICE:**Every child deserves the best education available, regardless of their zip code. However, for generations, our government-assigned education system has failed millions of parents, students, and teachers. This Executive Order begins to rectify that wrong by opening up opportunities for students to attend the school that best fits their needs.\n    - According to the latest National Assessment of Educational Progress (NAEP), 70% of 8th graders were below proficient in reading and 72% were below proficient in math. 40% of 4th graders did not even meet the basic reading levels. \n    - Standardized test scores have essentially been flat for over 30 years, despite hundreds of billions of dollars spent on government-run education.\n    - A dozen states have universal or near universal school choice programs and 33 states have some form of school choice program.\n    - School choice programs have a strong record of improving students’ academic performance.\n    - School choice has proven to be cost effective and saves taxpayer dollars.\n    - Parents report higher levels of school safety for their children who participate in school choice programs.\n    - Support for school choice is overwhelming, with 70% of Democrats, 73% of Black Americans, and 69% of Hispanic Americans in favor of it.\n    - President Trump is dedicated to ensuring every child has the opportunity to receive a world-class education.\n\n**FULFILLING THE PROMISE TO STRENGTHEN EDUCATION THROUGH FREEDOM AND OPPORTUNITY:**President Trump promised to bring school choice to every family in the Nation. Today’s historic executive order is a critical step in delivering on that promise, and builds on the long list of accomplishments from the first Trump Administration, including:\n    - Calling on Congress to pass the School Choice Now Act and the Education Freedom Scholarships and Opportunity Act.\n    - Providing in-person learning options for low-income parents forced to send their children to virtual school during the pandemic.\n    - Re-authorizing the D.C. Opportunity Scholarship program twice.\n    - Investing nearly $1.5 billion in the development of public charter schools, helping this innovative sector grow to 7,500 charter schools serving more than 3 million students.\n    - Allowing parents across the nation to withdraw up to $10,000 tax-free per year from 529 education savings plans to cover public, private, or religious K-12 schooling costs, thanks to the President’s historic tax cuts.\n\nParents can be confident that under his Administration, President Trump will provide every available opportunity for parents to enrich the education of their children through individual choice.\n",
  "summary": "On January 30, 2025, President Donald J. Trump signed an Executive Order aimed at expanding educational opportunities and choices for American families. The order emphasizes the role of parents in deciding the educational path of their children and directs various federal departments to promote school choice initiatives. The Department of Education is instructed to support state K-12 scholarship programs, and the Department of Health and Human Services and Department of Defense are tasked with facilitating educational alternatives for families, including private and faith-based options. Additionally, the Secretary of the Interior is to evaluate how families at Bureau of Indian Education schools might utilize federal funds for school choice.\n\nThe Executive Order seeks to address shortcomings in the traditional government-assigned education system, which has not met parental or student expectations. The U.S. educational outcomes, according to recent data, have stagnated despite significant financial investments, highlighting the need for this school choice initiative. The order also aims to fulfill President Trump's promise to enhance educational freedom, drawing on past efforts such as advocating for the School Choice Now Act and increasing public charter school funding.\n\nThere is strong public support for school choice, with significant backing from Democrats, Black Americans, and Hispanic Americans. The Executive Order envisions enabling every family the option to provide their children with a tailored, high-quality education through various educational choices.",
  "eli5": "President Trump wants parents to choose which school is best for their kids. He made rules to help families use different types of schools, like private ones, not just regular ones. This way, kids can learn better and have more choices.",
  "keywords": [
    "President Donald J. Trump",
    "educational opportunities",
    "school choice",
    "Executive Order",
    "Department of Education",
    "parents' rights",
    "K-12",
    "scholarship programs",
    "Secretary of Defense",
    "Bureau of Indian Education",
    "charter schools",
    "School Choice Now Act"
  ],
  "issues": [
    "Impact of the Executive Order on traditional public schools",
    "Potential misuse of federal funds",
    "Implementation challenges for states",
    "Long-term effectiveness of school choice programs",
    "Equity and access for underprivileged students"
  ],
  "citations": [
    "School Choice Now Act",
    "Education Freedom Scholarships and Opportunity Act"
  ],
  "document_type": "Fact Sheet"
}