{
  "title": "Fact Sheet: President Donald J. Trump Withdraws from Anti-American UN Organizations – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Withdraws from Anti-American UN Organizations – The White House",
  "og:description": "ENDING U.S. SUPPORT FOR RADICAL ANTI-AMERICAN UN ORGANIZATIONS: Today, President Donald J. Trump signed an Executive Order withdrawing the United States",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-withdraws-from-anti-american-un-organizations/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-05T02:12:28+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Withdraws from Anti-American UN Organizations\t\t\t\t\n\nFebruary 4, 2025\n\n**ENDING U.S. SUPPORT FOR RADICAL ANTI-AMERICAN UN ORGANIZATIONS**: Today, President Donald J. Trump signed an Executive Order withdrawing the United States from the UN Human Rights Council (UNHRC) and prohibiting any future funding for the UN Relief and Works Agency for the Near East (UNRWA).\n    - The Executive Order also requires the Secretary of State to review and report to the President on which international organizations, conventions, or treaties promote radical or anti-American sentiment.       - The UN Educational, Science, and Cultural Organization (UNESCO), in particular, will undergo a review under an expedited timeline due to its history of anti-Israel bias. \n    - The Executive Order will prohibit the United States from providing any additional funding to UNRWA, which has consistently shown itself to be anti-Semitic and anti-Israel, as evidenced by the number of its staff members who took part in the horrific October 7 th  terrorist attacks against Israel.       - UNRWA facilities have repeatedly been used by Hamas and other terrorist groups to store weapons and build tunnels. \n\n**STANDING UP FOR HUMAN RIGHTS**: The UN Human Rights Council (UNHRC) has not fulfilled its purpose and continues to be used as a protective body for countries committing horrific human rights violations.\n    - Countries such as Iran, China, and Cuba use the UNHRC to shield themselves despite having egregious records of human rights violations and abuses.\n    - The UNHRC has demonstrated consistent bias against Israel, focusing on it unfairly and disproportionately in council proceedings.\n    - In 2018, the year President Trump withdrew from the UNHRC in his first administration, the organization passed more resolutions condemning Israel than Syria, Iran, and North Korea combined.\n\n**BUILDING ON PAST SUCCESS**: During his first administration, President Trump stopped funding the UN Relief and Works Agency (UNRWA) and withdrew the United States from the UN Human Rights Council (UNHRC) and the UN Educational, Science and Cultural Organization (UNESCO).\n    - President Trump in 2017: “The United Nations must reform if it is to be an effective partner in confronting threats to sovereignty, security, and prosperity.”\n    - After the U.S. withdrew from UNESCO, the organization took steps to improve its relationship with Israel.\n    - President Trump successfully stopped U.S. funding to UNRWA during his first administration. The Biden Administration initially resumed funding until being forced to confront UNRWA’s corruption after the October 7 th  attacks, and President Trump is once again taking action to stand up for human rights by withdrawing the United States from this corrupt organization for good.\n",
  "summary": "**Summary**\n\nOn February 4, 2025, President Donald J. Trump signed an Executive Order to withdraw the United States from the UN Human Rights Council (UNHRC) and to halt future funding for the UN Relief and Works Agency for the Near East (UNRWA). The Executive Order also tasked the Secretary of State with reviewing international organizations for radical or anti-American sentiment, especially focusing on the UN Educational, Science, and Cultural Organization (UNESCO) due to its history of anti-Israel bias. The decision to cease funding UNRWA is based on accusations of anti-Semitic activities and misuse of facilities for terrorist purposes.\n\nThe Executive Order highlights concerns over the UNHRC's effectiveness, suggesting that countries with poor human rights records such as Iran, China, and Cuba have used it to evade scrutiny. The document cites past actions, noting that President Trump previously withdrew from and defunded several UN organizations during his first administration, emphasizing that these entities needed reform to be effective partners in addressing global threats. This move is positioned as an extension of Trump's previous policies aimed at protecting human rights and ensuring UN accountability.",
  "eli5": "**ELI5**\n\nPresident Trump told the United Nations he doesn't want to be part of certain groups because he thinks they're being unfair and aren't helping the world like they should. He also decided not to give them any more money.",
  "keywords": [
    "Donald Trump",
    "UN Withdrawal",
    "UNHRC",
    "UNRWA",
    "Executive Order",
    "Human Rights",
    "Foreign Policy",
    "UNESCO"
  ],
  "issues": [
    "Effectiveness of UNHRC and other organizations",
    "Potential bias against Israel",
    "Use of UNRWA facilities by terrorist groups",
    "U.S. international relations impact"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}