{
  "title": "Fact Sheet: President Donald J. Trump Restores Merit and Lethality to America's Armed Forces – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Restores Merit and Lethality to America's Armed Forces",
  "og:description": "ELIMINATING RACE- AND SEX-BASED DISCRIMINATION WITHIN THE ARMED FORCES: Today, President Donald J. Trump signed an Executive Order to restore merit and",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-restores-merit-and-lethality-to-americas-armed-forces/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-27T13:31:00+00:00",
  "article:modified_time": "2025-01-28T13:31:46+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# ****Fact Sheet: President Donald J. Trump Restores Merit and Lethality to America’s Armed Forces****\n\nJanuary 27, 2025\n\n**ELIMINATING RACE- AND SEX-BASED DISCRIMINATION WITHIN THE ARMED FORCES:** Today, President Donald J. Trump signed an Executive Order to restore merit and lethality to America’s fighting force. \n    - The Executive Order bans the use of discriminatory race- or sex-based preferences by any element of the Armed Forces, the Department of Defense, or the Department of Homeland Security.         - This Order also abolishes any remnant of the Diversity, Equity and Inclusion (DEI) bureaucracy within the Department of Defense and the Department of Homeland Security. \n    - The Secretary of Defense will task the Department of Defense with conducting an internal review of all instances of race- or sex-based discrimination based on Department of Defense DEI initiatives.       - This Order also requires the Secretary of Defense and the Secretary of Homeland Security to review the curriculum at the United States Service Academies and other academic institutions to ensure these institutions eliminate radical DEI and gender ideologies. \n\n**ENDING AN ERA OF ASSAULT ON MILITARY DISCIPLINE AND CULTURE:**Foreign adversaries are strengthening their fighting forces every day while the United States has deliberately been focused on radical ideology like DEI. The world is watching. \n    - Prior to harmful changes introduced by the Obama and Biden administrations, the United States military offered equality of opportunity to every American capable of and interested in serving their country. Yet these two administrations exploited the military in favor of identity politics—harming our national defense, undermining the non-political nature of our military, and eroding morale and recruitment.       - Due to this “woke” assault, the Services together logged their lowest recruiting records since 1940 with a 41,000-troop shortfall in 2023. \n    - Today’s Order moves our military away from this dark period and renews esprit de corps, readiness, and focus. It returns the Pentagon to the warfighter.\n    - This Order also combats ideologies that seek to divide our Armed Forces by race, sex or other immutable characteristics and thus tear at cohesion and military efficacy.\n\n**RESTORING A WARFIGHTING MINDSET:** The Armed Forces of the United States exist to preserve our freedom and the American way of life. \n    - President Trump is committed to a merit-based system of sex-neutral policies and colorblind recruitment, promotion, and retention that will return our military to greatness.\n    - President Trump vowed to get rid of the “woke” generals who prioritize social experiments over warfighting. He stated in his 2024 reelection campaign that “…[y]ou can’t have a woke military…You need people that want to win. They want to win wars. That’s what their purpose is, to win wars, not to be woke… but we do have great military.”\n",
  "summary": "On January 27, 2025, President Donald J. Trump signed an Executive Order with the aim of restoring merit and enhancing lethality within the United States Armed Forces. This directive bans the use of discriminatory preferences based on race or sex within the military, Department of Defense, and Department of Homeland Security. Furthermore, it abolishes the Diversity, Equity, and Inclusion (DEI) practices within these departments. The Order also tasks the Secretary of Defense with reviewing the curriculum of United States Service Academies to remove radical DEI and gender ideologies.\n\nThe Executive Order addresses concerns about military discipline and culture by refocusing away from what it describes as radical ideologies, believed to have undermined the effectiveness of the armed forces. It suggests that former policies introduced by the Obama and Biden administrations compromised the military's non-political nature and recruitment strength. President Trump aims to return the military to a focus on readiness and cohesiveness by rejecting ideologies that could divide institutions based on race or sex.\n\nThe mandate emphasizes a return to a warfighting mindset characterized by merit-based, sex-neutral, and colorblind recruitment and promotion systems. President Trump has also expressed intentions to remove leaders who prioritize social experimentation over military preparedness, aligning with his campaign assertion to maintain a military focused on winning wars rather than adhering to perceived \"woke\" concerns.",
  "eli5": "President Trump made new rules for the military to focus on picking the best people no matter their race or gender. He wants the military to be strong and ready to win wars, not to focus on issues like being \"woke\".",
  "keywords": [
    "Trump",
    "Armed Forces",
    "Executive Order",
    "Merit",
    "Lethality",
    "Diversity",
    "Equity",
    "Inclusion",
    "Military",
    "Discrimination",
    "Recruitment"
  ],
  "issues": [
    "Potential backlash from those supporting DEI initiatives",
    "Impact on morale and diversity within the Armed Forces",
    "Possible legal challenges to the Executive Order"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}