{
  "title": "Fact Sheet: President Donald J. Trump Prohibits Federal Funding for COVID-19 Vaccine Mandates in Schools – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Prohibits Federal Funding for COVID-19 Vaccine Mandates in Schools",
  "og:description": "PROHIBITING COVID-19 VACCINE MANDATES IN SCHOOLS: Today, President Donald J. Trump signed an Executive Order to prohibit federal funding for COVID-19",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-prohibits-federal-funding-for-covid-19-vaccine-mandates-in-schools/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-15T00:06:28+00:00",
  "article:modified_time": "2025-02-15T00:06:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# ****Fact Sheet: President Donald J. Trump Prohibits Federal Funding for COVID-19 Vaccine Mandates in Schools****\n\nFebruary 14, 2025\n\n**PROHIBITING COVID-19 VACCINE MANDATES IN SCHOOLS**: Today, President Donald J. Trump signed an Executive Order to prohibit federal funding for COVID-19 vaccine mandates in schools.\n    - The Order bars federal funds from being used to support or subsidize an educational service agency, state education agency, local education agency, elementary school, secondary school, or institution of higher education that requires students to have received a COVID-19 vaccination to attend in-person education programs.\n    - The Secretary of Education and the Secretary of Health and Human Services must issue guidelines for compliance and provide a plan to end coercive COVID-19 vaccine mandates, including a report on non-compliant entities and a process for preventing federal funds from supporting educational entities that impose COVID-19 vaccine mandates.\n\n**PUTTING AN END TO GOVERNMENT OVERREACH**: President Trump is committed to protecting personal freedoms and ensuring that Americans’ education isn’t conditioned on unnecessary government mandates.\n    - Some schools and universities have recently enforced or continue to enforce COVID-19 vaccine mandates, making access to education contingent upon students’ COVID-19 vaccination status.\n    - These mandates pressure students into making COVID-19 vaccine decisions based on government coercion, rather than on their own informed choices.\n    - Studies consistently show that children and young adults have an incredibly low risk of developing a severe illness from COVID-19.\n    - With COVID-19 vaccine mandates threatening educational opportunities for students, parents are being forced into a difficult position: comply with a controversial mandate or risk their child’s educational future.\n\n**PROMISES MADE, PROMISES KEPT**: President Trump is dedicated to ensuring that American students are not forced to choose between their education and their medical freedom.\n    - President Trump is fulfilling his campaign promise: “I will not allow schools to impose COVID vaccine mandates…”\n    - In President Trump’s first week in office, he reinstated service members who were dismissed for refusing the COVID vaccine, with full back pay and benefits.\n    - President Trump is as a staunch advocate for parental rights, ensuring families have the primary role in shaping their children’s educational journey, free from undue bureaucratic mandates.\n",
  "summary": "On February 14, 2025, President Donald J. Trump signed an Executive Order to prohibit federal funding from supporting schools that enforce COVID-19 vaccine mandates. This order affects educational service agencies, state and local education agencies, elementary, secondary, and higher education institutions. The Secretary of Education and the Secretary of Health and Human Services are tasked with issuing compliance guidelines and reporting non-compliant entities.\n\nPresident Trump emphasizes protecting personal freedoms and opposes what he perceives as government overreach through COVID-19 vaccine mandates in educational settings. He argues that these mandates pressure students into decisions that should be based on personal choice rather than government influence. The order reflects Trump's commitment to ensuring educational opportunities are not jeopardized by medical requirements, fulfilling a campaign promise to prevent vaccine mandates in schools.",
  "eli5": "President Trump made a rule that schools can't get certain money if they say kids must get COVID shots to go to school in person. He thinks this keeps kids' choices free.",
  "keywords": [
    "Trump",
    "Executive Order",
    "COVID-19",
    "vaccine mandates",
    "education",
    "federal funding",
    "personal freedom"
  ],
  "issues": [
    "Potential confusion over the implementation and enforcement of this order.",
    "Challenges related to balancing public health needs and personal freedoms.",
    "Impact on schools that have already implemented vaccine requirements."
  ],
  "citations": [],
  "document_type": "Executive Order"
}