{
  "title": "Fact Sheet: President Donald J. Trump Restores American Competitiveness and Security in FCPA Enforcement – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Restores American Competitiveness and Security in FCPA Enforcement",
  "og:description": "ELIMINATING UNDUE BARRIERS TO U.S. SUCCESS: Today, President Donald J. Trump signed an Executive Order to restore American competitiveness and security by",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-restores-american-competitiveness-and-security-in-fcpa-enforcement/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T04:01:58+00:00",
  "article:modified_time": "2025-02-11T04:01:59+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Restores American Competitiveness and Security in FCPA Enforcement \t\t\t\t\n\nFebruary 10, 2025\n\n**ELIMINATING UNDUE BARRIERS TO U.S. SUCCESS:**Today, President Donald J. Trump signed an Executive Order to restore American competitiveness and security by ordering revised, reasonable enforcement guidelines for the Foreign Corrupt Practices Act (FCPA) of 1977.\n    - The Order directs the Attorney General to pause FCPA actions until she issues revised FCPA enforcement guidance that promotes American competitiveness and efficient use of federal law enforcement resources.       - Past and existing FCPA actions will be reviewed.\n      - Future FCPA investigations and enforcement actions will be governed by this new guidance and must be approved by the Attorney General. \n\n**AMERICAN SECURITY REQUIRES AMERICAN ECONOMIC STRENGTH:**American national security depends on America and its companies gaining strategic commercial advantages around the world, and President Trump is stopping excessive, unpredictable FCPA enforcement that makes American companies less competitive.\n    - U.S. companies are harmed by FCPA overenforcement because they are prohibited from engaging in practices common among international competitors, creating an uneven playing field.\n    - Strategic advantages in critical minerals, deep-water ports, and other key infrastructure or assets around the world are critical to American national security.\n    - FCPA overenforcement infringes upon the President’s Article II authority to conduct foreign affairs, necessitating this review and new enforcement policies.\n    - Over time, FCPA interpretation and enforcement by U.S. prosecutors has broadened, imposing a growing cost on our Nation’s economy.       - In 2024, the DOJ and SEC filed 26 FCPA-related enforcement actions, and at least 31 companies were under investigation by year end.        - Over the past decade, there has been an average of 36 FCPA-related enforcement actions per year, draining resources from both American businesses and law enforcement. \n\n**PUTTING AMERICA FIRST:**President Trump is committed to prioritizing American economic and security interests and ensuring U.S. businesses have the tools to succeed globally.\n\nSince returning to office, President Trump has signed several executive actions aimed at enhancing American economic competitiveness, including an Executive Order to strengthen U.S. leadership in artificial intelligence (AI) and tariffs on Mexico, Canada, and China to protect the American people.  a 10-to-1 deregulation initiative, ensuring every new rule is justified by clear benefits\n\nPresident Trump renegotiated trade deals, including the United States-Mexico-Canada Agreement (USMCA) to secure better terms for American workers and businesses.\n\nPresident Trump has worked to cut burdensome regulations that hinder U.S. businesses, ensuring they can operate efficiently and competitively on the world stage.\n\nPresident Trump: “We have to save our country. Every policy must be geared toward that which supports the American worker, the American family, and businesses, both large and small, and allows our country to compete with other nations on a very level playing field…”\n",
  "summary": "President Donald J. Trump signed an Executive Order on February 10, 2025, aimed at revising the enforcement guidelines of the Foreign Corrupt Practices Act (FCPA) of 1977. The order requires the Attorney General to halt current FCPA actions until new enforcement guidelines that promote American competitiveness are established. This move is said to align with the administration's aim to eliminate barriers that affect U.S. companies' ability to compete globally. Past and future FCPA cases will be reviewed under the new guidelines and approved by the Attorney General.\n\nThe administration argues that overly strict enforcement of the FCPA has disadvantaged American companies, especially in strategic sectors like critical minerals and infrastructure, which are vital for national security. The document refers to the necessity of balancing legal enforcement with the President’s constitutional authority to conduct foreign affairs, which has apparently been hampered by overextended FCPA actions. Historically, FCPA enforcement has been costly, with numerous cases and investigations in past years, emphasizing the need for updated policies.\n\nPresident Trump's actions are part of a broader strategy to reinforce American economic primacy and security. Other initiatives mentioned include enhancing leadership in artificial intelligence, implementing a 10-to-1 deregulation initiative, and renegotiating key trade agreements like the USMCA. Trump emphasizes that U.S. policies should support American workers and businesses to ensure fair competition globally.",
  "eli5": "President Trump made rules easier for American businesses by changing the way a law called the FCPA is enforced, so they can be more competitive and strong in the world.",
  "keywords": [
    "Trump",
    "FCPA",
    "Executive Order",
    "American competitiveness",
    "national security",
    "business deregulation"
  ],
  "issues": [
    "Potential conflict with international anti-corruption norms",
    "Impacts of reduced enforcement on global corruption",
    "Balance between national security and ethical business practices"
  ],
  "citations": [
    "Foreign Corrupt Practices Act (FCPA) of 1977",
    "Article II of the U.S. Constitution"
  ],
  "document_type": "Fact Sheet"
}