{
  "title": "Fact Sheet: President Donald J. Trump Restores Maximum Pressure on Iran – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Restores Maximum Pressure on Iran",
  "og:description": "RESTORING MAXIMUM PRESSURE ON IRAN: Today, President Donald J. Trump signed a National Security Presidential Memorandum (NSPM) restoring maximum pressure",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-restores-maximum-pressure-on-iran/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-05T02:10:15+00:00",
  "article:modified_time": "2025-02-05T02:10:16+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Restores Maximum Pressure on Iran\t\t\t\t\n\nFebruary 4, 2025\n\n**RESTORING MAXIMUM PRESSURE ON IRAN:** Today, President Donald J. Trump signed a National Security Presidential Memorandum (NSPM) restoring maximum pressure on the government of the Islamic Republic of Iran, denying Iran all paths to a nuclear weapon, and countering Iran’s malign influence abroad.\n    - The NSPM establishes that:       - Iran should be denied a nuclear weapon and intercontinental ballistic missiles;       - Iran’s terrorist network should be neutralized; and        - Iran’s aggressive development of missiles, as well as other asymmetric and conventional weapons capabilities, should be countered. \n    - The NSPM directs the Secretary of the Treasury to impose maximum economic pressure on the Government of Iran, including by sanctioning or imposing enforcement mechanisms on those acting in violation of existing sanctions.       - The Treasury Secretary will also issue guidance for all relevant business sectors – including shipping, insurance, and port operators – about the risks to any person that knowingly violates U.S. sanctions with respect to Iran or an Iranian terror proxy.       - The Secretary of State will also modify or rescind existing sanctions waivers and cooperate with the Secretary of Treasury to implement a campaign aimed at driving Iran’s oil exports to zero.        - The United States Permanent Representative to the United Nations will work with key allies to complete the snapback of international sanctions and restrictions on Iran. \n\n**PROTECTING THE HOMELAND FROM IRAN:** The previous Administration’s tolerance of Iran’s threats to American citizens and companies ends now.\n    - The Attorney General will pursue all available legal steps to investigate, disrupt, and prosecute financial and logistical networks, operatives, or front groups inside the United States that are sponsored by Iran or an Iranian terror proxy.       - The Attorney General will prosecute leaders and members of Iranian-funded terrorist groups that have captured, harmed, or killed American citizens and seek their arrest and extradition to the United States. \n\n**TAKING IRAN’S NUCLEAR PROGRAM OFF THE TABLE:** President Trump will not tolerate Iran possessing a nuclear weapons capability, nor will he stand for their sustained sponsorship of terrorism, especially against U.S. interests.\n    - In 2020, President Trump declared that “as long as [he is] President of the United States, Iran will never be allowed to have a nuclear weapon.”\n    - Today’s NSPM fulfills the President’s 2020 vow to contend with Iran’s pernicious influence across the globe:       - “For far too long — all the way back to 1979, to be exact — nations have tolerated Iran’s destructive and destabilizing behavior in the Middle East and beyond.  Those days are over.  Iran has been the leading sponsor of terrorism, and their pursuit of nuclear weapons threatens the civilized world.  We will never let that happen.”\n",
  "summary": "On February 4, 2025, President Donald J. Trump signed a National Security Presidential Memorandum aiming to restore maximum pressure on Iran and prevent it from developing nuclear weapons. This Memorandum directs significant economic and diplomatic measures to counter Iran's nuclear ambitions and its influence abroad. The initiative includes denying Iran a nuclear weapon and ballistic missiles, neutralizing its terrorist networks, and countering its development of missile and weapon capabilities. The Treasury Secretary is tasked with imposing economic sanctions and providing guidance to businesses about the risks associated with violating U.S. sanctions. Additionally, efforts will be made to drive Iran's oil exports to zero with support from international allies.\n\nThe directive also outlines steps to protect the U.S. homeland from perceived Iranian threats. The Attorney General is instructed to take legal actions against Iranian-sponsored groups operating within the United States. This includes investigating, disrupting, and prosecuting networks and individuals associated with these groups. The initiative reaffirms President Trump's commitment to not allow Iran to possess nuclear weapons, emphasizing the end of tolerance for its destabilizing behavior and sponsorship of terrorism.\n\nThe actions underscore an assertive approach, aligning with the President's previous statements, to counter Iran's influence and protect global stability. This NSPM fulfills promises made in the past regarding stringent measures against Iran's activities.",
  "eli5": "The President made new rules to stop Iran from building dangerous weapons and causing trouble. Special people will make sure Iran can't sell stuff to other countries or support bad groups, keeping everyone safe.",
  "keywords": [
    "Trump",
    "Iran",
    "National Security Presidential Memorandum",
    "sanctions",
    "nuclear weapons",
    "terrorism",
    "economic pressure",
    "international relations"
  ],
  "issues": [
    "Potential for increased tensions with Iran and its allies.",
    "Impact on global oil markets due to aim of stopping Iran's oil exports.",
    "Legal and political challenges in implementing sanctions."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}