{
  "title": "Fact Sheet: President Donald J. Trump Honors Jocelyn Nungaray – ]\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Honors Jocelyn Nungaray",
  "og:description": "HONORING A GREAT AMERICAN: Today, President Donald J. Trump signed an Executive Order renaming the Anahuac National Wildlife Refuge the “Jocelyn Nungaray",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-honors-jocelyn-nungaray/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T03:57:38+00:00",
  "article:modified_time": "2025-03-05T03:57:39+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Honors Jocelyn Nungaray**\n\nMarch 4, 2025\n\n**HONORING A GREAT AMERICAN:**Today, President Donald J. Trump signed an Executive Order renaming the Anahuac National Wildlife Refuge the “Jocelyn Nungaray National Refuge” to forever commemorate the life of twelve-year-old Jocelyn Nungaray, who was tragically killed on June 17, 2024.\n    - Jocelyn Nungaray was brutally murdered in Houston, Texas, and two Venezuelan illegal aliens—both reputedly Tren de Aragua gang members—have been charged with this heinous crime.       - These two men, caught near the border in early 2024, were released into the United States due to the Biden Administration’s immigration policies. Only weeks later, they are alleged to have ended Jocelyn’s life in a senseless act of violence. \n    - The Anahuac National Wildlife Refuge will bear her name as a lasting tribute to her love of animals and passion for finding them homes. \n\n**THE TRAGIC CONSEQUENCES OF BIDEN’S BORDER CRISIS:**The prior administration’s approach to immigration left the nation vulnerable to criminal activity and chaos.\n    - While Biden was president, the southern border was overrun by cartels, criminal gangs, suspected terrorists, human traffickers, smugglers, and illicit narcotics.\n    - The Biden Administration’s lenient border policies allowed thousands of illegal aliens to enter the United States daily.\n    - The Biden Administration admitted that 40% of its catch-and-release migrants totally disappeared.\n    - Innocent American lives have been taken due to this migrant invasion, with victims like Laken Riley, Jocelyn Nungaray, and Rachel Morin tragically losing their lives because of crimes committed by illegal aliens.\n    - At one point in 2024, illegal aliens made up 75% of arrests in Midtown Manhattan for crimes like assault, robbery, and domestic violence.\n\n**SEALING THE BORDER:**On Day One, President Trump secured the border and launched a comprehensive strategy to restore safety and sovereignty to the United States.\n    - Apprehensions at the southern border are now at a record low, down 94% from a year ago.\n    - Would-be illegal border crossers have reportedly “given up” and are returning to their own countries as ICE arrests of illegal immigrants have surged 627%.\n    - Mexican cartel operatives say they are “genuinely” fearful “for the first time in years” amid the Trump Administration’s crackdown.\n    - Since returning to office, President Trump has:       - Declared a national emergency at the southern border.\n      - Deployed additional personnel to the border, including members of the Armed Forces and the National Guard.\n      - Restarted border wall construction.\n      - Designated international cartels and other criminal organizations—such as MS-13 and Tren de Aragua—as Foreign Terrorist Organizations and Specially Designated Global Terrorists.\n      - Suspended the entry of aliens into the U.S.\n      - Called for enhanced vetting and screening of aliens.\n      - Required the identification of countries that warrant a partial or full suspension on the admission of nationals.\n      - Restarted the detention and removal of aliens who are in violation of Federal law.\n      - Directed the Administration to resume the Migrant Protection Protocols—also known as “Remain in Mexico”—as soon as practicable.\n      - Ended the use of the CBP One app.\n      - Terminated all categorical parole programs, such as the “Processes for Cubans, Haitians, Nicaraguans, and Venezuelans,” that are contrary to President Trump’s immigration agenda.\n      - Ended automatic citizenship for children of illegal aliens.\n      - Paused the operation of the U.S. Refugee Admissions Program (USRAP).\n      - Ended catch-and-release policies.\n      - Revoked the Biden Administration’s disastrous executive actions that essentially opened our southern border.\n      - Detained the most dangerous illegal criminal aliens in Guantanamo Bay. \n      - Ended the taxpayer subsidization of illegal immigration.\n",
  "summary": "# Summary\n\nPresident Donald J. Trump issued an Executive Order on March 4, 2025, renaming the Anahuac National Wildlife Refuge to honor Jocelyn Nungaray, a twelve-year-old girl tragically killed in Houston, Texas, in 2024. Jocelyn's murder is linked to two Venezuelan illegal aliens, allegedly gang members, who were released into the U.S. due to the immigration policies of the previous administration. The renaming aims to pay tribute to Jocelyn’s love of animals.\n\nThe document also critiques the immigration policies during President Biden's administration, blaming them for allowing numerous illegal entries into the U.S. and linking these policies to increased criminal activity. President Trump’s administration has since intensified border security measures, significantly reducing illegal crossings and apprehensions. These measures include resuming border wall construction, enacting stricter immigration policies, and reversing many of Biden's immigration initiatives.",
  "eli5": "President Trump changed the name of a park to remember a girl named Jocelyn who loved animals and was sadly killed. He's also making the border safer by adding more guards and stopping people from coming in without permission.",
  "keywords": [
    "Trump",
    "Jocelyn Nungaray",
    "Executive Order",
    "Anahuac National Wildlife Refuge",
    "immigration",
    "border security",
    "Biden policies",
    "gang violence",
    "illegal immigration"
  ],
  "issues": [
    "Accusations regarding Biden's immigration policies",
    "Use of tragic events for political purposes",
    "Impact of immigration policies on crime rates",
    "Legal implications of renaming national landmarks"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}