{
  "title": "Fact Sheet: President Donald J. Trump Reins in Independent Agencies to Restore a Government that Answers to the American People – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Reins in Independent Agencies to Restore a Government that Answers to the American People",
  "og:description": "RESTORING DEMOCRACY AND ACCOUNTABILITY IN GOVERNMENT: Today, President Donald J. Trump signed an Executive Order ensuring that all federal agencies are",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-reins-in-independent-agencies-to-restore-a-government-that-answers-to-the-american-people/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-18T22:02:16+00:00",
  "article:modified_time": "2025-02-18T22:02:17+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Reins in Independent Agencies to Restore a Government that Answers to the American People**\n\nFebruary 18, 2025\n\n**RESTORING DEMOCRACY AND ACCOUNTABILITY IN GOVERNMENT:** Today, President Donald J. Trump signed an Executive Order ensuring that all federal agencies are accountable to the American people, as required by the Constitution. Under this Executive Order:\n    - The Order notes that Article II of the U.S. Constitution vests all executive power in the President, meaning that  all  executive branch officials and employees are subject to his supervision.\n    - Therefore, because all executive power is vested in the President, all agencies must: (1) submit draft regulations for White House review—with no carve-out for so-called independent agencies, except for the monetary policy functions of the Federal Reserve; and (2) consult with the White House on their priorities and strategic plans, and the White House will set their performance standards.\n    - The Office of Management and Budget will adjust so-called independent agencies’ apportionments to ensure tax dollars are spent wisely.\n    - The President and the Attorney General (subject to the President’s supervision and control) will interpret the law for the executive branch, instead of having separate agencies adopt conflicting interpretations.\n\n**REINING IN INDEPENDENT AGENCIES:** So-called independent agencies like the Federal Trade Commission (FTC), Federal Communications Commission (FCC), and Securities and Exchange Commission (SEC) have exercised enormous power over the American people without Presidential oversight.\n    - These agencies issue rules and regulations that cost billions of dollars and implicate some of the most controversial policy matters, and they do so without the review of the democratically elected President.\n    - They also spend American tax dollars and set priorities without consulting the President, while setting their own performance standards.\n    - Now they will no longer impose rules on the American people without oversight or accountability.\n\n**ENSURING A GOVERNMENT THAT ANSWERS TO THE PEOPLE:**This order fulfills President Trump’s promise to restore constitutional governance and accountability to the entire executive branch.\n    - Executive power without responsibility has no place in our Republic. The United States was founded on the principle that the government should be accountable to the people. That is why the Founders created a single President who is alone vested with “the executive Power” and responsibility to “take Care that the Laws be faithfully executed.”\n    - Voters and the President can now hold all Federal agencies—not just Cabinet departments—responsible for their decisions, as the Constitution demands.\n",
  "summary": "On February 18, 2025, President Donald J. Trump signed an Executive Order aimed at increasing accountability within the federal government by ensuring that all federal agencies adhere to the supervision of the President. The Executive Order emphasizes that the President, according to Article II of the U.S. Constitution, holds all executive power and therefore has oversight over all executive branch officials and employees. As part of the directive, independent agencies will be required to submit their draft regulations for review by the White House and consult with it on their priorities and strategic plans. Additionally, the Office of Management and Budget will oversee financial allocations to ensure efficient use of tax dollars.\n\nThe Executive Order specifically targets independent agencies like the Federal Trade Commission, the Federal Communications Commission, and the Securities and Exchange Commission, which were previously operating without direct Presidential oversight. These agencies will now be accountable for their rule-making processes, financial expenditures, and performance standards under the purview of the President. This initiative seeks to reinforce democratic principles by making the government more accountable to the electorate and aligning all federal agencies with constitutional governance.\n\nBy restoring oversight, President Trump's order aims to assure voters that all federal entities are justifiably accountable for their actions and decisions. The overarching goal is to cultivate a governance system where the executive branch is answerable to the public, aligning with the Founders' vision of a government that serves its citizens responsibly and transparently.",
  "eli5": "President Trump made a new rule saying that he should be in charge of all parts of the government, even the ones that usually work alone. This way, he can make sure they are doing what people want and using money wisely.",
  "issues": [
    "Potential overreach of executive power and impact on the independence of regulatory agencies.",
    "Implications for the separation of powers and checks and balances in government.",
    "Legal challenges regarding the constitutional authority of the President over independent agencies."
  ],
  "citations": [
    "U.S. Constitution Article II"
  ],
  "keywords": [
    "Executive Order",
    "Independent Agencies",
    "Presidential Oversight",
    "Federal Government Accountability",
    "Constitutional Governance",
    "Article II"
  ],
  "document_type": "Fact Sheet"
}