{
  "title": "Fact Sheet: President Donald J. Trump Directs Administration to Advance Lumbee Tribe Recognition – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Directs Administration to Advance Lumbee Tribe Recognition – The White House",
  "og:description": "DIRECTING PLAN FOR RECOGNITION OF LARGEST TRIBE EAST OF MISSISSIPPI RIVER: Today, President Donald J. Trump signed a Presidential Memorandum to the",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-directs-administration-to-advance-lumbee-tribe-recognition/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T20:41:10+00:00",
  "article:modified_time": "2025-01-24T17:27:56+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Directs Administration to Advance Lumbee Tribe Recognition \t\t\t\t\n\nJanuary 23, 2025\n\nDIRECTING PLAN FOR RECOGNITION OF LARGEST TRIBE EAST OF MISSISSIPPI RIVER: Today, President Donald J. Trump signed a Presidential Memorandum to the Secretary of the Interior to submit a plan to advance full federal recognition of the Lumbee Tribe of North Carolina.\n    - The memorandum establishes that it is the policy of the United States to support federal recognition and full tribal benefits for the Lumbee Tribe of North Carolina.\n    - It directs the Secretary of the Interior to submit a plan to assist the Lumbee Tribe in obtaining full federal recognition through legislation or other available mechanisms, including the right to receive full federal benefits.  \n\nFULL FEDERAL RECOGNITION IS LONG OVERDUE:The Lumbee have long been recognized at the state and federal level, but further federal action is required for full federal recognition and the accompanying benefits and protections.\n    - The State of North Carolina recognized the Lumbee Tribe in 1885, and in 1956, President Dwight D. Eisenhower signed the 1956 Lumbee Act, which recognized the Lumbee but denied them some federal benefits.\n    - Tribes can gain federal recognition by: (1) Act of Congress; (2) the Department of the Interior’s Office of Federal Acknowledgement process; or (3) federal court decision.       - President Trump’s memorandum directs the Secretary of the Interior to analyze these legal pathways for advancing Lumbee recognition. \n    - Federal recognition grants tribes’ certain governmental autonomy, land protections, and access to federal programs and services, like health care through the Indian Health Service.\n\nDELIVERING ON PROMISE TO SUPPORT RECOGNITION: President Trump promised to support federal recognition of the Lumbee Tribe.\n\nOn September 23, 2024, President Trump stated: “Today, I’m officially announcing that, if I am elected in November, I will sign legislation granting the great Lumbee Tribe federal recognition that it deserves.”\n",
  "summary": "## Summary\n\nPresident Donald J. Trump signed a Presidential Memorandum on January 23, 2025, directing the Secretary of the Interior to advance full federal recognition for the Lumbee Tribe of North Carolina. This memorandum establishes a policy supporting federal recognition and full tribal benefits for the Lumbee Tribe, which is the largest tribe east of the Mississippi River. It instructs the Secretary to devise a plan that would assist the tribe in achieving full recognition through legislative actions or other mechanisms.\n\nThe Lumbee Tribe has been a subject of recognition processes at both state and federal levels for many decades. Despite state recognition since 1885 and a 1956 act signed by President Eisenhower confirming their status, the Lumbee have been denied some federal benefits. President Trump aims to explore several pathways, including congressional acts or Department of Interior processes, to grant full recognition. This effort is aligned with President Trump's promise to support the tribe, reiterated in a statement on September 23, 2024.\n",
  "eli5": "President Trump wants to help a big group of Native Americans called the Lumbee Tribe get special government help. He asked a government office to make a plan to give them these benefits.",
  "keywords": [
    "Lumbee Tribe",
    "federal recognition",
    "President Donald J. Trump",
    "Presidential Memorandum",
    "tribal benefits",
    "Secretary of the Interior",
    "North Carolina"
  ],
  "issues": [
    "Whether the mechanisms identified will indeed result in federal recognition",
    "Potential political challenges in Congress to pass necessary legislation",
    "Historical denial of federal benefits under the 1956 Lumbee Act"
  ],
  "citations": [
    "1956 Lumbee Act"
  ],
  "document_type": "Presidential Memorandum"
}