{
  "title": "Fact Sheet: President Donald J. Trump Establishes White House Faith Office – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Establishes White House Faith Office",
  "og:description": "ESTABLISHING A FAITH OFFICE: Today, President Donald J. Trump signed an Executive Order to establish the White House Faith Office. The White House Faith",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-establishes-white-house-faith-office/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-07T21:46:15+00:00",
  "article:modified_time": "2025-02-09T21:49:38+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Establishes White House Faith Office\t\t\t\t\n\nFebruary 7, 2025\n\n**ESTABLISHING A FAITH OFFICE:** Today, President Donald J. Trump signed an Executive Order to establish the White House Faith Office.\n    - The White House Faith Office will empower faith-based entities, community organizations, and houses of worship to better serve families and communities.\n    - The Office will be housed in the Domestic Policy Council and will consult with experts within the faith community and make recommendations to the President regarding changes to policies, programs, and practices to better align with the American values.\n    - The Office will coordinate with agencies on religious liberty training and on identifying and promoting grant opportunities for non-profit faith-based entities, community organizations, and houses of worship.  \n    - The Office will work in collaboration with the Attorney General to identify failures to enforce constitutional and Federal statutory protections for religious liberty.\n\n**DEFENDING RELIGIOUS LIBERTY:** President Trump is committed to protecting the liberty and freedom of our religious communities, organizations, and students.\n    - In his first week, President Trump pardoned Christians and pro-life activists who were persecuted by the weaponized Biden Administration for praying and peacefully living out their faith.\n    - President Trump reinstated service members forced out of the military over the COVID-19 vaccine mandate, including those discharged over their religious objections to the vaccine.\n    - Last week, President Trump signed executive actions to ensure Federal overreach and taxpayer dollars will no longer force individuals to violate their commitment to life.\n    - Yesterday, President Trump signed an Executive Order establishing a task force to eradicate anti-Christian bias.\n\n**PROMISES MADE, PROMISES KEPT:** These actions build on President Trump’s longstanding commitment to safeguarding the fundamental right to religious freedom, as evidenced by his first term.\n    - In 2017, President Trump stopped the Johnson Amendment from interfering with pastors’ rights to speak their minds.\n    - In 2018, President Trump established the Faith and Opportunity Initiative which recognized and promoted the essential contributions of faith-based organizations.\n    - In 2018, President Trump reversed the Obama-era policy that prevented the government from providing disaster relief to religious organizations.\n    - In 2019, President Trump hosted a Global Call to Protect Religious Freedom event at the United Nations and called on the international community and business leaders to work to protect religious freedom around the world.\n    - In 2020, President Trump issued new guidance to protect religious liberty and expression in public schools.\n",
  "summary": "**Establishing a New Faith Office**: On February 7, 2025, President Donald J. Trump signed an Executive Order to create the White House Faith Office. This office is designed to provide support to faith-based entities, community organizations, and places of worship in their efforts to aid families and communities. It is part of the Domestic Policy Council and will work with faith community experts to provide recommendations to the President about aligning policies and practices with American values. Additionally, the office will work with government agencies to deliver religious liberty training and grant opportunities to faith-based non-profits and communities, and collaborate with the Attorney General to address failures in enforcing religious liberty protections.\n\n**Commitment to Religious Liberty**: President Trump emphasized his pledge to protect religious freedoms for communities, groups, and individuals. In his first week, he pardoned certain Christians and pro-life activists perceived as persecuted by the previous administration and reinstated military service members dismissed due to the COVID-19 vaccine mandate, specifically those with religious objections. Furthermore, recent executive actions were signed to ensure federal policies do not infringe on religious beliefs, such as a task force to combat anti-Christian bias.\n\n**Building on Past Initiatives**: These steps are in line with efforts from Trump's first term to uphold religious freedom. Actions taken in previous years, such as halting the Johnson Amendment in 2017, initiating the Faith and Opportunity Initiative in 2018, and hosting a Global Call to Protect Religious Freedom in 2019, highlight a consistent focus on religious protections and the role of faith-based organizations in the public sphere.",
  "eli5": "**President Trump** started a new office to help **churches** and **faith groups** do good things in their communities! He also made decisions to help people practice their beliefs freely and to **protect religious freedom** like he has before.",
  "keywords": [
    "Donald Trump",
    "White House Faith Office",
    "religious liberty",
    "Executive Order",
    "faith-based organizations",
    "COVID-19 vaccine mandate",
    "anti-Christian bias",
    "Johnson Amendment"
  ],
  "issues": [
    "No clear citation of specific statutory authority for establishing the office",
    "Potential concerns over separation of church and state",
    "Vagueness in identifying what constitutes 'anti-Christian bias'"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}