{
  "title": "Fact Sheet: President Donald J. Trump Addresses Human Rights Violations in South Africa – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Addresses Human Rights Violations in South Africa",
  "og:description": "ADDRESSING HUMAN RIGHTS VIOLATIONS IN SOUTH AFRICA: On Friday, President Donald J. Trump signed an Executive Order to address serious human rights",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-addresses-human-rights-violations-in-south-africa/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-07T21:39:08+00:00",
  "article:modified_time": "2025-02-09T21:40:14+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Addresses Human Rights Violations in South Africa\t\t\t\t\n\nFebruary 7, 2025\n\n**ADDRESSING HUMAN RIGHTS VIOLATIONS IN SOUTH AFRICA:** On Friday, President Donald J. Trump signed an Executive Order to address serious human rights violations occurring in South Africa.\n    - As encapsulated in its recent land confiscation act to seize disfavored citizens’ property without compensation, the government of South Africa blatantly discriminates against ethnic minority descendants of settler groups.\n    - As long as South Africa continues to support bad actors on the world stage and allows violent attacks on innocent disfavored minority farmers, the United States will stop aid and assistance to the country.\n    - The United States will establish a plan to resettle disfavored minorities in South Africa discriminated against because of their race as refugees.\n\n**STANDING UP AGAINST INJUSTICE AND OPPRESSION:**President Donald J. Trump is committed to holding South Africa accountable for its actions.\n    - South Africa has taken positions against the United States and its allies.       - Merely two months after the October 7 th  terrorist attacks on Israel, South Africa accused Israel, not Hamas, of genocide in the International Court of Justice.        - South Africa also strengthened ties with Iran, which supports terrorism globally. \n    - While championing terrorism and autocratic regimes abroad, South Africa has committed similar human rights violations at home. The recent Expropriation Act enables the government of South Africa to seize ethnic minority descendants of settler groups’ agricultural property without compensation.                - The Expropriation Act follows countless government policies designed to dismantle equal opportunity in employment, education, and business, and hateful rhetoric and government actions fueling disproportionate violence against racially disfavored landowners.        - Years ago, the South African government disbanded volunteer forces defending rural farmers, turning a blind eye to the ensuing farm attacks. \n\n**REAFFIRMING OUR COMMITMENT TO HUMAN RIGHTS:**A commitment to human rights is central to President Trump’s America First agenda.\n    - President Trump: “South Africa is confiscating land, and treating certain classes of people very badly […] I will be cutting off all future funding to South Africa until a full investigation of this situation has been completed!”\n    - President Trump believes in sending a clear message to the world’s bad actors—and to their victims—by condemning human rights abuses in no uncertain terms.\n",
  "summary": "On February 7, 2025, President Donald J. Trump signed an Executive Order addressing human rights violations in South Africa. The focus is on the land confiscation act which targets ethnic minority descendants of settler groups by seizing their property without compensation. The order indicates that the U.S. will halt all aid and assistance to South Africa as long as it supports global bad actors and allows violent attacks on minority farmers.\n\nThe Executive Order is a response to South Africa's positions against the U.S. and its allies, such as accusations against Israel following terrorist attacks and building relations with Iran. Within South Africa, laws like the Expropriation Act are seen as dismantling equal opportunities and inciting violence against racially disfavored landowners. President Trump is committed to sending a strong message against such human rights abuses by pausing funding until a detailed investigation is complete.\n\nThis approach is aligned with President Trump's America First agenda, emphasizing a firm stance against global injustices and fostering accountability for nations like South Africa that engage in discriminatory practices and support terrorism globally. The U.S. plans to offer resettlement for those racially discriminated against under these policies.",
  "eli5": "President Trump decided to stop giving money to South Africa because he believes they're being unfair by taking land from certain people and being mean. Until they stop and talk about it, the U.S. won't help them.",
  "keywords": [
    "Trump",
    "South Africa",
    "human rights",
    "land confiscation",
    "executive order",
    "discrimination",
    "ethnic minority",
    "aid",
    "terrorism",
    "Expropriation Act",
    "refugees"
  ],
  "issues": [
    "Validity and fairness of the land confiscation claims",
    "Impact of halting U.S. aid on South Africa",
    "Potential diplomatic effects with South Africa and allies",
    "Human rights implications"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}