{
  "title": "Fact Sheet: President Donald J. Trump Reins in Government Overreach and Begins Deconstruction of Unconstitutional Administrative State – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Reins in Government Overreach and Begins Deconstruction of Unconstitutional Administrative State",
  "og:description": "ENSURING LAWFUL ENFORCEMENT: Today, President Donald J. Trump signed an Executive Order ensuring lawful governance and implementing the President’s",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-reins-in-government-overreach-and-begins-deconstruction-of-unconstitutional-administrative-state/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-20T03:34:47+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Reins in Government Overreach and Begins Deconstruction of Unconstitutional Administrative State\t\t\t\t\n\nFebruary 19, 2025\n\n**ENSURING LAWFUL ENFORCEMENT:** Today, President Donald J. Trump signed an Executive Order ensuring lawful governance and implementing the President’s Department of Government Efficiency (DOGE) deregulatory initiative. The Executive Order will end Federal overreach in regulation and enforcement and restore the constitutional separation of powers:\n    - Agency heads shall, in coordination with their DOGE team leads and the Office of Management and Budget (OMB), review all regulations subject to their jurisdiction for consistency with law and Trump Administration policy, prioritizing rules that impose heavy costs.       - A Unified Agenda will be developed to rescind and/or modify regulations that are inconsistent with law or the Trump Administration’s policy. \n    - Agencies shall utilize enforcement discretion to de-prioritize enforcement actions that stretch statutory authority or exceed the constitutional powers of the Federal Government.\n    - The Order exempts, among other things, any action respecting a military, national security, homeland security, foreign affairs, or immigration-related function of the United States.\n\n**ELIMINATING UNLAWFUL REGULATIONS AND ENFORCEMENT:**The accumulation of federal regulations and their burdensome enforcement, including legally suspect regulations, has stifled economic growth and constrained Americans’ freedom.    \n    - The Biden Administration imposed a historic $1.7 trillion in costs on the American people. \n    - This Executive Order stops and reverses the regulatory overreach and abusive enforcement, ensuring that the operation of the government is responsible, lawful, and efficient.\n\n**BUILDING ON PAST SUCCESS:** President Trump’s first term was the most successful deregulatory undertaking in American history. This Executive Order builds on these foundations and furthers the deregulatory project to improve the daily lives of the American people and unleash a new Golden Age of America.\n",
  "summary": "On February 19, 2025, President Donald J. Trump signed an Executive Order to implement a deregulatory initiative under the President’s Department of Government Efficiency (DOGE). This Executive Order intends to address and reduce federal overreach in regulation and enforcement. Key actions include reviewing regulations to ensure consistency with current laws and administration policies, prioritizing the modification or removal of rules that impose significant costs, and minimizing enforcement actions perceived to exceed statutory authority.\n\nThe Executive Order aims to eliminate unlawful regulations and reduce the economic burdens created by excessive federal mandates. It highlights the $1.7 trillion cost burden imposed during the previous administration and seeks to reverse these effects. The Order exempts activities concerning military, national security, homeland security, foreign affairs, or immigration. It builds upon deregulatory efforts from President Trump’s first term, emphasizing the intent to improve American lives and revitalize economic growth.",
  "eli5": "President Trump made a rule to stop too many government rules from making things hard for everyone. This means fewer rules to follow, trying to make life better and easier for people.",
  "keywords": [
    "Trump",
    "Executive Order",
    "regulation",
    "deregulation",
    "government overreach",
    "DOGE",
    "economic growth",
    "government efficiency"
  ],
  "issues": [
    "Potential conflicts with existing laws and regulations",
    "Impact on regulatory agencies and their enforcement capabilities",
    "Effects on public safety and welfare"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}