{
  "title": "Fact Sheet: President Donald J. Trump Eradicates Anti-Christian Bias – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Eradicates Anti-Christian Bias",
  "og:description": "ERADICATING ANTI-CHRISTIAN BIAS: Today, President Donald J. Trump signed an Executive Order establishing a task force to end the anti-Christian",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-eradicates-anti-christian-bias/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-06T21:47:59+00:00",
  "article:modified_time": "2025-02-09T21:48:53+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Eradicates Anti-Christian Bias\t\t\t\t\n\nFebruary 6, 2025\n\n**ERADICATING ANTI-CHRISTIAN BIAS:** Today, President Donald J. Trump signed an Executive Order establishing a task force to end the anti-Christian weaponization of government and unlawful conduct targeting Christians.\n    - The task force, officially known as the Task Force to Eradicate Anti-Christian Bias, will be comprised of members of President Trump’s cabinet and key government agencies.\n    - The task force will review the activities of all departments and agencies to identify and eliminate anti-Christian policies, practices, or conduct.\n    - The task force will gather input from various stakeholders to ensure broad perspectives are considered, including faith-based organizations, State, local, and Tribal governments, and Americans affected by anti-Christian conduct.\n    - It will identify and address gaps in laws and enforcement that have contributed to anti-Christian conduct, including by remedying any failures to fully enforce the law against acts of anti-Christian hostility, vandalism, and violence.\n    - The task force will recommend further presidential or legislative actions necessary to rectify past wrongs and protect Americans’ religious liberties.\n    - The task force will submit an annual report on its progress, with a final report upon its conclusion.\n\n**PROTECTING AMERICANS’ RELIGIOUS FREEDOM:**The previous Administration engaged in an egregious pattern of targeting peaceful Christians while ignoring violent, anti-Christian offenses. President Trump will not tolerate this abuse of government and is taking action to ensure that any unlawful and improper anti-Christian conduct, policies or practices are identified, terminated, and rectified.\n    - The United States Constitution enshrines the fundamental right to religious liberty in the First Amendment.\n    - The Biden Department of Justice brought felony charges and obtained multi-year prison sentences against nearly two dozen pro-life Christians for praying and peacefully demonstrating outside abortion facilities.\n    - The Biden Department of Justice ignored hundreds of attacks on Catholic churches, charities, and pro-life centers.\n    - In 2023, a Federal Bureau of Investigation memo asserted that traditional Catholics were domestic-terrorism threats and suggested infiltrating Catholic churches as “threat mitigation.” \n    - The Biden Department of Education sought to repeal religious-liberty protections for faith-based organizations on college campuses. \n    - The Biden Equal Employment Opportunity Commission sought to force Christians to affirm radical transgender ideology against their faith.\n    - The Biden Department of Health and Human Services sought to drive Christians out of the foster-care system. \n    - In 2024, the Biden Administration declared Easter Sunday as “Transgender Day of Visibility.”\n\n**STANDING UP FOR RELIGIOUS LIBERTY:**President Donald J. Trump is committed to protecting Americans’ fundamental right to religious freedom.\n    - On his fourth day in office, President Trump pardoned the Christians and pro-life activists who were persecuted by the Biden Administration for praying and peacefully living out their faith.\n    - Last week, President Trump signed an Executive Order to combat anti-Semitism on our campuses and in our streets.\n    - President Trump: “I will create a new federal task force on fighting anti-Christian bias. That’ll be done immediately.”\n    - This Executive Order also builds on the long list of accomplishments from the first Trump Administration:       - During his first year in office, President Trump signed an Executive Order upholding religious liberty and the right to engage in religious speech.       - President Trump signed an Executive Order recognizing the essential contributions of faith-based organizations and establishing the Faith and Opportunity Initiative.        - President Trump reversed the Obama-era policy that prevented the government from providing disaster relief to religious organizations. \n\nPresident Trump hosted a Global Call to Protect Religious Freedom event at the United Nations and called on the international community and business lead\n",
  "summary": "**Fact Sheet: Eradicating Anti-Christian Bias Initiative**\n\nOn February 6, 2025, President Donald J. Trump signed an Executive Order to establish the Task Force to Eradicate Anti-Christian Bias, composed of members of his cabinet and key government agencies. The task force aims to identify and eliminate any anti-Christian policies, practices, or conduct within government departments and agencies. It will gather input from diverse groups, including faith-based organizations and local governments, to ensure a broad range of perspectives.\n\nThis initiative addresses concerns from the previous administration's handling of religious freedoms. President Trump holds that the Biden Administration targeted peaceful Christians while neglecting anti-Christian offenses, such as attacks on Catholic institutions. The new task force will examine failures in enforcing laws against anti-Christian violence and propose actions to protect religious liberties. This effort continues Trump's past work on religious freedom, including pardoning Christians penalized under Biden and signing an Executive Order against anti-Semitism.",
  "eli5": "President Trump made a special team to stop people in the government from being unfair to Christians. This team will look at how the government treats Christians and make sure everyone can practice their religion freely.",
  "keywords": [
    "Donald Trump",
    "anti-Christian bias",
    "religious freedom",
    "Executive Order",
    "Task Force",
    "Biden Administration",
    "First Amendment",
    "religious liberties"
  ],
  "issues": [
    "Potential bias in presenting previous administration's actions",
    "Effectiveness of task force's strategies",
    "Potential legal challenges"
  ],
  "citations": [
    "United States Constitution, First Amendment"
  ],
  "document_type": "Fact Sheet"
}