{
  "title": "Fact Sheet: President Donald J. Trump Expands Access to In Vitro Fertilization (IVF) – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Expands Access to In Vitro Fertilization (IVF)",
  "og:description": "LOWERING COSTS AND REDUCING BARRIERS TO IVF: Today, President Donald J. Trump signed an Executive Order expanding access to in vitro fertilization (IVF)",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-expands-access-to-in-vitro-fertilization-ivf/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-18T21:58:04+00:00",
  "article:modified_time": "2025-02-18T21:58:15+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Expands Access to In Vitro Fertilization (IVF)\t\t\t\t\n\nFebruary 18, 2025\n\n**LOWERING COSTS AND REDUCING BARRIERS TO IVF:**Today, President Donald J. Trump signed an Executive Order expanding access to in vitro fertilization (IVF) for Americans.\n    - The Order directs policy recommendations to protect IVF access and aggressively reduce out-of-pocket and health plan costs for such treatments.          - The recommendations will focus on how to ensure reliable access to IVF.        - Priority will also be placed on addressing any current policies, including those that require legislation, that exacerbate the cost of IVF treatments. \n    - The Order recognizes the importance of family formation and that our Nation’s public policy must make it easier for loving and longing mothers and fathers to have children. \n\n**SUPPORTING AMERICAN FAMILIES:** As many as one in seven couples trying to have a baby are unable to conceive, and many face significant financial hurdles to accessing IVF. \n    - Avenues to more affordable IVF treatments are needed.       - The cost can range from $12,000 to $25,000 per cycle and multiple cycles may be needed to get pregnant.          - IVF is often not fully covered by health insurance.         - Only a quarter of employers report coverage of IVF for their employees.         - Just a handful of states require some sort of coverage for IVF in state-regulated insurance plans.          - The federal government covers IVF in a limited capacity for military personnel, veterans, and federal employees.  \n    - Department of Health and Human Services data reports that more than 85,000 infants were born as a result of IVF in 2021.\n    - The general U.S. fertility rate is at another historic low.       - The rate dropped 3% in 2023 from 2022. From 2014-2020, the rate consistently decreased by 2% annually. \n\n**DELIVERING ON PROMISES FOR AMERICAN FAMILIES:** President Trump promised to advance IVF and help American families with the associated costs so American families can have more babies, building on his record of supporting family formation and stability.  \n    - In his first Administration, President Trump doubled the child tax credit and expanded the eligibility of receiving the credit.\n    - He also signed into law a provision that enables new parents to withdraw up to $5,000 from their retirement accounts without penalty when they give birth to or adopt a child.\n    - President Trump has long advocated for more babies and expanding American families: “Because we want more babies, to put it very nicely. And for this same reason, we will also allow new parents to deduct major newborn expenses from their taxes, so that parents that have a beautiful baby will be able, so we’re pro family. But the IVF treatments are expensive. It’s very hard for many people to do it and to get it, but I’ve been in favor of IVF, right from the beginning.”\n",
  "summary": "On February 18, 2025, President Donald J. Trump signed an Executive Order aimed at expanding access to in vitro fertilization (IVF) for Americans. This order tasks policy recommendations focused on reducing both out-of-pocket expenses and insurance costs linked to IVF treatments, while also ensuring reliable access to these services. It acknowledges that family formation is crucial and intends to simplify the path for mothers and fathers wishing to have children.\n\nMany couples in the U.S. are unable to conceive and face financial challenges accessing IVF, with costs ranging from $12,000 to $25,000 per cycle. Current insurance coverage for IVF is limited, with only a small number of employers offering coverage. Some states mandate IVF coverage in their insurance plans, and the federal government offers limited coverage for certain groups. To support family growth, President Trump's previous administration also made policy changes like doubling the child tax credit and allowing new parents to withdraw from retirement funds without penalty.\n\nThe move to enhance IVF accessibility comes as the U.S. fertility rate is at a historic low, continuing a declining trend over recent years. President Trump made a commitment to assist families with the costs associated with having more babies, advocating for improved reproductive health policies and financial supports for families intending to grow.",
  "eli5": "President Trump signed a paper to make it easier and cheaper for people to have babies with a special medical treatment called IVF, because he wants more families to be able to have children.",
  "keywords": [
    "President Trump",
    "IVF",
    "Executive Order",
    "family planning",
    "fertility rate",
    "insurance coverage",
    "healthcare costs",
    "child tax credit"
  ],
  "issues": [
    "Limited current insurance coverage for IVF",
    "High cost of IVF treatments",
    "Potential need for legislative changes",
    "U.S. fertility rate at a historic low"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}