{
  "title": "Fact Sheet: President Donald J. Trump Enforces Overwhelmingly Popular Demand to Stop Taxpayer Funding of Abortion – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Enforces Overwhelmingly Popular Demand to Stop Taxpayer Funding of Abortion – The White House",
  "og:description": "ENFORCING THE HYDE AMENDMENT: On Friday, President Donald J. Trump signed an Executive Order to end the use of Federal taxpayer dollars to fund or promote",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-enforces-overwhelmingly-popular-demand-to-stop-taxpayer-funding-of-abortion/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-25T18:47:52+00:00",
  "article:modified_time": "2025-01-28T19:44:51+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Enforces Overwhelmingly Popular Demand to Stop Taxpayer Funding of Abortion \t\t\t\t\n\nJanuary 25, 2025\n\n**ENFORCING THE HYDE AMENDMENT:** On Friday, President Donald J. Trump signed an Executive Order to end the use of Federal taxpayer dollars to fund or promote elective abortion.\n    - The Order recognizes that, for nearly five decades, Congress has enacted the Hyde Amendment and a series of additional laws to protect taxpayers from being forced to pay for abortion. Contrary to this longstanding commonsense policy, the previous administration embedded federal funding of elective abortion in a wide variety of government programs.\n    - To restore this longstanding policy, the Order rescinds two executive orders from President Biden that violate the Hyde Amendment:       - Executive Order 14076 imposed a whole-of-government effort to promote and fund abortion and to politicize enforcement of the Freedom of Access to Clinic Entrances (FACE) Act.         - Federal statutes protecting access to emergency medical care for pregnant women under the Emergency Medical Treatment and Labor Act (EMTALA) and protecting personal health information under the Health Insurance Portability and Accountability Act (HIPAA) remain in full effect.        - Executive Order 14079 recategorized abortion as “healthcare” in order to provide taxpayer funding for elective abortions. This included using Medicaid funding to pay for travel costs for elective abortions. \n\n**ENDING FEDERAL FUNDING OF ABORTION OVERSEAS:** President Donald J. Trump also signed a Presidential Memorandum reinstating the Mexico City Policy to stop the use of federal taxpayer dollars for abortion overseas.\n    - The President’s policy from 2017 is reinstated to ensure that no U.S. taxpayer money supports foreign organizations that perform or actively promote abortion in other nations.\n    - The first Trump Administration also extended this policy to global health assistance. A 2020 report by the United States Agency for International Development found that this life-affirming policy in no way diminished women’s health around the world.\n\n**PROTECTING TAXPAYERS FROM FUNDING ABORTION**: For the first time in nearly fifty years, President Trump returned the issue of life to a vote of the people, from within the States.\n    - Dobbs v. Jackson Women’s Health Organization , 597 U.S. 215 (2022), overturned  Roe v. Wade  and returned the power to regulate issues of life and safety to the people. Three of the justices deciding the case were appointed by President Trump.\n    - Federal overreach and taxpayer dollars will no longer force violations of faith and conscience or impede the ability of states to determine life policies through a vote of the people.       - For example, under President Biden, the Department of Defense reimbursed abortion-related travel expenses, the Department of Veterans Affairs allowed hospitals to provide abortions, and the Department of Health and Human Services paid for abortions for illegal immigrants. \n\n**PRESIDENT TRUMP PROMISED AND DELIVERED**: President Trump promised to protect and defend a vote of the people, from within the states, on the issue of life. Today’s executive actions build on the long list of accomplishments from the first Trump Administration to support the sanctity of every human life and prevent taxpayer funding of abortion. Select highlights of the first Trump Administration’s work include:\n    - Reinstated and expanded the Mexico City Policy, ensuring that taxpayer money is not used to fund abortion globally.\n    - Issued a rule preventing Title X taxpayer funding from subsiding the abortion industry.\n    - Cut all funding to the United Nations Population Fund, which supports coercive abortion and forced sterilization.\n    - Signed legislation overturning the previous administration’s regulation that prohibited states from defunding abortion facilities as part of their family planning programs.\n    - Fully enforced the separate payment requirement for abortion coverage in Obamacare exchange plans.\n    - Stopped the Federal funding of fetal tissue research.\n    - Worked to protect healthcare entities and individuals’ conscience rights, ensuring that no medical professional is forced to participate in an abortion in violation of their beliefs.\n    - Issued an executive order reinforcing the requirement that all hospitals in the United States provide medical treatment or an emergency transfer for infants who are in need of emergency medical care—regardless of prematurity or disability.\n    - Led a coalition of countries to sign the Geneva Consensus Declaration, declaring that there is no international right to abortion and committing to protecting women’s health.\n    - First president in history to attend the March for Life.\n",
  "summary": "**President Donald J. Trump’s Executive Actions on Abortion Funding**\n\nOn January 25, 2025, President Donald J. Trump signed an Executive Order to halt the use of federal taxpayer dollars for elective abortions, reinforcing the Hyde Amendment which restricts federal abortion funding. This order reverses previous executive orders by President Biden that integrated abortion funding into federal programs. Trump's actions included reinstituting the Mexico City Policy, designed to prevent U.S. funds from supporting international organizations that perform or endorse abortions abroad.\n\nThe Trump administration emphasizes the return of decision-making to states on abortion issues following the Dobbs v. Jackson Women’s Health Organization decision, which overruled Roe v. Wade. By revoking federal involvement, states regain the authority to regulate such matters through public votes. The administration highlighted its commitment to preventing taxpayer funding of abortion, as well as other measures undertaken during Trump's first term aimed at safeguarding the sanctity of life and supporting conscience rights in the healthcare sector.",
  "eli5": "President Trump made a rule that stops the government from using people's money to help with abortions. He also made sure money isn't used for abortions in other countries and wants states to decide about abortion on their own.",
  "keywords": [
    "Trump",
    "Executive Order",
    "Hyde Amendment",
    "Mexico City Policy",
    "abortion funding",
    "Dobbs v. Jackson",
    "Roe v. Wade",
    "state regulations",
    "taxpayer money"
  ],
  "issues": [
    "Potential conflict with state policies on abortion funding",
    "Impact on women's health and access to abortion",
    "Legal challenges regarding states' rights vs. federal rules",
    "Reversal of previous administration's policies"
  ],
  "citations": [
    "Hyde Amendment",
    "Executive Order 14076",
    "Executive Order 14079",
    "Dobbs v. Jackson Women’s Health Organization, 597 U.S. 215"
  ],
  "document_type": "Fact Sheet"
}