{
  "title": "Fact Sheet: President Donald J. Trump Ensures Military Excellence and Readiness – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Ensures Military Excellence and Readiness",
  "og:description": "PRIORITIZING SERVICEMEMBER INTEGRITY, LETHALITY, AND HEALTH: Today, President Donald J. Trump signed an Executive Order directing the Department of",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-ensures-military-excellence-and-readiness/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-27T13:30:00+00:00",
  "article:modified_time": "2025-01-28T13:31:10+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Ensures Military Excellence and Readiness\t\t\t\t\n\nJanuary 27, 2025\n\n**PRIORITIZING SERVICEMEMBER INTEGRITY, LETHALITY, AND HEALTH:** Today, President Donald J. Trump signed an Executive Order directing the Department of Defense to update its guidance regarding trans-identifying medical standards for military service and to rescind guidance inconsistent with military readiness.\n    - The Executive Order will require the Secretary of Defense to do the following:       - Update all Department of Defense medical standards to ensure they prioritize readiness and lethality.\n      - Take action to end the use of invented and identification-based pronouns in the Department of Defense. \n    - The Executive Order also prohibits males from using or sharing sleeping, changing, or bathing in facilities designated for females.\n    - The provisions in the Executive Order also apply to the Coast Guard.\n    - The Executive Order revokes Biden Administration Executive Order 14004 and all policies, directives, and guidance pursuant to that order.       - Executive Order 14004 called for accommodating “gender identity” in the military—to the detriment of military readiness and unit cohesion. \n\n**RESTORING SANITY IN OUR MILITARY:** During the Biden Administration, the Department of Defense allowed gender insanity to pervade our military organizations, family, and culture. This included not only permitting the military to increase the number of individuals not physically or mentally prepared to serve, but also ordering the Department of Defense to pay for servicemembers’ transition surgeries, as well as those of their dependent children—at a cost of millions of dollars to the American taxpayer.\n    - The United States imposes rigorous standards on all military servicemembers to ensure they are prepared to take on the challenges required of them.       - Fitness, health, welfare, and readiness standards must ensure that our military members are able to deploy, fight, and win.\n      - On the battlefield there can be no accommodation for anything less than resilience, strength, and the ability to withstand extraordinary physical demands.\n      - Individuals who are unable to meet these requirements are unable to serve in the military. This has been the case for decades. \n    - Unit cohesion requires high levels of integrity and stability among servicemembers.       - It can take a minimum of 12 months for an individual to complete treatments after transition surgery, which often involves the use of heavy narcotics.\n      - During this period, they are not physically capable of meeting military readiness requirements and require ongoing medical care. This is not conducive for deployment or other readiness requirements. \n\n**A LETHAL FIGHTING FORCE:** President Trump’s priority to have a ready, able, and lethal military will remain a core tenant of his second term.\n    - During his first term in 2018, President Trump’s Department of Defense took action to ensure trans-identifying servicemembers did not serve in capacities that undermined unit cohesion and lethality.\n",
  "summary": "**President Donald J. Trump** signed an **Executive Order** on January 27, 2025, to update the Department of Defense's guidance regarding medical standards for trans-identifying service members. This order aims to prioritize military readiness and lethality by rescinding previous guidance deemed inconsistent. The order mandates the Secretary of Defense to cease the use of identification-based pronouns and prohibits males from using female-designated facilities. It also revokes Executive Order 14004 from the Biden Administration, which advocated for accommodating gender identity in the military.\n\nThe Executive Order reflects a shift in military policy from the previous administration by emphasizing physical and mental fitness standards. It criticizes the Department of Defense's previous policies for failing to maintain cohesion and preparedness within the military ranks, citing financial and operational strains attributed to accommodating individuals transitioning gender. This action aligns with President Trump's focus on maintaining a militarily effective force capable of deploying quickly and meeting the physical challenges necessary for combat.",
  "eli5": "President Trump says the military should focus on being strong and ready, so he changed some rules to make sure everyone is very fit and can do tough jobs without distractions.",
  "keywords": [
    "Donald Trump",
    "Executive Order",
    "military readiness",
    "trans-identifying",
    "Department of Defense",
    "gender identity",
    "Biden administration"
  ],
  "issues": [
    "Impact on trans-identifying servicemembers",
    "Concerns about gender identity accommodation",
    "Effects on military readiness and cohesion",
    "Financial costs associated with gender transition surgeries"
  ],
  "citations": [
    "Executive Order 14004"
  ],
  "document_type": "Fact Sheet"
}