{
  "title": "Fact Sheet: President Donald J. Trump Protects Safety, Fairness, and Dignity in Women’s Sports – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Protects Safety, Fairness, and Dignity in Women’s Sports",
  "og:description": "EQUAL OPPORTUNITY FOR WOMEN AND GIRLS: Today, President Donald J. Trump signed an Executive Order keeping men out of women's sports. The Executive Order",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-withdraws-from-anti-american-un-organizations/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-06T02:12:28+00:00",
  "article:modified_time": "2025-02-09T18:41:03+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Protects Safety, Fairness, and Dignity in Women’s Sports**\n\nFebruary 5, 2025\n\n**EQUAL OPPORTUNITY FOR WOMEN AND GIRLS:** Today, President Donald J. Trump signed an Executive Order keeping men out of women’s sports.\n    - The Executive Order upholds the promise of Title IX and ends the dangerous and unfair participation of men in women’s sports.       - The order requires DOJ to abide by the nationwide vacatur of the previous Administration’s illegal Title IX rewrite that would have dissolved single-sex spaces and opportunities.        - The order also requires immediate action, including enforcement actions, against schools and athletic associations comprised of schools that deny women single-sex sports and single-sex locker rooms. \n    - The Executive Order calls for the convening of private sporting bodies in the White House to hear, in person, the stories of female athletes who suffer life-long injuries, who have been silenced and forced to shower with men, and whose hard work has been cast aside due to the biological advantage of males.\n    - The Executive Order directs State attorneys general to identify best practices for ensuring equal opportunities for women in sports and to highlight impact stories of women harmed by male athletes competing in women’s sports.\n    - The Secretary of State will demand changes within the International Olympic Committee to preserve single-sex sports, a necessity for safety and fairness.\n    - The Department of Homeland Security will review visa policies to address males falsely asserting they are females when entering the United States to compete in women’s sports.\n\n**THE BIDEN ADMINISTRATION’S WAR ON WOMEN:**Instead of standing for the rights of women, Biden caved to woke activists who wanted biological males to be treated as women in workplace showers, competitive sports, prisons, and rape shelters.\n    - The Biden Administration ignored the integrity of women’s sports and sex-equality under the 1972 landmark sex-discrimination Title IX law in the name of “inclusivity.”\n    - On his first day in office, Biden signed an Executive Order calling on schools across the country to allow students to compete in the sport of their “gender identity.”\n    - On the 50 th  anniversary of Title IX, Biden’s Department of Education “issued a new rule” which redefined the word “women.”       - This move “opened sex-segregated spaces like bathrooms, locker rooms, dorm rooms and single-sex admissions programs to anyone who identifies as a woman” and removed “commonsense” student protections in “campus sexual assault and harassment proceedings.”\n      - The Biden Administration argued that states may not pass laws protecting single-sex sports. Their rewrite of Title IX was found to be illegal and has been vacated nationwide. \n    - The Biden Administration changed federal prison policy to let prisoners be incarcerated with the gender they identify as, including letting biological males be housed with female inmates.       - Nearly half of trans-identifying male prisoners have sex-offense convictions.\n      - Because of Biden’s radical policies, two female inmates at an all-female prison were impregnated by a biological male who claimed to identify as a female. \n    - Biden oversaw a shortage of baby formula and feminine hygiene products, which left women unable to access and afford these essential items.\n\n**WOMEN’S OPPORTUNITIES AND PRIVACY ARE BEING DESTROYED:**Policies, like those of the NCAA, are based on the faulty premise that it is possible to medically close the male-female athletic gap. It’s not.\n    - Men, on average, have greater muscle mass, strength, and cardiovascular capacity due to testosterone levels, which provides them with physical advantages in many sports.       - Even if male athletes “transition” through hormone therapy, they retain physical advantages.\n      - Stories of athletes such as Peyton McNabb, who has been permanently disabled by a male spiking a volleyball in her face during a women’s match, highlight the danger in allowing male participation. \n    - Women’s sports were created to give female athletes a level playing field – allowing biological men to compete undermines the fairness and opportunities for women to succeed in their own leagues.\n    - Transgender men are pushing out the achievements of women who have worked their whole careers to set records in their respective fields.       - Female athletes have lost nearly 900 medals to men competing against them in women’s sporting categories.\n      - In addition to awards and trophies, men have been taking away roster spots, playing time, resources, and opportunities from women. \n    - The American people overwhelmingly agree with President Trump – men do not belong in women’s sports.       - Roughly seven in 10 Americans oppose men in women’s sports.\n      - More than 7,000 NCAA female athletes have personally reached out to the NCAA to change its policies, comply with Title IX, and protect women. \n    - To date, 26 states have enacted policies to protect equal athletic opportunities for women and girls.\n\n**FEMALE ATHLETES ARE SPEAKING OUT:**\n    - University of Wyoming volleyball player Macey Boggs: “I was stripped of a chance to play my final collegiate matches because we faced a situation no woman should ever have to face, either compete against a team rostering a male athlete on a woman’s scholarship or forfeit the rest of our season. No woman should have to face such a decision. We deserve to compete against athletes whose biology matches our own, not against a male standard.”\n    - Roanoke College swim team captain Lily Mullens: “This has been too great a burden to bear for many of our teammates who have lost hours of sleep, many tears, and the will to train to race a swimmer who has an advantage in the water that our bodies may never possess.”\n    - Roanoke College swim team member Susanna Price: “The thought of having to compete against a biological man is a message that women aren’t worthy, that we don’t actually matter.”\n    - American surfing legend Bethany Hamilton: “California state law allows for males in female surfing events. This is not fair game. I do not support this.”\n    - Professional golfer Alison Crenshaw: “This movement was born because there have been numerous incidents where female athletes have had their hard work and potential stolen from them because male athletes were allowed to compete in the female division. It’s wrong, it’s cheating, and female athletes deserve to have their rights as athletes fought for.”\n\n**PRESIDENT TRUMP PROMISES EQUAL OPPORTUNITIES FOR WOMEN AND GIRLS:**President Trump has vowed to defend women from gender ideology extremism and restore biological truth to the Federal government.\n    - President Trump campaigned on banning men from competing in women’s sports: “You just ban it. You just don’t let it happen.”\n    - On Day One, President Trump signed an Executive Order establishing Government-wide the biological reality of two sexes and clearly defining male and female.\n    - Earlier this week, President Trump signed Executive Orders to protect children from chemical and surgical mutilation and to prohibit federal funding of the indoctrination of children with radical gender ideology.\n    - Today’s Executive Order upholds the original promise of Title IX, keeping his campaign promise to the American people.\n",
  "summary": "On February 5, 2025, President Donald J. Trump signed an Executive Order aimed at preserving single-sex sports by restricting the participation of men in women's sports. This action is intended to uphold the principles of Title IX, which promises equal opportunities for women and girls. The order directs the Department of Justice to cease any actions related to the previous administration's Title IX changes, mandates state attorneys general to devise best practices for equality in sports, and seeks to influence international organizations like the International Olympic Committee. Furthermore, the order emphasizes having organizations listen to female athletes affected by current policies.\n\nThe Executive Order is a response to what the Trump administration sees as overreach by the previous Biden Administration, which had issued rulings altering the definition of 'woman' under Title IX to include gender identity. This approach was heavily criticized for undermining women's rights in various fields, including sports. President Trump criticized these previous policies for negatively impacting the privacy, safety, and opportunities available to women and girls and aims to restore what he terms 'biological truth' in federal policies.\n",
  "eli5": "President Trump made a rule that says men can't play in women's sports so that it's fair for girls and women to have their own teams again. He believes it's important to keep boys and girls teams separate so everyone gets a fair chance.",
  "keywords": [
    "Trump Administration",
    "Executive Order",
    "Title IX",
    "Women in Sports",
    "Gender Identity",
    "Biden Administration",
    "Equality",
    "Females",
    "Biological Truth"
  ],
  "issues": [
    "Controversy over the definition of 'woman' under Title IX.",
    "Potential conflict with previous administration's policies.",
    "Criticism from gender rights activists.",
    "Impact on international sports regulations."
  ],
  "citations": [
    "Title IX"
  ],
  "document_type": "Fact Sheet"
}