{
  "title": "Fact Sheet: President Donald J. Trump Eliminates the Federal Executive Institute – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Eliminates the Federal Executive Institute",
  "og:description": "ELIMINATING INEFFICIENCY AND BUREAUCRACY: Today, President Donald J. Trump signed an Executive Order to eliminate the Federal Executive Institute, a",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-eliminates-the-federal-executive-institute/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T04:02:11+00:00",
  "article:modified_time": "2025-02-12T00:15:07+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Eliminates the Federal Executive Institute\t\t\t\t\n\nFebruary 10, 2025\n\n**ELIMINATING INEFFICIENCY AND BUREAUCRACY:** Today, President Donald J. Trump signed an Executive Order to eliminate the Federal Executive Institute, a government program purportedly designed to provide bureaucratic leadership training.\n    - The Order directs the Office of Personnel Management to take all necessary steps to terminate the Federal Executive Institute and revokes the appropriate documents.\n\n**ENSURING EVERY TAX DOLLAR WORKS FOR THE AMERICAN PEOPLE:**President Trump is committed to ensuring that government serves the American people, rather than itself, which requires a complete shift in government leadership toward reducing waste and promoting efficient service to taxpayers.\n    - The Federal Executive Institute was created by the Johnson Administration more than 50 years ago to provide leadership training to government bureaucrats.\n    - Bureaucratic leadership over the past half-century has enlarged and entrenched Washington, D.C.’s managerial class, a bloated system far removed from the needs of American families. New leadership is needed.\n    - The Federal Executive Institute includes a resort property in Charlottesville, VA, that was formerly a luxury hotel, which is used for bureaucracy training courses.\n\n**DISMANTLING GOVERNMENT BUREAUCRACY:** Eliminating the Federal Executive Institute is part of President Trump’s broader mission to reform the federal bureaucracy, including by ending ineffective government programs that drain resources and empower government without achieving measurable results.\n    - The government wastes billions of dollars each year on duplicative programs and frivolous expenditures that fail to align with American values or address the needs of the American people.\n    - President Trump temporarily paused foreign aid to many non-governmental organizations, international organizations, and contractors to ensure every dollar of U.S. foreign assistance supports American values.\n    - President Trump established the “Department of Government Efficiency” to examine how to streamline the Federal government, eliminate unnecessary programs, and reduce bureaucratic inefficiency.\n    - President Trump launched a 10-to-1 deregulation initiative, ensuring every new rule is justified by clear benefits\n",
  "summary": "**Summary**\n\nOn February 10, 2025, President Donald J. Trump signed an Executive Order to dismantle the Federal Executive Institute, an organization established over 50 years ago to provide bureaucratic leadership training to government officials. By doing so, the government aims to reduce inefficiency and bureaucracy, ensuring that taxpayer money is directed towards the needs of American families rather than maintaining a bloated managerial class. The order instructs the Office of Personnel Management to oversee the termination of the Institute and revoke its founding documents.\n\nThis initiative is part of a larger strategy by President Trump to reform the federal bureaucracy by eliminating ineffective programs and reducing wasteful expenditures. The Executive Order follows actions such as pausing foreign aid to certain organizations and creating the \"Department of Government Efficiency\" to streamline operations. Additionally, a 10-to-1 deregulation policy has been introduced to ensure new regulations are substantiated by clear benefits.",
  "eli5": "**ELI5**\n\nPresident Trump decided to close a special school for government workers to save money because he thinks the government spends too much and wants to make sure money helps people better.",
  "keywords": [
    "Executive Order",
    "Federal Executive Institute",
    "bureaucracy",
    "Donald Trump",
    "government efficiency",
    "deregulation"
  ],
  "issues": [
    "Possible job loss for Federal Executive Institute staff",
    "Impact on leadership training for government officials",
    "Effectiveness of new initiatives in reducing bureaucracy"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}