{
  "title": "Fact Sheet: President Donald J. Trump Launches PCAST to Restore American Leadership in Science and Technology – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Launches PCAST to Restore American Leadership in Science and Technology",
  "og:description": "RENEWING AMERICAN LEADERSHIP IN CRITICAL AND EMERGING TECHNOLOGIES: Today, President Donald J. Trump announced the establishment of the President's",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-pcast-to-restore-american-leadership-in-science-and-technology/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T21:41:17+00:00",
  "article:modified_time": "2025-01-24T17:27:18+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Launches PCAST to Restore American Leadership in Science and Technology\t\t\t\t\n\nJanuary 23, 2025\n\nRENEWING AMERICAN LEADERSHIP IN CRITICAL AND EMERGING TECHNOLOGIES: Today, President Donald J. Trump announced the establishment of the President’s Council of Advisors on Science and Technology (PCAST) to spearhead American innovation and competitiveness in critical and emerging technologies.\n    - PCAST will include up to 24 members, with representation from leading American scientists and technologists from industry, academia, and government.\n    - The Assistant to the President for Science and Technology and the White House A.I. and Crypto Czar will co-chair PCAST.\n    - PCAST will provide advice and evidence-based recommendations to the President to ensure that policies are informed by the latest scientific discoveries and technological advancements.\n    - This council will champion bold investments in innovation, the elimination of bureaucratic barriers, and actions to help the United States remain the world’s premier hub for scientific and technological breakthroughs.\n\nFOCUSING SCIENCE AND TECHNOLOGY ON EXCELLENCE: President Trump is refocusing science and technology policy to emphasize results-driven excellence and merit-based achievement.\n    - The United States must leverage its pioneering spirit to lead in transformative science and technology, reshaping industries and securing the nation’s leadership.\n    - The pursuit of scientific truth is under threat from ideological agendas that prioritize group identity over individual merit, enforce conformity at the expense of innovative ideas, and inject politics into the heart of the scientific method.\n    - These threats have not only distorted truth, but have eroded public trust, undermined the integrity of research, stifled innovation, and weakened America’s competitive edge.\n    - PCAST will restore excellence by bringing together the brightest minds from academia, industry, and government to prioritize measurable results, foster innovation, and dismantle barriers to scientific progress.\n\nBUILDING ON SIGNIFICANT SCIENCE AND TECHNOLOGY ACCOMPLISHMENTS: President Trump’s first administration laid a strong foundation for American technological leadership.\n    - Launching national initiatives to drive innovation in critical technologies, including the American AI Initiative and the National Quantum Initiative, which prioritized research, strategic investments, and workforce development in transformative fields.\n    - Advancing emerging technologies by crafting regulatory and non-regulatory frameworks for areas such as autonomous driving systems, unmanned aerial systems, and biotechnology, ensuring a balanced approach to innovation and safety.\n    - Accelerating groundbreaking research and collaboration through initiatives like the National AI Research Resource, spectrum auctions to unlock valuable frequencies for 5G and innovation, and investments in world-leading supercomputing systems.\n",
  "summary": "On January 23, 2025, President Donald J. Trump announced the establishment of the President’s Council of Advisors on Science and Technology (PCAST) to promote American leadership in critical and emerging technologies. PCAST will comprise up to 24 members, including top scientists and technologists from various sectors. Co-chaired by the White House A.I. and Crypto Czar and the Assistant to the President for Science and Technology, the council will provide strategic recommendations to inform policies based on current scientific and technological insights. This initiative aims to drive innovation, dismantle bureaucratic obstacles, and position the United States as a global leader in scientific and technological progress.\n\nPresident Trump's initiative emphasizes focusing science and technology policy on delivering measurable results and recognizing merit-based accomplishments. In response to perceived ideological influences that may distort truth and hinder innovation, PCAST seeks to rebuild public trust and reinforce the nation's competitive edge by pooling expertise from academia, industry, and government. The council will prioritize transformative sciences and technological breakthroughs across various industries, ensuring a practical approach aligns with the nation’s pioneering spirit.\n\nBuilding on the achievements of his first administration, President Trump highlights previous efforts such as the American AI Initiative and the National Quantum Initiative. These initiatives focused on strategic investments and regulatory frameworks to support innovation in fields like autonomous systems, biotechnology, and telecommunications, including advancements in AI research and 5G technologies. The renewed emphasis on innovative science and technology aims to accelerate groundbreaking research and development in these critical areas.",
  "eli5": "President Trump is bringing together smart people to help America stay the best at science and technology. This group will give advice to make sure we do the best science and come up with cool new technologies, like robots and special computers.",
  "keywords": [
    "President Trump",
    "PCAST",
    "Science and Technology",
    "Innovation",
    "Emerging Technologies",
    "American Leadership",
    "AI and Crypto"
  ],
  "issues": [
    "Potential bias in emphasizing merit-based achievement",
    "Concerns about ideological influences in science",
    "Impact of reduced bureaucracy on safety regulations"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}