{
  "title": "Fact Sheet: President Donald J. Trump Ends DEI Madness and Restores Excellence and Safety within the Federal Aviation Administration – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump's America First Priorities",
  "og:description": "FLIGHTS SHOULD BE SUPERVISED BY THE BEST EMPLOYEES: President Donald J. Trump has signed a Presidential Memorandum terminating a Biden Administration",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-ends-dei-madness-and-restores-excellence-and-safety-within-the-federal-aviation-administration/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T12:34:42+00:00",
  "article:modified_time": "2025-01-24T17:30:06+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Ends DEI Madness and Restores Excellence and Safety within the Federal Aviation Administration\t\t\t\t\n\nJanuary 22, 2025\n\nFLIGHTS SHOULD BE SUPERVISED BY THE BEST EMPLOYEES: President Donald J. Trump has signed a Presidential Memorandum terminating a Biden Administration Federal Aviation Administration (FAA) hiring policy that prioritized diversity, equity, and inclusion (DEI) over safety and efficiency.\n    - This Presidential Memorandum orders the Secretary of Transportation and FAA Administrator to immediately stop Biden DEI hiring programs and return to non-discriminatory, merit-based hiring.\n    - It also requires the FAA Administrator to review the past performance and performance standards of all FAA employees in critical safety positions and make clear that any individual who fails to demonstrate adequate capability is replaced by someone who will ensure Americans’ flight safety and efficiency.\n\nMILLIONS OF AMERICANS RELY ON SAFE, TIMELY AIR TRAVEL EVERY DAY: Safety and competence should be the only job criteria for FAA employees, yet the Biden Administration violated the public trust—as well as the law—by prioritizing illegal DEI hiring.\n    - Every day, more than 45,000 flights and 2.9 million airline passengers traveling for work or fun or to visit friends and family entrust their lives to the FAA.\n    - Almost unbelievably, as a diversity, equity, and inclusion (DEI) initiative, the Biden FAA specifically recruited and hired individuals with “severe intellectual” disabilities, psychiatric issues, and complete paralysis over other individuals who sought to work for the FAA.\n    - President Trump is immediately terminating this illegal and dangerous program and requiring that all FAA hiring be based solely on ensuring the safety of airline passengers and overall job excellence.       - On January 11, 2023, two weeks after a major holiday airline crisis, an FAA system outage caused by employees missteps grounded all flights for the first time since 9/11, an illustration of the importance of FAA competence. \n\nFULFILLING PROMISE TO END ILLEGAL DISCRIMINATION AND BRING BACK COMMON SENSE: This Presidential Memorandum builds on President Trump’s day-one Executive Order ending the Biden Administration’s illegal and immoral DEI discrimination programs.\n    - In his inaugural address, President Trump promised: ““We will forge a society that is colorblind and merit-based.”\n\nPresident Trump stated in his January 20, 2025 Executive Order on Ending Radical and Wasteful Government DEI Programs and Preferencing: “Americans deserve a government committed to serving every person with equal dignity and respect, and to expending precious taxpayer resources only on making America great.”\n",
  "summary": "President Donald J. Trump has issued a Presidential Memorandum dated January 22, 2025, which directs the cessation of a hiring policy implemented during the Biden Administration that prioritized diversity, equity, and inclusion (DEI) at the Federal Aviation Administration (FAA). The memorandum mandates a return to merit-based hiring, emphasizing safety and efficiency as the primary criteria for employment. This action aims to ensure that FAA employees are fully capable and competent, to protect the safety of air travel passengers. The memorandum also requires a review of current FAA personnel in critical positions to ensure their continued capability in meeting safety requirements.\n\nThe decision to revoke DEI policies highlights concerns about previous FAA hiring practices that reportedly gave preference to candidates with severe intellectual disabilities and psychiatric issues under DEI initiatives. The memorandum refers to a significant FAA system outage on January 11, 2023, as a failure of competence during a critical time, underscoring the need for skilled personnel. This action follows President Trump's broader initiative, indicated in an Executive Order dated January 20, 2025, to eliminate government programs he considers discriminatory or wasteful, reaffirming his administration's commitment to a merit-based, colorblind society.",
  "eli5": "President Trump wants to make sure that people who keep planes safe are really good at their jobs, so he changed a rule to hire the best people, not just because of who they are. He thinks this helps keep everyone on airplanes safe.",
  "keywords": [
    "President Trump",
    "FAA",
    "DEI",
    "Merit-based hiring",
    "Safety",
    "Efficiency",
    "Presidential Memorandum"
  ],
  "issues": [
    "The impact of removing DEI initiatives on workplace diversity",
    "Potential backlash or legal challenges to ending DEI policies",
    "The accuracy of claims regarding prior FAA hiring practices",
    "The details of performance review processes for current employees"
  ],
  "citations": [],
  "document_type": "Presidential Memorandum"
}