{
  "title": "Fact Sheet: President Donald J. Trump Launches Massive 10-to-1 Deregulation Initiative – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Launches Massive 10-to-1 Deregulation Initiative",
  "og:description": "ELIMINATING 10 REGULATIONS FOR EACH NEW REGULATION ISSUED: Today, President Donald J. Trump signed an Executive Order to unleash prosperity through",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-massive-10-to-1-deregulation-initiative/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-31T23:42:37+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **********Fact Sheet: President Donald J. Trump Launches Massive 10-to-1 Deregulation Initiative**********\n\nJanuary 31, 2025\n\n**ELIMINATING 10 REGULATIONS FOR EACH NEW REGULATION ISSUED**: Today, President Donald J. Trump signed an Executive Order to unleash prosperity through deregulation. \n    - The Order requires that whenever an agency promulgates a new rule, regulation, or guidance, it must identify at least 10 existing rules, regulations, or guidance documents to be repealed.  \n    - The Director of the Office of Management and Budget will ensure standardized measurement and estimation of regulatory costs.\n    - It requires that for fiscal year 2025, the total incremental cost of all new regulations, including repealed regulations, be significantly less than zero. \n\n**HALTING THE REGULATORY ONSLAUGHT**: President Trump will halt the job killing and inflation-driving regulatory blitz of the Biden Administration.\n    - The Biden Administration imposed a historic $1.7 trillion in costs on the American people.\n    - Overregulation stops American entrepreneurship, crushes small business, reduces consumer choice, discourages innovation, and infringes on the liberties of American citizens.       - It also contributes to the high cost of living, including by driving up energy prices. \n\n**BUILDING ON PAST SUCCESS**:  President Trump’s first Administration undertook the most aggressive and successful regulatory reduction effort in history. \n    - In his first term, President Trump asked the agencies to eliminate two regulations for each one new regulation issued.  Not only was this 2-for-1 goal achieved, the first Trump Administration eliminated five and a half regulations for everyone new regulation issued. \n    - This Executive Order builds on President Trump’s previous success to improve daily lives of the American people by reducing unnecessary, burdensome, and costly Federal regulations.\n",
  "summary": "### Summary\n\nOn January 31, 2025, President Donald J. Trump signed an Executive Order aimed at significantly reducing federal regulations in the United States. The order mandates that federal agencies must rescind ten existing regulations for every new regulation they introduce. The goal is to not only reduce the quantity of regulatory restrictions but also their associated costs, ensuring that the net incremental cost of regulations for the fiscal year 2025 is significantly negative. The Director of the Office of Management and Budget is responsible for implementing standardized measures to estimate regulatory costs, thereby facilitating the execution of this policy.\n\nTrump's administration criticizes the preceding Biden Administration for imposing over $1.7 trillion in regulatory costs, which they claim stifles economic growth by hindering entrepreneurship, limiting consumer choices, and increasing living costs, particularly energy prices. This new Executive Order expands upon Trump's previous deregulation efforts during his first administration, where he successfully achieved a deregulation ratio of 5.5 eliminations for every new regulation made, surpassing his initial goal of 2-to-1.",
  "eli5": "President Trump signed a paper saying that when a new rule is made, ten old rules have to go away. This is to help things get cheaper and easier for everyone.",
  "keywords": [
    "Deregulation",
    "Executive Order",
    "President Donald Trump",
    "Federal Regulations",
    "Cost Reduction",
    "Economic Growth",
    "Entrepreneurship",
    "Biden Administration"
  ],
  "issues": [
    "Potential legal implications of repealing multiple regulations.",
    "Impact on industries previously regulated.",
    "Potential environmental impacts not addressed."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}