{
  "title": "Fact Sheet: President Donald J. Trump Directs the Building of the Iron Dome Missile Defense Shield for America – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Directs the Building of the Iron Dome Missile Defense Shield for America – The White House",
  "og:description": "DEFEND THE UNITED STATES AGAINST MISSILE ATTACK: Today, President Donald J. Trump signed an Executive Order to Build the Iron Dome for America. The",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-directs-the-building-of-the-iron-dome-missile-defense-shield-for-america/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-27T13:29:00+00:00",
  "article:modified_time": "2025-01-28T13:29:32+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Directs the Building of the Iron Dome Missile Defense Shield for America**\n\nJanuary 27, 2025\n\n**DEFEND THE UNITED STATES AGAINST MISSILE ATTACK**: Today, President Donald J. Trump signed an Executive Order to Build the Iron Dome for America.\n    - The Executive Order directs implementation of a next-generation missile defense shield for the United States against ballistic, hypersonic, advanced cruise missiles, and other next-generation aerial attacks.       - With the goal of providing for the common defense of American citizens, this Order accelerates the development and deployment of Hypersonic and Ballistic Tracking Space Sensor Layers, proliferated space-based interceptors, a Proliferated Warfighter Space Architecture, capabilities to defeat salvoes prior to launch, non-kinetic missile defense capabilities, and underlayer and terminal-phase intercept capabilities.\n      - It also secures the supply chains for all components of the Iron Dome. \n    - The Executive Order directs a review of theater missile defense posture to defend United States troops deployed abroad and an increase in cooperation on missile defense technology development, capabilities, and operations with partners and allies. \n\n**ADDRESSING VULNERABILITIES BY MODERNIZING AN OUTDATED SYSTEM**:\n    - The threat of attack by ballistic, cruise, and hypersonic missiles remains a catastrophic threat facing the United States.\n    - Over the past 40 years, rather than lessening, the threat from next-generation strategic weapons—including hypersonic—has become more complex with the development of next-generation delivery systems by our adversaries.\n    - Notwithstanding this increasing threat, United States homeland missile defense policy has been limited to staying ahead of rogue nation threats and accidental or unauthorized missile launches.\n\n**THE IRON DOME WILL FURTHER THE GOALS OF PEACE THROUGH STRENGTH**: By empowering the United States with a second-strike capability, the Iron Dome will deter adversaries from attacks on the homeland.\n    - President Trump is fulfilling his promises: “I will direct our military to begin construction of the great Iron Dome missile defense shield, which will be made all in the USA.”\n",
  "summary": "On January 27, 2025, President Donald J. Trump signed an Executive Order to initiate the construction of an Iron Dome Missile Defense Shield for the United States. This initiative aims to protect the nation from ballistic, hypersonic, and advanced cruise missile attacks. The Executive Order mandates the quick development and deployment of comprehensive defenses, including space-based sensors and interceptors, non-kinetic defense capabilities, and measures to secure supply chains. The plan also involves reviewing missile defense strategies abroad and enhancing collaboration with international partners.\n\nThe project addresses the growing threat from next-generation strategic weapons and aims to modernize outdated defense systems that have traditionally focused on rogue nations or accidental threats. By establishing a robust missile defense shield, it seeks to empower the United States with enhanced deterrence capabilities, reinforcing the strategy of peace through strength that President Trump advocated for. The development is also set to occur domestically, aligning with Trump's promises of American-made military advancements.",
  "eli5": "President Trump wants to build a big shield in America that can stop super-fast missiles from hitting us. It's like giving the country an umbrella to protect everyone from rain, but for missiles.",
  "keywords": [
    "Iron Dome",
    "missile defense",
    "Executive Order",
    "Trump",
    "hypersonic missiles",
    "ballistic missiles",
    "national security"
  ],
  "issues": [
    "Feasibility and cost of developing such advanced defense systems",
    "Impact on international relations and arms race",
    "Potential challenges in securing supply chains"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}