{
  "title": "Fact Sheet: President Donald J. Trump Orders Plan for a United States Sovereign Wealth Fund – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Orders Plan for a United States Sovereign Wealth Fund",
  "og:description": "DELIVERING A PLAN TO CREATE A UNITED STATES SOVEREIGN WEALTH FUND: Today, President Donald J. Trump signed an Executive Order calling for the creation of",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-orders-plan-for-a-united-states-sovereign-wealth-fund/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-03T23:18:12+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Orders Plan for a United States Sovereign Wealth Fund**\n\nFebruary 3, 2025\n\n**DELIVERING A PLAN TO CREATE A UNITED STATES SOVEREIGN WEALTH FUND:** Today, President Donald J. Trump signed an Executive Order calling for the creation of a Sovereign Wealth Fund.\n    - The Executive Order directs the Secretary of the Treasury and the Secretary of Commerce to deliver a plan within 90 days for the creation of a sovereign wealth fund.       - The Secretary of the Treasury and the Secretary of Commerce will work closely with the Director of the Office of Management and Budget and the Assistant to the President for Economic Policy to develop the plan.        - The Order directs the Secretary to include in the plan recommendations for funding mechanisms, investment strategies, fund structure, and a governance model. \n\n**ENSURING LONG-TERM ECONOMIC COMPETITIVENESS AND FISCAL SUSTAINABILITY:** The creation of a sovereign wealth fund for the United States will help maximize the stewardship of our national wealth.\n    - Sovereign wealth funds exist around the world as mechanisms to amplify the financial return to a nation’s assets and leverage those returns for strategic benefit and goals.       - The United States can leverage such returns to promote fiscal sustainability, lessen the burden of taxes on American families and small businesses, establish long-term economic security, and promote U.S. economic and strategic leadership internationally. \n    - The United States already holds a vast sum of highly valued assets that can be invested through a sovereign wealth fund for greater long-term wealth generation.       - The Federal government directly holds $5.7 trillion in assets. Indirectly, including through natural resource reserves, the Federal government holds a far larger sum of asset value. \n\n**PURSUING NATIONAL ENDEAVORS AND MAGNIFYING ECONOMIC GROWTH:** President Trump has called for the creation of a sovereign wealth fund “to invest in great national endeavors for the benefit of all of the American people.”\n    - President Trump’s economic policies—including the pursuit of fair and balanced trade, national energy dominance, and tax and regulatory relief to spur robust economic growth—will result in greater wealth and revenue streams that a sovereign wealth fund can maximize the potential of.\n    - Sovereign wealth funds are maintained by a diverse array of countries leveraging equally varied classes of national assets. President Trump has called for a sovereign wealth fund to ensure the United States can lead the way in long-term wealth generation.       - The United Kingdom recently announced their own plans to pursue development of such a fund.        - In addition to countries around the world maintaining their own funds, 23 states within our own country maintain their own funds that control in total $332 billion in assets.\n",
  "summary": "# **Summary**\n\nOn February 3, 2025, President Donald J. Trump signed an Executive Order to create a Sovereign Wealth Fund for the United States. The order directs the Secretary of the Treasury and the Secretary of Commerce to form a plan within 90 days, concerning the establishment of the fund. This plan will address funding mechanisms, investment strategies, and a governance model, developed in collaboration with the Director of the Office of Management and Budget and the Assistant to the President for Economic Policy.\n\nThe intended purpose of the Sovereign Wealth Fund is to ensure long-term economic competitiveness and fiscal sustainability. The fund aims to optimize the management of national wealth, promoting fiscal balance, reducing tax burdens on citizens, and reinforcing U.S. economic leadership globally. The U.S. government holds substantial assets valued at $5.7 trillion directly, and even more when considering natural resources, which can be strategically invested through a sovereign wealth fund.\n\nPresident Trump’s initiative aligns with his broader economic policies aiming at fostering economic growth, including fair trade and energy dominance. The formation of a sovereign wealth fund is designed to capitalize on these policies' successes, investing in national endeavors for the benefit of Americans. Other countries like the UK, and several U.S. states, have set similar funds, highlighting the global and domestic precedent for such financial vehicles.",
  "eli5": "President Trump wants to make a big savings fund for the U.S., called a Sovereign Wealth Fund, to help the country have more money for the future. This way, they can invest smartly and use the money for important projects, just like when people save their money for a rainy day.",
  "keywords": [
    "Donald Trump",
    "Sovereign Wealth Fund",
    "Economic Policy",
    "United States",
    "Fiscal Sustainability",
    "Investment",
    "National Assets"
  ],
  "issues": [
    "Lack of detail on potential risks associated with the fund",
    "Uncertainty about the source of funding for the Sovereign Wealth Fund",
    "Implications for existing federal asset management strategies",
    "Potential political and economic ramifications domestically and internationally"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}