{
  "title": "Fact Sheet: President Donald J. Trump Protects Civil Rights and Merit-Based Opportunity by Ending Illegal DEI – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump's America First Priorities",
  "og:description": "PROTECTING CIVIL RIGHTS AND EXPANDING INDIVIDUAL OPPORTUNITY: Today, President Donald J. Trump signed an historic Executive Order that protects the civil",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-protects-civil-rights-and-merit-based-opportunity-by-ending-illegal-dei/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T12:38:40+00:00",
  "article:modified_time": "2025-01-24T17:29:57+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Protects Civil Rights and Merit-Based Opportunity by Ending Illegal DEI\t\t\t\t\n\nJanuary 22, 2025\n\n**PROTECTING CIVIL RIGHTS AND EXPANDING INDIVIDUAL OPPORTUNITY**: Today, President Donald J. Trump signed an historic Executive Order that protects the civil rights of all Americans and expands individual opportunity by terminating radical DEI preferencing in federal contracting and directing federal agencies to relentlessly combat private sector discrimination. It enforces long-standing federal statutes and faithfully advances the Constitution’s promise of colorblind equality before the law. This comprehensive order is the most important federal civil rights measure in decades:\n    - It terminates “diversity, equity, and inclusion” (DEI) discrimination in the federal workforce, and in federal contracting and spending.       - Federal hiring, promotions, and performance reviews will reward individual initiative, skills, performance, and hard work and not, under any circumstances, DEI-related factors, goals, policies, mandates, or requirements. \n    - The order requires OMB to streamline the federal contracting process to enhance speed and efficiency, reduce costs, and require Federal contractors and subcontractors to comply with our civil rights laws.       - It revokes Executive Order 11246 contracting criteria mandating affirmative action\n      - It bars the Office of Federal Contract Compliance Programs from pushing contractors to balance their workforce based on race, sex, gender identity, sexual preference, or religion.\n      - It requires simple and unmistakable affirmation that contractors will not engage in illegal discrimination, including illegal DEI.    \n    - It directs all departments and agencies to take strong action to end private sector DEI discrimination, including civil compliance investigations.\n    - It mandates the Attorney General and the Secretary of Education issue joint guidance regarding the measures and practices required to comply with the Supreme Court’s decision in  Students for Fair Admissions v. Harvard .\n\n**RESTORING THE VALUES OF INDIVIDUAL DIGNITY, HARD WORK, AND EXCELLENCE**: Individual dignity, hard work, and excellence are fundamental to American greatness. This Executive Order reaffirms these values by ending the Biden-Harris Administration’s anti-constitutional and deeply demeaning “equity” mandates, terminating DEI, and protecting civil rights:\n    - Reversing the progress made in the decades since the Civil Rights Act of 1964 toward a colorblind and competence-based workplace, radical DEI has dangerously tainted many of our critical businesses and influential institutions, including the federal government.\n    - In the private sector, many corporations and universities use DEI as an excuse for biased and unlawful employment practices and illegal admissions preferences, ignoring the fact that DEI’s foundational rhetoric and ideas foster intergroup hostility and authoritarianism.       - Billions of dollars are spent annually on DEI, but rather than reducing bias and promoting inclusion, DEI creates and then amplifies prejudicial hostility and exacerbates interpersonal conflict. \n\n**PRESIDENT TRUMP PROMISED AND DELIVERED**: President Trump promised to terminate DEI in the federal government, protect equal opportunity, and force schools to end discriminatory admissions policies, and he delivered. Every man and woman should have the opportunity to go as far as their hard work, individual initiative, and competence can take them. In America, excellence, grit, and determination is our strength.\n",
  "summary": "On January 22, 2025, President Donald J. Trump signed an Executive Order that aims to safeguard civil rights and promote merit-based opportunities by abolishing DEI (Diversity, Equity, and Inclusion) practices in federal contracting and employment. The order intends to ensure that federal hiring and promotions are based on individual performance, skills, and hard work rather than DEI criteria. Furthermore, it seeks to simplify the federal contracting process and mandates that contractors uphold non-discrimination principles.\n\nThe Executive Order directs all federal departments and agencies to actively prevent DEI-related discrimination within the private sector, including thorough investigations into civil compliance. It also instructs the Attorney General and the Secretary of Education to provide guidance in line with the Supreme Court's decision in *Students for Fair Admissions v. Harvard*. The administration asserts that this order will foster a colorblind and competence-based professional environment, distancing itself from the policies established by the previous administration.\n\nThe order reflects Trump's fulfillment of his pledge to dismantle DEI programs and uphold equal opportunity by emphasizing individual merit, hard work, and competence. Critics of current DEI initiatives argue these programs foster division and bias rather than reducing discrimination. The order calls for a return to treating employees based solely on their abilities and achievements.",
  "eli5": "President Trump made a new rule to make sure everyone in the government's jobs and contracts gets treated fairly based on how hard they work, not traits like their race or gender. He wants everyone to have the same chance to succeed by doing their best.",
  "keywords": [
    "Trump",
    "Executive Order",
    "Civil Rights",
    "DEI",
    "Federal Contracting",
    "Merit-Based",
    "Discrimination",
    "Equal Opportunity"
  ],
  "issues": [
    "The impact on current DEI initiatives and employees who benefited from them",
    "The balance between promoting merit and addressing systemic discrimination",
    "Potential legal challenges to the Executive Order",
    "Interpretation and enforcement of 'colorblind equality'"
  ],
  "citations": [
    "Executive Order 11246",
    "Supreme Court’s decision in *Students for Fair Admissions v. Harvard*"
  ],
  "document_type": "Fact Sheet"
}