{
  "title": "Fact Sheet: President Donald J. Trump Declares a National Emergency at the Southern Border – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Declares a National Emergency at the Southern Border",
  "og:description": "INVOKING A NATIONAL EMERGENCY: Today, President Donald J. Trump signed an Executive Order invoking the National Emergencies Act regarding the crisis at",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-declares-a-national-emergency-at-the-southern-border/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T19:41:52+00:00",
  "article:modified_time": "2025-01-24T19:08:43+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Declares a National Emergency at the Southern Border\t\t\t\t\n\nJanuary 22, 2025\n\nINVOKING A NATIONAL EMERGENCY: Today, President Donald J. Trump signed an Executive Order invoking the National Emergencies Act regarding the crisis at the Southern Border of the United States.\n    - The Executive Order declares a national emergency at the southern border following four years of record-shattering illegal immigration into the U.S.\n    - It directs the Secretary of Defense to deploy additional personnel to the border, including members of the Armed Forces and the National Guard.\n    - Additionally, it directs the Secretaries of Defense and Homeland Security to finish the wall along the southern border and ensures that DHS has all the flexibility it needs to operate air missions near the border.\n\nTAKING BACK CONTROL: For the past four years, the federal government has abdicated its responsibility to enforce the border, resulting in a catastrophic immigration crisis for the United States.\n    - When States like Texas took steps to prevent illegal crossings into their state, the federal government sought to stop them by cutting down their barriers.\n    - A record-shattering 8.72 million border encounters have occurred at the southern border from FY21-FY24, overwhelming border resources and endangering communities.       - This has led to untold hundreds of thousands of children being trafficked.  Roughly 550,000 unaccompanied alien children have been encountered at the border since FY21.  Fentanyl and other drugs are pouring over the border and flooding our communities, killing roughly 75,000 Americans in 2023—the number one cause of death for Americans ages 18-45. \n      - It has allowed dangerous gangs like the Venezuelan Tren de Aragua to takeover and terrorize entire American cities.\n      - And it has led to the murders of innocent Americans like Laken Riley, Jocelyn Nungaray, Rachel Morin, and many others. \n\nBUILDING ON PAST SUCCESS: America is in a dire situation, and it is past time for the government to act. President Trump first declared an emergency at the Southern Border on February 15, 2019, and continued that emergency on February 13, 2020.\n    - Following the at-the-time historic surges of illegal aliens in 2018, President Trump declared a national emergency and successfully reduced the number of people seeking to enter the country illegally.\n    - In 2024, President Trump promised to declare an emergency to secure the border and use the military where necessary to protect Americans from foreign threats.\n    - This Executive Order will allow the government to gain operational control of the border, combat the cartels, and secure our nation.\n    - As President Trump described in 2018: “Illegal immigration affects the lives of all Americans. Illegal immigration hurts American workers; burdens American taxpayers; and undermines public safety; and places enormous strain on local schools, hospitals, and communities in general, taking precious resources away from the poorest Americans who need them most. Illegal immigration costs our country billions and billions of dollars each year…And I will therefore take every lawful action at my disposal to address this crisis. And that’s what we’re doing.”\n",
  "summary": "**President Donald J. Trump** has signed an **Executive Order** invoking a national emergency at the southern border of the United States as of **January 22, 2025**. This proclamation cites an ongoing immigration crisis exacerbated by four years of increasing illegal immigration numbers. The Executive Order seeks to bolster border security by deploying additional military personnel and completing the long-debated border wall. It explicitly directs the Secretaries of Defense and Homeland Security to carry out these tasks efficiently and provide necessary operational flexibility to the Department of Homeland Security (DHS).\n\nThe administration reports a staggering **8.72 million border encounters** from fiscal years 2021 to 2024, posing significant challenges to existing border resources and local communities. The order also addresses the flow of dangerous narcotics like fentanyl and the activity of gangs such as the Venezuelan **Tren de Aragua**, citing serious societal impact. It references past precedents, including Trump's 2019 national emergency declaration, to emphasize a commitment to restoring control of the border, protecting American citizens, and combating illegal networks.",
  "eli5": "President Trump wants to make the border safer because too many people are coming in illegally, and it's causing problems with drugs and gangs. So he's sending more soldiers to help and finish building a big wall.",
  "keywords": [
    "National Emergency",
    "Southern Border",
    "Executive Order",
    "Immigration",
    "Border Security",
    "Donald Trump",
    "Military Deployment",
    "Fentanyl Crisis",
    "Tren de Aragua",
    "DHS",
    "Human Trafficking",
    "Illegal Immigration"
  ],
  "issues": [
    "Potential legal challenges to the declaration of the national emergency",
    "Effectiveness and cost of deploying additional military personnel",
    "Impact on local communities and government resources",
    "Humanitarian concerns regarding immigration policy"
  ],
  "citations": [
    "National Emergencies Act"
  ],
  "document_type": "Fact Sheet"
}