{
  "title": "Fact Sheet: President Donald J. Trump Ends Taxpayer Subsidization of Open Borders – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Ends Taxpayer Subsidization of Open Borders",
  "og:description": "PRESERVING FEDERAL BENEFITS FOR AMERICAN CITIZENS: Today, President Donald J. Trump signed an Executive Order to ensure taxpayer resources are not used to",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-ends-taxpayer-subsidization-of-open-borders/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-20T03:07:11+00:00",
  "article:modified_time": "2025-02-20T03:07:12+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# **Fact Sheet: President Donald J. Trump Ends Taxpayer Subsidization of Open Borders**\n\nFebruary 19, 2025\n\n**PRESERVING FEDERAL BENEFITS FOR AMERICAN CITIZENS:** Today, President Donald J. Trump signed an Executive Order to ensure taxpayer resources are not used to incentivize or support illegal immigration.\n    - The Order directs Federal departments and agencies to identify all federally funded programs currently providing financial benefits to illegal aliens and take corrective action.\n    - It ensures that Federal funds to states and localities will not be used to support “sanctuary” policies or assist illegal immigration.\n    - It mandates improvements in eligibility verification to prevent benefits from going to individuals unlawfully present in the United States.\n    - President Trump is committed to safeguarding Federal public benefits for American citizens who are truly in need, including individuals with disabilities and veterans.\n\n**TAXPAYERS ARE FOOTING THE BILL FOR ILLEGAL IMMIGRATION:**With this Executive Order, President Trump is ensuring taxpayer resources are used to protect the interests of American citizens, not illegal aliens.\n    - The surge in illegal immigration, enabled by the previous Administration, is siphoning dollars and essential services from American citizens while state and local budgets grow increasingly strained.\n    - Under current welfare laws, specifically the Personal Responsibility and Work Opportunity Reconciliation Act of 1996 (PRWORA), illegal aliens are generally barred from welfare programs. But if they’re granted parole, they are classified as “qualified aliens” and become eligible for various welfare programs on a sliding scale, with full eligibility granted within five years.\n    - According to the Center for Immigration Studies (CIS), providing welfare to one million illegal aliens could cost American taxpayers an additional $3 billion annually.\n    - The U.S. House Homeland Security Committee estimated that taxpayers could pay as much as $451 billion to care for illegal aliens and gotaways that have entered the United States unlawfully since January 2021.\n    - The Federation for American Immigration Reform (FAIR) calculated that American taxpayers spend at least $182 billion annually to cover the costs incurred by the presence of 20 million illegal aliens and their children, which includes $66.5 billion in Federal expenses plus an additional $115.6 billion in state and local expenses.\n    - The Congressional Budget Office (CBO) estimated that the Biden Administration’s open borders agenda, which sought to provide Medicaid-funded emergency services to illegal aliens, has cost Federal and state taxpayers more than $16.2 billion.\n    - The Biden Administration gave billions in taxpayer dollars to left-wing groups that facilitated mass illegal migration and provided legal services to challenge deportation orders.\n    - In addition, since 2021, more than $1 billion has been allocated through the Federal Emergency Management Agency (FEMA) to illegal aliens.\n\n**SECURING THE BORDER AND PUTTING AMERICANS FIRST:**President Trump has delivered on his promise to secure the border and prioritize the needs of American citizens, taking immediate action to put an end to the previous Administration’s border crisis. Since taking office, President Trump has:\n    - Declared a national emergency at the southern border.\n    - Deployed additional personnel to the border, including members of the Armed Forces and the National Guard.\n    - Restarted border wall construction.\n    - Designated international cartels and other criminal organizations – such as MS-13 and Tren de Aragua – as Foreign Terrorist Organizations and Specially Designated Global Terrorists.\n    - Suspended the entry of aliens into the U.S.\n    - Called for enhanced vetting and screening of aliens.\n    - Required the identification of countries that warrant a partial or full suspension on the admission of nationals.\n    - Restarted the detention and removal of aliens who are in violation of Federal law.\n    - Directed the Administration to resume the Migrant Protection Protocols – also known as “Remain in Mexico” – as soon as practicable.\n    - Ended the use of the CBP One app.\n    - Terminated all categorical parole programs, such as the “Processes for Cubans, Haitians, Nicaraguans, and Venezuelans,” that are contrary to President Trump’s immigration agenda.\n    - Ended automatic citizenship for children of illegal aliens.\n    - Paused the operation of the U.S. Refugee Admissions Program (USRAP).\n    - Ended catch-and-release policies.\n    - Revoked Biden’s disastrous executive actions that essentially opened our southern border.\n    - Detained the most dangerous illegal criminal aliens in Guantanamo Bay.\n",
  "summary": "On February 19, 2025, President Donald J. Trump signed an Executive Order aimed at preventing the use of taxpayer funds to support illegal immigration in the United States. The order directs federal departments and agencies to identify and correct federally funded programs that provide financial benefits to individuals unlawfully present in the country. It seeks to stop federal funding from supporting sanctuary policies and mandates improvements in eligibility verification for federal benefits. The intention is to preserve these resources for American citizens genuinely in need, such as veterans and individuals with disabilities.\n\nPresident Trump justifies this action by highlighting the financial strain illegal immigration purportedly places on American taxpayers and resources. The executive order follows reports and estimates from various committees and organizations, suggesting that past policies have resulted in substantial costs due to the support of illegal immigrants. The action aligns with Trump's broader intent to secure the border and prioritize American citizens by reinstating border wall construction and suspending certain parole programs, amongst other measures aimed at controlling immigration.\n\nThe order is positioned against the previous administration's alleged open borders agenda, which President Trump argues exacerbated the illegal immigration problem. Efforts to rectify this include deploying additional personnel to the southern border, revoking certain executive actions, and implementing more stringent entry and removal policies for aliens. The administration's ultimate goal, as outlined, is to ensure national security and equitable distribution of federal benefits.",
  "eli5": "President Trump made a new rule so that American money isn't spent on people who are in the country without permission. He's trying to use that money to help Americans like veterans and people with disabilities instead.",
  "keywords": [
    "Executive Order",
    "illegal immigration",
    "taxpayer funds",
    "sanctuary policies",
    "border security",
    "Federal benefits",
    "Trump Administration"
  ],
  "issues": [
    "Potential legal challenges due to immigration policy changes",
    "Verification processes for federal benefits eligibility",
    "Impact on local governments with sanctuary policies"
  ],
  "citations": [
    "Personal Responsibility and Work Opportunity Reconciliation Act of 1996 (PRWORA)"
  ],
  "document_type": "Fact Sheet"
}