{
  "title": "Fact Sheet: President Donald J. Trump Ends the Procurement and Forced Use of Paper Straws – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Ends the Procurement and Forced Use of Paper Straws",
  "og:description": "ENDING THE FORCED USE OF PAPER STRAWS: Today, President Donald J. Trump signed an Executive Order to end the procurement and forced use of paper straws.",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-ends-the-procurement-and-forced-use-of-paper-straws/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T04:01:42+00:00",
  "article:modified_time": "2025-02-11T16:13:25+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Ends the Procurement and Forced Use of Paper Straws\t\t\t\t\n\nFebruary 10, 2025\n\n**ENDING THE FORCED USE OF PAPER STRAWS:** Today, President Donald J. Trump signed an Executive Order to end the procurement and forced use of paper straws.\n    - The Federal government is directed to stop purchasing paper straws and ensure they are no longer provided within Federal buildings.\n    - The Order requires the development of a National Strategy to End the Use of Paper Straws within 45 days to alleviate the forced use of paper straws nationwide.\n\n**BRINGING BACK COMMON SENSE:** The irrational campaign against plastic straws has forced Americans to use nonfunctional paper straws. This ends under President Trump.\n    - Cities and states across America have banned plastic straws, caving to pressure from woke activists who prioritize symbolism over science.\n    - Paper straws use chemicals that may carry risks to human health – including “forever chemical” PFAS (per- and polyfluoroalkyl substances) which are known to be highly water soluble and can bleed from the straw into a drink.       - A study found that while PFAS were found in paper straws, no measurable PFAS were found in plastic straws.  \n    - Paper straws are more expensive than plastic straws, and often force users to use multiple straws.\n    - Paper straws are not the eco-friendly alternative they claim to be – studies have shown that producing paper straws can have a larger carbon footprint and require more water than plastic straws.\n    - Paper straws often come individually wrapped in plastic, undermining the environmental argument for their use.\n\n**PROMOTING A CLEAN AND HEALTHY ENVIRONMENT:**President Trump has made it a top priority to promote a clean and healthy environment for the American people.\n    - President Trump’s policies are promoting economic growth, while still maintaining standards that allow Americans to have among the cleanest air and water in the world.\n    - This marks a sharp contrast from the previous Administration, which wasted American taxpayer dollars on virtue signaling instead of implementing effective solutions.       - For instance, the Biden Administration spent billions on electric vehicle charging stations, yet only eight were completed. \n    - Meanwhile, President Trump’s commonsense approach to environmental conservation has demonstrated his true commitment to preserving America’s natural resources.\n    - President Trump has championed improved forest management in order to prevent forest fires that are devastating communities and ecosystems across the country.\n    - By pausing the expansion of windmills, President Trump recognized their detrimental environmental impact, particularly on wildlife, often outweighs their benefits.\n    - President Trump signed the Save Our Seas Act to preserve and protect our beautiful waters and oceans from being littered with garbage.  \n    - President Trump is committed to securing American energy independence, recognizing that America’s domestic supply of clean coal and natural gas not only strengthens national security but also provides some of the cleanest energy in the world.\n",
  "summary": "**President Donald J. Trump signed an Executive Order on February 10, 2025, to end the procurement and mandatory use of paper straws within Federal buildings.** The order directs the Federal government to cease purchasing paper straws and establishes a 45-day timeline to develop a National Strategy to phase out paper straws nationwide. The decision is based on concerns over the inefficacy and potential health risks of paper straws, as well as their environmental impact. Paper straws have been criticized for containing PFAS, known as “forever chemicals,” which are highly soluble in water and may migrate into beverages.\n\n**The document argues for a return to plastic straws citing cost-effectiveness and lesser environmental impact.** Trump’s administration criticizes previous bans on plastic straws as being driven by appearance over science, noting the potential risks and higher costs associated with paper straws. The document further outlines President Trump's broader environmental policies, aiming to balance economic growth with environmental conservation. This includes enhanced forest management and energy independence while critiquing prior initiatives, including those on electric vehicle infrastructure.\n\n**President Trump's approach prioritizes practical environmental conservation strategies over symbolic gestures.** His administration underscores the negative impacts of certain renewable energy sources, such as windmills, and promotes the responsible management of natural resources. The order promotes American energy independence with clean coal and natural gas as pivotal elements supporting both economic and security objectives.",
  "eli5": "President Trump decided that people don’t need to use paper straws anymore because they don't work well and might be bad for health. He wants to let people use plastic straws again, saying they’re not as bad as people think.",
  "issues": [
    "The impact of ending the use of paper straws on environmental sustainability.",
    "Potential health issues related to PFAS in paper straws.",
    "Economic implications of returning to plastic straws.",
    "Accuracy of environmental claims regarding paper straws compared to plastic.",
    "Criticism of renewable energy infrastructure like windmills and electric vehicle stations."
  ],
  "citations": [],
  "keywords": [
    "Executive Order",
    "Donald J. Trump",
    "Paper Straws",
    "Plastic Straws",
    "Environmental Policy",
    "PFAS",
    "Energy Independence",
    "Forest Management",
    "Windmills"
  ],
  "document_type": "Fact Sheet"
}