{
  "title": "Fact Sheet: President Donald J. Trump Reinstates Service Members Discharged for Refusing the COVID Vaccine – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Reinstates Service Members Discharged for Refusing the COVID Vaccine – The White House",
  "og:description": "RESINSTATING THE UNJUSTLY DISCHARGED: Today, President Donald J. Trump signed an Executive Order to reinstate service members who were dismissed for",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-reinstates-service-members-discharged-for-refusing-the-covid-vaccine/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-27T13:25:00+00:00",
  "article:modified_time": "2025-01-28T13:25:46+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Reinstates Service Members Discharged for Refusing the COVID Vaccine****\n\nJanuary 27, 2025\n\n**RESINSTATING THE UNJUSTLY DISCHARGED:**Today, President Donald J. Trump signed an Executive Order to reinstate service members who were dismissed for refusing the COVID vaccine, with full back pay and benefits.\n    - The Executive Order directs the Secretary of Defense to reinstate all members of the military (active and reserve) who were discharged for refusing the COVID vaccine and who request to be reinstated.       - Those who are reinstated will receive their former rank and full back pay with benefits. \n\n**CORRECTING AN INJUSTICE:** In spite of the scientific evidence, the Biden Administration discharged healthy service members—many of whom had natural immunity and dedicated their entire lives to serving our country—for refusing the COVID vaccine. Government redress of these wrongful dismissals is overdue.\n    - From 2021 to 2023, the Biden Administration and former Secretary of Defense Lloyd Austin discharged over 8,000 troops solely due to their COVID-19 vaccination status.       - Such dismissals likely had a chilling effect on recruitment, with the Department of Defense missing its collective recruiting targets by around 41,000 recruits in FY2023.\n      - After the vaccine mandate was repealed in 2023, only 43 of the more than the 8,000 troops dismissed elected to return to service under the Biden Administration and Secretary Austin. \n\n**CHARTING A NEW COURSE FORWARD:** In 2024, President Trump declared that “there should have never been a [COVID vaccine] mandate. That should have never happened.” \n    - President Trump went on to lament that, due to the mandate, “we’ve lost some of our best people in the military too.”\n    - President Trump duly promised in 2024 that he “will rehire every patriot who was fired from the military with…backpay. They will get their backpay…”\n",
  "summary": "On January 27, 2025, President Donald J. Trump signed an Executive Order aimed at reinstating military service members discharged for refusing the COVID-19 vaccine. This order mandates the Secretary of Defense to reinstate all service members, both active and reserve, who request it. Those reinstated will receive full back pay and benefits and regain their former ranks. The reinstatement comes in response to actions by the previous Biden Administration that resulted in over 8,000 troops being dismissed purely for their vaccination status.\n\nThis Executive Order seeks to address what is termed as an 'injustice,' referencing the dismissal of service members despite their potential natural immunity and proven service records. The Biden Administration faced critiques for these dismissals, particularly as it missed its recruitment targets significantly in FY2023. Furthermore, it underlines President Trump’s 2024 pledge to rehire and financially compensate affected service members as an effort to correct past decisions surrounding the COVID-19 vaccine mandate.",
  "eli5": "President Trump decided to give jobs back to military people who were let go because they didn't take a COVID shot. He's also making sure they get their pay and benefits back.",
  "keywords": [
    "Donald Trump",
    "Executive Order",
    "military reinstatement",
    "COVID vaccine",
    "Biden Administration",
    "service members",
    "back pay",
    "recruitment"
  ],
  "issues": [
    "Accuracy of claims about natural immunity",
    "Impact on military recruitment and readiness",
    "Political implications of reinstating service members",
    "Implementation details of back pay and benefits"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}