{
  "title": "Fact Sheet: President Donald J. Trump Establishes the Make America Healthy Again Commission – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Establishes the Make America Healthy Again Commission",
  "og:description": "MAKING AMERICA HEALTHY AGAIN: Today, President Donald J. Trump signed an Executive Order establishing the President’s Make America Healthy Again",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-establishes-the-make-america-healthy-again-commission/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-13T20:46:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Establishes the Make America Healthy Again Commission\t\t\t\t\n\nFebruary 13, 2025\n\n**MAKING AMERICA HEALTHY AGAIN:** Today, President Donald J. Trump signed an Executive Order establishing the President’s Make America Healthy Again Commission.\n    - Chaired by U.S. Health and Human Services Secretary Robert F. Kennedy Jr., the Commission is tasked with investigating and addressing the root causes of America’s escalating health crisis, with an initial focus on childhood chronic diseases.\n    - Within 100 days, the Commission will produce an assessment that summarizes what is known and what questions remain regarding the childhood chronic disease crisis, and include international comparisons.\n    - Within 180 days, the Commission will produce a strategy, based on the findings of the assessment, to improve the health of America’s children.\n    - The Commission has four main policy directives to reverse chronic disease:       - Empower Americans through transparency and open-source data and avoid conflicts of interest in all federally funded health research.       - Prioritize gold-standard research on why Americans are getting sick in all health-related research funded by the federal government.       - Work with farmers to ensure that U.S. food is the healthy, abundant and affordable.        - Ensure expanded treatment options and health coverage flexibility for beneficial lifestyle changes and disease prevention. \n    - The Commission aims to restore trust in medical and scientific institutions and hold public hearings, meetings, roundtables, and similar events to receive expert input from leaders in public health.\n\n**ADDRESSING THE RISE OF CHRONIC ILLNESSES:** President Trump understands that America’s healthcare system is largely focused on treating chronic illnesses rather than preventing them, leading to a growing health crisis with serious economic and national security consequences.\n    - Based on all health indicators and global comparisons, Americans are becoming sicker, beset by illnesses that our medical system isn’t addressing effectively.       - In the United States, six in 10 adults have at least one chronic condition, and four in 10 have two or more.       - Prior to COVID, American life expectancy averaged 78.8 years, while comparable countries averaged 82.6 years, creating a gap that equates to 1.25 billion fewer life years for Americans.       - The United States has the highest age-standardized cancer incidence rate across 204 countries, nearly double the next-highest rate.         - From 1990 to 2021, the United States saw an 88% increase in cancer.        - Asthma is far more common in the United States than in other parts of the world, including most of Europe, Asia, and Africa. \n    - The rise in chronic conditions is not limited to adults.       - Childhood is usually the healthiest period of life, yet as of 2022, 30 million (40.7%) United States children had at least one health condition like allergies, asthma, or autoimmune diseases.       - Autism now affects one in 36 children, a staggering increase from rates of one to four out of 10,000 children identified with the condition during the 1980s.       - 18% of teens suffer from fatty liver disease, nearly 30% are prediabetic, and more than 40% are overweight or obese – these conditions were virtually unheard of in prior generations.       - The incidence of childhood cancer, while still rare, increased 0.8% per year since 1975—an over 40% increase over 45 years.        - Overmedication, particularly among children, is a growing concern. More than 3.4 million children are currently taking medication for ADD/ADHD and diagnoses continue to rise. \n    - Chronic disease has widespread effects, including on our military and our economy.       - 77% of young adults do not qualify for military service without a waiver, primary due to being overweight, drug use, or mental and physical health issues.       - 90% of America’s $4.5 trillion healthcare expenditure is directed at managing chronic and mental health conditions.        - The United States spends almost twice per capita what other wealthy countries spend on healthcare. \n    - Americans have lost trust in our health system, skeptical as to whether they are receiving honest answers about the causes of the country’s health crisis and how to improve it.       - Only a third of Americans trust the U.S. health system, a near-record low. \n\n**TAKING ON THE HEALTH CRISIS:**President Trump is fulfilling his promise to tackle the health crisis facing America.\n    - President Trump pledged that upon returning to the White House he would establish a special Presidential Commission that’s “not bought and paid for by Big Pharma, and I will charge them with investigating what is causing the decades-long increase in chronic illnesses […] And then, I will ask them to publish recommendations for how every American child can have a safe and healthy childhood.”\n    - In his first term, President Trump lowered healthcare costs, provided more healthcare options, and ensured better care for the American people.\n    - President Trump has consistently championed initiatives aimed at improving the health and well-being of Americans. Select actions from the prior Trump Administration include:       - Passed Right To Try to give terminally ill patients access to lifesaving cures.       - Signed an executive order to fight kidney disease with more transplants and better treatment.       - Accelerated medical breakthroughs in genetic treatments for Sickle Cell disease.       - Declared the opioid crisis a nationwide public health emergency and signed the SUPPORT for Patients and Communities Act, the largest-ever legislative effort to address a drug crisis in our Nation’s history.        - Expanded access to telehealth, especially in rural and underserved communities.\n",
  "summary": "President Donald J. Trump has signed an Executive Order establishing the Make America Healthy Again Commission on February 13, 2025. The commission aims to tackle the root causes of America's escalating health crisis, focusing initially on childhood chronic diseases. Robert F. Kennedy Jr., the U.S. Health and Human Services Secretary, will chair the commission. The commission is tasked with producing an assessment within 100 days on what is known and what needs to be addressed regarding childhood chronic diseases, and a strategic plan within 180 days to improve the health of American children.\n\nThe commission has outlined key policy directives to enhance public health, including promoting open-source data and transparency in health research, prioritizing research on disease causes, collaborating with farmers for healthier food, and facilitating increased treatment and coverage options for health improvements. The initiative seeks to restore trust in medical institutions through public hearings and engagements with public health leaders. President Trump emphasizes the need to address chronic illnesses, which significantly burden America’s healthcare system, economy, and military readiness.",
  "eli5": "The President made a plan to help make people healthier in America. He started a special team to figure out why so many kids are getting sick and to find ways to make everyone feel better.",
  "keywords": [
    "Make America Healthy Again Commission",
    "Donald J. Trump",
    "Robert F. Kennedy Jr.",
    "childhood chronic diseases",
    "health crisis",
    "U.S. Health and Human Services"
  ],
  "issues": [
    "The specifics of how the commission will achieve its goals are not detailed.",
    "Potential conflicts of interest in federally funded health research are mentioned.",
    "Trust in the U.S. health system is notably low."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}