{
  "title": "Fact Sheet: President Donald J. Trump Re-designates the Houthis as a Foreign Terrorist Organization – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Re-designates the Houthis as a Foreign Terrorist Organization",
  "og:description": "REVERSING THE BIDEN ADMINISTRATION’S REMOVAL OF THE HOUTHIS FROM THE FOREIGN TERRORIST ORGANIZATION LIST: Today, President Donald J. Trump signed an",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-re-designates-the-houthis-as-a-foreign-terrorist-organization/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T23:22:11+00:00",
  "article:modified_time": "2025-01-24T19:01:56+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFACT SHEET: President Donald J. Trump Re-designates the Houthis as a Foreign Terrorist Organization\t\t\t\t\n\nJanuary 22, 2025\n\nREVERSING THE BIDEN ADMINISTRATION’S REMOVAL OF THE HOUTHIS FROM THE FOREIGN TERRORIST ORGANIZATION LIST: Today, President Donald J. Trump signed an Executive Order Re-Designating Ansar Allah (also known as the Houthis) as a Foreign Terrorist Organization.\n    - The Executive Order sets in motion a process by which Ansar Allah, also known as the Houthis, will be designated as a Foreign Terrorist Organization.       - President Trump designated the Iranian-backed Houthis as a foreign terrorist organization (FTO) in January 2021.\n      - Within one month of taking office, the Biden administration reversed the Houthis’ designation.\n      - As a result of the Biden administration’s weak policy, the Houthis have fired at U.S. Navy warships dozens of times, launched numerous attacks on civilian infrastructure in partner nations, and attacked commercial vessels transiting Bab al-Mandeb more than 100 times.\n      - The Executive Order directs the Secretary of State, in consultation with others, to recommend the re-designation of the Houthis within 30 days. \n    - Under President Trump, it is now the policy of the United States to cooperate with its regional partners to eliminate the Houthis’ capabilities and operations, deprive them of resources, and thereby end their attacks on U.S. personnel and civilians, U.S. partners, and maritime shipping in the Red Sea.\n    - Following the Houthis’ re-designation as an FTO, the Executive Order also directs the Administrator of the United States Agency for International Development (USAID) and the Secretary of State to jointly review United Nations partners, nongovernmental organizations, and contractors operating in Yemen.\n    - Following this review, the President will direct USAID to end its relationship with entities that have made payments to the Houthis, or which have opposed international efforts to counter the Houthis while turning a blind eye towards the Houthis’ terrorism and abuses.\n",
  "summary": "# Summary\n\nOn January 22, 2025, President Donald J. Trump signed an Executive Order to re-designate the Yemeni group Ansar Allah, also known as the Houthis, as a Foreign Terrorist Organization (FTO). This reverses the 2021 decision by the Biden administration to remove the Houthis from the FTO list. The action underscores a shift in U.S. policy, emphasizing increased cooperation with regional partners to dismantle the Houthis' operational capacities and to halt their attacks on U.S. and allied interests.\n\nThe Executive Order stipulates that the Secretary of State, with assistance, must recommend a re-designation of the Houthis within 30 days. Additionally, the Administrator of the United States Agency for International Development (USAID) and the Secretary of State are tasked to review entities in Yemen involved with the Houthis. The President could direct USAID to sever connections with organizations paying the Houthis or opposing efforts to counter them. This move aims to undermine the Houthis' resources and operations in the region.",
  "eli5": "President Trump wants to call the Houthis in Yemen \"bad guys\" again and stop them from hurting people and ships near the water.",
  "keywords": [
    "Trump",
    "Houthis",
    "Foreign Terrorist Organization",
    "Executive Order",
    "USAID",
    "Yemen",
    "Biden Administration"
  ],
  "issues": [
    "Potential impact on humanitarian efforts in Yemen",
    "Escalation of regional tensions",
    "Effectiveness of the re-designation in reducing threats"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}