{
  "title": "Fact Sheet: President Donald J. Trump Establishes the National Energy Dominance Council – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Establishes the National Energy Dominance Council",
  "og:description": "POSITIONING AMERICAN ENERGY FOR THE NEXT CENTURY: Today, President Donald J. Trump signed an Executive Order establishing the National Energy Dominance",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-establishes-the-national-energy-dominance-council/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-15T03:08:15+00:00",
  "article:modified_time": "2025-02-15T03:08:16+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Establishes the National Energy Dominance Council\t\t\t\t\n\nFebruary 14, 2025\n\n**POSITIONING AMERICAN ENERGY FOR THE NEXT CENTURY**: Today, President Donald J. Trump signed an Executive Order establishing the National Energy Dominance Council.\n    - The National Energy Dominance Council will be established within the Executive Office of the President, chaired by the Secretary of the Interior Doug Burgum and vice-chaired by the Secretary of Energy Chris Wright, and comprised of members of President Trump’s cabinet and key government agencies.\n    - The Council will advise President Trump on strategies to achieve energy dominance by improving the processes for permitting, production, generation, distribution, regulation, and transportation across all forms of American energy.\n    - It will recommend a National Energy Dominance Strategy to the President aimed at cutting red tape, enhancing private sector investments, and advancing innovation.\n    - The Council will facilitate cooperation between the federal government and domestic energy partners, ensuring policy consistency.\n    - It will also consult with various public and private sector stakeholders to expand energy production and address cost barriers.\n\n**LOWERING PRICES AND STRENGTHENING AMERICAN ECONOMIC SECURITY**: Championing domestic energy production is vital both for mitigating price shocks to American families and de-risking the energy supply chain for our Nation as well as our allies.\n    - American energy dominance is the most reliable way to ensure the stability and affordability of American energy prices.       - Gasoline prices, as well as overall household energy prices, increased 30% under President Biden.       - The Biden-Harris Administration dramatically slowed the growth rate of American energy production and development, including by instituting a federal oil leasing moratorium, increasing energy permitting times by multiples of what they had been under President Trump, and removing hundreds of million acres from being available for energy production.        - Over the last four years, it is estimated that our Nation produced over two billion fewer barrels of oil than anticipated by trend (had President Trump’s energy policies been kept intact), a vast quantity of lost supply that could have lessened the burden of energy prices on American families. \n    - Developing American energy resources will enable our Nation to reduce its reliance on foreign entities, including strategic adversaries.       - While creating policies to restrict American production, the Biden Administration asked OPEC+ to increase production to meet American energy demand.       - As energy prices rose, the Biden Administration was reluctant to enforce American oil sanctions on rogue regimes, allowing Iran to export over one million barrels of oil per day through lax enforcement (up from a low of approximately 70,000 under the Trump administration) and temporarily lifting oil sanctions altogether on the Maduro regime in Venezuela.       - The United States is also highly dependent on China for a range of critical minerals, which has put our Nation’s supply chain at risk, as exemplified by China’s recent weaponization of its resources through bans on exporting germanium, gallium, and antimony to the United States.        - As our Nation makes rapid advancements in next generation technologies, such as artificial intelligence (along with the associated data centers), and energy demand rises, it will be all the more important to expand domestic energy supply. \n    - American energy leadership is vital not only for our Nation’s economic and national security, but also for the security of our allies.       - America’s liquefied natural gas (LNG) industry has played a critical role in helping Europe reduce its dependence on Russian energy, with LNG exports to Europe rising 141% in 2022, and continuing to increase to fill the gap.        - President Trump warned Western Europe as early as 2017 to rely on American natural gas rather than Russian energy. \n\n**RESTORING AMERICAN ENERGY DOMINANCE**: President Trump has a demonstrated track record of empowering American energy production, and will return our Nation to energy dominance.\n    - During President Trump’s first term, our Nation became a net exporter of energy for the first time in nearly 70 years and transformed into the world’s leading oil producer.\n    - President Trump expedited the LNG export license process (achieving licensing times one-sixth as long as those seen during the Biden Administration, which revoked these reforms), reduced the permitting time for drilling on federal lands (increasing permit applications by 300%), fixed the New Source Review (which punished companies for repairing and upgrading coal power plants), and opened up millions of acres for domestic energy development.\n    - Under President Trump’s leadership, American families saved an average of $2,500 per year in utility and gas costs, while the economy at large saw the creation of new American energy jobs.\n",
  "summary": "**National Energy Dominance Council Established by President Trump**: On February 14, 2025, President Donald J. Trump signed an Executive Order to form the National Energy Dominance Council. Chaired by Secretary of the Interior Doug Burgum and vice-chaired by Secretary of Energy Chris Wright, the Council will include members of the President's cabinet and key government agencies. Its primary aim is to advise the President on achieving energy dominance by streamlining processes in permitting, production, and distribution of American energy. The Council will work with various stakeholders to advance energy production, cut red tape, and enhance private sector investment.\n\n**Focus on Domestic Energy Production and Economic Security**: The plan emphasizes reducing U.S. reliance on foreign energy, criticizing the previous administration for policies that allegedly hindered domestic energy production and citing the increased energy costs under President Biden. The proposal outlines the need for domestic independence to strengthen the national supply chain and economic security. It also highlights past successes in the LNG sector and energy exports under Trump's leadership as critical to achieving energy stability. \n\n**Restoration of American Energy Dominance**: The Council's recommendations aim to restore the U.S. to a state of energy dominance, as seen during Trump's first term. Strategies include expediting licensing processes for exports, reducing permitting times for drilling, and fostering American energy jobs. The document underscores the economic benefits these policies provided American families previously, presenting a case for their reinstatement.",
  "eli5": "President Trump wants America to be number one in making and using energy, like oil and gas, by creating a special team to help him figure out how to make this happen again.",
  "keywords": [
    "National Energy Dominance Council",
    "American energy",
    "energy production",
    "domestic energy",
    "economic security",
    "energy policy"
  ],
  "issues": [
    "No explicit laws or regulations cited.",
    "Potential political bias in comparing administrations.",
    "Lack of specific targets or metrics for energy dominance."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}