{
  "title": "Fact Sheet: President Donald J. Trump Addresses the Threat to National Security from Imports of Timber, Lumber, and their Derivative Products – ]\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Addresses the Threat to National Security from Imports of Timber, Lumber, and their Derivative Products",
  "og:description": "SECURING AMERICA’S LUMBER SUPPLY: Today, President Donald J. Trump signed an Executive Order launching an investigation into how imports of timber,",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-addresses-the-threat-to-national-security-from-imports-of-timber-lumber-and-their-derivative-products/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-01T15:26:06+00:00",
  "article:modified_time": "2025-03-03T15:27:41+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Addresses the Threat to National Security from Imports of Timber, Lumber, and Their Derivative Products\t\t\t\t\n\nMarch 1, 2025\n\n**SECURING AMERICA’S LUMBER SUPPLY:** Today, President Donald J. Trump signed an Executive Order launching an investigation into how imports of timber, lumber, and their derivative products threaten America’s national security and economic stability.\n    - The Order directs the Secretary of Commerce to initiate a Section 232 investigation under the Trade Expansion Act of 1962.\n    - This investigation will assess the national security risks arising from the United States’ increasing dependence on imported timber, lumber, and derivative products like paper, furniture, and cabinetry, and the potential need for trade remedies to safeguard domestic industry.\n    - The investigation will culminate in a report identifying vulnerabilities in the lumber supply chain and providing recommendations to enhance the resilience of America’s domestic wood products industry.\n\n**ADDRESSING THE THREAT TO NATIONAL SECURITY:** President Trump recognizes that an overreliance on foreign timber, lumber, and their derivative products could jeopardize the United States’ defense capabilities, construction industry, and economic strength.\n    - Timber and lumber are essential materials for national security, economic stability, and industrial resilience.       - Lumber plays a vital role in civilian construction and military infrastructure.        - The U.S. military spends over ten billion dollars annually on construction and is testing innovative wood products such as cross-laminated timber. \n    - The United States has been a net importer of lumber since 2016, despite having the practical production capacity to supply 95% of the United States’ 2024 softwood consumption.\n    - Foreign supply chains and major exporters increasingly fill U.S. demand, creating vulnerabilities to disruptions.\n    - America’s reliance on imported lumber is exacerbated by foreign government subsidies and predatory trade practices, which undermine the competitiveness of the U.S. wood products industry.\n\n**STRENGTHENING AMERICAN INDUSTRY:**This Executive Order builds on previous actions taken by the Trump Administration to ensure U.S. trade policy serves the nation’s long-term interests.\n    - On Day One, President Trump initiated his America First Trade Policy to make America’s economy great again.\n    - President Trump signed proclamations to close existing loopholes and exemptions in order to restore a true 25% tariff on steel and elevate the tariff to 25% on aluminum.\n    - President Trump implemented a 10% additional tariff on imports from China in response to China’s role in importing illegal drugs to the United States.  \n    - President Trump unveiled the “Fair and Reciprocal Plan” on trade to restore fairness in U.S. trade relationships and counter non-reciprocal trade agreements.   \n    - President Trump signed a memorandum to safeguard American innovation, including the consideration of tariffs to combat digital service taxes (DSTs), fines, practices, and policies that foreign governments levy on American companies.\n    - President Trump launched a Section 232 investigation into how copper imports threaten America’s national security and economic stability.\n",
  "summary": "**Summary**\n\nPresident Donald J. Trump signed an Executive Order on March 1, 2025, initiating an investigation into the national security risks associated with the U.S.'s reliance on imported timber, lumber, and their derivative products like paper, furniture, and cabinetry. The Secretary of Commerce will lead this investigation under Section 232 of the Trade Expansion Act of 1962, assessing the economic and security vulnerabilities posed by foreign dependencies in the lumber supply chain. The ultimate goal is to determine the need for trade remedies to protect and strengthen the domestic wood products industry.\n\nThe investigation into the timber and lumber imports is based on concerns that over-dependence on these foreign goods could compromise U.S. defense capabilities and economic stability. Currently, despite its potential to produce most of its softwood needs domestically, the U.S relies heavily on imports, a situation made worse by foreign government subsidies and predatory trade practices. The investigation aims to pinpoint supply chain weaknesses and propose strategies to bolster the domestic industry and enhance national security.\n\n**Strengthening American Industry**\n\nThis initiative is part of President Trump's broader efforts to reinforce American industry through the \"America First Trade Policy.\" Past actions have included raising tariffs on steel and aluminum, responding to China's trade practices by increasing tariffs, and launching investigations into other import threats like copper. These measures reflect a consistent policy to secure economic growth and reinforce the United States' global trade standing.\n",
  "eli5": "President Trump is checking if getting wood from other countries is bad for America's security. He wants to make sure America has enough of its own wood for building things like houses and military stuff.",
  "keywords": [
    "Donald Trump",
    "Executive Order",
    "Timber",
    "Lumber",
    "National Security",
    "Trade Expansion Act",
    "Imports",
    "Section 232",
    "America First Trade Policy",
    "Domestic Industry"
  ],
  "issues": [
    "Potential impact on international trade relations.",
    "Economic implications of increased tariffs or trade barriers.",
    "Feasibility of increasing domestic lumber production."
  ],
  "citations": [
    "Trade Expansion Act of 1962"
  ],
  "document_type": "Fact Sheet"
}