{
  "title": "Fact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis",
  "og:description": "DELIVERING EMERGENCY PRICE RELIEF: Today, President Donald J. Trump signed a Presidential Memorandum to deliver emergency price relief for American",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-delivers-emergency-price-relief-for-american-families-to-defeat-the-cost-of-living-crisis/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T19:40:05+00:00",
  "article:modified_time": "2025-01-24T17:29:46+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis\t\t\t\t\n\nJanuary 22, 2025\n\nDELIVERING EMERGENCY PRICE RELIEF: Today, President Donald J. Trump signed a Presidential Memorandum to deliver emergency price relief for American families and defeat the cost-of-living crisis.\n    - The Presidential Memorandum recognizes a critical component of the crushing cost of everyday living. The Biden Administration imposed complex regulatory burdens and radical policies designed to weaken American production. \n    - President Trump is ordering all Federal agencies to untangle the American economy from Biden constraints and improve affordability of necessary goods and services and increase the prosperity of the American workers.\n    - This includes action to:       - Drastically lower the cost of housing and expand housing supply;       - Eliminate unnecessary administrative expenses and rent-seeking practices that drive up healthcare costs;       - Eliminate counterproductive requirements raising the costs of home appliances;       - Create employment opportunities for American workers including drawing discouraged workers into the labor force; and        - Eliminate harmful, coercive “climate” policies driving up the costs of food and fuel. \n\nENDING BIDEN’S WAR ON AFFORDABILITY: The Biden Administration’s destructive policies inflicted an historic inflation crisis on the American people. \n    - Hardworking families are overwhelmed today by the cost of fuel, food, housing, automobiles, medical care, utilities, and insurance.\n    - Unprecedented regulatory oppression from the Biden Administration has imposed almost $50,000 in costs on the average American household, whereas President Trump’s first-term agenda reduced regulatory costs by almost $11,000 per household.\n    - Americans are unable to purchase homes at historic rates, in part due to regulatory requirements that alone account for 25 percent of the cost of constructing a new home.\n    - Biden’s assault on plentiful and reliable American energy through impossible, unnecessary, and illegal regulatory demands have driven up the cost of transportation and manufacturing.       - Biden’s war on energy has been a war on American consumers. American households are paying an average of $1,200 more per year in energy costs under President Biden’s policies. Since he took office, total energy costs rose by 36%, gasoline rose 41%, home energy costs rose 30%, electricity bills rose 29%, and gas bills rose 34%.        - After averaging just $2.77 per gallon under President Trump, and a price of $2.33 upon leaving office, the price of gasoline skyrocketed under President Biden, reaching $3.33 a year later. It went on to reach a peak at $5.00 per gallon and remains elevated today.   \n    - The unlawful regulatory mandate on companies to eliminate gas-powered vehicles has resulted in artificial price increases in order to subsidize electric vehicles, largely disfavored by consumers.\n",
  "summary": "On January 22, 2025, President Donald J. Trump signed a Presidential Memorandum aimed at addressing the cost-of-living crisis in the United States. The memorandum directs federal agencies to remove regulatory measures imposed during the Biden Administration, which are believed to have increased costs of living for American families. Key actions include lowering housing costs, reducing healthcare expenses, promoting employment, and eliminating climate policies that increase food and fuel prices.\n\nThe document criticizes the Biden Administration for contributing to inflation and increasing living expenses through regulatory burdens. It claims these policies have led to significant costs for American households, citing regulatory pressures that account for a sizeable portion of housing costs and contribute to increased energy and transportation expenses. The memorandum seeks to reverse these trends by boosting American energy independence and consumer affordability.",
  "eli5": "President Trump wants to make things cheaper for families by changing some rules that he believes made things more expensive, like houses and food. He's trying to fix what he thinks was broken when President Biden was in charge.",
  "keywords": [
    "Cost-of-Living",
    "Regulatory Burden",
    "Housing Costs",
    "Energy Prices",
    "Biden Administration",
    "Trump Administration",
    "Presidential Memorandum",
    "Economic Policy"
  ],
  "issues": [
    "Possible bias against Biden Administration policies",
    "Lack of specific data or studies supporting claims",
    "Potential challenges in implementing major policy changes"
  ],
  "citations": [],
  "document_type": "Presidential Memorandum"
}