{
  "title": "Fact Sheet: President Donald J. Trump Is Protecting Americans' Second Amendment Rights – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Is Protecting Americans' Second Amendment Rights",
  "og:description": "STOPPING FEDERAL INFRINGEMENT ON CONSTITUTIONAL RIGHTS: Today, President Donald J. Trump signed an Executive Order to end the federal government’s",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-is-protecting-americans-second-amendment-rights/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-07T21:50:06+00:00",
  "article:modified_time": "2025-02-09T21:51:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump is Protecting Americans’ Second Amendment Rights\t\t\t\t\n\nFebruary 7, 2025\n\n**STOPPING FEDERAL INFRINGEMENT ON CONSTITUTIONAL RIGHTS:**Today, President Donald J. Trump signed an Executive Order to end the federal government’s violation of Americans’ fundamental Second Amendment right to protect themselves, their families, and their freedoms.\n    - This Executive Order will halt existing policies designed to curtail the clear right of law-abiding citizens to keep and bear arms.\n    - The order directs the incoming Attorney General to immediately complete a specific review of all orders, regulations, guidance, plans, and other actions by the Biden Administration regarding firearms—listing several specific documents to be reviewed—and deliver a plan of action to the President to eliminate all infringements on Americans’ Second Amendment rights. \n\n**ENDING THE ATTACKS ON LAW-ABIDING GUN OWNERS AND GUN BUSINESSES:**The Biden Administration has flagrantly sought to eliminate Second Amendment rights. Among other infringements, the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) was weaponized to end the livelihoods of law-abiding small business owners in an effort to limit Americans’ ability to acquire firearms:\n    - The so-called “zero tolerance” or “enhanced regulatory enforcement policy” put in place under the previous administration led to a nearly six-fold increase in enforcement actions against Federal Firearms Licensees (FFL’s), many of whom are mom-and-pop shop small businesses who made innocent paperwork errors.\n    - Firearms manufacturers have been de-banked or denied services simply because they make guns—which allow Americans to exercise a constitutional right.\n\n**DEFENDING OUR CONSTITUTIONAL RIGHT TO KEEP AND BEAR ARMS:** President Trump is standing up for our constitutional Second Amendment right to keep and bear arms, building on progress made during his first term:\n    - President Trump removed the United States from the United Nations (UN) misguided Arms Trade Treaty to protect Americans from the threat of global regulations of conventional firearms.\n    - President Trump’s Department of Justice narrowed the definition of “fugitive from justice” to more specific guidelines when determining who is prohibited from buying a gun.\n\nDuring the pandemic, President Trump designated the firearms industry “essential” in order to protect gun stores, shooting ranges, and ammunition dealers from being shut down.\n",
  "summary": "President Donald J. Trump signed an Executive Order on February 7, 2025, aimed at halting federal actions that allegedly violate the Second Amendment rights of Americans. This action mandates a review by the Attorney General of existing policies from the Biden Administration concerning firearms and to propose a plan to eliminate any infringements. The Executive Order addresses policies that limit the rights of law-abiding citizens to own and use firearms for self-defense and protection.\n\nThe Executive Order criticizes previous enforcement strategies employed by the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF), which led to an increase in actions against Federal Firearms Licensees (FFLs), including small businesses. The Trump Administration claims these policies were an unwarranted attack on citizens' constitutional rights. Actions include the removal of U.S. participation from the UN Arms Trade Treaty and the designation of the firearms industry as essential during the pandemic.\n\nThe significance of this order lies in its intention to reinforce the protection of gun rights and limit federal regulatory actions affecting firearms manufacturers and sellers. By emphasizing constitutional rights, President Trump's administration aims to ensure the availability and use of firearms for self-defense purposes by legal gun owners.",
  "eli5": "President Trump made a new rule to help people keep their guns because he thinks it is an important right. He wants to change the rules that make it harder for law-abiding people to own guns.",
  "keywords": [
    "Executive Order",
    "Second Amendment",
    "Gun Rights",
    "Firearms Policy",
    "Trump Administration",
    "Biden Administration",
    "ATF",
    "Federal Firearms Licensees",
    "UN Arms Trade Treaty"
  ],
  "issues": [
    "Potential changes in firearms regulations",
    "Impact on small businesses dealing in firearms",
    "Interpretation of Second Amendment rights",
    "Effects on public safety"
  ],
  "citations": [
    "Second Amendment",
    "United Nations Arms Trade Treaty"
  ],
  "document_type": "Fact Sheet"
}