{
  "title": "Fact Sheet: President Donald J. Trump Orders Declassification of JFK, RFK, and MLK Assassination Files – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Orders Declassification of JFK, RFK, and MLK Assassination Files – The White House",
  "og:description": "PROVIDING AMERICANS THE TRUTH AFTER SIX DECADES OF SECRECY: Today, President Donald J. Trump signed an Executive Order entitled Declassification of",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-orders-declassification-of-jfk-rfk-and-mlk-assassination-files/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T21:40:09+00:00",
  "article:modified_time": "2025-01-24T17:27:31+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: President Donald J. Trump Orders Declassification of JFK, RFK, and MLK Assassination Files\t\t\t\t\n\nJanuary 23, 2025\n\nPROVIDING AMERICANS THE TRUTH AFTER SIX DECADES OF SECRECY: Today, President Donald J. Trump signed an Executive Order entitled Declassification of Records Concerning the Assassinations of President John F. Kennedy, Senator Robert F. Kennedy, and the Reverend Doctor Martin Luther King Jr.\n    - The Executive Order establishes the policy that, more than 50 years after these assassinations, the victims’ families and the American people deserve the truth.\n    - Specifically, the Order directs the Director of National Intelligence and other appropriate officials to:       - (1) Present a plan within 15 days for the full and complete release of all John F. Kennedy assassination records; and        - (2) Immediately review the records relating to the Robert F. Kennedy and Martin Luther King Jr. assassinations and present a plan for their full and complete release within 45 days. \n\nPRESIDENT TRUMP IS ENDING THE ENDLESS DELAYS: In his first term, President Trump ordered agencies to move toward disclosing more information about the John F. Kennedy assassination, and now he is ordering that the work be completed.\n    - The President John F. Kennedy Assassination Records Collection Act of 1992 required all records related to the assassination be released in 25 years, absent a presidential certification that:       - Continued postponement is necessary due to an identifiable harm to the military defense, intelligence operations, law enforcement, or conduct of foreign relations; and        - Such identifiable harm is of such gravity that it outweighs the public interest in disclosure. \n    - In October 2017 and April 2018 certifications, President Trump directed agencies to reevaluate redactions and disclose any information that no longer warranted withholding.       - President Biden delayed disclosure in 2021, 2022, and 2023. \n    - In this Order, President Trump finds that continued withholding of the John F. Kennedy records is not in the public interest and is long overdue. He also concludes that releasing the Robert F. Kennedy and Martin Luther King Jr. assassination records is in the public interest.\n\nPRESIDENT TRUMP DELIVERS ON PROMISE TO RELEASE ASSASSINATION RECORDS: President Trump promised during his campaign to release assassination records to give Americans the truth.\n    - President Trump pledged on multiple occasions to release the JFK files, specifically stating in June 2024 that he would do so “early on.”\n    - President Trump: “When I return to the White House, I will declassify and unseal all JFK assassination related documents. It’s been 60 years, time for the American people to know the TRUTH!”\n",
  "summary": "President Donald J. Trump has signed an Executive Order titled 'Declassification of Records Concerning the Assassinations of President John F. Kennedy, Senator Robert F. Kennedy, and the Reverend Doctor Martin Luther King Jr.' on January 23, 2025. This order mandates the declassification and release of all related records to provide transparency and truth to the American public and the victims' families, more than 50 years after the events. The order requires the Director of National Intelligence to develop a plan for the full release of JFK assassination records within 15 days and a thorough review of the RFK and MLK assassination records, with a full release plan within 45 days.\n\nPresident Trump aims to eliminate previous delays, noting past actions since his first term and subsequent postponements by President Biden. In 1992, the President John F. Kennedy Assassination Records Collection Act required all records to be released within 25 years unless a presidential certification permitted postponement for reasons of national security or other significant concerns. Trump's current order declares that the public interest now surpasses the need for continued confidentiality of these records. During his campaign, Trump promised an early release of these documents, emphasizing the importance of revealing the truth to the public.\n\nThe order reflects a commitment to the transparency of historical records and fulfills Trump's campaign promises by addressing the long-standing issue of delayed declassification. This action underscores a conscious effort toward governmental transparency and public access to information related to historical assassinations.",
  "eli5": "President Trump signed a paper to share secret files about the deaths of important people, like President Kennedy, because he thinks it's time people know the truth.",
  "keywords": [
    "Trump",
    "Executive Order",
    "Declassification",
    "JFK Assassination",
    "RFK Assassination",
    "MLK Assassination",
    "Transparency",
    "Historical Records"
  ],
  "issues": [
    "Potential national security risks",
    "Impact on intelligence operations",
    "Public reaction to disclosed information",
    "Legal implications of releasing sensitive information"
  ],
  "citations": [
    "President John F. Kennedy Assassination Records Collection Act of 1992"
  ],
  "document_type": "Fact Sheet"
}