{
  "title": "Fact Sheet: Executive Order to Establish United States Leadership in Digital Financial Technology – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: Executive Order to Establish United States Leadership in Digital Financial Technology – The White House",
  "og:description": "ENSURING U.S. LEADERSHIP IN DIGITAL FINANCIAL TECHNOLOGY: Today, President Donald J. Trump signed an Executive Order to establish regulatory clarity for",
  "og:url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-executive-order-to-establish-united-states-leadership-in-digital-financial-technology/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T21:42:29+00:00",
  "article:modified_time": "2025-01-24T17:26:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Fact Sheets](https://www.whitehouse.gov/fact-sheets/)\n\n# \t\t\t\t\tFact Sheet: Executive Order to Establish United States Leadership in Digital Financial Technology\t\t\t\t\n\nJanuary 23, 2025\n\n**ENSURING U.S. LEADERSHIP IN DIGITAL FINANCIAL TECHNOLOGY:** Today, President Donald J. Trump signed an Executive Order to establish regulatory clarity for digital financial technology and secure America’s position as the world’s leader in the digital asset economy, driving innovation and economic opportunity for all Americans.\n    - The Executive Order establishes the Presidential Working Group on Digital Asset Markets to strengthen U.S. leadership in digital finance.       - The Working Group will be tasked with developing a Federal regulatory framework governing digital assets, including stablecoins, and evaluating the creation of a strategic national digital assets stockpile.       - The Working Group will be chaired by the White House AI &amp; Crypto Czar and include the Secretary of the Treasury, the Chairman of the Securities and Exchange Commission, and the heads of other relevant departments and agencies.        - The White House AI &amp; Crypto Czar will engage leading experts in digital assets and digital markets to ensure that the actions of the Working Group are informed by expertise beyond the Federal Government. \n    - The Executive Order directs departments and agencies with identifying and making recommendations to the Working Group on any regulations and other agency actions affecting the digital assets sector that should be rescinded or modified.\n    - The Executive Order prohibits agencies from undertaking any action to establish, issue, or promote central bank digital currencies (CBDCs).\n    - The Executive Order revokes the previous Administration’s Digital Assets Executive Order and the Treasury Department’s Framework for International Engagement on Digital Assets which suppressed innovation and undermined U.S. economic liberty and global leadership in digital finance.\n\n**ELIMINATING REGULATORY OVERREACH ON DIGITAL ASSETS AND PROTECTING AMERICAN ECONOMIC LIBERTY:** President Trump is fulfilling his promise to make the United States the “crypto capital of the planet.”\n    - President Trump will help make the United States the center of digital financial technology innovation by halting aggressive enforcement actions and regulatory overreach that have stifled crypto innovation under previous administrations.\n    - President Trump’s policy vision marks an unprecedented step towards welcoming in a new era for digital financial technology; one in which President Trump’s administration will work towards ensuring innovation thrives, regulatory frameworks are clear, and economic liberty is protected.\n    - The growth of digital financial technology in America must remain unhindered by restrictive regulations or unnecessary government interference.\n",
  "summary": "**Fact Sheet on Digital Financial Technology Leadership:** On January 23, 2025, President Donald J. Trump signed an Executive Order aimed at reinforcing the United States' leadership in digital financial technology. The order calls for establishing the Presidential Working Group on Digital Asset Markets. This group, chaired by the White House AI & Crypto Czar, will develop a federally regulated framework for digital assets, including stablecoins, and evaluate the potential for a strategic national digital assets stockpile. The Executive Order seeks to coordinate efforts among federal entities to manage regulations that affect the digital assets sector and advises against promoting central bank digital currencies.\n\nAdditionally, the Executive Order revokes previous policies that hindered innovation and threatened U.S. economic freedom and leadership in digital finance. President Trump promises to deter regulatory overreach that stunted growth in this sector under past administrations. The administration's new approach is designed to foster a thriving environment for digital financial technology to protect economic freedom while establishing clear regulatory guidelines.",
  "eli5": "President Trump wants to make sure the United States leads the world in new money technologies, like digital coins. He made rules so everyone knows what to expect and won't stop innovation, like promising there will be no over-complicated rules that slow things down.",
  "keywords": [
    "Digital Financial Technology",
    "Executive Order",
    "Digital Assets",
    "Regulatory Framework",
    "Stablecoins",
    "CBDCs",
    "Innovation",
    "Economic Opportunity",
    "U.S. Leadership"
  ],
  "issues": [
    "Potential bias towards industry by reducing regulatory actions",
    "Impact of prohibiting CBDCs on future U.S. financial strategy",
    "Challenges in balancing innovation with necessary regulation",
    "Revocation of previous policies might affect existing regulatory structures"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}