{
  "title": "Federal Recognition of the Lumbee Tribe of North Carolina – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Federal Recognition of the Lumbee Tribe of North Carolina – The White House",
  "og:description": "MEMORANDUM FOR THE SECRETARY OF THE INTERIOR SUBJECT:       Federal Recognition of the Lumbee Tribe of North Carolina",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/federal-recognition-of-the-lumbee-tribe-of-north-carolina/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T20:38:30+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tFederal Recognition of the Lumbee Tribe of NorthCarolina\t\t\t\t\n\nJanuary 23, 2025\n\nMEMORANDUM FOR THE SECRETARY OF THE INTERIOR\n\nSUBJECT:       Federal Recognition of the Lumbee Tribe of North\n\nCarolina\n\nSection 1.  Purpose and Policy.  The Lumbee Tribe of North Carolina, known as the People of the Dark Water, have a long and storied history.  The tribe’s members were descendants of several tribal nations from the Algonquian, Iroquoian, and Siouan language families, including the Hatteras, the Tuscarora, and the Cheraw.  The waters of the Lumbee River and lands that surround it have protected and provided for the Lumbee people for centuries despite war, disease, and many other perils.\n\nIn 1885, the State of North Carolina recognized the Lumbee people as an Indian tribe.  1885 N.C. Sess. Laws 92.  In 1956, President Dwight D. Eisenhower signed the Lumbee Act (Public Law 84-570, 70 Stat. 254), which recognized the Lumbee as the Lumbee Indians of North Carolina but denied Lumbee Indians Federal benefits associated with such recognition.  Today, according to the State of North Carolina, the Lumbee Tribe consists of more than 55,000 members, making it the largest tribe east of the Mississippi River and the ninth-largest tribe in the Nation.\n\nIn 2024, the United States House of Representatives passed, by a vote of 311-96, the Lumbee Fairness Act (H.R. 1101), which would grant the Lumbee Tribe full Federal recognition, but this legislation was not considered by the United States Senate before the end of the 118th Congress.  Similar legislation has passed the House of Representatives several times.\n\nConsidering the Lumbee Tribe’s historical and modern significance, it is the policy of the United States to support the full Federal recognition, including the authority to receive full Federal benefits, of the Lumbee Tribe of North Carolina.\n\nSec. 2.  Directive for Recognition Plan.  (a)  Within 90 days of the date of this memorandum, the Secretary of the Interior shall review all applicable authorities regarding the recognition or acknowledgement of Indian tribes and, in consultation with the leadership of the Lumbee Tribe of North Carolina, shall submit to the President a plan to assist the Lumbee Tribe in obtaining full Federal recognition through legislation or other available mechanisms, including the right to receive full Federal benefits.\n\n(b)  The plan shall include consideration and analysis of each potential legal pathway to effectuate full Federal recognition of the Lumbee Tribe, including through an act of the Congress, judicial action, or the Procedures for Federal Acknowledgement of Indian Tribes set forth in 25 C.F.R. Part 83.\n\n(c)  The Secretary of the Interior is authorized and directed to publish this memorandum in the *Federal Register*.\n",
  "summary": "The memorandum dated January 23, 2025, is addressed to the Secretary of the Interior and focuses on the federal recognition of the Lumbee Tribe of North Carolina. The Lumbee Tribe, historically known as the People of the Dark Water, has a rich cultural heritage, with members descending from various tribal nations, including the Hatteras, Tuscarora, and Cheraw. Despite being recognized as an Indian tribe by North Carolina in 1885 and as Lumbee Indians by the U.S. in 1956, they were denied federal benefits associated with such recognition. In response to recent legislative efforts, the memorandum emphasizes the United States' policy to support full federal recognition for the Lumbee Tribe.\n\nThis document directs the Secretary of the Interior to create a plan within 90 days to assist the Lumbee Tribe in obtaining full federal recognition by consulting with the tribe's leadership. The plan must explore all possible legal pathways, such as Congressional acts, judicial actions, or federal acknowledgment procedures in 25 C.F.R. Part 83. The Secretary is further tasked with publishing this memorandum in the Federal Register to ensure visibility and official documentation.",
  "eli5": "The president wrote a message saying the Lumbee Tribe in North Carolina should be officially recognized by the U.S. Government so they can get special benefits. The Secretary of the Interior needs to figure out how to make this happen.",
  "keywords": [
    "Lumbee Tribe",
    "Federal Recognition",
    "North Carolina",
    "Secretary of the Interior",
    "Federal Benefits",
    "Native American Tribes"
  ],
  "issues": [
    "The memorandum needs coordination between multiple parties for successful implementation.",
    "There is uncertainty in the legal pathways for federal recognition, which the Secretary must analyze.",
    "The delay in Senate action on the Lumbee Fairness Act highlights potential legislative hurdles."
  ],
  "citations": [
    "1885 N.C. Sess. Laws 92",
    "Public Law 84-570, 70 Stat. 254",
    "H.R. 1101",
    "25 C.F.R. Part 83"
  ],
  "document_type": "Presidential Memorandum"
}