{
  "title": "First Lady Melania Trump Announces Opening of White House Public Tours – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "First Lady Melania Trump Announces Opening of White House Public Tours",
  "og:description": "First Lady Melania Trump announced that the White House will officially open for public tours on Tuesday, February 25, 2025. “The President and I are",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/first-lady-melania-trump-announces-opening-of-white-house-public-tours/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-12T19:00:00+00:00",
  "article:modified_time": "2025-02-14T14:09:10+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tFirst Lady Melania Trump Announces Opening of White House Public Tours\t\t\t\t\n\nFebruary 12, 2025\n\nFirst Lady Melania Trump announced that the White House will officially open for public tours on Tuesday, February 25, 2025.\n\n“The President and I are excited to reopen the White House to those interested in the extraordinary story of this iconic and beautiful landmark. There is much to learn about the American Presidency, the First Families who have lived here, and our Nation’s rich history from a firsthand experience at the White House. This opportunity is unique among nations around the globe—a tradition we are honored to continue for the hundreds of thousands of visitors who come each year,” said First Lady Melania Trump.\n\nPublic tours must be requested through Members of Congress, and requests may be submitted up to three months in advance. Tours are scheduled on a first-come-first-served basis.\n\nTours are self-guided, typically last 45 minutes, and will generally be available from 7:30 a.m. to 11:30 a.m. Tuesday through Thursday as well as 7:30 a.m. to 1:30 p.m. Friday through Saturday (excluding Federal holidays or unless otherwise noted). When possible, public tour hours will be extended based on the official White House schedule. For more information, including what visitors will need to access the White House campus, please visit [www.WhiteHouse.gov/Visit](http://www.WhiteHouse.gov/Visit).\n",
  "summary": "First Lady Melania Trump announced the reopening of the White House for public tours on February 25, 2025. This initiative is intended to educate the public about the White House's history, including the American Presidency and the First Families who have lived there. Public tours provide a unique opportunity to experience this historic landmark firsthand. \n\nTours must be requested through Members of Congress and are scheduled on a first-come-first-served basis. They are self-guided, lasting approximately 45 minutes, and are generally available from 7:30 a.m. to 11:30 a.m. Tuesday through Thursday, and from 7:30 a.m. to 1:30 p.m. Friday through Saturday, excluding federal holidays. The official White House schedule may allow for extended tour hours. For more details, visitors can refer to the White House's official website.",
  "eli5": "The White House is opening up for people to visit starting February 25, 2025. You can go see where the President lives and learn about America's history. Tours are available if you ask your Congress member, and they happen in the morning from Tuesday to Saturday.",
  "keywords": [
    "White House",
    "public tours",
    "Melania Trump",
    "American Presidency",
    "First Families",
    "tradition",
    "Washington D.C.",
    "landmark"
  ],
  "issues": [
    "Unclear if any special security measures or requirements might change due to current circumstances.",
    "Limited availability of tour slots due to a first-come-first-served basis."
  ],
  "citations": [],
  "document_type": "Press Release"
}