{
  "title": "Gulf of America Day, 2025 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Gulf of America Day, 2025",
  "og:description": "BY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION      Today, I am very honored to recognize February 9, 2025, as the first ever Gulf of",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/gulf-of-america-day-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-09T22:08:57+00:00",
  "article:modified_time": "2025-02-09T22:08:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tGulf of America Day, 2025\t\t\t\t\n\nFebruary 9, 2025\n\nBY THE PRESIDENT OF THE UNITED STATES OF AMERICAA PROCLAMATION\n\nToday, I am very honored to recognize February 9, 2025, as the first ever Gulf of America Day.     On January 20, 2025, I signed Executive Order 14172 (“Restoring Names That Honor American Greatness”).  Among other actions, that Executive Order required the Secretary of the Interior, acting pursuant to 43 U.S.C. 364 through 364f, to “take all appropriate actions to rename as the ‘Gulf of America’ the U.S. Continental Shelf area bounded on the northeast, north, and northwest by the State of Texas, Louisiana, Mississippi, Alabama and Florida and extending to the seaward boundary with Mexico and Cuba in the area formerly named as the Gulf of Mexico.”     I took this action in part because, as stated in that Order, “[t]he area formerly known as the Gulf of Mexico has long been an integral asset to our once burgeoning Nation and has remained an indelible part of America.”     Today, I am making my first visit to the Gulf of America since its renaming.  As my Administration restores American pride in the history of American greatness, it is fitting and appropriate for our great Nation to come together and commemorate this momentous occasion and the renaming of the Gulf of America.     NOW, THEREFORE, I, DONALD J. TRUMP, President of the United States of America, by virtue of the authority vested in me by the Constitution and the laws of the United States, do hereby proclaim February 9, 2025, as Gulf of America Day.  I call upon public officials and all the people of the United States to observe this day with appropriate programs, ceremonies, and activities.     IN WITNESS WHEREOF, I have hereunto set my hand this ninth day of February, in the year of our Lord two thousand twenty-five, and of the Independence of the United States of America the two hundred and forty-ninth.\n",
  "summary": "On February 9, 2025, President Donald J. Trump officially proclaimed the first Gulf of America Day. This proclamation follows the signing of Executive Order 14172 on January 20, 2025, which directed the renaming of the Gulf of Mexico to the Gulf of America. The renaming affects the U.S. Continental Shelf area neighboring Texas, Louisiana, Mississippi, Alabama, and Florida, extending to Mexico and Cuba, as part of an effort to honor and restore American greatness in this historically significant region. \n\nThe President cited the significance of this region as a key asset in America's growth and history, reaffirming the administration's aim to strengthen national pride and commemorate this change. The proclamation calls upon public officials and citizens to engage in appropriate observances such as programs and activities, thereby making this renaming and its celebration a formal part of the nation's calendar.",
  "eli5": "President Trump decided to change the name of the Gulf of Mexico to the Gulf of America. He says it is important to Americans and asked everyone in the country to celebrate this change every year on February 9th by doing fun activities about it.",
  "keywords": [
    "Gulf of America",
    "Donald J. Trump",
    "proclamation",
    "Executive Order 14172",
    "renaming",
    "national pride",
    "February 9, 2025"
  ],
  "issues": [
    "The renaming could possibly raise questions about historical and geographical recognition.",
    "The potential diplomatic implications of changing the name from Gulf of Mexico.",
    "The public and regional reception of the name change."
  ],
  "citations": [
    "Executive Order 14172",
    "43 U.S.C. 364 through 364f"
  ],
  "document_type": "Proclamation"
}