{
  "title": "Hiring Freeze – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Hiring Freeze – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, I hereby order a freeze on the hiring of",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/hiring-freeze/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:54:32+00:00",
  "article:modified_time": "2025-01-20T23:54:33+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tHiring Freeze\t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, I hereby order a freeze on the hiring of Federal civilian employees, to be applied throughout the executive branch.  As part of this freeze, no Federal civilian position that is vacant at noon on January 20, 2025, may be filled, and no new position may be created except as otherwise provided for in this memorandum or other applicable law.  Except as provided below, this freeze applies to all executive departments and agencies regardless of their sources of operational and programmatic funding.\n\nThis order does not apply to military personnel of the armed forces or to positions related to immigration enforcement, national security, or public safety.  Moreover, nothing in this memorandum shall adversely impact the provision of Social Security, Medicare, or Veterans’ benefits.  In addition, the Director of the Office of Personnel Management (OPM) may grant exemptions from this freeze where those exemptions are otherwise necessary.\n\nWithin 90 days of the date of this memorandum, the Director of the Office of Management and Budget (OMB), in consultation with the Director of OPM and the Administrator of the United States DOGE Service (USDS), shall submit a plan to reduce the size of the Federal Government’s workforce through efficiency improvements and attrition.  Upon issuance of the OMB plan, this memorandum shall expire for all executive departments and agencies, with the exception of the Internal Revenue Service (IRS).  This memorandum shall remain in effect for the IRS until the Secretary of the Treasury, in consultation with the Director of OMB and the Administrator of USDS, determines that it is in the national interest to lift the freeze.\n\nContracting outside the Federal Government to circumvent the intent of this memorandum is prohibited.\n\nIn carrying out this memorandum, the heads of executive departments and agencies shall seek efficient use of existing personnel and funds to improve public services and the delivery of these services.  Accordingly, this memorandum does not prohibit making reallocations to meet the highest priority needs, maintain essential services, and protect national security, homeland security, and public safety.\n\nThis memorandum does not limit the nomination and appointment of officials to positions requiring Presidential appointment or Senate confirmation, the appointment of officials to non-career positions in the Senior Executive Service or to Schedule A or C positions in the Excepted Service, the appointment of officials through temporary organization hiring authority pursuant to section 3161 of title 5, United States Code, or the appointment of any other non-career employees or officials if approved by agency leadership appointed by the President.  Moreover, it does not limit the hiring of personnel where such a limit would conflict with applicable law.\n\nThis memorandum does not abrogate any collective bargaining agreement in effect on the date of this memorandum.\n",
  "summary": "On January 20, 2025, the President of the United States issued a memorandum imposing a hiring freeze on Federal civilian employees across the executive branch. This measure, which targets vacant positions existing at that noon and disallows the creation of new positions, aims to manage the size of the Federal Government's workforce. It is notable that the freeze does not affect military personnel or positions related to immigration enforcement, national security, and public safety, ensuring that essential services such as Social Security, Medicare, and Veterans' benefits remain unaffected.\n\nThe memorandum mandates the Office of Management and Budget (OMB), in coordination with the Office of Personnel Management (OPM) and the United States Digital Service (USDS), to devise a plan within 90 days to reduce the Federal workforce through improved efficiencies and attrition. The memorandum's terms expire upon the OMB plan's issuance but persist for the IRS until such a time the Secretary of the Treasury and other relevant authorities decide otherwise. The document outlines specific exemptions, forbidding contracting out to bypass its intent, and details permissible hiring such as Presidential appointments, non-career Senior Executive Service positions, and others as allowed by law.",
  "eli5": "The President said that, as of January 20, 2025, the government shouldn't hire any new people for regular jobs, except for certain important jobs like in the military and safety. They have 90 days to make a plan for making the government smaller and better.",
  "keywords": [
    "Presidential Memorandum",
    "hiring freeze",
    "Federal civilian employees",
    "executive branch",
    "Office of Management and Budget",
    "Office of Personnel Management",
    "United States Digital Service",
    "Internal Revenue Service"
  ],
  "issues": [
    "Impact on public services within the IRS",
    "Potential for overreliance on temporary solutions",
    "Implementation strategies for exceptions to the freeze"
  ],
  "citations": [
    "section 3161 of title 5, United States Code"
  ],
  "document_type": "Presidential Memorandum"
}