{
  "title": "Holding Former Government Officials Accountable For Election Interference And Improper Disclosure Of Sensitive Governmental Information – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Holding Former Government Officials Accountable For Election Interference And Improper Disclosure Of Sensitive Governmental Information – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/holding-former-government-officials-accountablefor-election-interference-and-improper-disclosure-of-sensitive-governmental-information/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:30:20+00:00",
  "article:modified_time": "2025-01-21T02:24:46+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tHOLDING FORMER GOVERNMENT OFFICIALS ACCOUNTABLEFOR ELECTION INTERFERENCE AND IMPROPER DISCLOSUREOF SENSITIVE GOVERNMENTAL INFORMATION\t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose.  In the closing weeks of the 2020 Presidential campaign, at least 51 former intelligence officials coordinated with the Biden campaign to issue a letter discrediting the reporting that President Joseph R. Biden’s son had abandoned his laptop at a computer repair business.  Signatories of the letter falsely suggested that the news story was part of a Russian disinformation campaign.\n\nBefore being issued, the letter was sent to the CIA Prepublication Classification Review Board, the body typically assigned to formally evaluate the sensitive nature of documents prior to publication.  Senior CIA officials were made aware of the contents of the letter, and multiple signatories held clearances at the time and maintained ongoing contractual relationships with the CIA.\n\nFederal policymakers must be able to rely on analysis conducted by the Intelligence Community and be confident that it is accurate, crafted with professionalism, and free from politically motivated engineering to affect political outcomes in the United States.  The signatories willfully weaponized the gravitas of the Intelligence Community to manipulate the political process and undermine our democratic institutions.  This fabrication of the imprimatur of the Intelligence Community to suppress information essential to the American people during a Presidential election is an egregious breach of trust reminiscent of a third world country.  And now the faith of Americans in all other patriotic intelligence professionals who are sworn to protect the Nation has been imperiled.\n\nNational security is also damaged by the publication of classified information.  Former National Security Advisor John R. Bolton published a memoir for monetary gain after he was terminated from his White House position in 2019.  The book was rife with sensitive information drawn from his time in government.  The memoir’s reckless treatment of sensitive information undermined the ability of future presidents to request and obtain candid advice on matters of national security from their staff.  Publication also created a grave risk that classified material was publicly exposed.\n\nTo remedy these abuses of the public trust, this Order directs the revocation of any active or current security clearances held by:  (i) the former intelligence officials who engaged in misleading and inappropriate political coordination with the 2020 Biden presidential campaign; and (ii) John R. Bolton.\n\nSec. 2.  Policy.  (a)  It is the policy of the United States to ensure that the Intelligence Community not be engaged in partisan politics or otherwise used by a U.S. political campaign for electioneering purposes.  The term “Intelligence Community” has the meaning given the term in section 3003 of title 50, United States Code.\n\n(b)  It is the policy of the United States that individuals who hold government-issued security clearances should not use their clearance status to influence U.S. elections.\n\n(c)  It is the policy of the United States that classified information not be publicly disclosed in memoirs, especially those published for personal monetary gain.\n\nSec. 3.  Implementation.  (a)  Effective immediately, the Director of National Intelligence, in consultation with the Director of the Central Intelligence Agency, shall revoke any current or active clearances held by the following individuals:\n\n              (1)  James R. Clapper Jr.\n\n              (2)  Michael V. Hayden\n\n              (3)  Leon E. Panetta\n\n              (4)  John O. Brennan\n\n              (5)  C. Thomas Fingar\n\n              (6)  Richard H. Ledgett Jr.\n\n              (7)  John E. McLaughlin\n\n              (8)  Michael J. Morell\n\n              (9)  Michael G. Vickers\n\n              (10) Douglas H. Wise\n\n              (11) Nicholas J. Rasmussen\n\n              (12) Russell E. Travers\n\n              (13) Andrew Liepman\n\n              (14) John H. Moseman\n\n              (15) Larry Pfeiffer\n\n              (16) Jeremy B. Bash\n\n              (17) Rodney Snyder\n\n              (18) Glenn S. Gerstell\n\n              (19) David B. Buckley\n\n              (20) Nada G. Bakos\n\n              (21) James B. Bruce\n\n              (22) David S. Cariens\n\n              (23) Janice Cariens\n\n              (24) Paul R. Kolbe\n\n              (25) Peter L. Corsell\n\n              (26) Roger Z. George\n\n              (27) Steven L. Hall\n\n              (28) Kent Harrington\n\n              (29) Don Hepburn\n\n(30) Timothy D. Kilbourn\n\n              (31) Ronald A. Marks\n\n              (32) Jonna H. Mendez\n\n              (33) Emile Nakhleh\n\n              (34) Gerald A. O’Shea\n\n              (35) David Priess\n\n              (36) Pamela Purcilly\n\n              (37) Marc Polymeropoulos\n\n              (38) Chris Savos\n\n              (39) Nick Shapiro\n\n              (40) John Sipher\n\n              (41) Stephen B. Slick\n\n              (42) Cynthia Strand\n\n              (43) Greg Tarbell\n\n              (44) David Terry\n\n              (45) Gregory F. Treverton\n\n              (46) John D. Tullius\n\n              (47) David A. Vanell\n\n              (48) Winston P. Wiley\n\n              (49) Kristin Wood\n\n              (50) John R. Bolton\n\nTwo signatories, Patty Patricia A. Brandmaeir and Brett Davis, are deceased.\n\n(b)  Within 90 days of this order, the Director of National Intelligence, in consultation with the Director of the Central Intelligence Agency, shall submit a report to the President through the National Security Advisor that details:\n\n(i)    any additional inappropriate activity that occurred within the Intelligence Community, by anyone contracted by the Intelligence Community or by anyone who held a security clearance, related to the letter signed by the 51 former intelligence officials;\n\n(ii)   recommendations to prevent the Intelligence Community or anyone who works for or within it from inappropriately influencing domestic elections; and\n\n(iii)  any disciplinary action—including the termination of security clearances—that should be taken against anyone who engaged in inappropriate conduct related to the letter signed by the 51 former intelligence officials.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,     January 20, 2025.\n",
  "summary": "The text is an executive order issued on January 20, 2025, by the President of the United States, addressing the issues of election interference and the improper disclosure of sensitive governmental information. It highlights an incident where 51 former intelligence officials, in coordination with the Biden campaign, issued a misleading letter during the 2020 Presidential campaign. This letter, purportedly vetted by the CIA Prepublication Classification Review Board, was intended to discredit a news story about President Biden’s son, falsely suggesting a Russian disinformation angle.\n\nThe executive order aims to revoke security clearances of officials involved in this incident and emphasizes the need to keep the Intelligence Community politically neutral and prevent the use of classified information for personal gain. It directs the Director of National Intelligence and the CIA to revoke the security clearances of specified individuals, including former National Security Advisor John R. Bolton. Additionally, the order requires a report detailing any inappropriate activities relating to the incident and recommendations to prevent similar occurrences in the future.",
  "eli5": "The President made a rule to take away special clearances from some old government officials because they used their information for politics and money, which was wrong.",
  "keywords": [
    "Executive Order",
    "Election Interference",
    "Security Clearances",
    "Intelligence Community",
    "Joseph R. Biden",
    "John R. Bolton",
    "Classified Information"
  ],
  "issues": [
    "Potential overreach of executive power in revoking security clearances.",
    "Impact on the principle of free speech for former officials.",
    "Compliance with existing laws and separation of powers.",
    "Effectiveness of preventing future election interference."
  ],
  "citations": [
    "Section 3003 of title 50, United States Code"
  ],
  "document_type": "Executive Order"
}