{
  "title": "Honoring Jocelyn Nungaray – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Honoring Jocelyn Nungaray",
  "og:description": "              By the authority vested in me as President by the Constitution and the laws of the United States of",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/03/honoring-jocelyn-nungaray/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T05:27:15+00:00",
  "article:modified_time": "2025-03-05T05:27:16+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\t  Honoring Jocelyn Nungaray \t\t\t\t\n\nMarch 5, 2025\n\n               By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.Purpose and Policy.  The prior administration’s immigration policies inexcusably endangered and caused enormous suffering within our Nation, including by causing the southern border to be overrun by cartels, criminal gangs, known terrorists, human traffickers, smugglers, unvetted military-age males from foreign adversaries, and illicit narcotics.  These open-border policies are responsible for the horrific and inexcusable murders of many innocent American citizens at the hands of illegal aliens.        One of those innocent victims was Jocelyn Nungaray, whose life was tragically cut short on June 17, 2024, when she was brutally murdered in Houston, Texas.  Two Venezuelan illegal aliens who were allegedly Tren de Aragua gang members and were apprehended near the border in early 2024 — and then released into the United States by the prior administration — have been charged with her murder.  Jocelyn was a precious 12 year old girl beloved by her family and friends for her kindness and infectious zeal for life.  She loved animals and had a passion for ensuring that they had homes.  It is fitting and in the national interest, therefore, that the Anahuac National Wildlife Refuge, a scenic area for coastal wildlife and recreation along the Gulf of America near Jocelyn’s home in Texas, will forever honor and preserve the memory of a beautiful American, Jocelyn Nungaray.Sec. 2.  Renaming the Anahuac National Wildlife Refuge to Honor Jocelyn Nungaray.  Within 30 days of the date of this order, pursuant to authority under the National Wildlife Refuge System Administration Act (16 U.S.C. 668dd-668ee) and other applicable law, the Secretary of the Interior (Secretary) shall update procedures as necessary and take all other appropriate actions to rename the area known as the “Anahuac National Wildlife Refuge” as the “Jocelyn Nungaray National Wildlife Refuge” and ensure that her life is permanently commemorated therein.  The Secretary shall subsequently provide guidance to ensure all Federal references to the Jocelyn Nungaray National Wildlife Refuge, including on agency maps, contracts, and other documents and communications, reflect its renaming. Sec. 3.General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:             (i)   the authority granted by law to an executive department or agency, or the head thereof; or             (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.        (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n       (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\n                              DONALD J. TRUMP\n\nTHE WHITE HOUSE,\n\n    March 4, 2025.\n",
  "summary": "The presidential action taken by Donald J. Trump on March 5, 2025, addresses concerns over the previous administration's immigration policies, which, according to the current administration, led to increased crime and threats at the southern border. Among the consequences cited was the tragic murder of Jocelyn Nungaray, a 12-year-old girl, in Houston, Texas, allegedly by illegal immigrants involved with a criminal gang. In her memory, the Anahuac National Wildlife Refuge in Texas will be renamed as the 'Jocelyn Nungaray National Wildlife Refuge'. \n\nWithin 30 days from the order's issue, the Secretary of the Interior is tasked with implementing the renaming process and ensuring that federal references reflect this change. The action emphasizes honoring Jocelyn by permanently commemorating her life and highlights a critique on prior border policies. It underlines that the changes will be carried out consistent with existing laws and available funding.",
  "eli5": "The President decided to rename a special wildlife area in Texas after a girl named Jocelyn who tragically died, to remember her and make sure her name is never forgotten.",
  "issues": [
    "The document heavily criticizes prior immigration policies; balance and perspectives might be a concern.",
    "Potential political implications of the changes in policy and focus on specific incidents.",
    "Explanation of procedural steps needed for renaming and logistics involved."
  ],
  "citations": [
    "16 U.S.C. 668dd-668ee"
  ],
  "keywords": [
    "Immigration policy",
    "Jocelyn Nungaray",
    "National Wildlife Refuge",
    "Donald Trump",
    "Executive Order",
    "Renaming"
  ],
  "document_type": "Presidential Action"
}