{
  "title": "ICYMI: Secretary Brooke Rollins Outlines Plan to Lower Egg Prices – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "ICYMI: Secretary Brooke Rollins Outlines Plan to Lower Egg Prices",
  "og:description": "In today’s Wall Street Journal, Secretary of Agriculture Brooke Rollins lays out the Trump Administration's comprehensive plan to bring down the price of",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/icymi-secretary-brooke-rollins-outlines-plan-to-lower-egg-prices/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-26T15:35:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tICYMI: Secretary Brooke Rollins Outlines Plan to Lower Egg Prices\t\t\t\t\n\nFebruary 26, 2025\n\nIn today’s *Wall Street Journal*, Secretary of Agriculture Brooke Rollins [lays out](https://www.wsj.com/opinion/agriculture-secretary-brooke-rollins-my-plan-to-lower-egg-prices-6be0f881) the Trump Administration’s comprehensive plan to bring down the price of eggs.*“The Biden administration did little to address the repeated outbreaks and high egg prices that followed. By contrast, the Trump administration is taking the issue seriously. To that end, today I am announcing a comprehensive strategy to combat avian influenza. The Agriculture Department will invest up to $1 billion to curb this crisis and make eggs affordable again. We are working with the Department of Government Efficiency to cut hundreds of millions of dollars of wasteful spending. We will repurpose some of those dollars by investing in long-term solutions to avian flu, which has resulted in about 166 million laying hens being culled since 2022.”*[**Read the full op-ed here**](https://www.wsj.com/opinion/agriculture-secretary-brooke-rollins-my-plan-to-lower-egg-prices-6be0f881).\n",
  "summary": "In a recent article for the Wall Street Journal, Secretary of Agriculture Brooke Rollins detailed a plan by the Trump Administration to address the high prices of eggs, exacerbated by repeated outbreaks of avian influenza. The strategy involves a substantial investment of $1 billion by the Agriculture Department to combat the crisis and stabilize egg prices. This effort is in response to what Rollins describes as insufficient action by the previous Biden administration in tackling the root causes of the issue.\n\nThe plan includes a collaboration between the Agriculture Department and the Department of Government Efficiency to reduce wasteful spending. By reallocating funds from these savings, the aim is to invest in long-term solutions to mitigate avian influenza outbreaks, which have led to the culling of approximately 166 million laying hens since 2022. This comprehensive strategy seeks to ensure egg affordability and address the economic impact of the influenza outbreaks.",
  "eli5": "The government wants to make eggs cheaper for everyone by stopping the sickness that makes chickens sick. They plan to spend a lot of money to keep chickens healthy so there are more eggs and they don't cost as much.",
  "keywords": [
    "Secretary of Agriculture",
    "Brooke Rollins",
    "Trump Administration",
    "egg prices",
    "avian influenza",
    "culling",
    "wasteful spending",
    "Department of Government Efficiency"
  ],
  "issues": [
    "Effectiveness of the proposed plan",
    "Impacts of avian influenza",
    "Previous administration's handling of the issue",
    "Long-term sustainability of funding allocation"
  ],
  "citations": [],
  "document_type": "Press Release"
}