{
  "title": "Illegal Immigrant Killers, Rapists Aren’t Scholars — They’re Criminals – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Illegal Immigrant Killers, Rapists Aren’t Scholars — They’re Criminals",
  "og:description": "In a strong contender for dumbest statement of the year, disgraced “filmmaker” Michael Moore lamented illegal immigrant criminals being apprehended",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/illegal-immigrant-killers-rapists-arent-scholars-theyre-criminals/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-26T19:31:20+00:00",
  "article:modified_time": "2025-02-26T19:31:21+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tIllegal Immigrant Killers, Rapists Aren’t Scholars — They’re Criminals\t\t\t\t\n\nFebruary 26, 2025\n\nIn a strong contender for dumbest statement of the year, disgraced “filmmaker” Michael Moore [lamented](https://nypost.com/2025/02/25/media/michael-moore-says-deported-migrants-could-have-cured-cancer/) illegal immigrant criminals being apprehended because they might’ve “discovered the cure for cancer” or “stopped that asteroid.” The only thing more foolish than that statement are the [politicians who oppose](https://www.whitehouse.gov/articles/2025/02/sick-politicians-want-killers-rapists-roaming-our-streets/) the deportations.\n\n**These are the types of cold-blooded criminals he’s talking about:**\n    - A Portuguese national  convicted  of sexual exploitation of a minor—child pornography, apprehended in Philadelphia.\n    - A Guatemalan national  charged  with armed home invasion, kidnapping, intimidation, and assault with a dangerous weapon, apprehended in Rhode Island.\n    - A Haitian national  charged  with three murders, apprehended in North Carolina.\n    - A Salvadoran national and MS-13 gang member  convicted  of aggravated assault with bodily injury and DWI, apprehended in Houston.\n    - A Guatemalan national  charged  with multiple counts of child rape, apprehended in Massachusetts.\n    - A Brazilian national and confirmed gang member  convicted  of assault and battery, apprehended in Boston.\n    - A Honduran national  convicted  of criminal sexual conduct with a minor, apprehended in Minnesota.\n    - A Salvadoran national  convicted  of sodomy/anal intercourse with a child less than 13 years of age, apprehended in Washington.\n    - An Ecuadorian national  convicted  of rape, arrested in Buffalo.\n    - A Guatemalan national  charged  with multiple counts of child rape, apprehended in Massachusetts.\n    - A Dominican Republican national  convicted  of sexual conduct against a child, apprehended in Buffalo.\n    - A Mexican national  convicted  of sexual exploitation of a child, apprehended in San Francisco.\n    - A Turkish national who is a  known  or suspected terrorist, apprehended in New York City.\n    - A Mexican national  convicted  of drug trafficking, apprehended in Texas.\n",
  "summary": "On February 26, 2025, an article was published on the White House website addressing the criticism from filmmaker Michael Moore regarding the deportation of illegal immigrant criminals. Moore speculates that some deported individuals might have potential to contribute significantly to society, such as discovering a cure for cancer. The article counters his argument by listing several instances where illegal immigrants committed serious crimes, underscoring the government's focus on deporting criminals to ensure public safety.\n\nThe document highlights various cases where individuals from countries like Portugal, Guatemala, Haiti, and El Salvador have been apprehended for crimes such as sexual exploitation of minors, armed invasion, multiple murders, and gang-related violence. The government uses these examples to support stringent immigration enforcement, arguing that deportation is necessary to prevent such individuals from endangering communities across the United States. The article aims to shed light on the challenges of balancing immigration policies with public safety concerns.",
  "eli5": "Some people think that not all rules should be so strict, but the government shows how people who broke the law caused harm, so they want to send them away to keep everyone safe.",
  "keywords": [
    "illegal immigration",
    "deportation",
    "crime",
    "public safety",
    "Michael Moore",
    "immigration enforcement",
    "White House"
  ],
  "issues": [
    "The potential for bias in framing immigrants as criminals.",
    "The lack of alternative perspectives or solutions to balance public safety with immigration rights.",
    "Concerns about the accuracy and completeness of the cases presented."
  ],
  "citations": [],
  "document_type": "Articles"
}