{
  "title": "Immediate Assessment of Aviation Safety – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Immediate Assessment of Aviation Safety – The White House",
  "og:description": "MEMORANDUM FOR THE SECRETARY OF TRANSPORTATION THE ADMINISTRATOR OF THE FEDERAL AVIATION ADMINISTRATION SUBJECT:       Immediate Assessment of Aviation",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/immediate-assessment-of-aviation-safety/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-30T21:36:58+00:00",
  "article:modified_time": "2025-01-30T21:36:59+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tImmediate Assessment of Aviation Safety\t\t\t\t\n\nJanuary 30, 2025\n\nMEMORANDUM FOR THE SECRETARY OF TRANSPORTATION                                                 THE ADMINISTRATOR OF THE FEDERAL AVIATION                                                 ADMINISTRATION\n\nSUBJECT:       Immediate Assessment of Aviation Safety\n\nOn January 29, 2025, a commercial aircraft and a military helicopter horrifically collided near Ronald Reagan Washington National Airport.  American families today woke up without their loved ones after what should have been a routine trip, and the entire Nation mourns the loss of the victims.\n\nThis shocking event follows problematic and likely illegal decisions during the Obama and Biden Administrations that minimized merit and competence in the Federal Aviation Administration (FAA).  The Obama Administration implemented a biographical questionnaire at the FAA to shift the hiring focus away from objective aptitude.  During my first term, my Administration raised standards to achieve the highest standards of safety and excellence.  But the Biden Administration egregiously rejected merit-based hiring, requiring all executive departments and agencies to implement dangerous “diversity equity and inclusion” tactics, and specifically recruiting individuals with “severe intellectual” disabilities in the FAA.   \n\nOn my second day in office, I ordered an immediate return to merit-based recruitment, hiring, and promotion, elevating safety and ability as the paramount standard.  Yesterday’s devastating accident tragically underscores the need to elevate safety and competence as the priority of the FAA. \n\nConsistent with the Presidential Memorandum of January 21, 2025 (Keeping Americans Safe in Aviation), I am further ordering the Secretary of Transportation (Secretary) and the Administrator of the Federal Aviation Administration (Administrator) to review all hiring decisions and changes to safety protocols made during the prior 4 years, and to take such corrective action as necessary to achieve uncompromised aviation safety, including the replacement of any individuals who do not meet qualification standards.  This review shall include a systematic assessment of any deterioration in hiring standards and aviation safety standards and protocols during the Biden Administration.\n\nConsistent with the Presidential Memorandum of January 21, 2025, the Secretary and the Administrator shall take all actions necessary to reverse concerning safety and personnel trends during the prior 4 years, instill an unwavering commitment to aviation safety, and ensure that all Americans fly with peace of mind\n",
  "summary": "On January 30, 2025, a memorandum was issued following a tragic collision between a commercial aircraft and a military helicopter near Ronald Reagan Washington National Airport. The President addressed this incident by attributing issues within the Federal Aviation Administration (FAA) to past administrations. He criticized hiring practices influenced by the Obama and Biden Administrations that emphasized diversity over merit, alleging these policies compromised safety and competence.\n\nThe President instructed the Secretary of Transportation and the FAA Administrator to review hiring decisions and safety protocol changes from the previous four years. This directive aims to identify and rectify any reductions in hiring and safety standards, as part of a broader initiative to uphold aviation safety in line with a previous Presidential Memorandum. The ultimate goal is to instill a commitment to safety and ensure peace of mind for all air travelers.",
  "eli5": "The President is asking his team to check how people were hired for airplane jobs. He wants to make sure only the best people are chosen to keep everyone safe, especially after a plane and a helicopter crashed.",
  "keywords": [
    "Aviation Safety",
    "FAA",
    "Presidential Memorandum",
    "Merit-based Hiring",
    "Diversity and Inclusion",
    "Biden Administration",
    "Obama Administration",
    "Ronald Reagan Airport",
    "Collision"
  ],
  "issues": [
    "Allegation of reduced safety standards under previous administrations.",
    "Impact of diversity policies on safety and merit.",
    "Possible political bias in attributing blame to past administrations."
  ],
  "citations": [
    "Presidential Memorandum of January 21, 2025 (Keeping Americans Safe in Aviation)"
  ],
  "document_type": "Presidential Memorandum"
}