{
  "title": "Implementing The President's \"Department of Government Efficiency\" Workforce Optimization Initiative – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Implementing The President's \"Department of Government Efficiency\" Workforce Optimization Initiative",
  "og:description": "     By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-workforce-optimization-initiative/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T23:31:14+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tImplementing The President’s “Department of Government Efficiency” Workforce Optimization Initiative\t\t\t\t\n\nFebruary 11, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.  Purpose.  To restore accountability to the American public, this order commences a critical transformation of the Federal bureaucracy.  By eliminating waste, bloat, and insularity, my Administration will empower American families, workers, taxpayers, and our system of Government itself.Sec. 2.  Definitions.  (a)  “Agency” has the meaning given to it in section 3502 of title 44, United States Code, except that such term does not include the Executive Office of the President or any components thereof.      (b)  “Agency Head” means the highest-ranking official of an agency, such as the Secretary, Administrator, Chairman, or Director, unless otherwise specified in this order.     (c)  “DOGE Team Lead” means the leader of the Department of Government Efficiency (DOGE) Team at each agency, as defined in Executive Order 14158 of January 20, 2025 (Establishing and Implementing the President’s “Department of Government Efficiency”).     (d)  “Employee” has the meaning given to it by section 2105 of title 5, United States Code, and includes individuals who serve in the executive branch and who qualify as employees under that section for any purpose.     (e)  “Immigration enforcement” means the investigation, enforcement, or assisting in the investigation or enforcement of Federal immigration law, including with respect to Federal immigration law that penalizes a person’s presence in, entry, or reentry to, or employment in, the United States, but does not include assisting individuals in applying for immigration benefits or efforts to prevent enforcement of immigration law or to prevent deportation or removal from the United States.      (f)  “Law enforcement” means:          (i)   engagement in or supervision of the prevention, detection, investigation, or prosecution of, or the incarceration of any person for, any violation of law; or          (ii)  the protection of Federal, State, local, or foreign government officials against threats to personal safety.     (g)  “Temporary employee” has the meaning given to it in 5 C.F.R. part 316.     (h)  “Reemployed annuitant” has the meaning given to it in 5 C.F.R. part 837.Sec. 3.  Reforming the Federal Workforce to Maximize Efficiency and Productivity.  (a)  Hiring Ratio.  Pursuant to the Presidential Memorandum of January 20, 2025 (Hiring Freeze), the Director of the Office of Management and Budget shall submit a plan to reduce the size of the Federal Government’s workforce through efficiency improvements and attrition (Plan).  The Plan shall require that each agency hire no more than one employee for every four employees that depart, consistent with the plan and any applicable exemptions and details provided for in the Plan.  This order does not affect the standing freeze on hiring as applied to the Internal Revenue Service.  This ratio shall not apply to functions related to public safety, immigration enforcement, or law enforcement.  Agency Heads shall also adhere to the Federal Hiring Plan that will be promulgated pursuant to Executive Order 14170 of January 20, 2025 (Reforming the Federal Hiring Process and Restoring Merit to Government Service).     (b)  Hiring Approval.  Each Agency Head shall develop a data-driven plan, in consultation with its DOGE Team Lead, to ensure new career appointment hires are in highest-need areas.            (i)    This hiring plan shall include that new career appointment hiring decisions shall be made in consultation with the agency’s DOGE Team Lead, consistent with applicable law.            (ii)   The agency shall not fill any vacancies for career appointments that the DOGE Team Lead assesses should not be filled, unless the Agency Head determines the positions should be filled.            (iii)  Each DOGE Team Lead shall provide the United States DOGE Service (USDS) Administrator with a monthly hiring report for the agency.     (c)  Reductions in Force.  Agency Heads shall promptly undertake preparations to initiate large-scale reductions in force (RIFs), consistent with applicable law, and to separate from Federal service temporary employees and reemployed annuitants working in areas that will likely be subject to the RIFs.  All offices that perform functions not mandated by statute or other law shall be prioritized in the RIFs, including all agency diversity, equity, and inclusion initiatives; all agency initiatives, components, or operations that my Administration suspends or closes; and all components and employees performing functions not mandated by statute or other law who are not typically designated as essential during a lapse in appropriations as provided in the Agency Contingency Plans on the Office of Management and Budget website.  This subsection shall not apply to functions related to public safety, immigration enforcement, or law enforcement.      (d)  Rulemaking.  Within 30 days of the date of this order, the Director of the Office of Personnel Management (OPM) shall initiate a rulemaking that proposes to revise 5 C.F.R. 731.202(b) to include additional suitability criteria, including:           (i)    failure to comply with generally applicable legal obligations, including timely filing of tax returns;           (ii)   failure to comply with any provision that would preclude regular Federal service, including citizenship requirements;           (iii)  refusal to certify compliance with any applicable nondisclosure obligations, consistent with 5 U.S.C. 2302(b)(13), and failure to adhere to those compliance obligations in the course of Federal employment; and          (iv)   theft or misuse of Government resources and equipment, or negligent loss of material Government resources and equipment.      (e)  Developing Agency Reorganization Plans.  Within 30 days of the date of this order, Agency Heads shall submit to the Director of the Office of Management and Budget a report that identifies any statutes that establish the agency, or subcomponents of the agency, as statutorily required entities.  The report shall discuss whether the agency or any of its subcomponents should be eliminated or consolidated.     (f)  Within 240 days of the date of this order, the USDS Administrator shall submit a report to the President regarding implementation of this order, including a recommendation as to whether any of its provisions should be extended, modified, or terminated.Sec. 4.  Exclusions.  (a)  This order does not apply to military personnel.     (b)  Agency Heads may exempt from this order any position they deem necessary to meet national security, homeland security, or public safety responsibilities.      (c)  The Director of OPM may grant exemptions from this order where those exemptions are otherwise necessary and shall assist in promoting workforce reduction.Sec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:          (i)   the authority granted by law to an executive department, agency, or the head thereof; or          (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    February 11, 2025.\n",
  "summary": "The document is a Presidential Action dated February 11, 2025, detailing an initiative called the 'Department of Government Efficiency' (DOGE) aimed at reforming the federal workforce to enhance efficiency and productivity. The order establishes a hiring freeze ratio, mandates agency heads to create hiring plans with their respective DOGE Team Leads, and outlines criteria for reducing the workforce through large-scale reductions in force (RIFs). The document also specifies rulemaking by the Director of the Office of Personnel Management (OPM) to introduce additional suitability criteria for federal employment and calls for agency restructuring plans to be submitted within 30 days.\n\nThe initiative permits exemptions for positions related to national security, public safety, and law enforcement. The USDS Administrator is tasked with reporting to the President within 240 days on the implementation of the order. The document provides a framework for implementing these changes while ensuring compliance with existing laws and available appropriations. Notably, exclusions from the order include military personnel, and the document underscores that it is not intended to create enforceable rights for any party.\n\nThroughout the document, several terms and positions are defined, such as 'Agency,' 'Agency Head,' 'DOGE Team Lead,' and 'Temporary Employee,' offering a systematic approach to the new directives. The overall intention is to streamline the federal workforce, reduce unnecessary positions, and ensure alignment with broader government efficiency goals.",
  "eli5": "The President wants to make the government work better by having fewer, but more efficient workers. They plan to hire only one new person for every four that leave, except for important jobs like safety, to make sure everything runs smoothly.",
  "keywords": [
    "Department of Government Efficiency",
    "Federal workforce",
    "Hiring freeze",
    "Productivity",
    "Efficiency",
    "Reductions in force",
    "Public safety",
    "Immigration enforcement",
    "Law enforcement",
    "Agency restructuring"
  ],
  "issues": [
    "Potential impact on federal employment levels",
    "Effectiveness of the hiring freeze in achieving desired efficiency",
    "Potential legal challenges regarding workforce reductions",
    "Impact on current diversity, equity, and inclusion initiatives",
    "Implications of restructuring for statutory agencies"
  ],
  "citations": [
    "Section 3502 of title 44, United States Code",
    "Section 2105 of title 5, United States Code",
    "Executive Order 14158 of January 20, 2025",
    "5 C.F.R. part 316",
    "5 C.F.R. part 837",
    "5 C.F.R. 731.202(b)",
    "5 U.S.C. 2302(b)(13)"
  ],
  "document_type": "Presidential Action"
}