{
  "title": "Imposing Sanctions on the International Criminal Court – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Imposing Sanctions on the International Criminal Court",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/imposing-sanctions-on-the-international-criminal-court/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-06T22:36:06+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tIMPOSING SANCTIONS ON THE INTERNATIONAL CRIMINAL COURT\t\t\t\t\n\nFebruary 6, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 *et seq.*) (IEEPA), the National Emergencies Act (50 U.S.C. 1601 *et seq.*) (NEA), section 212(f) of the Immigration and Nationality Act of 1952 (8 U.S.C. 1182(f)), and section 301 of title 3, United States Code,    I, DONALD J. TRUMP, President of the United States of America, find that the International Criminal Court (ICC), as established by the Rome Statute, has engaged in illegitimate and baseless actions targeting America and our close ally Israel.  The ICC has, without a legitimate basis, asserted jurisdiction over and opened preliminary investigations concerning personnel of the United States and certain of its allies, including Israel, and has further abused its power by issuing baseless arrest warrants targeting Israeli Prime Minister Benjamin Netanyahu and Former Minister of Defense Yoav Gallant.  The ICC has no jurisdiction over the United States or Israel, as neither country is party to the Rome Statute or a member of the ICC.  Neither country has ever recognized the ICC’s jurisdiction, and both nations are thriving democracies with militaries that strictly adhere to the laws of war.  The ICC’s recent actions against Israel and the United States set a dangerous precedent, directly endangering current and former United States personnel, including active service members of the Armed Forces, by exposing them to harassment, abuse, and possible arrest.  This malign conduct in turn threatens to infringe upon the sovereignty of the United States and undermines the critical national security and foreign policy work of the United States Government and our allies, including Israel.  Furthermore, in 2002, the Congress enacted the American Servicemembers’ Protection Act of 2002 (22 U.S.C. 7421 *et seq.*) to protect United States military personnel, United States officials, and officials and military personnel of certain allied countries against criminal prosecution by an international criminal court to which the United States is not party, stating, “In addition to exposing members of the Armed Forces of the United States to the risk of international criminal prosecution, the Rome Statute creates a risk that the President and other senior elected and appointed officials of the United States Government may be prosecuted by the International Criminal Court.” (22 U.S.C. 7421(9)).      The United States unequivocally opposes and expects our allies to oppose any ICC actions against the United States, Israel, or any other ally of the United States that has not consented to ICC jurisdiction.  The United States remains committed to accountability and to the peaceful cultivation of international order, but the ICC and parties to the Rome Statute must respect the decisions of the United States and other countries not to subject their personnel to the ICC’s jurisdiction, consistent with their respective sovereign prerogatives.     The United States will impose tangible and significant consequences on those responsible for the ICC’s transgressions, some of which may include the blocking of property and assets, as well as the suspension of entry into the United States of ICC officials, employees, and agents, as well as their immediate family members, as their entry into our Nation would be detrimental to the interests of the United States.    I therefore determine that any effort by the ICC to investigate, arrest, detain, or prosecute protected persons, as defined in section 8(d) of this order, constitutes an unusual and extraordinary threat to the national security and foreign policy of the United States, and I hereby declare a national emergency to address that threat.  I hereby determine and order:     Section 1.  (a)  All property and interests in property that are in the United States, that hereafter come within the United States, or that are or hereafter come within the possession or control of any United States person, of the following persons are blocked and may not be transferred, paid, exported, withdrawn, or otherwise dealt in:(i)   the person listed in the Annex to this order; and(ii)  any foreign person determined by the Secretary of State, in consultation with the Secretary of the Treasury and the Attorney General:(A)  to have directly engaged in any effort by the ICC to investigate, arrest, detain, or prosecute a protected person without consent of that person’s country of nationality;(B)  to have materially assisted, sponsored, or provided financial, material, or technological support for, or goods or services to or in support of, any activity in subsection (a)(ii)(A) of this section or any person whose property or interests in property are blocked pursuant to this order; or(C)  to be owned or controlled by, or to have acted or purported to act for or on behalf of, directly or indirectly, any person whose property or interests in property are blocked pursuant to this order.(b)  The prohibitions in subsection (a) of this section apply except to the extent provided by statutes, or in regulations, orders, directives, or licenses that may be issued pursuant to this order, and notwithstanding any contract entered into or any license or permit granted before the date of this order.    Sec. 2.  I hereby determine that the making of donations of the types of articles specified in section 203(b)(2) of IEEPA (50 U.S.C. 1702(b)(2)) by, to, or for the benefit of any person whose property and interests in property are blocked pursuant to section 1 of this order would seriously impair my ability to address the national emergency declared in this order, and I hereby prohibit such donations as provided by section 1 of this order.     Sec. 3.  The prohibitions in section 1(a) of this order include:     (a)  the making of any contribution or provision of funds, goods, or services by, to, or for the benefit of any person whose property and interests in property are blocked pursuant to section 1 of this order; and     (b)  the receipt of any contribution or provision of funds, goods, or services from any such person.    Sec. 4.  The unrestricted immigrant and nonimmigrant entry into the United States of aliens determined to meet one or more of the criteria in section 1 of this order, as well as immediate family members of such aliens, or aliens determined by the Secretary of State to be employed by, or acting as an agent of, the ICC, would be detrimental to the interests of the United States, and the entry of such persons into the United States, as immigrants or nonimmigrants, is hereby suspended, except where the Secretary of State determines that the entry of the person into the United States would not be contrary to the interests of the United States, including when the Secretary of State so determines, based on a recommendation of the Attorney General, that the person’s entry would further important United States law enforcement objectives.  In exercising this responsibility, the Secretary of State shall consult with the Secretary of Homeland Security on matters related to admissibility or inadmissibility within the authority of the Secretary of Homeland Security.  Such persons shall be treated as persons covered by section 1 of Proclamation 8693 of July 24, 2011 (Suspension of Entry of Aliens Subject to United Nations Security Council Travel Bans and International Emergency Economic Powers Act Sanctions).  The Secretary of State shall have the responsibility for implementing this section pursuant to such conditions and procedures as the Secretary of State has established or may establish pursuant to Proclamation 8693.    Sec. 5.  Within 60 days of the date of this order, the Secretary of the Treasury, in consultation with the Secretary of State, shall submit to the President a report on additional persons that should be included within the scope of section 1 of this order.    Sec. 6.  (a)  Any transaction that evades or avoids, has the purpose of evading or avoiding, causes a violation of, or attempts to violate any of the prohibitions set forth in this order is prohibited.(b)  Any conspiracy formed to violate any of the prohibitions set forth in this order is prohibited.    Sec. 7.  Nothing in this order shall prohibit transactions for the conduct of the official business of the Federal Government by employees, grantees, or contractors thereof.     Sec. 8.  For the purposes of this order:     (a)  the term “person” means an individual or entity;     (b)  the term “entity” means a government or instrumentality of such government, partnership, association, trust, joint venture, corporation, group, subgroup, or other organization;     (c)  the term “United States person” means any United States citizen, permanent resident alien, entity organized under the laws of the United States or any jurisdiction within the United States (including a foreign branch, subsidiary, or employee of such entity), or any person lawfully in the United States;     (d)  the term “protected person” means:(i)   any United States person, unless the United States provides formal consent to ICC jurisdiction over that person or becomes a state party to the Rome Statute, including:(A)  current or former members of the Armed Forces of the United States;(B)  current or former elected or appointed officials of the United States Government; and(C)  any other person currently or formerly employed by or working on behalf of the United States Government; and(ii)  any foreign person that is a citizen or lawful resident of an ally of the United States that has not consented to ICC jurisdiction over that person or is not a state party to the Rome Statute, including:(A)  current or former members of the armed forces of such ally of the United States;(B)  current or former elected or appointed government officials of such ally of the United States; and(C)  any other person currently or formerly employed by or working on behalf of such a government;     (e)  the term “ally of the United States” means:(i)   a government of a member country of the North Atlantic Treaty Organization; or(ii)  a government of a “major non-NATO ally,” as that term is defined by section 2013(7) of the American Servicemembers’ Protection Act of 2002 (22 U.S.C. 7432(7));     (f)  the term “immediate family member” means a spouse or child;     (g)  the term “alien” has the meanings given to the term in section 101(a)(3) of the Immigration and Nationality Act of 1952 (8 U.S.C. 1101(a)(3)); and     (h)  the term “foreign person” means a person that is not a United States person.    Sec. 9.  For those persons whose property and interests in property are blocked pursuant to this order who might have a constitutional presence in the United States, I find that because of the ability to transfer funds or other assets instantaneously, prior notice to such persons of measures to be taken pursuant to section 1 of this order would render those measures ineffectual.  I therefore determine that for these measures to be effective in addressing the national emergency declared in this order, there need be no prior notice of a listing or determination made pursuant to section 1 of this order.    Sec. 10.  The Secretary of the Treasury, in consultation with the Secretary of State, is hereby authorized to take such actions, including adopting rules and regulations, and to employ all powers granted to the President by IEEPA as may be necessary to implement this order.  The Secretary of the Treasury may, consistent with applicable law, redelegate any of these functions within the Department of the Treasury.  All executive departments and agencies of the United States shall take all appropriate measures within their authority to implement this order.    Sec. 11.  The Secretary of the Treasury, in consultation with the Secretary of State, is hereby authorized to submit recurring and final reports to the Congress on the national emergency declared in this order, consistent with section 401(c) of the NEA (50 U.S.C. 1641(c)) and section 204(c) of IEEPA (50 U.S.C. 1703(c)).     Sec. 12.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "# Presidential Action on ICC Sanctions\n\nOn February 6, 2025, President Donald J. Trump issued an order imposing sanctions on the International Criminal Court (ICC). This action was guided by the International Emergency Economic Powers Act, the National Emergencies Act, the Immigration and Nationality Act, and other legal authorities. The President found the ICC had undertaken illegitimate and baseless actions by investigating and issuing arrest warrants against U.S. personnel and allies, including Israel, despite neither nation being a party to the Rome Statute that established the ICC.\n\nThe sanctions aim to protect United States personnel and those from allied nations from prosecution by the ICC, which they argue lacks jurisdiction. The order considers any ICC efforts to target U.S. or allied personnel as a threat to national security. Measures include blocking assets and restricting entry of ICC officials into the U.S. unless specifically authorized by the Secretary of State. The order further mandates ongoing reporting to the President and Congress on the implementation of these sanctions.",
  "eli5": "The U.S. President put rules in place to stop people from the International Criminal Court from going after American and Israeli people unfairly. If they try, the rules allow the U.S. to block their money and stop them from visiting the United States.",
  "keywords": [
    "ICC",
    "sanctions",
    "United States",
    "Israel",
    "national security",
    "Donald J. Trump",
    "Rome Statute",
    "jurisdiction",
    "national emergency"
  ],
  "issues": [
    "Legitimacy of ICC jurisdiction",
    "Impact on international relations",
    "Sovereignty and diplomacy concerns",
    "Potential legal challenges to the sanctions"
  ],
  "citations": [
    "50 U.S.C. 1701 et seq.",
    "50 U.S.C. 1601 et seq.",
    "8 U.S.C. 1182(f)",
    "3 U.S.C. 301",
    "22 U.S.C. 7421 et seq.",
    "8 U.S.C. 1101(a)(3)"
  ],
  "document_type": "Presidential Action"
}