{
  "title": "Imposing Duties to Address the Situation at Our Southern Border – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Imposing Duties to Address the Situation at Our Southern Border – The White House",
  "og:description": "          By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/imposing-duties-to-address-the-situation-at-our-southern-border/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-01T13:38:46+00:00",
  "article:modified_time": "2025-02-03T13:41:46+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tImposing Duties to Address the Situation at Our Southern Border\t\t\t\t\n\nFebruary 1, 2025\n\n          By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 *et seq*.) (IEEPA), the National Emergencies Act (50 U.S.C. 1601 *et seq*.) (NEA), section 604 of the Trade Act of 1974, as amended (19 U.S.C. 2483), and section 301 of title 3, United States Code,\n\n          I, DONALD J. TRUMP, President of the United States of America, find that the sustained influx of illegal aliens and illicit opioids and other drugs has profound consequences on our Nation, endangering lives and putting a severe strain on our healthcare system, public services, communities, and schools.  Since the end of my first term, U.S. Customs and Border Protection (CBP) within the Department of Homeland Security has recorded more than three times as many inadmissible encounters nationwide as during my first term.     These challenges threaten the fabric of our society.  Gang members, smugglers, human traffickers, and illicit drugs of all kinds have poured across our borders and into our communities.  Mexico has played a central role in these challenges, including by failing to devote sufficient attention and resources to meaningfully stem the tide of unlawful migration and illicit drugs.     Mexican drug trafficking organizations (DTOs) are the world’s leading traffickers of fentanyl, methamphetamine, cocaine, and other illicit drugs, and they cultivate, process, and distribute massive quantities of narcotics that fuel addiction and violence in communities across the United States.  These DTOs collaborate and conspire with transnational cartels and other global partners to smuggle drugs into the United States, utilizing clandestine airstrips, maritime routes, tunnels, and overland corridors, and both willing and unwilling human couriers.  \n\n     The Mexican DTOs have an intolerable alliance with the government of Mexico. This alliance endangers the national security of the United States, and we must eradicate the influence of these dangerous cartels from the bilateral environment. The government of Mexico has afforded safe havens for the cartels to engage in the manufacturing and transportation of illicit drugs, which collectively have led to the overdose deaths of hundreds of thousands of American victims.\n\n     Mexican cartels are also implicated in human trafficking and smuggling operations, enabling the illegal migration of millions across our borders.  These operations are often tied to organized crime, and they create pathways for cartel activities to expand into the United States.  Furthermore, violent criminals originating from Central and South America easily transit into and through Mexico, and into the United States, where they cause irreparable harm to our citizens.  These dangerous criminals are involved in drug-related violence, gang activity, and other crimes that endanger the safety of American communities.     Immediate action is required to address the national emergency I declared in Proclamation 10886 of January 20, 2025 (Declaring a National Emergency at the Southern Border of the United States), and to finally end the public health crisis caused by opioid use and addiction, which will not happen unless the compliance and cooperation of the government of Mexico is assured.     I hereby determine and order:     Section 1.  (a)  As President of the United States, my highest duty is the defense of the country and its citizens.  A Nation without borders is not a Nation at all.  I will not stand by and allow our sovereignty to be eroded, our laws to be trampled, our citizens to be endangered, or our borders to be disrespected anymore.     I previously declared a national emergency with respect to the grave threat to the United States posed by the influx of illegal aliens and illicit drugs into the United States in Proclamation 10886.  Pursuant to the NEA, I hereby expand the scope of the national emergency declared in that proclamation to cover the failure of Mexico to arrest, seize, detain, or otherwise intercept DTOs, other drug and human traffickers, criminals at large, and illicit drugs.  In addition, this failure to act on the part of the government of Mexico constitutes an unusual and extraordinary threat, which has its source in substantial part outside the United States, to the national security, foreign policy, and economy of the United States.  I hereby declare and reiterate a national emergency under the NEA and IEEPA to deal with that threat.  This national emergency requires decisive and immediate action, and I have decided to impose, consistent with law, ad valorem tariffs on articles that are products of Mexico as set forth in this order.  In doing so, I invoke my authority under section 1702(a)(1)(B) of IEEPA, and specifically find that action under other authority to impose tariffs is inadequate to address this unusual and extraordinary threat.     Sec. 2.  (a)  All articles that are products of Mexico, as defined by the *Federal Register* notice described in section 2(d) of this order (the *Federal Register* notice), shall be, consistent with law, subject to an additional 25 percent ad valorem rate of duty.  Such rate of duty shall apply with respect to goods entered for consumption, or withdrawn from warehouse for consumption, on or after 12:01 a.m. eastern time on February 4, 2025, except that goods entered for consumption, or withdrawn from warehouse for consumption, after such time that were loaded onto a vessel at the port of loading or in transit on the final mode of transport prior to entry into the United States before 12:01 a.m. eastern time on February 1, 2025, shall not be subject to such additional duty, only if the importer certifies to CBP as specified in the *Federal Register* notice.      (b)  The rates of duty established by this order are in addition to any other duties, fees, exactions, or charges applicable to such imported articles.      (c)  Should the government of Mexico retaliate against the United States in response to this action through import duties on United States exports to Mexico or similar measures, the President may increase or expand in scope the duties imposed under this Executive Order to ensure the efficacy of this action.      (d)  In order to establish the duty rate on imports of articles that are products of Mexico, the Secretary of Homeland Security shall determine the modifications necessary to the Harmonized Tariff Schedule of the United States (HTSUS) in order to effectuate this order consistent with law and shall make such modifications to the HTSUS through notice in the *Federal Register*.  The modifications made to the HTSUS by this notice shall be effective with respect to goods entered for consumption, or withdrawn from warehouse for consumption, on or after 12:01 a.m. eastern time on February 4, 2025, except as otherwise noted in subsection 2(a) of this section, and shall continue in effect until such actions are expressly reduced, modified, or terminated.     (e)  Articles that are products of Mexico, except those that are eligible for admission under “domestic status” as defined in 19 CFR 146.43, which are subject to the duties imposed by this order and are admitted into a United States foreign trade zone on or after 12:01 a.m. eastern time on February 4, 2025, except as otherwise noted in subsection 2(a) of this section, must be admitted as “privileged foreign status” as defined in 19 CFR 146.41.  Such articles will be subject upon entry for consumption to the rates of duty related to the classification under the applicable HTSUS subheading in effect at the time of admittance into the United States foreign trade zone*.*     (f)  No drawback shall be available with respect to the duties imposed pursuant to this order.     (g)  For avoidance of doubt, duty-free *de minimis* treatment under 19 U.S.C. 1321 shall not be available for the articles described in subsection (a) of this section.     (h)  Any prior Presidential Proclamation, Executive Order, or other presidential directive or guidance related to trade with Mexico that is inconsistent with the direction in this order is hereby terminated, suspended, or modified to the extent necessary to give full effect to this order.      (i)  The articles described in subsection (a) of this section shall exclude those encompassed by 50 U.S.C. 1702(b).     Sec. 3.  (a)  The Secretary of Homeland Security shall regularly consult with the Secretary of State, the Attorney General, the Assistant to the President for National Security Affairs, and the Assistant to the President for Homeland Security on the situation at our southern border.  The Secretary of Homeland Security shall inform the President of any circumstances that, in the opinion of the Secretary of Homeland Security, indicate that the government of Mexico has taken adequate steps to alleviate the illegal migration and illicit drug crisis through cooperative actions.  Upon the President’s determination of sufficient action to alleviate the crisis, the tariffs described in section 2 of this order will be removed.     (b)  The Secretary of Homeland Security, in coordination with the Secretary of State, the Attorney General, the Assistant to the President for National Security Affairs, and the Assistant to the President for Homeland Security shall recommend additional action, if necessary, should the government of Mexico fail to take adequate steps to alleviate the illegal migration and illicit drug crises through cooperative enforcement actions.     Sec. 4.  The Secretary of Homeland Security, in consultation with the Secretary of the Treasury, the Attorney General, and the Secretary of Commerce, is hereby authorized to take such actions, including adopting rules and regulations, and to employ all powers granted to me by IEEPA as may be necessary to implement this order.  The Secretary of Homeland Security may, consistent with applicable law, redelegate any of these functions within the Department of Homeland Security.  All agencies shall take all appropriate measures within their authority to implement this order.\n\n       Sec. 5.  The Secretary of Homeland Security, in coordination with the Secretary of the Treasury, the Attorney General, the Secretary of Commerce, the Assistant to the President for National Security Affairs,  and the Assistant to the President for Homeland Security, is hereby authorized to submit recurring and final reports to the Congress on the national emergency under IEEPA declared in this order, consistent with section 401(c) of the NEA (50 U.S.C. 1641(c)) and section 204(c) of IEEPA (50 U.S.C. 1703(c)).     Sec. 6.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:     (i)   the authority granted by law to an executive department, agency, or the head thereof; or     (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,     February 1, 2025.\n",
  "summary": "# Summary\n\nOn February 1, 2025, President Donald J. Trump issued an announcement detailing the imposition of a 25% tariff on Mexican products as a measure to address illegal immigration and drug trafficking concerns at the U.S. southern border. This decision was made under the authority of several U.S. laws, including the International Emergency Economic Powers Act and the National Emergencies Act. President Trump emphasized that Mexico has not taken sufficient action against drug trafficking organizations (DTOs) that have facilitated the flow of illicit drugs and human trafficking into the United States.\n\nThe tariffs are set to begin on February 4, 2025, and apply to all Mexican products, with specific exclusions detailed. The action aims to incentivize the Mexican government to better cooperate with the U.S. to curb illegal activities at the border. In case of Mexican retaliation, President Trump may further increase tariffs. The Secretary of Homeland Security is tasked with assessing Mexico's response and advising on additional measures if necessary.",
  "eli5": "# ELI5\n\nThe President of the United States wants to charge extra money on goods from Mexico because too many people and things like drugs are coming into the United States from there. This is to make sure Mexico helps stop it.",
  "keywords": [
    "Donald Trump",
    "tariffs",
    "Mexico",
    "border security",
    "drug trafficking",
    "illegal immigration",
    "national emergency"
  ],
  "issues": [
    "Potential trade conflict with Mexico",
    "Economic impact on both nations",
    "Diplomatic relations with Mexico"
  ],
  "citations": [
    "50 U.S.C. 1701 et seq.",
    "50 U.S.C. 1601 et seq.",
    "19 U.S.C. 2483",
    "3 U.S.C. 301",
    "19 CFR 146.43",
    "19 CFR 146.41",
    "19 U.S.C. 1321"
  ],
  "document_type": "Executive Order"
}