{
  "title": "Imposing Duties to Address the Flow of Illicit Drugs Across Our National Border – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Imposing Duties to Address the Flow of Illicit Drugs Across Our National Border – The White House",
  "og:description": "     By the authority vested in me as President by the Constitution and the laws of the United States of America, including the",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/imposing-duties-to-address-the-flow-of-illicit-drugs-across-our-national-border/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-02T01:36:39+00:00",
  "article:modified_time": "2025-02-02T01:39:01+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\t IMPOSING DUTIES TO ADDRESS THE FLOW OFILLICIT DRUGS ACROSS OUR NORTHERN BORDER\t\t\t\t\n\nFebruary 1, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 *et seq*.) (IEEPA), the National Emergencies Act (50 U.S.C. 1601 *et seq*.) (NEA), section 604 of the Trade Act of 1974, as amended (19 U.S.C. 2483), and section 301 of title 3, United States Code,\n\n     I, DONALD J. TRUMP, President of the United States of America, find that the sustained influx of illicit opioids and other drugs has profound consequences on our Nation, endangering lives and putting a severe strain on our healthcare system, public services, and communities.\n\nThis challenge threatens the fabric of our society.  Gang members, smugglers, human traffickers, and illicit drugs of all kinds have poured across our borders and into our communities.  Canada has played a central role in these challenges, including by failing to devote sufficient attention and resources or meaningfully coordinate with United States law enforcement partners to effectively stem the tide of illicit drugs.\n\nDrug trafficking organizations (DTOs) are the world’s leading producers of fentanyl, methamphetamine, cocaine, and other illicit drugs, and they cultivate, process, and distribute massive quantities of narcotics that fuel addiction and violence in communities across the United States.  These DTOs often collaborate with transnational cartels to smuggle illicit drugs into the United States, utilizing clandestine airstrips, maritime routes, and overland corridors.  \n\nThe challenges at our southern border are foremost in the public consciousness, but our northern border is not exempt from these issues.  Criminal networks are implicated in human trafficking and smuggling operations, enabling unvetted illegal migration across our northern border.  There is also a growing presence of Mexican cartels operating fentanyl and nitazene synthesis labs in Canada.  The flow of illicit drugs like fentanyl to the United States through both illicit distribution networks and international mail — due, in the case of the latter, to the existing administrative exemption from duty and taxes, also known as *de minimis*, under section 1321 of title 19, United States Code — has created a public health crisis in the United States, as outlined in the Presidential Memorandum of January 20, 2025 (America First Trade Policy) and Executive Order 14157 of January 20, 2025 (Designating Cartels and Other Organizations as Foreign Terrorist Organizations and Specially Designated Global Terrorists).  With respect to smuggling of illicit drugs across our northern border, Canada’s Financial Transactions and Reports Analysis Centre recently published a study on the laundering of proceeds of illicit synthetic opioids, which recognized Canada’s heightened domestic production of fentanyl, largely from British Columbia, and its growing footprint within international narcotics distribution.  Despite a North American dialogue on the public health impacts of illicit drugs since 2016, Canadian officials have acknowledged that the problem has only grown.  And while U.S. Customs and Border Protection (CBP) within the Department of Homeland Security seized, comparatively, much less fentanyl from Canada than from Mexico last year, fentanyl is so potent that even a very small parcel of the drug can cause many deaths and destruction to America families.  In fact, the amount of fentanyl that crossed the northern border last year could kill 9.5 million Americans. \n\nImmediate action is required to finally end this public health crisis and national emergency, which will not happen unless the compliance and cooperation of Canada is assured.\n\nI hereby determine and order:\n\n Section 1.  (a)  As President of the United States, my highest duty is the defense of the country and its citizens. A Nation without borders is not a nation at all.  I will not stand by and allow our sovereignty to be eroded, our laws to be trampled, our citizens to be endangered, or our borders to be disrespected anymore.\n\nI previously declared a national emergency with respect to the grave threat to the United States posed by the influx of illegal aliens and illicit drugs into the United States in Proclamation 10886 of January 20, 2025 (Declaring a National Emergency at the Southern Border).  Pursuant to the NEA, I hereby expand the scope of the national emergency declared in that Proclamation to cover the threat to the safety and security of Americans, including the public health crisis of deaths due to the use of fentanyl and other illicit drugs, and the failure of Canada to do more to arrest, seize, detain, or otherwise intercept DTOs, other drug and human traffickers, criminals at large, and drugs.  In addition, this failure to act on the part of Canada constitutes an unusual and extraordinary threat, which has its source in substantial part outside the United States, to the national security and foreign policy of the United States.  I hereby declare and reiterate a national emergency under the NEA and IEEPA to deal with that threat.  This national emergency requires decisive and immediate action, and I have decided to impose, consistent with law, ad valorem tariffs on articles that are products of Canada set forth in this order.  In doing so, I invoke my authority under section 1702(a)(1)(B) of IEEPA and specifically find that action under other authority to impose tariffs is inadequate to address this unusual and extraordinary threat.\n\n Sec. 2.  (a)  All articles that are products of Canada as defined by the *Federal Register* notice described in subsection (e) of this section (*Federal Register* notice), and except for those products described in subsection (b) of this section, shall be, consistent with law, subject to an additional 25 percent ad valorem rate of duty.  Such rate of duty shall apply with respect to goods entered for consumption, or withdrawn from warehouse for consumption, on or after 12:01 a.m. eastern time on February 4, 2025, except that goods entered for consumption, or withdrawn from warehouse for consumption, after such time that were loaded onto a vessel at the port of loading or in transit on the final mode of transport prior to entry into the United States before 12:01 a.m. eastern time on February 1, 2025, shall not be subject to such additional duty, only if the importer certifies to CBP as specified in the *Federal Register* notice. \n\n(b)  With respect to energy or energy resources, as defined in section 8 of Executive Order 14156 of January 20, 2025 (Declaring a National Energy Emergency), and as otherwise included in the *Federal Register*notice, such articles that are products of Canada as defined by the *Federal Register* notice shall be, consistent with law, subject to an additional 10 percent ad valorem rate of duty.  Such rate of duty shall apply with respect to goods entered for consumption, or withdrawn from warehouse for consumption, on or after 12:01 a.m. eastern time on February 4, 2025, except that goods entered for consumption, or withdrawn from warehouse for consumption, after such time that were loaded onto a vessel at the port of loading or in transit on the final mode of transport prior to entry into the United States before 12:01 a.m. eastern time on February 1, 2025, shall not be subject to such additional duty, only if the importer certifies to CBP as specified in the *Federal Register* notice.  \n\n(c)  The rates of duty established by this order are in addition to any other duties, fees, exactions, or charges applicable to such imported articles. \n\n(d)  Should Canada retaliate against the United States in response to this action through import duties on United States exports to Canada or similar measures, the President may increase or expand in scope the duties imposed under this order to ensure the efficacy of this action.\n\n(e)  In order to establish the duty rate on imports of articles that are products of Canada, the Secretary of Homeland Security shall determine the modifications necessary to the Harmonized Tariff Schedule of the United States (HTSUS) in order to effectuate this order consistent with law and shall make such modifications to the HTSUS through notice in the *Federal Register*.  The modifications made to the HTSUS by this notice shall be effective with respect to goods entered for consumption, or withdrawn from warehouse for consumption, on or after 12:01 a.m. eastern time on February 4, 2025, and shall continue in effect until such actions are expressly reduced, modified, or terminated.\n\n(f)  Articles that are products of Canada, except those that are eligible for admission under “domestic status” as defined in 19 CFR 146.43, which are subject to the duties imposed by this order and are admitted into a United States foreign trade zone on or after 12:01 a.m. eastern time on February 4, 2025, except as otherwise noted in subsections (a) and (b) of this section, must be admitted as “privileged foreign status” as defined in 19 CFR 146.41.  Such articles will be subject upon entry for consumption to the rates of duty related to the classification under the applicable HTSUS subheading in effect at the time of admittance into the United States foreign trade zone*.*\n\n(g)  No drawback shall be available with respect to the duties imposed pursuant to this order. \n\n(h)  For avoidance of doubt, duty-free *de minimis* treatment under 19 U.S.C. 1321 shall not be available for the articles described in subsection (a) and subsection (b) of this section.\n\n     (i)  Any prior Presidential Proclamation, Executive Order, or other Presidential directive or guidance related to trade with Canada that is inconsistent with the direction in this order is hereby terminated, suspended, or modified to the extent necessary to give full effect to this order. \n\n     (j)  The articles described in subsection (a) and subsection (b) of this section shall exclude those encompassed by 50 U.S.C. 1702(b).\n\nSec. 3.  (a)  The Secretary of Homeland Security shall regularly consult with the Secretary of State, the Attorney General, the Assistant to the President for National Security Affairs, and the Assistant to the President for Homeland Security on the situation at our northern border.  The Secretary of Homeland Security shall inform the President of any circumstances that, in the opinion of the Secretary of Homeland Security, indicate that the Government of Canada has taken adequate steps to alleviate this public health crisis through cooperative enforcement actions.  Upon the President’s determination of sufficient action to alleviate the crisis, the tariffs described in section 2 of this order shall be removed.\n\n(b)  The Secretary of Homeland Security, in coordination with the Secretary of State, the Attorney General, the Assistant to the President for National Security Affairs, and the Assistant to the President for Homeland Security, shall recommend additional action, if necessary, should the Government of Canada fail to take adequate steps to alleviate the illegal migration and illicit drug crises through cooperative enforcement actions.\n\nSec. 4.  The Secretary of Homeland Security, in consultation with the Secretary of the Treasury, the Attorney General, and the Secretary of Commerce, is hereby authorized to take such actions, including adopting rules and regulations, and to employ all powers granted to the President by IEEPA as may be necessary to implement this order.  The Secretary of Homeland Security may, consistent with applicable law, redelegate any of these functions within the Department of Homeland Security.  All executive departments and agencies shall take all appropriate measures within their authority to implement this order.\n\n Sec. 5.  The Secretary of Homeland Security, in coordination with the Secretary of the Treasury, the Attorney General, the Secretary of Commerce, the Assistant to the President for National Security Affairs, and the Assistant to the President for Homeland Security, is hereby authorized to submit recurring and final reports to the Congress on the national emergency under IEEPA declared in this order, consistent with section 401(c) of the NEA (50 U.S.C. 1641(c)) and section 204(c) of IEEPA (50 U.S.C. 1703(c)).\n\n Sec. 6.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    February 1, 2025.\n",
  "summary": "On February 1, 2025, President Donald J. Trump issued an executive order to impose duties on Canadian products to address the flow of illicit drugs across the United States' northern border. Utilizing powers under several U.S. laws, the President determined that Canada has not effectively controlled drug trafficking contributing to a public health crisis in the U.S. Tariffs include a 25% ad valorem duty on most Canadian products and a 10% duty on energy resources, effective February 4, 2025. \n\nThis action is part of an initiative to curb the increase of synthetic opioids and other illicit drugs entering the U.S. from Canada—an escalating issue that Canada has reportedly not managed adequately. The executive order involves collaboration between various U.S. departments and outlines punitive measures such as increased tariffs should Canada retaliate. The order also restricts duty-free exemptions for these goods and tasks U.S. Homeland Security officials with assessing and reporting Canada's compliance efforts.",
  "eli5": "President Trump decided to make things Canada sells to us more expensive to push Canada to help stop bad drugs from coming into our country through their borders. He wants to keep everyone safer.",
  "keywords": [
    "Donald Trump",
    "U.S. Canada relations",
    "drug trafficking",
    "northern border",
    "tariffs",
    "Illicit drugs",
    "Public health crisis",
    "Executive order",
    "Fentanyl",
    "National security"
  ],
  "issues": [
    "Potential trade retaliations by Canada",
    "Impact on U.S.-Canada relations",
    "Effectiveness of tariffs in combating drug trafficking",
    "Economic implications for U.S. and Canadian businesses"
  ],
  "citations": [
    "50 U.S.C. 1701 et seq. (International Emergency Economic Powers Act)",
    "50 U.S.C. 1601 et seq. (National Emergencies Act)",
    "19 U.S.C. 2483 (Trade Act of 1974)",
    "3 U.S.C. 301",
    "50 U.S.C. 1702(a)(1)(B)",
    "19 U.S.C. 1321"
  ],
  "document_type": "Executive Order"
}