{
  "title": "Industry, Lawmakers Applaud President Trump’s Section 232 Tariffs – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Industry, Lawmakers Applaud President Trump’s Section 232 Tariffs",
  "og:description": "Yesterday, President Donald J. Trump took decisive action to protect critical American industries by restoring a 25% tariff on steel imports and elevating",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/industry-lawmakers-applaud-president-trumps-section-232-tariffs/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T23:35:14+00:00",
  "article:modified_time": "2025-02-11T23:49:44+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tIndustry, Lawmakers Applaud President Trump’s Section 232 Tariffs\t\t\t\t\n\nFebruary 11, 2025\n\nYesterday, President Donald J. Trump [took](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=cfc30a2569&amp;e=19eb8827a7) decisive action to protect critical American industries by restoring a 25% tariff on steel imports and elevating the tariff to 25% on aluminum imports — building on the [successful tariffs](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=62aa1c6af5&amp;e=19eb8827a7) from his first term, which have since been undermined by loopholes and exemptions.**The moves were quickly met with praise from industry, unions, and lawmakers:****Steel Manufacturers Association President Philip K. Bell:** “The steel industry in America faces serious threats from foreign actors that seek to destroy domestic production. China and other countries routinely violate trade laws and dump heavily subsidized steel products into the United States at the expense of American workers. By imposing a 25 percent tariff on steel imports, President Trump is leveling the playing field for American manufacturers and workers and helping America defeat direct threats to our jobs.”**United Steelworkers President David McCall:** “Our union welcomes President Donald Trump’s efforts to contain the global overcapacity that has for too long enabled bad actors like China to flood the global market with its unfairly traded products, resulting in surging imports into the United States, especially from Mexico.”[**Aluminum Association President Charles Johnson:**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=217fe77d98&amp;e=19eb8827a7) “We appreciate President Trump’s continued focus on strong trade actions to support the aluminum industry in the United States. During his first term the president was early to recognize the genuine threat that non-market actors pose to U.S. manufacturing industries like ours … Today, there is not enough smelting capacity in the United States to supply the growing aluminum industry with the input materials it needs.”[**American Iron and Steel Institute President Kevin Dempsey:**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=1014480e23&amp;e=19eb8827a7) “We look forward to working closely with the President and his administration to implement a robust and reinvigorated trade agenda to address the many foreign market-distorting policies and practices that create an unlevel playing field for American steelmakers.”[**American Primary Aluminum Association President Mark Duffy:**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=4991b1e461&amp;e=19eb8827a7) “Today is a great day for the U.S. aluminum industry. Unfair trade practices have devastated the domestic aluminum industry and President Trump’s actions today will protect thousands of American workers and their families.”**Coalition for a Prosperous America Chairman Zach Mottl:** “President Trump’s decision to implement global tariffs is a critical step toward restoring stability to American industry, safeguarding domestic production, and ensuring these critical sectors are not harmed by a surge of imports. The only way to rebuild domestic industrial capacity is through strong and enforceable trade policies, and these tariffs are a major step in the right direction.”**Nucor Corporation President Leon Topalian:**“Nucor strongly commends the actions taken today by President Trump to reimpose tariffs on all steel imports. America’s national security depends on a robust and healthy American steel industry, which continues to be harmed by massive global steel overcapacity and the resulting surge of illegally dumped and subsidized imports from around the world. Many of our trading partners have taken advantage of our open market for far too long and have intentionally circumvented our trade laws or allowed other bad actors to transship illegally dumped and subsidized steel. The President’s actions will help level the playing field for American steel producers.”**Energy Fair Trade Coalition Executive Director Bret Manley:**“President Trump’s bold leadership will strengthen the backbone of America – our steel and aluminum industry. E-FTC is proud to support initiatives that will level the playing field, foster domestic job growth, and promote fair reciprocal trade.”[**Century Aluminum Company CEO Jesse Gary:**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=436e0214d1&amp;e=19eb8827a7) “We strongly support today’s Executive Order from President Donald J. Trump imposing a 25% tariff to stop the flood of aluminum imports into the United States. President Trump’s decisive action will protect national security and help level the playing field for America’s aluminum workers. On behalf of our employees, I thank President Trump for putting America first and strengthening the Section 232 tariffs, which will help drive the resurgence of domestic aluminum production.”[**Lowell Iron and Steel Company President Dennis Scanell:**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=cccdb443a5&amp;e=19eb8827a7) “The tariffs, thank God they’re coming … Maybe this evens the playing field for us, but this hits right at home. There’s no way we can compete with Canada.”**America First Works:** “President Trump promised to put America First and make our nation wealthy again; that is exactly what tariffs do. In his first term, President Trump’s bold trade policies created over 4,000 new American jobs and higher wages for hardworking patriots. Foreign nations will no longer be able to take advantage of the United States. If they don’t like the tariffs, they can come to the table and make a deal. In fact, that is what President Trump does best. China will no longer exploit trade loopholes to undermine American workers. Now is the time to stand strong, fight for fair trade, and put America FIRST where it belongs!”[**Sen. Jim Banks (R-IN):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=77e1a9fb99&amp;e=19eb8827a7) “Too many politicians in Washington take our domestic steel industry for granted. That hurts our workers and disrespects our history.”[**Sen. John Kennedy (R-LA):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=8eb1e9586c&amp;e=19eb8827a7) “If you have a high tariff on our product, and we have a low tariff on your product, we ought to level them out. That just seems fair to me.”[**Sen. Roger Marshall (R-KS):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=c9f0c6e558&amp;e=19eb8827a7) “President Trump is a leader who brokers deals that put AMERICAN workers first. The days of unfair, one-sided trade deals that let foreigners take advantage of our country are over. The sky is not falling. @POTUS is protecting our Steel and Aluminum industry workers — and in the end, America will have the upper hand. As it should be.”[**Sen. Tim Scott (R-SC):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=71ee19ba5a&amp;e=19eb8827a7) “President Trump’s approach to tariffs is designed with the long-term benefits of American consumers and national security in mind. By prioritizing fair trade policies and a balanced approach to tariffs, we’ll secure the economic prosperity of American workers across the country.”[**Sen. Tommy Tuberville (R-AL):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=fabff0dab3&amp;e=19eb8827a7) “The media is in full meltdown mode after President Trump imposed duties and retaliatory tariffs this week on countries who have been ripping us off for decades. Both aluminum and steel are critical to our national security — and we make some of the best in the world right here at home. President Trump’s strategic tariffs will strengthen and revitalize our nation’s economy by making sure our trade deals are fair to taxpayers and the American worker.”[**Majority Whip Tom Emmer (R-MN):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=a413b9b171&amp;e=19eb8827a7) “President @realDonaldTrump is a master negotiator, especially when it comes to tariffs. Don’t just take my word for it — even Biden’s own commerce secretary admitted that the tariffs President Trump placed on foreign steel and aluminum during his first term were effective.”[**Chairwoman Lisa McClain (R-MI):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=b7fa96b262&amp;e=19eb8827a7) “Millions of Americans are cheering for @POTUS’s tariff negotiations. He has proven his effectiveness in this arena time and time again. This will be no different. He is sending a message to the world. Compete fairly, or pay the price.”[**Rep. Jason Smith (R-MO):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=3f65e6a7b2&amp;e=19eb8827a7) “President Trump is wasting no time moving forward with his America First trade policy. The days of the United States allowing our trading partners to steam roll us are over. President Trump successfully used tariffs in the past to grow our economy and protect American jobs. He imposed steel and aluminum tariffs in 2018, and now he is eliminating exceptions countries like China have used to circumvent them. I look forward to continuing to work with @POTUS to put America First and hold our trading partners accountable.”[**Rep. Andrew Clyde (R-GA):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=176bc7061c&amp;e=19eb8827a7) “President Trump is sending a loud and clear message: America is DONE letting foreign countries undercut our economy. Once again, he’s delivering on his promise to PUT AMERICA FIRST!”[**Rep. Carlos Gimenez (R-FL):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=dd69e110c2&amp;e=19eb8827a7) “President Trump is ABSOLUTELY RIGHT to tariff &amp; combat Communist #China!”[**Rep. Diana Harshbarger (R-TN):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=22600a62e9&amp;e=19eb8827a7) “Unfair trade practices have led to our nation being on the wrong end of too many bad deals. That’s coming to an end. President Trump is taking action to protect America’s steel and aluminum industries with his latest executive order, continuing to put America first.”[**Rep. Dan Meuser (R-PA):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=317c9ab2bc&amp;e=19eb8827a7) “President @realDonaldTrump is taking action to protect the American steel industry by closing loopholes that allow other countries to bypass U.S. tariffs through Mexico and Canada. This move will strengthen domestic production and encourage critical investment in U.S. Steel.”[**Rep. Maria Elvira Salazar (R-FL):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=00f0042c1a&amp;e=19eb8827a7) “Trading with the United States is a privilege, not a right. President Trump’s America First trade policy will advance our priorities abroad and grow prosperity at home!”[**Rep. Keith Self (R-TX):**](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=c970ec2271&amp;e=19eb8827a7) “President Trump KEEPS HIS PROMISES! @realDonaldTrump is delivering on his promise to rebalance trade from unfair foreign competition. In the Golden Age, we are building a stronger America.”\n",
  "summary": "In February 2025, President Donald J. Trump took decisive action to protect American industries by reinstating and increasing tariffs on steel and aluminum imports, with steel tariffs set at 25% and aluminum tariffs raised to 25%. This move follows similar policies from his first term which had been weakened by loopholes and exemptions. The announcement was met with widespread approval from industry leaders, union representatives, and Republican lawmakers who believe these tariffs will help mitigate threats posed by foreign competitors, especially from countries like China and Mexico, accused of unfair trade practices.\n\nIndustry leaders like Philip K. Bell of the Steel Manufacturers Association and Charles Johnson of the Aluminum Association expressed support, emphasizing the tariffs' roles in leveling the competitive field for U.S. manufacturers and enhancing domestic production. Lawmakers, including Senators Jim Banks and Tim Scott, praised the tariffs as a necessary means to protect American workers, citing their long-term benefits for national security and economic stability. Leaders across industry and government see these tariffs as vital steps to restore and safeguard America’s industrial base through enforceable trade policies.",
  "eli5": "President Trump made a rule to make foreign steel and aluminum more expensive in America so that the people who make them here in the USA can compete more fairly. Lots of people in government and business think this is a good idea to help protect jobs in America.",
  "keywords": [
    "Trump",
    "tariffs",
    "steel",
    "aluminum",
    "trade policy",
    "foreign imports",
    "industry support",
    "national security",
    "American manufacturing"
  ],
  "issues": [
    "Potential international trade disputes",
    "Impact on domestic consumer prices",
    "Effectivity in closing unaddressed loopholes"
  ],
  "citations": [
    "Section 232 of the Trade Expansion Act"
  ],
  "document_type": "Press Release"
}