{
  "title": "Vice President JD Vance\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Vice President JD Vance",
  "og:description": "In 2024, President Donald J. Trump extended JD the incredible honor of asking him to serve as the Vice-Presidential Nominee for the Republican Party. JD looks forward to serving with President Trump over the next four years as they work diligently to Make America Great Again.",
  "og:url": "https://www.whitehouse.gov/administration/jd-vance/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-01-20T21:38:31+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Administration](https://www.whitehouse.gov/administration/)\n\n# \t\t\t\t\tJD Vance\t\t\t\t\n\nVice President of the United States\n\nVice President JD Vance was born and raised in Middletown, Ohio, a once flourishing American manufacturing town where Ohioans could live content, middle-class lives on single incomes. Over time, many of those good jobs disappeared, and JD’s family suffered the effects along with many others. \n\nGrowing up, JD faced a challenging childhood marked by financial struggles and family instability. His mother’s battle with addiction and his father’s absence left a void that his grandparents filled with unwavering support and guidance. His grandma, Mamaw, who was the proud owner of 19 handguns, provided the tough love he needed to stay on the straight and narrow.   \n\nAfter graduating from Middletown High School, JD served his country honorably by enlisting in the United States Marine Corps, serving for four years with a tour in Iraq. Upon returning home, JD used the GI Bill to attend The Ohio State University, where he excelled academically and earned a spot at Yale Law School. \n\nJD met his lovely wife, Usha, during their time in law school together. Today, they reside in Cincinnati, Ohio and are proud parents to three beautiful children. After law school, JD found success as an investor in startups across the Midwest, and as the author of the bestselling memoir “Hillbilly Elegy,” which gave a voice to millions of forgotten Americans across the heartland.  \n\nIn 2022, JD Vance took his commitment to his country to the national stage and was elected to the U.S. Senate. As a Senator, he was a champion for issues such as securing our southern border, revitalizing American manufacturing, and fighting for the prosperity of working-class families across the country.   \n\nIn 2024, President Donald J. Trump extended JD the incredible honor of asking him to serve as the Vice-Presidential Nominee for the Republican Party. JD looks forward to serving with President Trump over the next four years as they work diligently to Make America Great Again.\n\n[Learn more about Second Lady Usha Vance here.](https://www.whitehouse.gov/the-administration/usha-vance/)\n",
  "summary": "**JD Vance** serves as Vice President of the United States. Born in Middletown, Ohio, Vance's early life was marked by economic challenges and family instability. Despite these hurdles, with the support of his grandparents, he persevered, joining the United States Marine Corps and later pursuing higher education. He attended The Ohio State University and Yale Law School, where he met his wife, Usha.\n\nAfter his education, JD Vance became a successful investor and authored the memoir _Hillbilly Elegy_. He entered politics and was elected to the U.S. Senate in 2022, where he focused on issues such as border security and revitalizing manufacturing. In 2024, he was chosen by President Donald J. Trump as the Vice-Presidential Nominee, committing to work on enhancing the prosperity of working-class families.",
  "eli5": "**JD Vance** grew up in Ohio and had a tough time with money and family. He worked hard and is now the Vice President, helping people in America have better lives.",
  "keywords": [
    "JD Vance",
    "Vice President",
    "United States",
    "Middletown, Ohio",
    "Marine Corps",
    "Yale Law School",
    "Hillbilly Elegy",
    "U.S. Senate",
    "Donald Trump",
    "Republican Party"
  ],
  "issues": [
    "Accuracy of JD Vance serving as Vice President instead of being a senator.",
    "Error in describing the timeline or sequence of events."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}