{
  "title": "Keeping Americans Safe in Aviation – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Keeping Americans Safe in Aviation – The White House",
  "og:description": "SUBJECT:       Keeping Americans Safe in Aviation Every day, the Federal Aviation Administration (FAA), within the U.S. Department of Transportation,",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/keeping-americans-safe-in-aviation/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T01:17:18+00:00",
  "article:modified_time": "2025-01-22T01:17:19+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tKeeping Americans Safe in Aviation\t\t\t\t\n\nJanuary 21, 2025\n\nSUBJECT:       Keeping Americans Safe in Aviation\n\nEvery day, the Federal Aviation Administration (FAA), within the U.S. Department of Transportation, oversees safety for more than 45,000 flights and 2.9 million airline passengers.  These Americans trust the FAA’s public servants with their lives, and it is therefore imperative that they maintain a commitment to excellence and efficiency.During the prior administration, however, the FAA betrayed its mission by elevating dangerous discrimination over excellence.  For example, prior to my Inauguration, the FAA Diversity and Inclusion website revealed that the prior administration sought to specifically recruit and hire individuals with serious infirmities that could impact the execution of their essential life-saving duties.Illegal and discriminatory diversity, equity, and inclusion (DEI) hiring, including on the basis of race, sex, disability, or any other criteria other than the safety of airline passengers and overall job excellence, competency, and qualification, harms all Americans, who deserve to fly with confidence.  It also penalizes hard-working Americans who want to serve in the FAA but are unable to do so, as they lack a requisite disability or skin color.  FAA employees must hold the qualifications and have the ability to perform their jobs to the highest possible standard of excellence.I hereby order the Secretary of Transportation and the Federal Aviation Administrator to immediately return to non-discriminatory, merit-based hiring, as required by law.  All so-called DEI initiatives, including all dangerous preferencing policies or practices, shall immediately be rescinded in favor of hiring, promoting, and otherwise treating employees on the basis of individual capability, competence, achievement, and dedication. The Secretary of Transportation and the Federal Aviation Administrator shall review the past performance and performance standards of all individuals in critical safety positions and take all appropriate action to ensure that any individual who fails or has failed to demonstrate requisite capability is replaced by a high-capability individual that will ensure top-notch air safety and efficiency.\n",
  "summary": "On January 21, 2025, a presidential action was announced to address hiring practices at the Federal Aviation Administration (FAA). The document criticizes the prior administration for prioritizing diversity, equity, and inclusion (DEI) policies over merit, particularly in the hiring and promotion processes within FAA roles that are critical to aviation safety. The current administration mandates a return to strict, merit-based hiring and promotion standards, focusing on individual capability and excellence over demographics or personal characteristics.\n\nThe action requires the Secretary of Transportation and the Federal Aviation Administrator to rescind all DEI initiatives and review the performance of current employees in critical safety positions to ensure they meet the highest standards. The goal is to prioritize safety and operational efficiency by ensuring all FAA employees are selected based solely on their qualifications and ability to perform essential duties competently, without any influence from discriminatory practice.",
  "eli5": "The president wants people who work at keeping airplanes safe to be chosen because they're best at the job, not because of things like what they look like or if they have a disability.",
  "keywords": [
    "FAA",
    "Aviation Safety",
    "Merit-based Hiring",
    "Diversity, Equity, and Inclusion",
    "Federal Aviation Administration"
  ],
  "issues": [
    "Potential backlash over reversing DEI policies",
    "Evaluation of current employees may cause workforce disruptions",
    "The challenge of balancing non-discriminatory practices with diversity aspirations"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}