{
  "title": "Keeping Education Accessible and Ending Covid-19 Vaccine Mandates in Schools – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Keeping Education Accessible and Ending Covid-19 Vaccine Mandates in Schools",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1.  Purpose",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/keeping-education-accessible-and-ending-covid-19-vaccine-mandates-in-schools/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-15T14:21:15+00:00",
  "article:modified_time": "2025-02-15T14:23:51+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tKeeping Education Accessible and Ending Covid-19 Vaccine Mandates in Schools\t\t\t\t\n\nFebruary 15, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section1.  Purpose and Policy.  Some school districts and universities continue to coerce children and young adults into taking the COVID-19 vaccine by conditioning their education on it, and others may re-implement such mandates.  Parents and young adults should be empowered with accurate data regarding the remote risks of serious illness associated with COVID-19 for children and young adults, as well as how those risks can be mitigated through various measures, and left free to make their own decisions accordingly.  Given the incredibly low risk of serious COVID-19 illness for children and young adults, threatening to shut them out of an education is an intolerable infringement on personal freedom.  Such mandates usurp parental authority and burden students of many faiths.    It is the policy of my Administration that discretionary Federal funds should not be used to directly or indirectly support or subsidize an educational service agency, State educational agency, local educational agency, elementary school, secondary school, or institution of higher education that requires students to have received a COVID-19 vaccination to attend any in-person education program.Sec. 2.  Definitions.  For the purposes of this order:  (a)  The term “educational service agency” has the meaning given in 20 U.S.C. 1401(5).(b)  The term “elementary school” has the meaning given in 34 C.F.R. 77.1(c). (c)  The term “institution of higher education” has the meaning given in 20 U.S.C. 1001(a). (d)  The term “local educational agency” has the meaning given in 34 C.F.R. 77.1(c).(e)  The term “secondary school” has the meaning given in 34 C.F.R. 77.1(c). (f)  The term “State educational agency” has the meaning given in 34 C.F.R. 77.1(c).Sec. 3.  Ending COVID-19 Vaccine Mandate Coercion.  (a)  The Secretary of Education shall as soon as practicable issue guidelines to elementary schools, local educational agencies, State educational agencies, secondary schools, and institutions of higher education regarding those entities’ legal obligations with respect to parental authority, religious freedom, disability accommodations, and equal protection under law, as relevant to coercive COVID-19 school mandates.(b)  Within 90 days of the date of this order, the Secretary of Education, in consultation with the Secretary of Health and Human Services, shall provide to the President, through the Assistant to the President for Domestic Policy, a plan to end coercive COVID-19 school mandates, consistent with applicable law, and including, as appropriate, any proposed legislation.  Such plan shall also include:(i)   a list of discretionary Federal grants and contracts provided to elementary schools, local educational agencies, State educational agencies, secondary schools, and institutions of higher education that are non-compliant with the guidelines issued pursuant to subsection (a) of this section; and(ii)  each executive department or agency’s process for, to the maximum extent consistent with applicable law, preventing Federal funds from being provided to, and rescinding Federal funds from, elementary schools, local educational agencies, State educational agencies, secondary schools, and institutions of higher education that are non-compliant with the guidelines issued pursuant to subsection (a) of this section.Sec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "The document is a Presidential order issued on February 15, 2025, addressing the discontinuation of COVID-19 vaccine mandates in educational institutions. The President, drawing powers from the Constitution and applicable laws, mandates that Federal funds should not support educational agencies that require COVID-19 vaccination for attendance. The order emphasizes the low risk of serious illness from COVID-19 for children and young adults, arguing that mandates infringe on personal freedom, parental authority, and may pose burdens upon specific faiths.\n\nThe order directs the Secretary of Education to issue guidelines to various educational bodies regarding legal obligations pertaining to parental authority, religious freedom, and equal protection concerning COVID-19 school mandates. Within 90 days, a plan must be furnished to end coercive mandates, detailing non-compliant entities and processes to prevent or retract Federal funding from them. The order reinforces its compatibility with existing laws, clarifies it doesn't impair authoritative functions of other entities, and states it won't create legally enforceable rights.",
  "eli5": "The President made a rule that schools should not make kids get a COVID-19 shot to go to school. Schools that still have this rule can't use government money.",
  "keywords": [
    "Presidential order",
    "COVID-19 vaccine mandates",
    "education",
    "Federal funding",
    "personal freedom",
    "parental authority"
  ],
  "issues": [
    "Potential impact on public health policies",
    "Compliance and enforcement mechanisms for educational institutions",
    "Interpretation of the order's scope regarding Federal distribution of funds"
  ],
  "citations": [
    "20 U.S.C. 1401(5)",
    "20 U.S.C. 1001(a)",
    "34 C.F.R. 77.1(c)"
  ],
  "document_type": "Executive Order"
}