{
  "title": "Limiting Lame-Duck Collective Bargaining Agreements That Improperly Attempt to Constrain the New President – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Limiting Lame-Duck Collective Bargaining Agreements That Improperly Attempt to Constrain the New President – The White House",
  "og:description": "MEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES SUBJECT:       Limiting Lame-Duck Collective Bargaining Agreements That Improperly Attempt",
  "og:url": "https://www.whitehouse.gov/uncategorized/2025/01/limiting-lame-duck-collective-bargaining-agreements-that-improperly-attempt-to-constrain-the-new-president/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-31T23:44:47+00:00",
  "article:modified_time": "2025-01-31T23:44:48+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Uncategorized](https://www.whitehouse.gov/uncategorized/)\n\n# \t\t\t\t\tLimiting Lame-Duck Collective Bargaining Agreements That Improperly Attempt to Constrain the New President\t\t\t\t\n\nJanuary 31, 2025\n\nMEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES\n\nSUBJECT:       Limiting Lame-Duck Collective Bargaining Agreements That Improperly Attempt to Constrain the New President\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby ordered:Section 1.  Policy and Purpose*.*  In the final days of the prior administration’s tenure, it purposefully finalized collective bargaining agreements (CBAs) with Federal employees in an effort to harm my Administration by extending its wasteful and failing policies beyond its time in office.  For example, the Department of Education negotiated a CBA on January 17, 2025 — 3 days before I took office — that generally prohibits the agency from returning remote employees to their offices.Such last-minute, lame-duck CBAs, which purport to bind a new President to his predecessor’s policies, run counter to America’s system of democratic self-government.  CBAs quickly negotiated to include extreme policies on the eve of a new administration are purposefully designed to circumvent the will of the people and our democracy.  Such CBAs inhibit the President’s authority to manage the executive branch by tying his hands with inefficient and ineffective practices.  The Supreme Court has explained that a President “cannot choose to bind his successors by diminishing their powers.”Therefore, it is the policy of the executive branch that CBAs executed in the 30 days prior to the inauguration of a new President, and that purport to remain in effect despite the inauguration of a new President and administration, shall not be approved.Sec. 2.  Standards for CBA Duration.  (a)  No executive department or agency (agency) or agency employees shall make a CBA governing conditions of employment in the 30 days prior to a change in Presidential administrations that:(i)    creates new contractual obligations;(ii)   makes substantive changes to existing agreements; or(iii)  extends the duration of an existing agreement.(b)  Subsection (a) of this section applies only to the extent that its requirements do not prevent CBAs from rolling over under existing contractual provisions.(c)  To the extent that subordinate agency personnel have executed a CBA that violates the requirements of subsection (a) of this section, but the applicable agency head has not yet approved such agreement pursuant to 5 U.S.C. 7114(c), such agency head shall promptly disapprove such agreement as inconsistent with the requirements of this memorandum. (d)  The requirements of this section do not apply to CBAs that primarily cover law enforcement officers, as that term is used in 18 U.S.C. 1515(a)(4).Sec. 3.  General Provisions.  (a)  Nothing in this memorandum shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department, agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This memorandum shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  If the Federal Labor Relations Authority or a court of competent jurisdiction issues a final judgment holding that section 2(d) of this memorandum would prevent this memorandum from being considered a Government-wide rule or regulation for purposes of 5 U.S.C. 7117(a)(1), section 2(d) of this memorandum shall be severed and rendered inoperative thereby and given no force or effect.(d)  This memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.(e)  The Director of the Office of Personnel Management is authorized and directed to publish this memorandum in the *Federal Register*.\n",
  "summary": "In a memorandum issued on January 31, 2025, the President directed executive departments and agencies to limit certain collective bargaining agreements (CBAs) made in the last 30 days of a previous administration. This decision arose from concerns that these last-minute agreements were intentionally designed to bind the incoming administration to the prior administration's policies. One cited example involved the Department of Education, which negotiated a CBA just days before the new administration took office, preventing employees from returning to offices from remote work.\n\nThe memorandum establishes policies that disallow new CBAs, substantive changes to existing ones, or extensions of agreements during this 30-day period unless they align with existing contractual provisions. It aims to uphold democratic self-government by ensuring that new administrations can implement their policies without being constrained by the previous Government's final decisions. Furthermore, the memorandum clarifies the standards for CBA durations and emphasizes that agreements inconsistent with the directive should be disapproved by agency heads unless they concern law enforcement officers.\n\nAdditionally, the memorandum clarifies that it should not impair legal authorities granted to departments or agencies, nor should it contravene budgetary regulations set by the Office of Management and Budget. The document also outlines specific legal procedures, including severability clauses should certain provisions be legally challenged, and directs the publication of the memorandum in the Federal Register.",
  "eli5": "The President made a rule saying the old President's team can't make important agreements right before leaving that the new President has to follow. This is to make sure the new President can do their job without being stuck with the old President's choices.",
  "keywords": [
    "Collective Bargaining Agreements",
    "Lame-Duck Policies",
    "Presidential Memorandum",
    "Federal Employees",
    "Executive Branch Management",
    "Policy Transition"
  ],
  "issues": [
    "Potential conflicts with existing contractual provisions",
    "Legal challenges regarding the memorandum's provisions",
    "Impact of non-applicability to law enforcement CBAs"
  ],
  "citations": [
    "5 U.S.C. 7301",
    "5 U.S.C. 7114(c)",
    "18 U.S.C. 1515(a)(4)",
    "5 U.S.C. 7117(a)(1)"
  ],
  "document_type": "Presidential Memorandum"
}