{
  "title": "First Lady Melania Trump\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "First Lady Melania Trump",
  "og:description": "First Lady Melania Trump is the wife of the 45th and 47th President of the United States, Donald J. Trump, and the mother to their son, Barron Trump. ",
  "og:url": "https://www.whitehouse.gov/administration/melania-trump/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-01-20T21:38:38+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Administration](https://www.whitehouse.gov/administration/)\n\n# \t\t\t\t\tMelania Trump\t\t\t\t\n\nFirst Lady OF THE UNITED STATES\n\nMelania Trump is the wife of the 45th and 47th President of the United States, Donald J. Trump, and the mother to their son, Barron Trump. \n\nShe was born in Slovenia on April 26, 1970, and is the second First Lady born outside the United States. At a young age, she began what would soon become a highly successful modeling career, appearing in many high-profile ad campaigns and working with some of the best photographers in the fashion industry.\n\nIn 1996, Mrs. Trump moved to New York, and 10 years later, she proudly became a United States Citizen, making her the only First Lady to become a naturalized citizen. Mrs. Trump has always been an active member of her community. In 2005, she was the Honorary Chairwoman of the Martha Graham Dance Company. That same year, she was awarded Goodwill Ambassador by the American Red Cross—a role she served for 4 years. Mrs. Trump served 5 years as Honorary Chairwoman for the Boys’ Club of New York and was named Woman of the Year in 2006 by the Police Athletic League. In 2010, Mrs. Trump was the Chairwoman of the American Heart Association. In addition to her philanthropic work and modeling and fashion career, Mrs. Trump is an accomplished businesswoman. In 2010, she launched her own successful jewelry collection, Melania Trump Timepieces and Jewelry.\n\nWhile Melania Trump became a household name, she is, first and foremost, a mother and wife, and in 2017, she made the White House and Washington home for her family.\n\nIn her role as First Lady from 2017 to 2021, Mrs. Trump focused on the many issues affecting children across the Nation. This passion led to the establishment of BE BEST in 2018; Mrs. Trump’s awareness campaign focused on the well-being of children and highlighted the people and programs dedicated to ensuring a better future for the next generation. Mrs. Trump promoted BE BEST throughout the country and internationally.\n\nIn addition to BE BEST, Mrs. Trump has a deep appreciation for the military and their families. She traveled to military bases domestically and overseas, including Iraq in 2018, and regularly incorporated military families in public engagements. \n\nIn her time away from the White House, Mrs. Trump established Fostering the Future, a BE BEST initiative, which provides college-level scholarships to those aging out of the foster care system. The scholarship funds are provided by a portion of the revenue generated from her Web 2 and Web 3 platforms on melaniatrump.com and usamemorabilia.com. Her platforms utilize blockchain technology, marking her as a pioneer within the industry while empowering the next generation of young Americans with the resources needed to excel. Mrs. Trump consistently implements innovative approaches to advance her advocacy for children and the causes she supports, demonstrating a forward-thinking commitment to making a positive impact.\n\nIn 2024, Mrs. Trump released her memoir, *MELANIA*, which quickly became a #1 on the *New York Times*best sellers list. \n\n[Learn more about President Donald J. Trump here.](https://www.whitehouse.gov/the-administration/donald-j-trump/)\n",
  "summary": "Melania Trump, born on April 26, 1970, in Slovenia, is the wife of Donald J. Trump and served as the First Lady of the United States from 2017 to 2021. She is notable for being the first First Lady to become a naturalized U.S. citizen, having moved to New York in 1996. In 2005, she was appointed as the Goodwill Ambassador of the American Red Cross and served in various charitable roles, such as Honorary Chairwoman for the Boys' Club of New York and the American Heart Association. She also started a successful line of jewelry, furthering her career as a businesswoman.\n\nDuring her tenure as First Lady, Melania Trump initiated the BE BEST campaign in 2018, which focused on the well-being and positive development of children. She emphasized improving lives through visits to military bases domestically and abroad, notably Iraq, showcasing her appreciation for military families. Post her White House years, she launched 'Fostering the Future,' a scholarship initiative for young adults aging out of foster care, funded by her online platforms. In 2024, she published her memoir, *MELANIA*, which became a bestseller.",
  "eli5": "Melania Trump used to live in a big house called the White House and worked to help kids be happier and healthier. She also made a book that a lot of people read.",
  "keywords": [
    "Melania Trump",
    "First Lady",
    "BE BEST",
    "foster care scholarships",
    "modeling career",
    "naturalized citizen"
  ],
  "issues": [
    "Incorrect information about Donald Trump serving as the 47th President.",
    "No specific citations to laws or rules.",
    "Vague details on the impact of BE BEST and other initiatives."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}