{
  "title": "Memorandum for the Heads of Executive Departments and Agencies – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Memorandum for the Heads of Executive Departments and Agencies",
  "og:description": "SUBJECT:       Advancing United States Interests When Funding                Nongovernmental Organizations The United States",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/memorandum-for-the-heads-of-executive-departments-and-agencies/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-06T14:35:08+00:00",
  "article:modified_time": "2025-02-07T16:52:19+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tMEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES\t\t\t\t\n\nFebruary 6, 2025\n\nSUBJECT:       Advancing United States Interests When Funding\n\n                             Nongovernmental Organizations\n\nThe United States Government has provided significant taxpayer dollars to Nongovernmental Organizations (NGOs), many of which are engaged in actions that actively undermine the security, prosperity, and safety of the American people.  It is the policy of my Administration to stop funding NGOs that undermine the national interest.\n\nI therefore direct the heads of executive departments and agencies (agencies) to review all funding that agencies provide to NGOs.  The heads of agencies shall align future funding decisions with the interests of the United States and with the goals and priorities of my Administration, as expressed in executive actions; as otherwise determined in the judgment of the heads of agencies; and on the basis of applicable authorizing statutes, regulations, and terms.\n",
  "summary": "The memorandum, dated February 6, 2025, is from the President of the United States to the heads of executive departments and agencies. It addresses the issue of U.S. government funding to Nongovernmental Organizations (NGOs) that allegedly impact the nation's security, prosperity, or safety negatively. The memorandum emphasizes that it is the Administration's policy to cease funding NGOs that do not align with national interests.\n\nTo implement this policy, the heads of all agencies are instructed to thoroughly review current and future funding activities regarding NGOs. This review must ensure that such funding decisions are aligned with the Administration's expressed goals and priorities, and that they comply with authorizing statutes, regulations, and other informed judgments by agency heads.",
  "eli5": "The U.S. President told government leaders to double-check where they give money to certain groups to make sure these groups are not doing things that might hurt the country.",
  "keywords": [
    "United States",
    "Nongovernmental Organizations",
    "funding",
    "national interest",
    "security",
    "prosperity",
    "safety"
  ],
  "issues": [
    "Potential impact on international aid and NGO operations",
    "Criteria for determining if an NGO undermines national interest",
    "Implications for current U.S. foreign policy"
  ],
  "citations": [
    "Executive actions",
    "Authorizing statutes",
    "Regulations"
  ],
  "document_type": "Presidential Memorandum"
}