{
  "title": "Memo to Press: Hundreds of Billions of Dollars are Fraudulently Spent Every Year – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Memo to Press: Hundreds of Billions of Dollars are Fraudulently Spent Every Year",
  "og:description": "The New York Times erroneously wrote that there is no “proof” for “sweeping claims” of “fraud” in federal government spending. Apparently, the Times and",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/memo-to-press-hundreds-of-dollars-are-fraudulently-spent-every-year/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-12T20:05:31+00:00",
  "article:modified_time": "2025-02-12T20:50:57+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tMemo to Press Corps: Hundreds of Billions of Dollars Are Fraudulently Spent Every Year\t\t\t\t\n\nFebruary 12, 2025\n\nThe New York Times erroneously [wrote](https://www.nytimes.com/2025/02/11/us/politics/trump-musk-oval-office.html) that there is no “proof” for “sweeping claims” of “fraud” in federal government spending.Apparently, the Times and other like-minded outlets lack access to a newfangled research tool called Google.The [Government Accountability Office](https://www.gao.gov/products/gao-24-105833) released a report just last year finding “No area of the federal government is immune to fraud. We estimated that the federal government could lose between $233 billion and $521 billion annually to fraud.”President Donald J. Trump is determined to be a good steward of taxpayer dollars and put an end to fraudulent and wasteful spending.\n",
  "summary": "On February 12, 2025, a memo was issued to the press corps highlighting significant fraudulent expenditures within the federal government. In response to an article by the New York Times, which claimed the lack of proof for sweeping accusations of fraud, the memo referenced a report from the Government Accountability Office (GAO). The report indicated that no sector of the federal government is exempt from fraud, estimating potential annual losses between $233 billion and $521 billion.\n\nThe memo emphasized President Donald J. Trump's commitment to safeguarding taxpayer money by addressing fraudulent and inefficient spending. The government aims to use available tools and technologies to identify, quantify, and mitigate these instances of fraud to better manage federal expenditures.",
  "eli5": "A lot of money the government spends is getting lost because of cheating, and they want to fix it. They studied it and found out it's a big problem, and they want to make sure people's money is used properly.",
  "keywords": [
    "Fraudulent Spending",
    "Federal Government",
    "Taxpayer Dollars",
    "Government Accountability Office",
    "Donald Trump",
    "Budget Management"
  ],
  "issues": [
    "The memo challenges the accuracy of a New York Times article.",
    "Concerns about the scale of fraudulent spending and its impact on the budget."
  ],
  "citations": [
    "GAO Report: GAO-24-105833"
  ],
  "document_type": "Press Release"
}