{
  "title": "Memorandum for the Heads of Executive Departments and Agencies – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Memorandum for the Heads of Executive Departments and Agencies",
  "og:description": "SUBJECT:       Advancing United States Interests When Funding                Nongovernmental Organizations The United States",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/memorandum-for-the-heads-of-executive-departments-and-agencies/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-07T14:35:08+00:00",
  "article:modified_time": "2025-02-07T14:35:09+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tMEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES\t\t\t\t\n\nFebruary 7, 2025\n\nSUBJECT:       Advancing United States Interests When Funding\n\n                             Nongovernmental Organizations\n\nThe United States Government has provided significant taxpayer dollars to Nongovernmental Organizations (NGOs), many of which are engaged in actions that actively undermine the security, prosperity, and safety of the American people.  It is the policy of my Administration to stop funding NGOs that undermine the national interest.\n\nI therefore direct the heads of executive departments and agencies (agencies) to review all funding that agencies provide to NGOs.  The heads of agencies shall align future funding decisions with the interests of the United States and with the goals and priorities of my Administration, as expressed in executive actions; as otherwise determined in the judgment of the heads of agencies; and on the basis of applicable authorizing statutes, regulations, and terms.\n",
  "summary": "On February 7, 2025, a memorandum was issued from the White House to the heads of executive departments and agencies. The directive emphasized the United States Government's policy to stop funding nongovernmental organizations (NGOs) that act against the national interest. The memorandum highlighted concerns about taxpayer dollars funding actions by NGOs that could compromise the security, prosperity, and safety of the American people. \n\nThe heads of these executive departments and agencies were instructed to review all current funding to NGOs. Future funding decisions should be aligned with U.S. interests as well as the administration's goals and priorities. This alignment should be determined through executive actions and based on the judgment of the heads of agencies in conjunction with applicable statutes, regulations, and terms.",
  "eli5": "The president wants to stop giving money to groups that don't help America stay safe and strong. People in charge need to check who they're giving money to and only support groups that help America.",
  "keywords": [
    "Nongovernmental Organizations",
    "Funding",
    "United States Interests",
    "Executive Departments",
    "Memorandum",
    "National Security",
    "Prosperity",
    "Safety"
  ],
  "issues": [
    "Potential arbitrary assessment of what constitutes undermining U.S. interests",
    "Impact on NGOs that provide essential services but might be deemed against administrative policy",
    "Complete alignment of funding decisions with administration’s current priorities could affect longstanding US alliances and aid"
  ],
  "citations": [],
  "document_type": "Presidential Memorandum"
}