{
  "title": "Radical Transparency About Wasteful Spending – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Radical Transparency About Wasteful Spending",
  "og:description": "MEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES SUBJECT:       Radical Transparency About Wasteful",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/memorandum-for-the-heads-of-executive-departments-and-agencies-7c05/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-18T21:45:46+00:00",
  "article:modified_time": "2025-02-19T02:33:28+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tRadical Transparency About Wasteful Spending\t\t\t\t\n\nFebruary 18, 2025\n\nMEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES\n\nSUBJECT:       Radical Transparency About Wasteful Spending\n\nThe United States Government spends too much money on programs, contracts, and grants that do not promote the interests of the American people.  For too long, taxpayers have subsidized ideological projects overseas and domestic organizations engaged in actions that undermine the national interest.  The American people have seen their tax dollars used to fund the passion projects of unelected bureaucrats rather than to advance the national interest.  The American people have a right to see how the Federal Government has wasted their hard-earned wages.\n\nI therefore direct the heads of executive departments and agencies (agencies) to take all appropriate actions to make public, to the maximum extent permitted by law and as the heads of agencies deem appropriate to promote the policies of my Administration, the complete details of every terminated program, cancelled contract, terminated grant, or any other discontinued obligation of Federal funds.  Agencies shall ensure that such publication occurs in accordance with all applicable laws, regulations, and the terms and conditions of the underlying contract, grant, or other award.\n",
  "summary": "On February 18, 2025, a memorandum titled **Radical Transparency About Wasteful Spending** was issued to the heads of executive departments and agencies. The document emphasizes the need to eliminate federal spending on programs, contracts, and grants that do not serve the interests of the American people. It highlights concerns over taxpayer money being used for ideological projects and endeavors that do not align with national objectives.\n\nThe President has instructed agency leaders to act diligently in making public the complete details of any programs, contracts, grants, or other obligations of federal funds that have been terminated or discontinued. The goal is to provide transparency in federal spending, ensuring that the publication of such data complies with all applicable laws and regulations. This approach aims to clearly show taxpayers how their money is spent and to ensure that federal resources advance the country's interests.",
  "eli5": "The President told government workers to be open about when they stop spending money on things that don't help Americans. This is so everyone can see if taxpayer money was being wasted.",
  "keywords": [
    "wasteful spending",
    "transparency",
    "federal funds",
    "terminated programs",
    "contracts",
    "grants",
    "government accountability"
  ],
  "issues": [
    "Potential legal limitations on the publication of certain data",
    "The subjective determination of what constitutes the national interest",
    "Compliance with applicable laws and regulations in publishing data"
  ],
  "citations": [],
  "document_type": "Presidential Memorandum"
}