{
  "title": "Memorandum for the Secretary of State the Secretary of Defense the Secretary of Health and Human Services the Administrator of the United States for International Development – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Memorandum for the Secretary of State the Secretary of Defense the Secretary of Health and Human Services the Administrator of the United States for International Development – The White House",
  "og:description": "01/24/25 SUBJECT: The Mexico City Policy I hereby revoke the Presidential Memorandum of January 28, 2021, for the Secretary of State, the Secretary of",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/memorandum-for-the-secretary-of-state-the-secretary-of-defense-the-secretary-of-health-and-human-services-the-administrator-of-the-united-states-for-international-development/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-25T01:09:26+00:00",
  "article:modified_time": "2025-01-25T01:12:06+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tMEMORANDUM FOR THE SECRETARY OF STATETHE SECRETARY OF DEFENSETHE SECRETARY OF HEALTH AND HUMAN SERVICESTHE ADMINISTRATOR OF THE UNITED STATES AGENCY FORINTERNATIONAL DEVELOPMENT\t\t\t\t\n\nJanuary 24, 2025\n\n01/24/25\n\nSUBJECT: The Mexico City Policy\n\nI hereby revoke the Presidential Memorandum of January 28, 2021, for the Secretary of State, the Secretary of Defense, the Secretary of Health and Human Services, and the Administrator of the United States Agency for International Development (Protecting Women’s Health at Home and Abroad), and reinstate the Presidential Memorandum of January 23, 2017, for the Secretary of State, the Secretary of Health and Human Services, and the Administrator of the United States Agency for International Development (The Mexico City Policy).\n\nI direct the Secretary of State, in coordination with the Secretary of Health and Human Services, to the extent allowable by law, to implement a plan to extend the requirements of the reinstated Memorandum to global health assistance furnished by all departments or agencies.\n\nI further direct the Secretary of State to take all necessary actions, to the extent permitted by law, to ensure that U.S. taxpayer dollars do not fund organizations or programs that support or participate in the management of a program of coercive abortion or involuntary sterilization.\n\nThis memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nThe Secretary of State is authorized and directed to publish this memorandum in the Federal Register.\n",
  "summary": "On January 24, 2025, a Presidential Memorandum was issued addressing the Mexico City Policy. This memorandum revokes an earlier directive from January 28, 2021, and reinstates a previous policy from January 23, 2017. The main goal of this action is to ensure that U.S. government funding does not support organizations involved in coercive abortion or involuntary sterilization. \n\nThe Secretary of State, along with the Secretary of Health and Human Services, is instructed to create and implement a plan to apply the guidelines of this reinstated policy across all global health assistance provided by U.S. departments and agencies. The memorandum emphasizes that this directive does not create any legal rights enforceable against the U.S. government. Finally, it authorizes the Secretary of State to publish the memorandum in the Federal Register, ensuring its provisions are widely disseminated and understood.",
  "eli5": "The President has decided to use rules from a few years ago to make sure U.S. money doesn't help groups that are involved in forced abortions or sterilizing people without them wanting it.",
  "keywords": [
    "Mexico City Policy",
    "Presidential Memorandum",
    "U.S. funding",
    "global health assistance",
    "January 24, 2025",
    "coercive abortion",
    "involuntary sterilization"
  ],
  "issues": [
    "Potential impact on U.S. global health assistance",
    "Clarification on how the plan will be implemented",
    "Enforcement mechanisms given the policy's limits"
  ],
  "citations": [
    "January 28, 2021 Presidential Memorandum",
    "January 23, 2017 Presidential Memorandum"
  ],
  "document_type": "Presidential Memorandum"
}