{
  "title": "Memorandum for the Heads of Executive Departments and Agencies – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Memorandum for the Heads of Executive Departments and Agencies",
  "og:description": "SUBJECT:       Radical Transparency About Wasteful Spending The United States Government spends too much money on programs,",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/memorandum-for-the-heads-of-executive-departments-and-agencies-7c05/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-18T21:45:46+00:00",
  "article:modified_time": "2025-02-18T21:45:47+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tMEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES\t\t\t\t\n\nFebruary 18, 2025\n\nSUBJECT:       Radical Transparency About Wasteful Spending\n\nThe United States Government spends too much money on programs, contracts, and grants that do not promote the interests of the American people.  For too long, taxpayers have subsidized ideological projects overseas and domestic organizations engaged in actions that undermine the national interest.  The American people have seen their tax dollars used to fund the passion projects of unelected bureaucrats rather than to advance the national interest.  The American people have a right to see how the Federal Government has wasted their hard-earned wages.\n\nI therefore direct the heads of executive departments and agencies (agencies) to take all appropriate actions to make public, to the maximum extent permitted by law and as the heads of agencies deem appropriate to promote the policies of my Administration, the complete details of every terminated program, cancelled contract, terminated grant, or any other discontinued obligation of Federal funds.  Agencies shall ensure that such publication occurs in accordance with all applicable laws, regulations, and the terms and conditions of the underlying contract, grant, or other award.\n",
  "summary": "On February 18, 2025, a memorandum was issued to the heads of executive departments and agencies in the United States. The memorandum highlights the need for radical transparency regarding wasteful spending by the federal government. It argues that too much taxpayer money is spent on programs, contracts, and grants that do not serve the American public's interests and emphasizes that citizens deserve to know how their taxes are being utilized.\n\nThe memorandum directs government agencies to disclose comprehensive details about any terminated programs, cancelled contracts, or discontinued obligations of federal funds. This disclosure should be done to the fullest extent allowed by law, ensuring that it promotes the administration's policy while complying with relevant laws, regulations, and the specific terms of the affected agreements. The overarching goal is to ensure taxpayer money is used appropriately and in support of national interests.",
  "eli5": "The U.S. government wants to show everyone how it spends money, especially when it stops or cancels things that don't help people, so everyone can see where the money went.",
  "keywords": [
    "Wasteful Spending",
    "Transparency",
    "Federal Funds",
    "Terminated Programs",
    "Cancelled Contracts",
    "Government Accountability"
  ],
  "issues": [
    "Details on which specific programs, contracts, or grants will be affected by this directive.",
    "How 'radical transparency' will be implemented without breaching any existing confidentiality agreements.",
    "Potential resistance from agencies in fully executing this order."
  ],
  "citations": [],
  "document_type": "Presidential Memorandum"
}