{
  "title": "Monday Morning Wins: Call It the “Trump Effect” – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Monday Morning Wins: Call It the “Trump Effect”",
  "og:description": "There is no better way to start the week than by celebrating more big wins for Americans under the leadership of President Donald J. Trump. American",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/monday-morning-wins-call-it-the-trump-effect/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-03T15:17:50+00:00",
  "article:modified_time": "2025-03-03T15:21:48+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tMonday Morning Wins: Call It the “Trump Effect”\t\t\t\t\n\nMarch 3, 2025\n\nThere is no better way to start the week than by celebrating more big wins for Americans under the leadership of President Donald J. Trump.\n    - American manufacturing surges amid President Trump’s tariffs:  Automaker Honda is  expected  to produce its next-generation Civic hybrid model in Indiana, while Wisconsin-based Clarios, a leader in low-voltage energy storage,  announced  a $6 billion plan to expand its U.S.-based manufacturing.       - They’re only the latest major companies to announce such a move in alignment with President Trump’s Made in America agenda. Last week, Apple  announced  an historic $500 billion investment that will create 20,000 new U.S.-based jobs, while drug maker Eli Lilly  announced  a $27 billion investment in its U.S.-based manufacturing — bringing the total number of investments secured in President Trump’s second term to  nearly $2 billion . \n    - Border security drives results:  President Trump  announced  illegal border crossings in February — his first full month in office — were the lowest ever recorded,  down 94%  from last February and  down 96%  from the all-time high of the Biden Administration.       - This follows  news  that would-be illegal border crossers have “given up” and are returning to their own countries as ICE arrests of illegal immigrants have  surged  627%.        - Mexican cartel operatives  say  they are “genuinely” fearful “for the first time in years” amid the Trump Administration’s crackdown. \n    - A victory for small businesses:  The U.S. Department of the Treasury  suspended  enforcement of Biden-era Beneficial Ownership Information reporting requirements for U.S. citizens — a big win for small businesses faced with burdensome reporting requirements that increased costs and lowered productivity.\n",
  "summary": "The article details recent successes attributed to President Donald J. Trump's policies as of March 3, 2025. Under his leadership, American manufacturing is seeing a surge, with companies like Honda and Clarios announcing significant investments in U.S.-based production. This trend aligns with Trump's 'Made in America' agenda, which has also seen massive commitments from companies like Apple and Eli Lilly. The latter's $27 billion investment contributes to nearly $2 billion in total investments secured during President Trump's second term. \n\nBorder security measures have also been notably effective, with illegal border crossings dropping by 94% compared to the previous year and 96% from the highest levels seen under the Biden Administration. ICE arrests have increased significantly, and there's a reported level of fear among Mexican cartel operatives in light of these developments. Concurrently, the Treasury Department has halted enforcement of certain Biden-era reporting requirements which had imposed burdens on small businesses, marking another policy victory.",
  "eli5": "President Trump is making it easier for companies to build things in America and stopping more people from crossing the border illegally. This makes companies happy and makes America feel safer.",
  "keywords": [
    "Trump Administration",
    "American manufacturing",
    "Border security",
    "ICE arrests",
    "Made in America",
    "Small businesses"
  ],
  "issues": [
    "Lack of specific data sources for claims",
    "No mention of potential economic or social impacts",
    "Absence of context regarding the changes to border policy"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}