{
  "title": "More Support for Trump Administration’s Pursuit of Peace in Ukraine – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "More Support for Trump Administration’s Pursuit of Peace in Ukraine",
  "og:description": "Support continues to roll in for the unwavering commitment of President Donald J. Trump and Vice President Vance to the American people and the Trump",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/more-support-for-trump-administrations-pursuit-of-peace-in-ukraine/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-01T19:20:22+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tMore Support for Trump Administration’s Pursuit of Peace in Ukraine\t\t\t\t\n\nMarch 1, 2025\n\nSupport continues to roll in for the unwavering commitment of President Donald J. Trump and Vice President Vance to the American people and the Trump Administration’s relentless pursuit of peace.[**Speaker Mike Johnson**](https://x.com/SpeakerJohnson/status/1895587277792829938)**:** “Thanks to President Trump – the days of America being taken advantage of and disrespected are OVER. The death and destruction of the Russian-provoked war needs to stop immediately, and only our American President can put these two countries on a path to lasting peace. President Zelenskyy needed to acknowledge that, and accept the extraordinary mineral rights partnership proposal that President Trump put on the table. What we witnessed in the Oval Office today was an American President putting America first.”[**Secretary of State Marco Rubio**](https://x.com/townhallcom/status/1895664016774889614)**:** “The only person on the planet who is actively trying to bring an end to this conflict is named Donald Trump, the President of the United States.”[**National Security Advisor Mike Waltz**](https://x.com/RapidResponse47/status/1895852082219139573)**:** “It’s not clear that Zelenskyy truly wants to stop the fighting. He came in, even though he was warned not to, determined to litigate all of that … This was the wrong approach, wrong time in history, and definitely the wrong president to try to do this.”[**Director of National Intelligence Tulsi Gabbard**](https://x.com/TulsiGabbard/status/1895615743535776181)**:** “Thank you @realDonaldTrump for your unwavering leadership in standing up for the interests of the American people, and peace. What you said is absolutely true: Zelensky has been trying to drag the United States into a nuclear war with Russia/WW3 for years now, and no one has called him on it. Thank you, Vice President @JDVance for speaking out so forcefully and clearly, about the necessity of diplomacy.”[**UN Ambassador-designate Elise Stefanik**](https://x.com/RepStefanik/status/1895581865580667051)**:** “President Trump will ALWAYS stand up for the American people – especially in the Oval Office. Peace through strength is back on the world stage because of President Trump’s bold and strong leadership.”[**Sen. Eric Schmitt**](https://x.com/Eric_Schmitt/status/1895643334661849332): “Zelensky was probably used to talking this way to American leaders. Apparently, no one told him that things have changed. The age of America Last foreign policy is over. From this day forward, it’s going to be only America First.”[**Sen. Lindsey Graham**](https://x.com/RapidResponse47/status/1895562247570931834): “I have never been more proud of the president. I was very proud of JD Vance, standing up for our country.”[**CNN’s Scott Jennings**](https://x.com/RapidResponse47/status/1895858044216774806)**:** “All Zelenskyy had to do today was put on a tie, show up, smile, say thank you, sign the papers, and have lunch. That’s it — and he couldn’t do that.”[**Marc Thiessen**](https://x.com/marcthiessen/status/1895675484177879253)**:** “There was no ambush. Z was set up for success. All he had to do was not get into a public fight and sign the minerals deal.  Not hard. A lot of work went into making a successful moment possible and he blew it and then refused to apologize.”[**Deputy Chief of Staff Stephen Miller**](https://x.com/RapidResponse47/status/1895651604923367673)**:** “The way that President Trump defended Americans after YEARS of being fleeced and abused and taken advantage of and taken for granted — millions of American hearts swelled with overflowing pride today to watch President Trump put Zelenskyy in his place.”[**Press Secretary Karoline Leavitt**](https://x.com/RapidResponse47/status/1895655537343389872)**:** “[Zelenskyy] refuses to recognize the practical reality of this war. It has been going on for years, his countrymen are dying, and the people who have been funding this effort — the American people — are sick and tired of footing this bill.”[**Rep. Victoria Spartz**](https://x.com/RapidResponse47/status/1895657708290015583)**:** “It’s such a disservice to the Ukrainian people to play hero and politics and trying to increase his rating … Being so insulting to the American people after how much was done by us for Ukraine and for Europe, I can’t believe it.”[**Rep. Kevin Hern**](https://x.com/RapidResponse47/status/1895591764171661809)**:** “President Trump is determined to end the war in Ukraine. He is determined for the world to get back at peace, as it was when he was in office before.”\n",
  "summary": "On March 1, 2025, prominent American political figures and officials expressed strong support for President Donald J. Trump and Vice President Vance's efforts in pursuing peace in Ukraine. The comments follow a meeting in the Oval Office where President Zelenskyy of Ukraine was urged to accept a proposed mineral rights partnership as a step towards ending the ongoing Russian-provoked conflict. This event underscores the administration's belief that President Trump is the only leader capable of brokering peace and restoring American strength on the world stage.\n\nStatements from notable individuals such as Speaker Mike Johnson, Secretary of State Marco Rubio, and National Security Advisor Mike Waltz emphasize that the U.S. has ended policies perceived as weak or detrimental to American interests. Criticism was directed at President Zelenskyy for his supposed unwillingness to cooperate and sign the proposed agreement. Officials like UN Ambassador-designate Elise Stefanik and Press Secretary Karoline Leavitt lauded Trump's approach as prioritizing American interests and expressed frustration over the protracted war and its impact on American taxpayers.\n\nOverall, the narrative revolved around a perceived shift in U.S. foreign policy under President Trump that focuses on 'America First' principles. It showcased a clear message from the Trump administration: ending the Ukraine war through strong leadership and strategic partnerships while emphasizing the importance of diplomacy and peace.",
  "eli5": "Big people in charge of America like President Trump and his team are trying to stop fighting in a place called Ukraine. They want everyone to be friends, but the leader of Ukraine doesn't seem to want to agree to their plan right now.",
  "keywords": [
    "Trump Administration",
    "Ukraine",
    "Peace",
    "Mineral rights",
    "American foreign policy",
    "Zelenskyy",
    "Diplomacy",
    "America First"
  ],
  "issues": [
    "Biased portrayal of Zelenskyy's willingness to cooperate",
    "Lack of details on the proposed mineral rights partnership",
    "Ambiguity around the specific diplomatic actions being taken"
  ],
  "citations": [],
  "document_type": "Press Release"
}