{
  "title": "National Security Presidential Memorandum/NSPM-2 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "National Security Presidential Memorandum/NSPM-2",
  "og:description": "MEMORANDUM FOR THE SECRETARY OF STATE              THE SECRETARY OF THE TREASURY              THE SECRETARY OF DEFENSE              THE ATTORNEY",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/national-security-presidential-memorandum-nspm-2/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-05T02:09:53+00:00",
  "article:modified_time": "2025-02-05T02:09:54+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tNATIONAL SECURITY PRESIDENTIAL MEMORANDUM/NSPM-2\t\t\t\t\n\nFebruary 4, 2025\n\nMEMORANDUM FOR THE SECRETARY OF STATE              THE SECRETARY OF THE TREASURY              THE SECRETARY OF DEFENSE              THE ATTORNEY GENERAL              THE SECRETARY OF ENERGY              THE SECRETARY OF THE INTERIOR              THE SECRETARY OF HOMELAND SECURITY              THE ASSISTANT TO THE PRESIDENT AND CHIEF OF STAFF              THE UNITED STATES TRADE REPRESENTATIVE              THE UNITED STATES PERMANENT REPRESENTATIVE TO THE                 UNITED NATIONS              THE DIRECTOR OF NATIONAL INTELLIGENCE              THE DIRECTOR OF THE CENTRAL INTELLIGENCE                 AGENCY              THE DIRECTOR OF THE OFFICE OF MANAGEMENT AND                 BUDGET              THE ASSISTANT TO THE PRESIDENT FOR NATIONAL                 SECURITY AFFAIRS              THE COUNSEL TO THE PRESIDENT              THE ASSISTANT TO THE PRESIDENT FOR ECONOMIC                 POLICY              THE CHAIRMAN OF THE JOINT CHIEFS OF STAFF              THE DIRECTOR OF THE FEDERAL BUREAU OF                 INVESTIGATIONSUBJECT: Imposing Maximum Pressure on the Government of       the Islamic Republic of Iran, Denying Iran All       Paths to a Nuclear Weapon, and Countering Iran’s       Malign InfluenceAs President, my highest priority is to ensure the safety and security of the United States and the American people.  Since its inception in 1979 as a revolutionary theocracy, the Government of the Islamic Republic of Iran has declared its hostility to the United States and its allies and partners.  Iran remains the world’s leading state sponsor of terror and has aided Hezbollah, Hamas, the Houthis, the Taliban, al-Qa’ida, and other terrorist networks.  The Islamic Revolutionary Guard Corps (IRGC) is itself a designated Foreign Terrorist Organization.The Iranian Government, including the IRGC, is using agents and cyber-enabled means to target United States nationals living in the United States and other countries around the world for attacks, including assault, kidnapping, and murder.  Iran has also directed its proxy groups, including Hezbollah’s Islamic Jihad Organization, to embed sleeper cells in the Homeland to be activated in support of this terrorist activity.   Iran bears responsibility for the horrific Hamas massacres committed on October 7, 2023, and bears responsibility for continued Houthi attacks against the United States Navy, allied navies, and international commercial shipping in the Red Sea.  Since April 2024, the regime has twice demonstrated its willingness to launch ballistic and cruise missile attacks against the State of Israel. Iran commits grievous human rights abuses and arbitrarily detains foreigners, including United States citizens, on spurious charges without due process of law, subjecting them to abuse.  The United States stands with the women of Iran who face daily abuse by the regime. Iran’s nuclear program, including its enrichment- and reprocessing-related capabilities and nuclear-capable missiles, poses an existential danger to the United States and the entire civilized world.  A radical regime like this can never be allowed to acquire or develop nuclear weapons, or to extort the United States or its allies through the threat of nuclear weapons acquisition, development, or use.  Iran today stands in breach of its Nuclear Non-Proliferation Treaty obligations by concealing undeclared nuclear sites and material as required by its Comprehensive Safeguards Agreement with the International Atomic Energy Agency (IAEA).  Iran has obstructed IAEA access to its military sites or sites tied to the Organization of Defensive Innovation and Research, also known as SPND, and to interview nuclear weapons scientists still employed by SPND.  Public reports indicating that Iran may now be engaged in computer modeling related to nuclear weapons development raise immediate alarm.  We must deny Iran all paths to a nuclear weapon and end the regime’s nuclear extortion racket. Iran’s behavior threatens the national interest of the United States.  It is therefore in the national interest to impose maximum pressure on the Iranian regime to end its nuclear threat, curtail its ballistic missile program, and stop its support for terrorist groups. Section 1.  Policy.  It is the policy of the United States that Iran be denied a nuclear weapon and intercontinental ballistic missiles; that Iran’s network and campaign of regional aggression be neutralized; that the IRGC and its surrogates be disrupted, degraded, or denied access to the resources that sustain their destabilizing activities; and to counter Iran’s aggressive development of missiles and other asymmetric and conventional weapons capabilities. Sec. 2.  Enacting Maximum Pressure on the Islamic Republic of Iran*.***(a)  The Secretary of the Treasury shall:              (i)    immediately impose sanctions or appropriate enforcement remedies on all persons for which the Department has evidence of activity in violation of one or more Iran-related sanctions;              (ii)   implement a robust and continual sanctions enforcement campaign with respect to Iran that denies the regime and its terror proxies access to revenue;              (iii)  review for modification or rescission any general license, frequently asked question, or other guidance that provides Iran or any of its terror proxies any degree of economic or financial relief;\n\n              (iv)   issue updated guidance to all relevant business sectors including shipping, insurance, and port operators, about the risks to any person that knowingly violates United States sanctions with respect to Iran or an Iranian terror proxy; and              (v)    maintain countermeasures against Iran at the Financial Action Task Force, evaluate beneficial ownership thresholds to ensure sanctions deny Iran all possible illicit revenue, and evaluate whether financial institutions should adopt a “Know Your Customer’s Customer” standard for Iran-related transactions to further prevent sanctions evasion. \n\n(b)  The Secretary of State shall:              (i)    modify or rescind sanctions waivers, particularly those that provide Iran any degree of economic or financial relief, including those related to Iran’s Chabahar port project;              (ii)   implement a robust and continual campaign, in coordination with the Secretary of the Treasury and other relevant executive departments or agencies (agencies), to drive Iran’s export of oil to zero, including exports of Iranian crude to the People’s Republic of China;              (iii)  lead a diplomatic campaign to isolate Iran throughout the world, including within international organizations, including the denial of freedom of movement or safe haven to the IRGC or any terror proxy of Iran wherever such may operate outside Iran’s borders; and              (iv)   take immediate steps, in coordination with the Secretary of the Treasury and other relevant agencies, to ensure that the Iraqi financial system is not utilized by Iran for sanctions evasion or circumvention, and that Gulf countries are not used as sanctions evasion transshipment points. (c)  The United States Permanent Representative to the United Nations shall:              (i)    work with key allies to complete the snapback of international sanctions and restrictions on Iran;              (ii)   hold Iran accountable for its breach of the Nuclear Non-Proliferation Treaty; and              (iii)  regularly convene the United Nations Security Council to highlight the myriad threats posed by Iran to international peace and security. (d)  The Secretary of Commerce shall conduct a robust and continuous export control enforcement campaign to restrict the flow of technology and components used by the regime for military purposes.   \n\n(e)  The Attorney General shall:              (i)    pursue all available legal steps to investigate, disrupt, and prosecute financial and logistical networks, operatives, or front groups inside the United States that are sponsored by Iran or an Iranian terror proxy;              (ii)   pursue all available legal steps to impound illicit Iranian oil cargoes;              (iii)  pursue all available legal steps to identify Iranian governmental assets in the United States and overseas, and help American victims of terrorism, including Gold Star Families, collect on Federal judgments against Iran;              (iv)   pursue all available legal steps to indict and prosecute the leaders and members of Iranian-funded terrorist groups and proxies that have captured, harmed, or killed American citizens and, where possible and in coordination with the Secretary of State, seek their arrest and extradition to the United States; and                 (v)    use all criminal, regulatory, and cyber authorities and tools to vigorously investigate, prosecute, and disrupt efforts by the Iranian government to conduct espionage or obtain military, intelligence, government, or other sensitive information, compromise the Homeland and our critical infrastructure, evade sanctions and export controls, obtain material support for terrorism, exert foreign malign influence, and threaten harm and infringe on First Amendment-protected speech, including efforts designed to sow anti-Semitism.Sec. 3.  General Provisions.  (a)  Nothing in this memorandum shall be construed to impair or otherwise affect:              (i)   the authority granted by law to an executive department or agency, or the head thereof; or              (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.        (b)  This memorandum shall be implemented consistent with applicable law and subject to the availability of appropriations.        (c)  This memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "On February 4, 2025, a Presidential Memorandum was issued to several key national security and economic officials, detailing the United States' strategy to impose maximum pressure on Iran. The memorandum underscores Iran's activities as the world's leading state sponsor of terrorism and accuses it of supporting various terrorist groups and committing human rights abuses. The memorandum reflects the administration's policy to prevent Iran from acquiring a nuclear weapon and to curtail its ballistic missile program, emphasizing the need to neutralize Iran's influence and aggression in the region.\n\nThe memorandum outlines directives for several departments and government agencies. The Secretary of the Treasury is tasked with imposing sanctions and denying Iran and its proxies revenue. The Secretary of State is instructed to lead efforts to diplomatically isolate Iran and drive down its oil exports. Other roles include the UN Representative pushing for international sanctions, the Secretary of Commerce enforcing export controls, and the Attorney General taking legal action against Iranian networks. This comprehensive approach aims to disrupt Iran's malign activities and curb its nuclear ambitions.\n\nOverall, the memorandum serves as a detailed policy directive to various branches of the U.S. government, advocating for stringent measures to counteract Iran's perceived threats by applying a multi-faceted strategy involving diplomatic, economic, and legal tools.",
  "eli5": "The President wants to make sure Iran doesn't do any dangerous things, like get a nuclear bomb, by using lots of rules and working with other countries to stop them.",
  "issues": [
    "Potential for increased geopolitical tension with Iran and its allies.",
    "Impact on international relations, particularly with countries still engaged economically with Iran.",
    "Concerns about the effectiveness and humanitarian impact of sanctions.",
    "Possibility of escalation affecting global oil markets and trade routes."
  ],
  "citations": [],
  "keywords": [
    "Iran",
    "Nuclear weapons",
    "Sanctions",
    "Terrorism",
    "National security",
    "Commerce",
    "Diplomacy",
    "International relations"
  ],
  "document_type": "Presidential Memorandum"
}