{
  "title": "National Black History Month, 2025 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "National Black History Month, 2025 – The White House",
  "og:description": "BY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION  Today, I am very honored to recognize February 2025 as National Black History Month.    ",
  "og:url": "https://www.whitehouse.gov/uncategorized/2025/01/national-black-history-month-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-31T23:43:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Uncategorized](https://www.whitehouse.gov/uncategorized/)\n\n# \t\t\t\t\tNational Black History Month, 2025\t\t\t\t\n\nJanuary 31, 2025\n\nBY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION\n\n Today, I am very honored to recognize February 2025 as National Black History Month.     Every year, National Black History Month is an occasion to celebrate the contributions of so many black American patriots who have indelibly shaped our Nation’s history.     Throughout our history, black Americans have been among our country’s most consequential leaders, shaping the cultural and political destiny of our Nation in profound ways.  American heroes such as Frederick Douglass, Harriet Tubman, Thomas Sowell, Justice Clarence Thomas, and countless others represent what is best in America and her citizens.  Their achievements, which have monumentally advanced the tradition of equality under the law in our great country, continue to serve as an inspiration for all Americans.  We will also never forget the achievements of American greats like Tiger Woods, who have pushed the boundaries of excellence in their respective fields, paving the way for others to follow.      This National Black History Month, as America prepares to enter a historic Golden Age, I want to extend my tremendous gratitude to black Americans for all they have done to bring us to this moment, and for the many future contributions they will make as we advance into a future of limitless possibility under my Administration.     NOW, THEREFORE, I, DONALD J. TRUMP, President of the United States of America, by virtue of the authority vested in me by the Constitution and the laws of the United States, do hereby proclaim February 2025 as National Black History Month.  I call upon public officials, educators, librarians, and all the people of the United States to observe this month with appropriate programs, ceremonies, and activities.     IN WITNESS WHEREOF, I have hereunto set my hand thisthirty-first day of January, in the year of our Lord two thousand twenty-five, and of the Independence of the United States of America the two hundred and forty-ninth.\n",
  "summary": "## Summary\n\nThe President of the United States of America, Donald J. Trump, has issued a proclamation recognizing February 2025 as National Black History Month. This annual observance is dedicated to celebrating and honoring the substantial contributions made by black American leaders throughout the country's history. The proclamation highlights numerous historical and contemporary figures such as Frederick Douglass, Harriet Tubman, and Tiger Woods, acknowledging their roles in shaping the cultural and political landscape of the United States.\n\nPresident Trump emphasizes the importance of the achievements of black Americans in advancing equality and freedom within the nation, as well as their continued influence on the country's future progress. He calls upon public officials, educators, and citizens to observe the month with relevant programs, ceremonies, and activities, underscoring the lasting gratitude America holds for the contributions of black Americans.",
  "eli5": "## ELI5\n\nThe President said that February is a special month to remember what important things black people have done for the country. He asked everyone to celebrate this by having special events at schools, libraries, and other places.",
  "keywords": [
    "National Black History Month",
    "Donald J. Trump",
    "American history",
    "cultural contributions",
    "equality"
  ],
  "issues": [
    "The document does not mention specific programs or activities for observing Black History Month.",
    "The focus on specific individuals may overlook broader contributions from less prominent figures."
  ],
  "citations": [],
  "document_type": "Proclamation"
}