{
  "title": "National Energy Dominance Council Paves Way for Unleashing American Energy – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "National Energy Dominance Council Paves Way for Unleashing American Energy",
  "og:description": "Last week, President Donald J. Trump established the National Energy Dominance Council — a cornerstone in the Trump Administration’s pursuit of unleashing",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/national-energy-dominance-council-paves-way-for-unleashing-american-energy/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-20T01:57:20+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tNational Energy Dominance Council Paves Way for Unleashing American Energy\t\t\t\t\n\nFebruary 19, 2025\n\nLast week, President Donald J. Trump [established](https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-establishes-the-national-energy-dominance-council/) the National Energy Dominance Council — a cornerstone in the Trump Administration’s pursuit of unleashing American energy. Led by Secretary of the Interior Doug Burgum and Secretary of Energy Chris Wright, the Council will play a key role in the Trump Administration’s work to lower energy prices, meet the rising demand for affordable energy, strengthen economic security, and ensure the American energy industry is best positioned as a global leader over the next century.\n\n**The move was hailed by lawmakers, workers, and industry:**\n\n[**House Committee on Energy and Commerce Chair Brett Guthrie (R-KY)**](https://energycommerce.house.gov/posts/chairman-guthrie-commends-the-creation-of-the-national-energy-dominance-council)**:** “Energy security is national security. By utilizing our domestic energy resources to create baseload power, we can lower prices, secure our grid, and provide the energy needed to grow manufacturing, heat our homes, and fill our gas tanks. The creation of this council under the leadership of Secretary Wright and Secretary Burgum is a strong step toward securing our energy future, and ensuring we have the resources necessary to meet the demands that AI will place on our grid. President Trump is continuing to fulfill his promise to the American people to return our nation to energy dominance, and I look forward to working together to achieve that goal.”\n\n[**American Exploration and Production Council**](https://axpc.org/2025/02/14/axpc-statement-on-creation-of-national-energy-dominance-council/)**:** “Our nation is stronger, more secure, and more prosperous when America is the world leader in energy production, and AXPC applauds the Trump administration’s recognition that a whole of government approach is necessary to address the challenges related to American energy dominance. Sound energy policy across agencies will support our ability to meet rising national and global demand for affordable, reliable energy. We will continue to work with Congress and the Trump administration and the new National Energy Dominance Council on sensible, durable policies that allow American energy companies to continue to innovate and produce the energy America needs.”\n\n[**North America’s Building Trades Unions**](https://www.nabtu.org/press_releases/nabtu-statement-on-national-energy-dominance-council/)**:** “North America’s Building Trades Unions look forward to engaging with the National Energy Dominance Council recently established by the White House. This effort, chaired by Secretary of the Interior Doug Burgum and vice-chaired by Secretary of Energy Chris Wright, comes at a critical moment for our nation. As our country’s energy demands continue to rise and we work to meet the needs of artificial intelligence, confront rising adversarial powers, and provide our citizenry with stable and affordable energy, we at NABTU are ready to meet the moment. The men and women of the Building Trades have built the existing energy infrastructure of this nation and are eager to partner with this Council to provide the highly skilled workforce necessary to advance America’s all-of-the-above energy strategy and bring about the next generation of expanded, domestic and affordable power supply.”\n\n[**National Rural Electric Cooperative Association CEO Jim Matheson**](https://www.electric.coop/americas-electric-cooperatives-applaud-formation-of-the-national-energy-dominance-council)**:**“We are thrilled that President Trump has established the National Energy Dominance Council to tackle some of the biggest energy policy challenges facing our nation. Electricity demand is skyrocketing, yet due to bad policy decisions, always-available baseload power is being forced to retire before it can be reliably replaced. As a result, much of the country faces an increased risk of energy shortfalls over the next decade. Under the leadership of Chairman Doug Burgum and Vice Chairman Chris Wright, the Council is perfectly positioned to address the growing threats to reliable and affordable power. We believe the Executive Order’s focus on improving key processes, including those for permitting, producing and distributing American energy, is exactly the right place to start.”\n\n**United Association of Union Plumbers and Pipefitters General President Mark McManus:**“The men and women of the United Association are the best trained and most highly skilled craftspeople in the energy industry, and for generations we have built the critical infrastructure that delivers affordable domestic energy to our homes and businesses across the nation. We are now poised to deliver the next generation of energy production at this critical point in our nation’s history, but all too often government red tape and environmental activist groups stand in the way of these good paying and family-sustaining jobs. We look forward to working with President Trump and the new National Energy Dominance Council to cut government red tape and modernize our permitting processes to boost domestic production of critical energy like oil, gas, hydrogen, carbon capture, and nuclear, and to reduce our dependence on foreign sources of energy.”\n\n[**Power The Future Executive Director Daniel Turner**](https://powerthefuture.com/president-trump-announces-the-national-energy-dominance-council/)**:**“The National Energy Dominance Council is a long-overdue course correction that prioritizes American energy workers, revitalizes domestic production, and ensures affordability for families. The NEDC has the opportunity to right the many wrongs of the Biden administration’s failures by working alongside the private sector to create policies that increase production, drive down costs, and protect the environment. By cutting through burdensome regulations and anti-energy mandates, the NEDC will unleash America’s full energy potential and pave the way for an era of prosperity, affordability, and innovation.”\n\n[**National Association of Manufacturers President Jay Timmons**](https://nam.org/manufacturers-national-energy-dominance-council-shows-president-trumps-commitment-to-american-energy-leadership-and-manufacturing-growth-33293/?stream=series-press-releases)**:**“President Trump is moving quickly to unleash America’s full energy potential by establishing the National Energy Dominance Council, setting America up to lead on energy and secure our energy independence. This action demonstrates President Trump and his administration’s commitment to ensuring manufacturers have the energy they need to drive economic growth. […] The National Energy Dominance Council, under the leadership of Interior Secretary Burgum and Energy Secretary Wright, will help power the future of manufacturing in America because when manufacturing wins, America wins.”\n\n[**Competitive Enterprise Institute Senior Fellow Marlo Lewis**](https://cei.org/news_releases/cei-applauds-launch-of-president-trumps-national-energy-dominance-council/)**:** “This is welcome news. Unlike the previous administration, which increased US reliance on oil imports from OPEC and critical minerals from China by rigging domestic markets against reliable energy from fossil fuels, President Trump seeks to emancipate all sources of reliable American energy to compete in domestic and overseas markets. The president also seeks to accelerate the permitting of new energy infrastructure, including the power plants needed to support hundreds of new data centers and US leadership in artificial intelligence. President Trump is correct that clearing away impediments to America’s global leadership in energy production and exports will lower energy prices, enhance US economic security, create millions of new well-paying jobs, and strengthen US competitiveness in advanced technologies such as AI.”\n\n[**Growth Energy**](https://x.com/GrowthEnergy/status/1891885351733547320)**:**“#ICYMI last week @POTUS established the National Energy Dominance Council, noting that #biofuels ‘reduce our dependency on foreign imports, and grow our economy’ – #ethanol producers are ready to deliver for American consumers and the president’s priorities!”\n\n[**Small Business and Entrepreneurship Council**](https://sbecouncil.org/2025/02/17/sbe-council-applauds-president-trumps-national-energy-dominance-council-eo/)**:** “The National Energy Dominance Council is greatly needed to promptly reduce onerous barriers and rules that work against an abundant energy supply. Rather than federal government agencies finding ways to expand their regulatory turf and stymie the energy sector, the Council is tasked with reducing outdated red tape and moving with speed on recommendations and action, which will facilitate the significant investment needed for big projects. A modern regulatory system and commitment to U.S. energy supremacy will generate quality jobs, economic vibrancy and growth, and innovations that will yield efficiencies and cleaner energy. As both energy consumers and as significant players in the U.S. energy sector, small businesses will greatly benefit. SBE Council thanks President Trump for prioritizing this critical sector and for his commitment to more affordable, reliable and abundant energy for America.”\n\n[**Americans for Prosperity**](https://americansforprosperity.org/policy-corner/president-trump-establishes-national-energy-dominance-council/)**:**“Coupled with earlier Executive Orders signed by President Trump, with this Order, the current administration is well on its way in laying the groundwork for a future where energy abundance can become a reality.  Americans for Prosperity applauds President Trump’s actions in this Executive Order and anticipates a bright future for energy production in this country.”\n",
  "summary": "President Donald J. Trump established the National Energy Dominance Council on February 19, 2025, as part of an initiative to reinforce American energy leadership. Led by Secretary of the Interior Doug Burgum and Secretary of Energy Chris Wright, this council aims to lower energy prices, align with growing demand, boost economic security, and position America as a global energy leader. This move has received support from various stakeholders, including lawmakers, industry groups, trade unions, and businesses, all of whom emphasize the council's potential to secure energy independence and enhance economic growth.\n\nThe council's creation reflects a concerted effort to dismantle regulatory hurdles and update permitting processes to encourage domestic energy production across various forms, including oil, gas, and renewables. Energy organizations, manufacturing leaders, and trade unions have expressed their optimism, highlighting the council's role in ensuring affordable supplies of energy, facilitating innovation, and creating jobs. The initiative also aims to address the challenges and demands of artificial intelligence, further backed by support from multiple organizations.\n\nWith a strong emphasis on developing a comprehensive strategy, the Council's impact is projected to reshape the national energy landscape. Lawmakers and industry leaders are hopeful that this initiative will bolster America's competitiveness, enhance its technological capabilities, and ultimately lead to a stronger, more prosperous energy sector.",
  "eli5": "President Trump started a new team called the National Energy Dominance Council to help make energy cheaper and better in America. Lots of people think it's a good idea because it might help us not have to rely on other countries for energy and create more jobs here.",
  "keywords": [
    "Trump Administration",
    "National Energy Dominance Council",
    "American energy leadership",
    "economic security",
    "energy independence",
    "regulatory reform",
    "domestic energy production",
    "artificial intelligence",
    "job creation"
  ],
  "issues": [
    "Impact on environmental regulations",
    "Balance between energy independence and sustainability",
    "Possible international repercussions",
    "Implementation challenges with state and local governments"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}