{
  "title": "New Poll Shows Massive Support for President Trump and His Agenda – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "New Poll Shows Massive Support for President Trump and His Agenda",
  "og:description": "A new poll by Harvard CAPS-Harris reveals the majority of the country backs President Donald J. Trump and his actions to bring much-needed reforms that",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/new-poll-shows-massive-support-for-president-trump-and-his-agenda/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-24T18:10:41+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tNew Poll Shows Massive Support for President Trump and His Agenda\t\t\t\t\n\nFebruary 24, 2025\n\nA [new poll by Harvard CAPS-Harris](https://harvardharrispoll.com/wp-content/uploads/2025/02/HHP_Feb2025_vFinal.pdf) reveals the majority of the country backs President Donald J. Trump and his actions to bring much-needed reforms that are making America great again.\n    - Americans  **overwhelmingly support**  President Trump’s agenda.       - 81% support deporting criminal illegal immigrants.       - 76% support a “full-scale effort to find and eliminate fraud and waste in government.”       - 76% support closing the border with additional security and policies.       - 69% support keeping men out of women’s sports.       - 68% support government declaring there are only two genders.       - 65% support ending race-based hiring in government.       - 63% support “freezing and re-evaluating all foreign aid expenditures and the department that handled them.”       - 61% support reciprocal tariffs.       - 60% support direct U.S. negotiations with Russia to end the war in Ukraine.       - 59% support cutting government spending already approved by Congress.        - 57% support ending the ban on new offshore drilling. \n    - Most Americans approve of President Trump’s job performance — including pluralities of men, women, independents, and Americans who live in urban, suburban, and rural areas — while almost  **six-in-ten**  say he’s doing a better job than President Biden.\n    - Almost half of Americans  **believe**  the U.S. economy is “strong” under President Trump — the highest number since 2021 — while a plurality say his policies will make them “financially better off.”\n    - Americans are significantly  **more optimistic**  about the direction of the country, with those who say we’re on the right track up 14 points over last month.\n    - Americans strongly  **support**  President Trump’s effort to root out waste, fraud, and abuse in government.        - 77% support a “full examination of all government expenditures.”\n      - 72% agree there should be a government agency “focused on efficiency.”\n      - 70% say government is “filled with waste, fraud, and inefficiency.”\n      - Two-thirds say Congress should join the “effort to reduce government expenditures.” \n    - Americans  **back**  President Trump’s action to protect American workers.       - 61% support reciprocal tariffs.       - 57% say tariffs are an “effective foreign and economic policy tool.”        - 54% say tariffs will help get “concessions from other countries.” \n    - President Trump, Vice President JD Vance, Secretary of Health and Human Services Robert F. Kennedy, Jr., Director of National Intelligence Tulsi Gabbard, and Attorney General Pam Bondi all enjoy net positive favorability.\n",
  "summary": "A recent poll conducted by Harvard CAPS-Harris indicates significant public support for President Donald J. Trump and his agenda. The survey, released in February 2025, highlights approval for various elements of Trump's policies, including the deportation of criminal illegal immigrants, enhancing border security, and a focus on reducing government fraud and inefficiency. The poll reflects a favorable view of Trump's handling of the U.S. economy, with nearly half of the respondents considering it strong, which is the highest rating since 2021. Moreover, the poll suggests a high level of optimism regarding the country's direction.\n\nThe data further illustrates public backing for Trump's efforts in reevaluating foreign aid, implementing reciprocal tariffs, and pursuing direct negotiations with Russia concerning the conflict in Ukraine. Additionally, significant segments of the population support actions to protect American workers through economic tools like tariffs. Key officials in the Trump administration, including Vice President JD Vance and Secretary of Health and Human Services Robert F. Kennedy, Jr., enjoy positive favorability ratings as well.\n\nA broad consensus among Americans encourages efforts to streamline government operations, with overwhelming support for examining government expenditures thoroughly. Public sentiment favors the establishment of a governmental body dedicated to efficiency and sees Congress as a vital ally in reducing unnecessary spending. The favorability towards these efforts is consistent across different demographics, with the majority believing Trump's performance surpasses that of his predecessor, President Biden.",
  "eli5": "Many people in the U.S. think President Trump is doing a good job in 2025, and they like the changes he wants to make, like making sure the government is not wasting money and keeping the country safe. They think the economy is getting better too!",
  "keywords": [
    "Trump administration",
    "public opinion",
    "government efficiency",
    "economic policy",
    "border security",
    "foreign aid",
    "tariffs",
    "U.S.-Russia negotiations",
    "gender policies"
  ],
  "issues": [
    "Potential bias in poll reporting",
    "Accuracy of public opinion representation",
    "Interpretation of economic conditions and job performance"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}