{
  "title": "Nominations Sent to the Senate – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Nominations Sent to the Senate",
  "og:description": "NOMINATIONS SENT TO THE SENATE:     Gary Andres, of Virginia, to be an Assistant Secretary of Health and Human",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/nominations-sent-to-the-senate/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-12T13:29:14+00:00",
  "article:modified_time": "2025-02-13T13:29:40+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tNominations Sent to the Senate\t\t\t\t\n\nFebruary 12, 2025\n\nNOMINATIONS SENT TO THE SENATE:     Gary Andres, of Virginia, to be an Assistant Secretary of Health and Human Services.     Daniel Aronowitz, of Virginia, to be an Assistant Secretary of Labor.     James Baehr, of Louisiana, to be General Counsel, Department of Veterans Affairs.     Kirsten Baesler, of North Dakota, to be Assistant Secretary for Elementary and Secondary Education.     Joseph Barloon, of Maryland, to be a Deputy United States Trade Representative (Geneva Office), with the rank of Ambassador.     Benjamin Black, of New York, to be Chief Executive Officer of the United States International Development Finance Corporation.     Kevin Cabrera, of Florida, to be Ambassador Extraordinary and Plenipotentiary of the United States of America to the Republic of Panama.     Sean Cairncross, of Minnesota, to be National Cyber Director.     Gustav Chiarello III, of Virginia, to be an Assistant Secretary of Health and Human Services.     Tyler Clarkson, of Virginia, to be General Counsel of the Department of Agriculture.     Jason De Sena Trennert, of New York, to be an Assistant Secretary of the Treasury.     Thomas DiNanno, of Florida, to be Under Secretary of State for Arms Control and International Security.     Sean Donahue, of Florida, to be an Assistant Administrator of the Environmental Protection Agency.     David Eisner, of New York, to be an Assistant Secretary of Energy.     David Fogel, of Connecticut, to be Assistant Secretary of Commerce and Director General of the United States and Foreign Commercial Service.     George Glass, of Oregon, to be Ambassador Extraordinary and Plenipotentiary of the United States of America to Japan.     Jonathan Gould, of Virginia, to be Comptroller of the Currency for a term of five years.     Catherine Hanson, of South Carolina, to be Chief Financial Officer, Environmental Protection Agency.     Landon Heid, of Missouri, to be an Assistant Secretary of Commerce.     Peter Hoekstra, of Michigan, to be Ambassador Extraordinary and Plenipotentiary of the United States of America to Canada.     Allison Hooker, of Georgia, to be an Under Secretary of State (Political Affairs).     Mike Huckabee, of Arkansas, to be Ambassador Extraordinary and Plenipotentiary of the United States of America to the State of Israel.     John Hurley, of California, to be Under Secretary for Terrorism and Financial Crimes.     Scott Hutchins, of Indiana, to be Under Secretary of Agriculture for Research, Education, and Economics.     Ronald Johnson, of Florida, to be Ambassador Extraordinary and Plenipotentiary of the United States of America to the United Mexican States.     Taylor Jordan, of the District of Columbia, to be an Assistant Secretary of Commerce.     Paul Kapur, of California, to be Assistant Secretary of State for South Asian Affairs.     David Keeling, of Kentucky, to be an Assistant Secretary of Labor.     Nicholas Kent, of Virginia, to be Under Secretary of Education.     Joseph Kent, of Washington, to be Director of the National Counterterrorism Center, Office of the Director of National Intelligence.     Jessica Kramer, of Wisconsin, to be an Assistant Administrator of the Environmental Protection Agency.     Charles Kushner, of New York, to be Ambassador Extraordinary and Plenipotentiary of the United States of America to the French Republic, and to serve concurrently and without additional compensation as Ambassador Extraordinary and Plenipotentiary of the United States of America to the Principality of Monaco.     Henry Mack III, of Florida, to be an Assistant Secretary of Labor.     Ned Mamula, of Pennsylvania, to be Director of the United States Geological Survey.     Jennifer Mascott, of Maryland, to be General Counsel, Department of Education.     Jonathan McKernan, of Tennessee, to be Director, Bureau of Consumer Financial Protection for a term of five years.     Jonathan Morrison, of California, to be Administrator of the National Highway Traffic Safety Administration.     Brian Morrissey, Jr., of Virginia, to be General Counsel for the Department of the Treasury.     Brian Nesvik, of Wyoming, to be Director of the United States Fish and Wildlife Service.     Kevin O’Farrell, of Florida, to be Assistant Secretary for Career, Technical, and Adult Education, Department of Education.     Caleb Orr, of Texas, to be an Assistant Secretary of State (Economic and Business Affairs).     Wayne Palmer, of Virginia, to be Assistant Secretary of Labor for Mine Safety and Health.     Luke Pettit, of the District of Columbia, to be an Assistant Secretary of the Treasury.     Tina Pierce, of Idaho, to be Chief Financial Officer, Department of Energy.     Chris Pratt, of Utah, to be an Assistant Secretary of State (Political-Military Affairs).     Brian Quintenz, of Ohio, to be Chairman of the Commodity Futures Trading Commission.     Brian Quintenz, of Ohio, to be a Commissioner of the Commodity Futures Trading Commission for a term expiring April 13, 2029.     David Rader, of Virginia, to be an Assistant Secretary of Commerce.     Joel Rayburn, of Oklahoma, to be an Assistant Secretary of State (Near Eastern Affairs).     Kimberly Richey, of Texas, to be Assistant Secretary for Civil Rights, Department of Education.     Mary Riley, of the District of Columbia, to be Assistant Secretary for Legislation and Congressional Affairs, Department of Education.     Audrey Robertson, of Colorado, to be an Assistant Secretary of Energy (Energy Efficiency and Renewable Energy).     Sarah Rogers, of New York, to be Under Secretary of State for Public Diplomacy.     Reed Rubinstein, of Maryland, to be Legal Adviser of the Department of State.     Kathleen Sgamma, of Colorado, to be Director of the Bureau of Land Management.     Warren Stephens, of Arkansas, to be Ambassador Extraordinary and Plenipotentiary of the United States of America to the United Kingdom of Great Britain and Northern Ireland.     Michael Stuart, of West Virginia, to be General Counsel of the Department of Health and Human Services.     Aaron Szabo, of Virginia, to be an Assistant Administrator of the Environmental Protection Agency.     Richard Topping, of Ohio, to be Chief Financial Officer, Department of Veterans Affairs.     Craig Trainor, of Virginia, to be an Assistant Secretary of Housing and Urban Development.     Olivia Trusty, of Maryland, to be a Member of the Federal Communications Commission for the remainder of the term expiring June 30, 2025.     Olivia Trusty, of Maryland, to be a Member of the Federal Communications Commission for a term of five years from July 1, 2025.  (Reappointment)     Matthew Whitaker, of Iowa, to be United States Permanent Representative on the Council of the North Atlantic Treaty Organization, with the rank and status of Ambassador Extraordinary and Plenipotentiary.WITHDRAWAL SENT TO THE SENATE:     Luke Petit, of Washington, to be an Assistant Secretary of the Treasury.\n",
  "summary": "On February 12, 2025, a series of nominations were sent to the Senate for various key positions in the U.S. government by the President. Notable nominations include Gary Andres and Gustav Chiarello III for the roles of Assistant Secretary of Health and Human Services, Daniel Aronowitz for Assistant Secretary of Labor, and James Baehr for General Counsel at the Department of Veterans Affairs. Additionally, the list features nominations for several ambassadorial positions, such as Kevin Cabrera to Panama and George Glass to Japan.\n\nThis comprehensive list aims to fill various critical governmental roles, spanning multiple departments such as Education, Energy, and Commerce, as well as international positions in trade and diplomacy. The nominations also include roles like the National Cyber Director, Chief Financial Officer of the EPA, and Under Secretary positions across several sectors. Alongside these nominations, the President has also sent a withdrawal for Luke Petit, who was initially nominated as Assistant Secretary of the Treasury.",
  "eli5": "The President suggested lots of people to the Senate to help run important jobs in the government, like looking after veterans and protecting the environment. Imagine your class picking helpers for different tasks, and the President is choosing the best ones for America.",
  "keywords": [
    "Nominations",
    "Senate",
    "Government positions",
    "Ambassadors",
    "Presidential Actions",
    "Health and Human Services",
    "Labor",
    "Education",
    "Trade",
    "International Relations",
    "Environmental Protection"
  ],
  "issues": [
    "Duplication of names, e.g., Brian Quintenz for two roles in the Commodity Futures Trading Commission.",
    "Withdrawal of a nominee, Luke Petit, which might require further clarification."
  ],
  "citations": [],
  "document_type": "Presidential Action"
}