{
  "title": "OMB Memo M-25-11 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "OMB Memo M-25-11 – The White House",
  "og:description": "January 21, 2025 M-25-11 MEMORANDUM TO THE HEADS OF DEPARTMENTS AND AGENCIES FROM: Matthew J. Vaeth, Acting Director, Office of Management and Budget ",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/omb-memo-m-25-11/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T14:28:00+00:00",
  "article:modified_time": "2025-01-22T14:51:24+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tMEMORANDUM TO THE HEADS OF DEPARTMENTS AND AGENCIES\t\t\t\t\n\nJanuary 21, 2025\n\nJanuary 21, 2025\n\nM-25-11\n\nMEMORANDUM TO THE HEADS OF DEPARTMENTS AND AGENCIES\n\nFROM: Matthew J. Vaeth, Acting Director, Office of Management and Budget  \n\nKevin Hassett, Assistant to the President for Economic Policy and Director of the National Economic Council\n\nSUBJECT: Guidance Regarding Section 7 of the Executive Order *Unleashing American Energy*\n\nThe directive in section 7 of the Executive Order entitled *Unleashing American Energy* requires agencies to immediately pause disbursement of funds appropriated under the Inflation Reduction Act of 2022 (Public Law 117-169) or the Infrastructure Investment and Jobs Act (Public Law 117-58).  This pause only applies to funds supporting programs, projects, or activities that may be implicated by the policy established in Section 2 of the order. This interpretation is consistent with section 7’s heading (“Terminating the Green New Deal”) and its reference to the “law and the policy outlined in section 2 of th[e] order.”\n\nFor the purposes of implementing section 7 of the Order, funds supporting the “Green New Deal” refer to any appropriations for objectives that contravene the policies established in section 2.  Agency heads may disburse funds as they deem necessary after consulting with the Office of Management and Budget.\n",
  "summary": "On January 21, 2025, a memorandum was issued to the heads of departments and agencies, authored by Matthew J. Vaeth, Acting Director of the Office of Management and Budget, and Kevin Hassett, Assistant to the President for Economic Policy and Director of the National Economic Council. The purpose of the memorandum is to provide guidance on implementing Section 7 of the Executive Order *Unleashing American Energy*. This section mandates an immediate pause on the disbursement of funds appropriated under the Inflation Reduction Act of 2022 and the Infrastructure Investment and Jobs Act, which are involved in programs that conflict with the policies described in Section 2 of the Order.\n\nThe memorandum clarifies that the pause in funds primarily affects projects associated with the \"Green New Deal,\" interpreting the order as consistent due to its heading \"Terminating the Green New Deal\". The agency heads are instructed to consult with the Office of Management and Budget before resuming the disbursement of funds, ensuring alignment with the policies set forth in the Executive Order. The guidance underscores a shift in energy policy as directed by the Executive Order.",
  "eli5": "The government decided to stop spending money on energy projects that don't fit their new plan and told people in charge of departments to check with them first before continuing any spending.",
  "keywords": [
    "Executive Order",
    "Unleashing American Energy",
    "Inflation Reduction Act",
    "Infrastructure Investment and Jobs Act",
    "Green New Deal",
    "fund disbursement",
    "Office of Management and Budget"
  ],
  "issues": [
    "Lack of clarity on what specific projects are considered part of the 'Green New Deal'",
    "Potential delay in critical infrastructure projects due to funding pauses",
    "Impact of the funding pause on environmental objectives"
  ],
  "citations": [
    "Inflation Reduction Act of 2022 (Public Law 117-169)",
    "Infrastructure Investment and Jobs Act (Public Law 117-58)",
    "Executive Order *Unleashing American Energy*"
  ],
  "document_type": "Presidential Memorandum"
}