{
  "title": "One Voice for America's Foreign Relations – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "One Voice for America's Foreign Relations",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:   ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/one-voice-for-americas-foreign-relations/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-12T22:01:34+00:00",
  "article:modified_time": "2025-02-13T15:40:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tOne Voice for America’s Foreign Relations\t\t\t\t\n\nFebruary 12, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section1.  Purpose*.*  Article II of the United States Constitution vests the power to conduct foreign policy in the President of the United States.  Presidents rely on their Secretaries of State and their subordinate officials to ensure that the United States is served and protected at home and abroad.  As the principal steward of the President’s foreign policy, the Secretary must maintain an exceptional workforce of patriots to implement this policy effectively.Sec. 2.  Policy. All officers or employees charged with implementing the foreign policy of the United States must under Article II do so under the direction and authority of the President. Failure to faithfully implement the President’s policy is grounds for professional discipline, including separation.  The personnel procedures of executive departments and agencies (agencies) charged with implementing the President’s foreign policy must therefore provide an effective and efficient means for ensuring that officers and employees faithfully implement the President’s policies.Sec. 3.  Definitions.  For the purposes of this order:(a)  the terms “Department,” “Foreign Service,” “Service,” and “Secretary” shall have the meaning given those terms by section 3902 of title 22, United States Code; and(b)  the term “members of the Foreign Service” shall have the same meaning as “members of the Service” under section 3903 of title 22, United States Code.(c)  the term “Civil Service employee” shall mean an employee of the Department holding United States citizenship, except for a member of the Foreign Service, as defined in section 2664a of title 22, United States Code.(d)  the term “other staff” shall mean locally employed staff and agents under the authority of sections 202(a)(4)(A) (22 U.S.C. 3922(a)(4)(A)) and 303 (22 U.S.C. 3943) of the Foreign Service Act of 1980, or special Government employees of the Department as defined in section 202(a) of title 18, United States Code.Sec. 4.  Election of Procedures.  When the Secretary concludes that a member of the Foreign Service, a Civil Service employee, or other staff has demonstrated performance or conduct that warrants a personnel action, the Secretary shall, with respect to officials appointed by the Secretary or others within the Department, take appropriate action, subject to the supervision of the President, and shall, with respect to officials appointed by the President, preliminarily determine whether to refer such a matter for the President’s consideration.  Such preliminary determination shall be made in the Secretary’s sole and exclusive discretion.Sec. 5.  Foreign Service Reform.  (a)  The Secretary shall, consistent with applicable law, reform the Foreign Service and the administration of foreign relations to ensure faithful and effective implementation of the President’s foreign policy agenda.(b)  The Secretary shall, consistent with applicable law, implement reforms in recruiting, performance, evaluation, and retention standards, and the programs of the Foreign Service Institute, to ensure a workforce that is committed to faithful implementation of the President’s foreign policy.(c)  In implementing the reforms identified in this section, the Secretary shall, consistent with applicable law, revise or replace the Foreign Affairs Manual and direct subordinate agencies to remove, amend, or replace any handbooks, procedures, or guidance.(d)  The Secretary shall have sole and exclusive discretion in the exercise or delegation of the responsibilities enumerated in this order, and, as the Secretary deems necessary or appropriate, may prescribe additional procedures that subordinate officials shall follow in the performance of such responsibilities.Sec. 6.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i) the authority granted by law to an executive department or agency, or the head thereof; or(ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    February 12, 2025.\n",
  "summary": "On February 12, 2025, a Presidential Order was issued outlining the responsibilities and authority vested in the President of the United States, particularly in the area of foreign relations. The order clarifies that all foreign policy must be implemented under the President's direction and supervision. It stresses the importance of a dedicated workforce to achieve these aims, largely overseen by the Secretary of State. This workforce includes members of the Foreign Service, Civil Service employees, and other relevant staff. \n\nThe order mandates that any failure to faithfully execute the President's foreign policy could result in professional disciplinary action. The Secretary of State is tasked with reforming the Foreign Service to ensure effective implementation of foreign policy. Reforms include changes in recruiting, performance evaluation, retention standards, and updates to training programs at the Foreign Service Institute.\n\nAdditionally, the order provides the Secretary with the discretion to make preliminary decisions regarding referrals to the President when dealing with appointed officials who may require personnel actions. The guidelines emphasize that these reforms and their execution should adhere to applicable laws and should not interfere with existing authorities or budgetary considerations.",
  "eli5": "The President made a rule saying that anything to do with America talking to other countries needs to be done the President's way. If people working for the government don't follow this, they might get in trouble. They also want to make sure that people working on these things are very good at their jobs!",
  "keywords": [
    "foreign policy",
    "President",
    "executive order",
    "Secretary of State",
    "Foreign Service",
    "disciplinary action",
    "personnel reform"
  ],
  "issues": [
    "Potential challenges in implementing reforms across various departments",
    "Difficulty in balancing professional discipline with existing employment protections",
    "Ensuring compliance with existing laws and regulations while implementing new policies"
  ],
  "citations": [
    "Article II of the United States Constitution",
    "22 U.S.C. section 3902",
    "22 U.S.C. section 3903",
    "22 U.S.C. section 2664a",
    "22 U.S.C. sections 3922(a)(4)(A) and 3943",
    "Foreign Service Act of 1980",
    "18 U.S.C. section 202(a)"
  ],
  "document_type": "Executive Order"
}