{
  "title": "Pausing Foreign Corrupt Practices Act Enforcement to Further American Economic and National Security – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Pausing Foreign Corrupt Practices Act Enforcement to Further American Economic and National Security",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1.  Purpose",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/pausing-foreign-corrupt-practices-act-enforcement-to-further-american-economic-and-national-security/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T04:07:39+00:00",
  "article:modified_time": "2025-02-11T04:07:40+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPausing Foreign Corrupt Practices Act Enforcement to Further American Economic and National Security\t\t\t\t\n\nFebruary 10, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1.  Purpose and Policy.  Since its enactment in 1977, the Foreign Corrupt Practices Act (15 U.S.C. 78dd-1 *et seq*.) (FCPA) has been systematically, and to a steadily increasing degree, stretched beyond proper bounds and abused in a manner that harms the interests of the United States.  Current FCPA enforcement impedes the United States’ foreign policy objectives and therefore implicates the President’s Article II authority over foreign affairs.     The President’s foreign policy authority is inextricably linked with the global economic competitiveness of American companies.  American national security depends in substantial part on the United States and its companies gaining strategic business advantages whether in critical minerals, deep-water ports, or other key infrastructure or assets.      But overexpansive and unpredictable FCPA enforcement against American citizens and businesses — by our own Government — for routine business practices in other nations not only wastes limited prosecutorial resources that could be dedicated to preserving American freedoms, but actively harms American economic competitiveness and, therefore, national security.      It is therefore the policy of my Administration to preserve the Presidential authority to conduct foreign affairs and advance American economic and national security by eliminating excessive barriers to American commerce abroad.      Sec. 2.  Policy of Enforcement Discretion.  (a)  For a period of 180 days following the date of this order, the Attorney General shall review guidelines and policies governing investigations and enforcement actions under the FCPA.  During the review period, the Attorney General shall:          (i)    cease initiation of any new FCPA investigations or enforcement actions, unless the Attorney General determines that an individual exception should be made;          (ii)   review in detail all existing FCPA investigations or enforcement actions and take appropriate action with respect to such matters to restore proper bounds on FCPA enforcement and preserve Presidential foreign policy prerogatives; and          (iii)  issue updated guidelines or policies, as appropriate, to adequately promote the President’s Article II authority to conduct foreign affairs and prioritize American interests, American economic competitiveness with respect to other nations, and the efficient use of Federal law enforcement resources.     (b)  The Attorney General may extend such review period for an additional 180 days as the Attorney General determines appropriate.     (c)  FCPA investigations and enforcement actions initiated or continued after the revised guidelines or policies are issued under subsection (a) of this section:          (i)   shall be governed by such guidelines or policies; and          (ii)  must be specifically authorized by the Attorney General.     (d)  After the revised guidelines or policies are issued under subsection (a) of this section, the Attorney General shall determine whether additional actions, including remedial measures with respect to inappropriate past FCPA investigations and enforcement actions, are warranted and shall take any such appropriate actions or, if Presidential action is required, recommend such actions to the President.     Sec. 3.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.     Sec. 4.  General Provisions*.*(a)  Nothing in this order shall be construed to impair or otherwise affect:           (i)   the authority granted by law to an executive department, agency, or the head thereof; or           (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.      (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.      (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.  THE WHITE HOUSE,    February 10, 2025.\n",
  "summary": "On February 10, 2025, the President issued an Executive Order to pause enforcement of the Foreign Corrupt Practices Act (FCPA) for 180 days. The President argues that current enforcement of the FCPA has been too broad, impeding U.S. foreign policy objectives by affecting America’s economic competitiveness and national security. During this pause, the Attorney General is tasked with reviewing existing FCPA guidelines and enforcement actions to ensure they align with the President's foreign policy prerogatives and the strategic economic interests of the United States.\n\nThe Attorney General must also decide whether to continue, adjust, or cease ongoing and future FCPA investigations, with a possibility of extending this review period by another 180 days if needed. Any new or continued investigations must receive approval from the Attorney General. The order emphasizes that if any part of this order is invalidated, the remaining provisions still stand, and it clarifies that the order does not create enforceable rights against the U.S. government.",
  "eli5": "The President is pausing a law called the Foreign Corrupt Practices Act for a while because he believes it’s being used too much and hurting American businesses. During this time, the Attorney General will check and maybe change how this law is used.",
  "keywords": [
    "FCPA",
    "Executive Order",
    "foreign policy",
    "economic competitiveness",
    "national security",
    "Attorney General",
    "review"
  ],
  "issues": [
    "Potential weakening of anti-corruption efforts",
    "Impact on international relations",
    "Legal challenges to the order's validity"
  ],
  "citations": [
    "Foreign Corrupt Practices Act",
    "15 U.S.C. 78dd-1"
  ],
  "document_type": "Executive Order"
}