{
  "title": "President Trump Announces Appointments to the White House Faith Office – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Appointments to the White House Faith Office",
  "og:description": "President Donald Trump announced appointments to the White House Faith Office.Pastor Paula White-Cain will return to the White House as a Special",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-appointments-to-the-white-house-faith-office/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-08T00:01:24+00:00",
  "article:modified_time": "2025-02-08T00:01:25+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident Trump Announces Appointments to the White House Faith Office\t\t\t\t\n\nFebruary 7, 2025\n\nPresident Donald Trump announced appointments to the White House Faith Office.**Pastor Paula White-Cain**will return to the White House as a Special Government Employee and Senior Advisor of the newly created White House Faith Office. In the last 40 years, White-Cain has expanded her influence globally in almost 200 countries, ministering, fighting for religious freedom and humanitarian rights, and advocating for the voiceless. She is the founder and president of Paula White Ministries and National Faith Advisory Board. She is president of City Destiny and the overseer and a teaching pastor at StoryLife Church in Florida. Paula previously served an advisor to President Trump in the White House Faith and Opportunity Initiative**.** She also served as chairwoman of the Evangelical Advisory Board (2016). Paula is a celebrated New York Times best-selling author, teacher, beloved wife, mother, grandmother, mentor, popular TV personality, and spirit-led preacher of God’s Word. She is married to legendary singer/songwriter Jonathan Cain of the iconic Rock &amp; Roll Hall of Fame band Journey.**Jennifer S. Korn** will return to the White House as a Deputy Assistant to the President and Faith Director of the newly created White House Faith Office after serving as Senior Advisor of National Faith Advisory Board, America’s largest faith coalition. Korn previously served President Trump all four years as Deputy Director of the White House Office of Public Liaison and during the 2016 Presidential Election leading Latino, Minority, Faith, Veteran and other coalition engagement for historic gains among these communities. Korn has served two decades working to elect officials and implement policies at the national and state levels to improve the lives of these important constituencies. Korn is also a proud military spouse.**Jackson Lane** will join the White House as Special Assistant to the President and Deputy Director of Faith Engagement after serving as the Deputy Director of Faith Outreach for the Trump-Vance 2024 Campaign.\n",
  "summary": "President Donald Trump announced new appointments to the White House Faith Office on February 7, 2025. Pastor Paula White-Cain has been reappointed to serve as a Special Government Employee and Senior Advisor. She is renowned for her global ministry outreach and her role as founder and president of Paula White Ministries and the National Faith Advisory Board. Previously, she held the position of advisor in the White House Faith and Opportunity Initiative under Trump's administration.\n\nJennifer S. Korn is appointed as Deputy Assistant to the President and Faith Director. Korn's prior experience includes serving as Senior Advisor of the National Faith Advisory Board and Deputy Director of the White House Office of Public Liaison during Trump's four-year term. Jackson Lane is named Special Assistant to the President and Deputy Director of Faith Engagement, following his role in the Trump-Vance 2024 Campaign. These appointments aim to consolidate the influence of faith in policymaking and community engagement.",
  "eli5": "President Trump picked some people to help him talk to religious groups and do good things for them. One of them is Pastor Paula who's been helping him before. Another helper is Jennifer, who's good at working with different communities, and Jackson, who helped during a recent election campaign.",
  "keywords": [
    "Donald Trump",
    "Paula White-Cain",
    "White House Faith Office",
    "Jennifer S. Korn",
    "Jackson Lane",
    "appointments",
    "faith engagement",
    "administration"
  ],
  "issues": [
    "Lack of details on the specific goals or initiatives of the White House Faith Office",
    "Potential concerns about church-state separation"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}