{
  "title": "Press Gaggle by President Trump at Future Investment Initiative Institute Priority Summit – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Press Gaggle by President Trump at Future Investment Initiative Institute Priority Summit",
  "og:description": "Faena Hotel & Forum Miami Beach, Florida (February 19, 2025) 5:35 P.M. EST      THE PRESIDENT:  Thank you very much. ",
  "og:url": "https://www.whitehouse.gov/remarks/2025/02/press-gaggle-by-president-trump-at-future-investment-initiative-institute-priority-summit/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-19T23:10:48+00:00",
  "article:modified_time": "2025-02-20T23:12:08+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMPAT FUTURE INVESTMENT INITIATIVE INSTITUTE PRIORITY SUMMIT \t\t\t\t\n\nFebruary 19, 2025\n\nFaena Hotel &amp; Forum\n\nMiami Beach, Florida\n\n(February 19, 2025)\n\n5:35 P.M. EST\n\n     THE PRESIDENT:  Thank you very much.  (Applause.)  What a great group this is.  You have to see outside.  It’s going wild outside with a lot of love for all of us, I guess.  (Laughter.)\n\nBut thank you, Richard, for the introduction.  And thank you to all for such a warm welcome. \n\nIt’s great to be back in beautiful Miami, where I’ve actually built a lot of great buildings with the Dezer family and some others.  We’ve had tremendous success in Miami.  We have Trump Towers in Sunny Isles Beach.  It’s four beautiful buildings right on the ocean. \n\nThe Trump Grande — put the little E on the end for a little — class it up a little bit.  (Laughter.)  Trump Grande. \n\nAnd the 700-acre Doral.  That’s a tremendous country club in the — it’s actually the most successful country club in the U.S., where I was just given approval to build 1,500 units.\n\nAnd I couldn’t care less about building units.  When you’re president, who the hell wants to build units?  (Laughter.)  I’ve been building units all my life.  I don’t want to build units, but they gave us permission to do it.\n\nBut today is a tremendous honor to become the first American president to address the Future Investment Initiative Institute.  That’s the first one.  That’s very — it’s always nice.  (Applause.)\n\nAnd I want to thank Mayor of Miami Francis Suarez for being here.  Thank you very much, Francis, wherever you may be.  (Applause.)  Hi, Francis.  And thank you for the endorsement when I ran.  I was very appreciative. \n\nAlong with the mayor of Miami Beach, Steven Meiner.  Steven, thank you very much.  Thank you.  (Applause.)  Thank you.  Thank you, Steven.  Thank you very much.\n\nAnd numerous American business leaders, some of the bi- — biggest business leaders, actually, anywhere in the world, and many distinguished guests from the Middle East, and, in particular, the Kingdom of Saudi Arabia — a special place with special leaders.  (Applause.)\n\nAnd including FII Institute chairman and governor of the Public Investment Fund, which is a seriously big fund, Yasir.  I see you there.  Stand up, Yasir.  (Applause.)  Everyone knows Yasir.  Thank you.  Great guy.  Great, great person.\n\nAnd Finance Minister Mohammed, thank you very much.  Thank you right — thank you very much.  (Applause.)  Good to see you again.  That’s pretty good: finance minister of that part of the world.  That’s not bad.  (Laughter.)  Other parts of the world, not so good, but that one is good.  (Laughter.) \n\nAnd many other senior government leaders.  I also want to recognize the Kingdom’s ambassador to the United States, Her Royal Highness Princess Reema.  (Applause.)  Ooh, very popular.  Very popular.  Wow.  That’s very nice.  Sitting next to Elon.  Wow, that’s — you couldn’t do better than that, huh?  (Applause.) \n\nAs well as my own special envoy to the Middle East, who has really done a fantastic job, Steve Witkoff.  Thank you, Steve.  (Applause.)  He’s been busy.  And Michael Waltz is here.  Where is Michael?  Michael has been so busy.  They’ve been going back and forth and back. \n\nAnd a woman who was just voted the most powerful woman an- — anywhere in the world — (applause) — no, I’ll go with — I’m going to go with Princess Reema — but she was voted the most powerful woman anywhere in the world: Susie Wiles.  Thank you.  (Applause.)  Thank you.  Most powerful woman, that’s pretty good.  We have to talk to you about that, Susie.  That’s pretty good.  (Laughter.)\n\nAnd also, we all know Jared Kushner, a very special guy.  (Applause.)  Thank you, Jared.  Thank you, Jared.\n\nAnd Elon Musk.  He’s been making a little news lately, hasn’t he, though?  (Applause.)  Very positive news.  Stand up, Elon.  (Applause.)  He’s a great guy. \n\nWe did a little show last night.  I heard that it got very good ratings, too, by the way.  We did “Hannity.”  Sean Hannity was fantastic — a fantastic man, a fantastic guy, and he did a show.  And it was great being on the show with you last night.\n\nI come today with a simple message for business leaders from all across the nation and all around the world: If you want to build the future, push boundaries, unleash breakthroughs, transform industries, and make a fortune — because you want to make fortune; most of you have already made a fortune, I don’t want to say — (laughter) — there is no better place on Earth than the current and future United States of America under a certain president named Donald J. Trump.  I think that you’re going to do very well.  (Applause.)\n\nThey’re saying that November 5th — Election Day — 2024, will go down as one of the most important days in the history of our country.  They said, “In 129 years, the most consequential election.”  I don’t know if they’re right about that or not, but it sounds good.  I wanted to see if I could get a couple of more years tacked on, but I figured the fight wasn’t really worth it.  One hundred and twenty-nine is a lot. \n\nAnd as of January 20th, 2025, the dark days of high taxes, crushing regulations, rampant inflation, flagrant corruption, government weaponization — ooh, I know about weaponization — and total incompetence will be gone forever.  Will be gone forever.  (Applause.)  Because the United States is back and open for business, and the golden age of America has officially begun.  You see it happening.  (Applause.)\n\nSince my election, America’s economic engines have come roaring back to life in just a very short period of time.  Think of it.  From November 5th, the — the progress that’s been made has been amazing.  The Nasdaq is up nearly 10 percent in just a few months, and that’s a lot.  The Dow Jones Industrial Average is up 2,200 points. \n\nAnd Bitcoin has set multiple all-time record highs, because everyone knows that I’m committed to making America the crypto capital.  We want to stay — we want to stay at the forefront of everything, and one of them is crypto.  And Miami seems to be the center of the action, come to think of it, and maybe it’ll stay there.\n\nBusiness optimism skyrocketed 42 points — think of that — in a single month.  The most in history, by far.  That’s the biggest increase in history by not even close. \n\nThe ISM index of manufacturing activity surged into positive territory for the first time in many years.  Amazing. \n\nAnd it was just announced — this is an interesting one.  I didn’t realize it was that bad for so long.  But it was just announced by one of the nation’s most historically accurate and respected pollsters, Rasmussen, that the number of Americans who believe our country is on the right track now exceeds those who think it’s heading in the wrong direction for the first time in 20 years.  Can you believe you that?  Twenty years.  (Applause.)  And this is really a seismic 27-point swing from just before the election.  That’s — nobody has ever seen anything like that one, Yasir.  I want to tell you.  That’s a big one.  (Laughter.)\n\nThe best and most successful business leaders on Earth are now racing to invest in the United States.  Since November, DAMAC has announced plans to invest $40 billion in the U.S., creating at least 10,000 jobs.  SoftBank has announced investments of between $100- and $200 billion, creating at least 100,000 American jobs.  Oracle and OpenAI and SoftBank are now collectively committing $500 billion to keep the United States on the cutting edge of artificial intelligence. \n\nAnd so many more — I mean, so many companies, they want to come to the White House and have a little news conference all the time.  I said, “Why don’t you just announce it?”  But they want to come, and I’ll do that.  I don’t mind doing that.  I say anytime they want to go $10 billion or more, I’m — I’m there.  (Laughter and applause.)  Ten billion or more.\n\nBut on his recent visit to the White House, the prime minister of Japan announced he anticipates Japanese investment in the United States of well over a trillion dollars, and we’re working on an Alaska pipeline already, which is the closest point to Asia. \n\nAnd as you know, the ANWR, which we’ve started, Ronald Reagan couldn’t get it approved.  Nobody could get it approved for so many years.  Couldn’t get it approved.  I got it approved.  Actually, I got it approved twice.  I got it approved, and Biden ended it.  That was a shocker.  But we just got it approved again.  And we’re going to be — (applause) — it’s — it’s probably the largest deposit maybe anywhere in the world, just by itself.  It’s — they say of similar size to Saudi Arabia, so we hope that’s correct.\n\nBut all of this is only happening because of the world-changing results of the 2024 election.  We won the House.  We won the Senate, the White House, and the Electoral College and the popular vote in a landslide.  We also won all seven swing states, and all 50 states shifted in the Republican direction for the first time ever.  So, every state — every single state of the 50 states shifted Republican.  That’s never happened before.  Either way, it’s never happened. \n\nAnd 85 percent of counties voted for Trump.  Think of that.  So, you have 2,600 counties versus 525.  Two thousand six hundred, think of that.  That’s why when you look at the election map, after it was all done — the certified map — the whole thing was red — 2,600 versus 500.  It’s a big, big dif- — nobody’s seen anything like it, actually. \n\nSo, as a result of this very historic victory, investors from all over the planet, once again, have confidence in America’s future and respect for America’s leaders, and it’s about time we get a little respect. \n\nThe last administration was the worst and most incompetent in the history of our country, but we are moving quickly to fix every single disaster Joe Biden created and make America stronger and more prosperous than ever before.  (Applause.)\n\nOur first and most urgent mission is to remove the criminals that Biden allowed into our country with the ridiculous and very dangerous open-borders policy.  They came from all over the world.  They came from prisons and jails.  They came from mental institutions and insane asylums.  They were gang members.  They were drug lords.  They came from all over, and they were allowed to come into our country.  And we’re getting them out in record levels, just like they came in in record levels. \n\nI want to thank Tom Homan and Kristi, who is just doing — she’s doing a fantastic job — governor of South Dakota — and Tom Homan, you know, and they are doing a fantastic job.  (Applause.)  And the results are incredible.\n\nAnd every country is taking them back.  They’re sending their criminals to us, and they’re all taking them back.  We had a little problem with a couple of them.  That ended very quickly.  And because some said, “We don’t really want MS-13 back in our country.”  But I said, “Congratulations, you’re taking them back,” and they take them back. \n\nAnd, by the way, Europe and other places ought to start also doing that.  They better start looking at immigration, because it’s really hurting Europe very, very badly.  And they better get smart and they better get tough before it’s too late. \n\nWe’re also working to end the highest inflation in our country’s history, all caused because they played with our energy policy and wasted money on the Green New Scam and other things such as that, and they wasted monies at — at never-seen-before levels.  If Joe Biden had simply held federal spending at the pre-pandemic levels we had in 2019, we — right now, we would have virtually no inflation. \n\nWe’re trying to balance the budget immediately, and because of the tariff income, which is really go- — it’s — it’s already turned out to be amazing, actually.  It’s really meant more for bringing countries and companies into our country, but it’s — the numbers are rather staggering, because we’re the big piggy bank that everybody wants to be.  And they can play games, and they can say, “Well, there’ll be retribution and, you know, equal this and that,” but they can’t be equal. \n\nBut we want to keep it so that we’re the big piggy bank.  And if we had years like we did the last four years, that wouldn’t have lasted too long.  So, we’re not promising it, but you know, all of these things could happen.  We — we hope to balance our budget. \n\nSo, I don’t want to promise it, because if I do and we come about $10 short, the fake news media back there would say, “We have breaking news.  He did not make it.  He did not make it.” \n\nBut we’ll get it done very soon.  It might not be this year, but it could be this year.  Actually, we have a chance at getting it even this year, which people would be shocked at, because they were talking about 10 years, 15 years, 20 years from now.\n\nWhen I took office last month, we inherited the consequences of inflation that was more than four times what it was when I left four years ago.  Think of that, I left, it was at 1.4 percent.  And the annual government spending over $1.5 trillion more than projected in 2020 alone — $1.5 trillion.\n\nBut under the Trump administration, all of that is changing faster and more dramatically than anyone ever thought possible.  They didn’t think it was possible to do what we’ve done in just a very short period of time.  We’ve accomplished more in four weeks than most administrations accomplish in four years. \n\nOn my first day in office, I imposed an immediate federal hiring freeze, a federal regulation freeze, and a foreign aid freeze. \n\nI signed an order creating the Department of Government Efficiency and put a man named Elon Musk in charge.  Thank you, Elon, for doing it.  (Applause.)  Thank you very much. \n\nAnd he’s doing a great job.  I wish you could have seen him last night.  It’s really — you know, he’s a very committed person.  He’s a very serious person.  And he’s a very high-IQ people. \n\nYou know, I like high-IQ people.  Not all have to be, but, you know, it’d be nice to have some people up there that — (laughter) — he’s a seriously high-IQ individual.  Now, he’s got his faults also, I will tell you that — (laughter) — but not too many of them.\n\nWhich is now really waging war on government waste, fraud, and abuse, and they’re curbing inflation and saving taxpayers billions and billions of dollars every single day.  And there’s even under consideration a new concept where we give 20 percent of the DOGE savings to American citizens and 20 percent goes to paying down debt, because the numbers are incredible, Elon.  So many billions of dollars — it’s billions — hundreds of billions, and we’re thinking about giving 20 percent back to the American citizens and 20 percent down to pay back debt — and pay down debt, which is — if you look at value, if it were a real estate balance sheet, the debt is tiny, but we still — we still want to pay it down.  Doesn’t matter.  We don’t look at it as a piece of real estate.  It’s America.  We’re going to get it down through intelligence, hard work, and, as Elon said, a word called “caring.”  You have to have — you have to care. \n\nBy doing this, Americans will tell us where there is waste.  They’ll be reporting it themselves.  They participate in the process of saving money. \n\nSo many of the men and women in this room, as an example, they pay tremendous amounts of taxes.  And here are just a few examples of where your money was going before I came along.  These are just some of the — just taken at random.  Oh, there are much worse examples than this.  I was just looking at them before the speech, and I can tell you there were much worse.  And there are some that are horrible, but I don’t want to really say them, because they’re very, very embarrassing to people — very, very embarrassing.  And they’re really something, but you’ll be seeing it and you will be reading about it.\n\nBut just some taking at random:\n\n$2 million for sex change operations in Guatemala.\n\n$20 million for “Sesame Street” performances in Iraq.  Twenty million, that’s a lot of money.  (Laughter.)  You know, I know what it costs to do those things.  You get a cast over for $50,000, give them a couple of bucks tip.  That’s it.  Not $20 million.  (Laughter.)  Twenty million, that’s “Gone With the Wind” on steroids.  (Laughter.)\n\n$101 million for 29 diversity, equity, and inclusion contracts at the Department of Education.  Wow.\n\nAnd we’ve also canceled — we’ve canceled all of these, saved all of this money.  And, again, this is just a small sample.  This could go on.  I could read them all day. \n\n$520 million for a consultant — I want to know who is that consultant — (laughter) — to do ESG — that’s environmental, social, and governance — investments in Africa. \n\n$25 million to promote biodiversity conservation and licit livelihoods by developing socially responsible behavior in Colombia. \n\n$40 million to improve the social and economic inclusion of sedentary migrants.  Nobody knows what that even means.  None of this stuff.  Nobody.  (Laughter.)  Everyone is trying to figure out, “What the hell does it all mean?”\n\n$42 million for social and behavior changes in Uganda.  Forty million is a lot of newspaper ads in Uganda.  (Laughter.)\n\n$70 million for research of evidence-based solutions for development challenges.\n\n$10 million for Mozambique medical male circumcision.  (Laughter.)  What does that — what does that mean?\n\n$2.3 million dollars for strengthening independent voices in Cambodia.  (Laughter.)\n\n$14 million for improving public procurement in Serbia.\n\n$486 million to the Consortium for Elections and Political Process Strengthening, including $22 million for inclusion — inclusive and participatory political process in Moldova and $21 million for voter turnout in India.  What do we need to spend $21 million for voter turnout in India?  Wow, $21 million.  I guess they were trying to get somebody else elected.  Wow, we ought to tell the Indian government, because when we hear that Russia spent about two dollars in our country, it was a big deal.  Right?  (Laughter.)  They took — they took some Internet ads for $2,000.  This is a total breakthrough: twenty-one million dollars for India elections.\n\n$29 million to strengthen the political landscape in Bangladesh.\n\n$20 million for fiscal federalism, and $19 million in addition to the $21 million, for biodiversity ~~conversion~~ [conservation] in Nepal.\n\n$1.5 million for voter confidence in Liberia.  We need voter confidence too, when you read this list.  (Laughter.) \n\n$14 million for social cohesion in Mali.\n\n$2.5 million for inclusive democracies in South Africa.\n\n$47 million for improving learning outcomes in Asia.  Asia is doing very well.  We don’t need to give them money.  (Laughter.)\n\nAnd in another program, $50 million, plus another $50 million, for condoms for Hamas.  You know about that?  (Laughter.)  A hundred million dollars for condoms.  Condoms.  Does everybody know what a condom is?  (Laughter.)  For Hamas — $100 million. \n\nAnd these are just some.  I could read this list all day long.  I just don’t want to bore you.  But these are just some, and not nearly as bad as others.  And some are just — I just don’t want to say them because they’re too — they’re too ~~incenduary~~ [incendiary].\n\nWe’re also finding tremendous abuse, waste, and fraud in Social Security.  Social Security is — what’s happening there is going to be one of the great potential scandals in history. \n\nOn the program, there are over 4.7 million Social Security numbers from people from 100 years old to 109.  Think of that.  Now, over 100, there aren’t a lot of people that make it.  Hopefully most of the people in this room will make it, but historically, you don’t have thousands and thousands of people.  But listen to this: 3.6 million people are on Social Security rolls from the age of 110 years old to 119.  Do you think there are really that many?  (Laughter.)  Those people are seriously old.  (Laughter.)  But it gets worse. \n\n3.47 million — 3.47 million people are on Social Security from the age of 120 years old to 129 years old. \n\n3.9 million people are on the age of Social Security from 130 years old to 139 years old.  Now the all-time record, I heard, is a woman who was a hundred — she was 127 years old.  That’s the record.  A woman from a certain country where they have actually people that live pretty long, actually.  And she was 127 years old.  That’s pretty old, but we’re topping her by millions — millions of people.  (Laughter.) \n\n3.5 million people from the age 140 to 149 years old. \n\n1.3 million people are on Social Security from the age 150 to 159. \n\nAnd over 130,000 people are on Social Security over the age of 160 years old — okay? — including 1,039 people — think of it — over 1,000 people — between the ages of 220 to 229.  (Laughter.)  And one person between the age of 240 to 249. \n\nAnd the record-topper: There is one person on Social Security who is 360 years old — (laughter) — which is approximately 110 years older than our country.  (Laughter and applause.) \n\nSo, what we’re trying to find out and what we will find out is are people being paid from all of these.  You know, is somebody pocketing $10,000 here, $10,000 there?  What’s going on?  So, we’ll find that out pretty easily because we have a lot of computer geniuses.\n\nI said to Elon, “Who are these people that are doing this, the DOGE people?”  I said, “Who are they?  Where do they come from?”  He said, “Well, number one, they love our country, and, number two, they’re really genius at computers.”  So, nobody is going to fool them.  When they go in, they see some bureaucrat that’s scamming the country, and they try and talk about, you know, certain computer language, these people say, “No, it doesn’t work that way.”  These are people that are — have a natural ability as — as, you know, brilliant computer people.\n\nIt was very interesting when he told me that.  I said, “That’s what you need today.” \n\nBut all of these scams have now been terminated. \n\nIn addition, over the past month, we have effectively eliminated the U.S. Agency for International Development, which was funding much of this lunacy.  We virtually shut down the out-of-control CFPB, escorting radical-left bureaucrats out of the building and locking the doors behind them.  What they were doing was so terrible.  Where they were spending the money was so terrible. \n\nWhat we haven’t looked at yet but will be is does the money come back to them, because nobody can be stupid like that.  And they’re not stupid.  They’re smart, actually.  And, you know, why are doing that?  Does money come back to them?  So, we’ll figure that out pretty easily, I think, and quickly.\n\nBut I’ve ended all of the so-called diversity, equity, and inclusion programs across the entire federal government and private sector and notified every single government DEI officer that their jobs have been deleted.  They’re all deleted.  And it’s interesting, even these country — these companies that have tremendous — the amounts of money — a number of them just announced — Walmart, if you can believe it, they just announced that they’re stopping. \n\nAnd, you know, these companies are writing off, like, $220 million.  How can you spend that much money no matter what you’re doing?  If you’re teaching something, you’re going to have an instructor, you’re going to talk, you’re going to give them a book, “Please read the book.”  You know, and then you find they spent $225 million on that.  What’s going on?\n\nAnd we were going in the wrong way, and our military was really — although, I tell you, you know, we — we defeated ISIS with our military in three weeks.  General “Razin” Caine was — he’s some general.  He’s a real general, not a television general.  And three weeks — ISIS.  And I — I asked him, and I saw some of his people that were so great, the soldiers.  We have the greatest military in the world, but we don’t have the greatest top, top leadership.  That’s why Afghanistan was such a horrible situation and so embarrassing and so many other things. \n\nBut when we want to, with proper leadership, there’s nobody even close to us.  We have the best equipment in the world.  We make the best equipment in the world.  But we have the best military, but, you know, we never fight to win.  We fight to just keep it going forever.  And when we fight to win, there’s nobody that can even come close to us. \n\nBut I was talking to General Dan Caine, and we call him “Razin” Caine.  And I was told it would take about four years to defeat ISIS, and he did it in three weeks.  I said to him, “What do you think, General?  How long will it take?”  “Sir, I think we should do it in less than four weeks.  You’re going to have time leftover.”  And he did.  He did that.  And we were told by the television generals it would take four years. \n\nSo, we did it.  That’s when I went to Iraq.  I flew to Iraq and — late at night — the dark of night, all the windows closed, all the lights off in the plane, in Air Force One.  And we flew in, and it was pretty amazing.  I’ll tell you, we were landing, and there were no lights.  No lights on the plane.  “Sir, we have to turn off all lights.”  I said, “You mean we spend $9 trillion, and we have to fly in on Air Force One with the lights off?”  And I went up to the pilot and said hello.\n\nAnd, by the way, these guys are like central casting.  These are the best-looking human beings.  Everybody is, like, perfect.  (Laughter.)  The most handsome people, the best-looking people you’ve ever seen, with the flattops and the whole thing. \n\nAnd I was a little concerned because the lights are off, and everything is off, and even the lights in where he was were down very dim — very, very dim with all of the lights on the fancy dashboards of the plane of Air Force One.\n\nWe’re getting a new Air Force One if they can ever finish the damn thing.  (Laughter.)  We’re getting two of them, actually.  But we may have to go a different route because it’s taking them a long time.  We’re going to get military that’s going to start building.  We’re going to get people to start building properly again in our country, because they don’t build properly.  (Applause.)  This was Boeing.\n\nBut we’re — we’re up there, and I’m looking at these people.  And, again, cent- — I say they look like Tom Cruise but better — (laughter) — stronger, tougher.  And I like Tom Cruise, but these are better.  And I said — I said, “Are we okay, Captain?”  “Yes, sir, we’re fine.”  But I’m looking out.  I don’t see any lights, and we’re landing. And I’m — you know, I’m used to that.  I like to sit with the pilots a lot, and I respect the pilots greatly.\n\nAnd we’re up there, and, you know, we have the computer — I call it the computer voice, where it goes 1,000, 900, 800.  That’s feet — your feet above ground.  So, that means you’re very low.  And I’m looking out, and my eyes are pretty good, and I don’t see any lights.  And the computer goes out.  It sounds like a — an intelligent individual.  It goes, “1,000.”  We’re a thousand feet up.  That’s very — it’s a 10-story building.  This is a big, big plane.  And then it goes, “900, 800, 700.”  I say, “Captain.”  (Clears throat.)  (Laughter.)  “Captain, we don’t see any lights.”  I said, “Is everything” — “Yes, sir.  Everything is fine, sir.  We’ll be landing in three minutes.”\n\n     And then it goes, like, “600, 500.”  “Captain, are we okay?”  (Laughter.)  And then it goes, “400, 300, 200.”  And I’m saying, “Man, there’s nothing out there.”  (Laughter.) \n\nAnd then he goes boom.  Perfect landing, right on this thing.  There are no lights on the runway.  There’s no n- — I don’t know how the hell they do it, but I’m sure as hell glad we had somebody that knows how to fly.  (Laughter.) \n\nBut they didn’t want to have any lights because they didn’t want the enemy — after spending, you know, years and trillions of dollars, we have to land with Air Force One with no lights on the runway.  But they were incredible people. \n\nAnd then I got out of the plane, and I actually asked my people — you know, I said, “Excuse me, I was very brave sitting in that cockpit.  Am I allowed to give myself the Congressional Medal of Honor?”  (Laughter and applause.)  And they said, “I don’t think so, sir.”  I said, “Well, I felt I was extremely brave.”  (Laughter.) \n\nBut now here’s the problem with saying a story like that.  When you kid, the press will say, “President Donald Trump wanted to give himself the Congressional Medal of Honor.”  (Laughter.)   Headlines, you know?  Headlines all over the fake news.  We call it the fake news, but we’re all wise to them.\n\nBut it was something. \n\nAnd then I went down, and it was the same thing.  I’m standing on the top, and I look down and there’s these handsome people.  Everybody is like from a movie set.  Good-looking guys.  I get down the stairs, and “What’s your name?”  “My name is Caine, sir.”  “What’s your first name?”  “They call me ‘Razin.’”  I say, “Wait a minute.  Your name is Razin Caine?  I love you.  I’ve been looking for you for five years.  You are the grea-” — (laughter) — “This is what I want.” \n\nAnd there was a general next to him.  There was a colonel.  There was a drill sergeant, a master sergeant.  They were all, like, people — I could make a movie right now.  I’d have the best-looking people ever.  And they were great. \n\nAnd then I went in, and “Sir, would you like to rest before the me-” — “No, I don’t want to rest.  I don’t want to rest.  I’ve been resting on the plane,” other than the last few moments, which were quite harrowing.  (Laughter.)  And I said, “I don’t want to rest.”  He was thinking about Biden in advance, you know?  Biden would have gone there; he would have rested for days.  (Laughter.)  They — and then they wouldn’t have had a meeting.  He’d just go home.  (Laughter.)\n\nNo, I said, “I don’t want to rest.  I don’t want to rest at all.  I want to go.”\n\nSo, we went into this, like, bunker, and we had a lot of very good, talented people.  And that’s when I asked him.  I said, “You know, I’m hearing it’s going to take a long time.”  “No, that’s not right, sir.  It’s not going to take a long time.  We’ll have it done in four weeks.”  I said, “How can you say four weeks when, in Washington, they said four years?”  He said, “It’s four weeks, sir.  We’ll hit them left.  We’ll hit them right.  We’ll hit them up the center.  We’ll hit them underground and overground.  We’ll knock the hell out of them, sir.” \n\nAnd I said, “Why is it that they said so long?”  He said, “Because they wouldn’t let us fight, and we’re very far away.  They want us to fight for this — from this airport.  We’re very, very far away, sir, and they want us to fight here.  We have many substations out” — sub-airports, they call them.  Remote airports, where they build them in the sand.  “And we have many of them, and I’d use them all, sir, and I would hit them so hard from so many different directions.”\n\nI said, “Well, what do you think?”  He said, “You just let me know.”  And I called him back, and I said, “Go ahead and do it.  Are you sure you can do this, General?”  He said, “Yes, sir.”  And he did it, actually, in three weeks.  It was over.  A hundred percent of people that are really hurting the Middle East, hurting the world — and it was done. \n\nAnd we have — I’m telling you, we have the greatest military in the world, but you have to use the right people.  But there’s nothing like what they were able to do in that case.  And in other cases, wherever I gave them something, it was done incredibly well and very — and you know many of the instances, because it’s been well reported.\n\nBut we’ve also required — and we ha- — so, we have a country that’s a great country.  It’s a strong country, but it’s a country that’s just now gaining its respect back to the levels that it should — should have never lost.  We were being laughed at by the entire world, but we’re not being laughed at anymore. \n\nBut we’ve also required that all federal employees must once again show up to work.  This is a new phenomenon, you know, since COVID.  (Applause.)  Show up to work in person like the rest of us.  So, I mean, it doesn’t work when you don’t show up. \n\nAnd I see companies now are all going back to it.  They’re all going back.  It’s great.  I want some of the big business leaders saying, “We absolutely are going back.”  You — you j- — you can’t work at home.  They’re not working.  They’re playing tennis, they’re playing golf, or they have other jobs, but they’re not working — or they’re certainly not working hard.  You could never build a company or a country with that. \n\nSo, we have a very strong policy.  And if they don’t show up to work, they — they get fired. \n\nAnd we’re trying to make our government smaller but much stronger.  And we have tremendous bureaucracy, but it’s happening.  A lot of people are leaving and, in some cases, leaving with pretty good offers.  You know, you’re paid seven or eight months and go out, find a job.  But some of these people had jobs.  They were actually working for us, but they also had other jobs.  And those people, in theory, they have problems.  I don’t know if we’re going to do anything about that.  So, we have other things to do, but they were working other jobs instead of working for us.  So, they were staying home working, but they were working other jobs, getting paid a lot of money, perhaps. \n\nWe offered deferred resignation buyouts to all federal workers, resulting in more than 75,000 bureaucrats voluntarily surrendering their taxpayer-funded jobs.  A lot of them are leaving because they don’t want to be caught having the second job, some are leaving because they didn’t want to be in government any longer, and — and some are leaving because they didn’t want to show up to work.  They wanted to work outside of an office, and that’s never going to work for anybody, including companies.  The companies ought to get smart. \n\nYou watch these companies where they do that: They start going bad.  Nobody knows — “what’s wrong with this company?”  Well, try getting the people back into the office where they can be cohesive and together. \n\nIn less than a single month, the Department of Government Efficiency has already saved over 55- — this is just a short period of time — $55 billion, and we’re just getting started.  That’s nothing compared to the numbers that you’re talking about, right?  (Applause.) \n\nWe’re ending trillions of dollars in waste, and it’ll mean much lower inflation; lower interest rates; lower payments on mortgages, credit cards, car loans; and much higher stock markets.  I think the stock market is going to be great.  In other words, we will rapidly grow our economy by dramatically shrinking the federal government, and we have to do it. \n\nI’m also taking fast action to end the radical left’s nation-wrecking crusade against oil and natural gas.  Over the past four years, the Biden administration cut the number of new oil leases and gas leases by 95 percent.  They slowed new pipeline. \n\nI mean, look at the — any one.  Dakota Access, they wanted that one knocked out.  The Keystone Pipeline, they wanted that one knocked out.  They ended the Keystone.  We got the Dakota Access done, but it wasn’t easy after they tried to stop it.\n\nThey slowed new oil and gas pipeline construction to virtually a halt.  They shut down 38 percent of active oil and gas rigs in the United States. \n\nBut they love the wind turbines.  They go round and round and round.  And if the wind doesn’t blow, they got problems.  They kill all the birds.  They ruin the sight lines.  They ruin the plains and the beautiful areas of our country, including the oceans, the lakes. \n\nThey closed more than 50 power plants, all causing energy prices to skyrocket.  You saw that happen.  That’s what caused the inflation.  It’s pretty easy. \n\nThese policies were so destructive that despite draining nearly 40 percent of U.S. Strategic Petroleum Reserve meant for emergencies — it was meant for emergencies.  It wasn’t meant for getting the price of gasoline down so that you can win an election.  Didn’t work for winning the election.  Actually, there’s so many people that are driving that it’s a very small number.  It just had a very small effect.  But in the meantime, it takes it down.  It’s at — now it’s at the lo- — we’ll fill it up fast, but it’s at the lowest level. \n\nWhen we made the transition, it was at the lowest level in history ever recorded.  It’s the lowest level.  Nobody’s ever seen it that way.  They — they put it all out because they thought they could keep gasoline prices down a little bit.  Just go past the election, and then after that, they didn’t care.  And it didn’t work, because they didn’t get elected.  I got elected.\n\nBut the price of gasoline still rose over 35 percent and, in some cases, at some periods, it was 100 percent and 125 percent during certain periods of time.\n\nUnder the Trump administration, we have implemented a very different plan.  You probably heard of it.  It’s called drill, baby, drill, and we’re doing a — (applause).\n\nThe world runs on low-cost energy, and energy-producing nations like us have nothing to apologize for.  We have more energy than any other nation in the world, and we’re going to use it.  And we’re going to use it on AI plants. \n\nI was telling some of the people that came in that — you know, they’re very inter- — everybody’s talking about AI.  I hope you’re right.  You know, I don’t know.  Who knows?  (Laughter.)\n\nBut, Elon, are they right?  Are they right in going all i- — they are all in for AI. \n\nBut the problem is, to do it, just in our country, you need twice the electricity just to open up and be the top of AI.  You need twice the electricity that we have right now.  In the entire country, if you take all of the electricity, you need more than twice.  You need twice.  You need double what we have right now just to fuel this new industry that’s growing.  I was amazed when I heard that number.\n\nAnd they all said, “How can we do this?”  Because, you know, in China and various other places, you can probably get it with the shake of a hand, but in our country, you can’t. \n\nBut now you can, because we’ve declared — I’m declaring a national emergency in order to get fast approvals.  And we’re going to have — if you build a plant, you’re able to build an electric-generating facility right next to your plant, so you’ll be making your own.  You won’t have to count on utilities.  You won’t have to count on an old grid that could fail, could get hit by something — bad things or good things — but you’re not going to have to — you’re not going to have to worry about grids.  You’re not going to have — you’ll build your plant, and you’ll build your — your — essentially, you become a utility, in a way.  You build your own electricity.  If you want to build extra and put it out and get paid for that, you’re going to be able to do that.  You could put it back into the grid, but you’re going to be able to build with your plant a generating facility.\n\nAnd we’re going to get you Lee Zeldin, head of the environment — head of Environmental — the Environmental group — various groups.  And we’ve got them unified now, but we’re going to get you very fast approvals, and they’ll be approved so fast your head will spin.  And we’re going to get that whole industry started, and we’re going to be the head of it.  We’re leading right now.  We have the greatest brain power.  We’re leading right now, and I expect that we’re going to be leading by a lot. \n\nBut we’re going to get you the energy very, very quickly.  That would be the one thing that everybody was concerned, “How do we have that much electricity when Los Angeles has blackouts and brownouts right now, and there’s a lack of electricity?”  But we’re going to get it at levels never seen before. \n\nI ended the ridiculous Green New Scam, halting tens of billions of dollars of wasteful deficit spending.  And I withdrew the United States from the unfair, one-sided Paris Climate Accord. \n\nAnd I ended Joe Biden’s insane electric vehicle mandate, because it was just insane.  I repealed the last — and, by the way, if you want to buy an electric car, that’s great.  If you want to buy a gasoline-driven car or a hybrid, it’s great.  Whatever the — whatever the thing happens to be. \n\nI heard hydrogen is hot.  The problem is, when it’s not, you’re in deep trouble.  Because when that sucker blows up, they don’t find the body.  (Laughter.)  So, that’s one that I said, “You know what?  Let’s take a pass on that one.”  They said it’s good, but when it’s bad, it’s really bad.  You find the bodies on trees — on the side of a tree.  (Laughter.)  I said, “I think we’ll pass on that one.  Right?  We’re not going to want that one.”  But you never know.  Maybe someday it’ll be good.  But it doesn’t sound like it’s off to a good start. \n\nI repealed the last administration’s very destructive natural gas export ban, and, last week, we approved our first new liquefied natural gas export license, and we have literally hundreds of people that want to export. \n\nI recently met with the Japanese prime minister, Ishiba, to discuss large increases in American oil and gas exports.  They want it so badly.  They said, “We went to the Biden administration, and they wouldn’t sell it.  They wouldn’t sell it.”  Nobody knows why.  Biden didn’t know why either.  They asked him.  “I don’t know.”  (Laughter.)  “He wanted — they did?  Oh, I didn’t know that.” \n\nBut we’re going to sell it.  And the new project in Alaska is going to feed all of Asia.  We’re going to take care of all of Asia.  We have so much oil and gas, like very few people — like very few countries have — like, really, actually, no country has. \n\nI also met with Prime Minister Modi of India, who wants to greatly expand India’s purchase of American energy. \n\nAnd my administration has also launched the most aggressive deregulation program of any nation in history.  Under my executive order, for every 1 new regulation added, 10 old regulations have to be eliminated.  (Applause.)\n\nAnd, you know, in our first term, which was actually an incredible success — we had the greatest economy in history until COVID, and even after that, we did great.  The stock market was higher.  If you think of it, it was higher after the fact — after we went through that whole thing, it was higher than it was just prior to COVID coming in, which is a pretty amazing thing. \n\nBut we did a great job on that, but it was a terrible thing for the world.  The whole world suffered.  It suffered terribly, including China, including other countries.  It just was a terrible period of time. \n\nBut despite that, we did well.  But we had the greatest economy in the history of our country, and I think this time we’re going to do even better.  We had — we were artificially hurt by COVID.  We had to focus on that instead of focusing on — but just prior to COVID coming in, there’s never been anything like what we did, what we achieved.  And even after, we did very well con- — and especially considering what all of us had to do with COVID.  Some nations were hit so badly, it was — it was just unbelievable what happened to them. \n\nAs part of our effort, I’ve signed executive orders to keep the United States at the forefront of artificial intelligence and to end Joe Biden’s war on Bitcoin and crypto.  We ended that war totally.  That war is over.  They were very hostile toward them until the very end, just because there are so many people on Bitcoin and crypto that — just before the end, the SEC came out, and they were being very nice.  I was so nice to people, because so many people were being indicted for no reason whatsoever — very political group of people.  That’s all they did was they liked indicting people. \n\nBut they were being indicted, and many of those indictments were dropped just before the election because they said, “Wait a minute.  There’s 100 million, 125 million people using this,” and they didn’t want to have, you know, all these people being — voting against.  But by the time they did that, it was too late.  We had that vote entirely, I think.  I think anybody would — smart that believed in that, and there were a lot of people believing it — anybody that was smart voted for Trump.\n\nAnd they pulled the indictments.  And I see people that were indicted.  I said, “I saved your life.  I saved your life.”  Because if they thought that — they actually thought that I was doing — they said, “Why is Trump doing it?  Is he doing it for political reasons?”  I don’t do anything for political reasons.  I do what’s right.  I do — I want to be on the forefront of every industry.  (Applause.) \n\nSo, I’ll be working with the Republican Congress to pass the largest tax cuts in American history.  And that includes, obviously — (applause) — yeah.  That includes we have to extend the Trump tax cuts, which were, until now, the largest. \n\nWe’re going to dramatically cut taxes for families and for workers and for companies, including no tax on tips and hopefully no tax on Social Security and no tax on overtime.  And that overtime one is a sleeper, because I think a lot of people are going to be spurred on to do a lot of extra work.  When they hear that, it’s — a lot of companies really like it and a lot of people really like it. \n\nThe new Trump tax cuts will also include 100 percent expensing for new factory construction in the United States and anything else that you’re going to buy with capital.  If you buy something — if you buy something that is going to be good for our country, we’re going to let you expense it — one-year expense.  (Applause.)  And I did that the first time, and everybody was saying, “Can you go back to that?”  Now you still get, I guess, 40 percent or whatever, but it, you know, pares down.  But we’re going to bring that right up to the — to the top level.  I think that had a lot to do with the success that I had during my first term. \n\nAnd we’ll substantially cut taxes for all domestic producers of oil and gas and just about everything else that they produce. \n\nIn my first term, I brought the business tax down from around 40 percent to 21 percent, which everybody said was an impossible thing to do.  I cut it from 40 or — it actually — with state and city, it was much higher than 40, but I got it down to 21 percent.  And now I’m bringing it down to a goal of 15 percent, but only if you make your product in America.  In other words, you’re going to be at 21 percent, but if you make your product in America, you’re going to go from 21 to 15.  If you don’t, you’re going to pay 21 percent, which is still lower than anything.  (Applause.) \n\nSo, guys like Elon are going to come and make his great cars in the United States.  There — a lot of — a lot of people will.  A lot of people are calling.  A lot of car companies are calling.  They called me — three of them.  Three of the majors, they called, and they said, “We’re looking all over the place.  We want to be there.”\n\nI’m going to be announcing tariffs on cars and semiconductors and chips and pharmaceuticals — drugs and pharmaceuticals and lumber, probably, and some other things over the next month or sooner, and it’s going to have a big impact on America.  We’re bringing our businesses back. \n\nIf they don’t make their product in America, then they — very simply, they have to pay a tariff.  But if they do make their product in America, they ha- — they don’t have to pay any tariff, which will bring — it’s all going to bring trillions of dollars into our Treasury, or it’s going to mean that there won’t be any taxes because we won’t have a fair base.  If they don’t have it, we don’t have it.  If they don’t pay — if they don’t charge us, we don’t charge them.  It’s pretty simple. \n\nThe Republican Party is, once again, the party of common sense.  We’re a party of common sense.  We want strong borders.  We don’t want men playing in women’s sports.  We don’t want to have transgender for everybody.  We’re the party of common sense.  That’s how we won the election in such a big manner. \n\nWe’ll no longer allow other countries to ransack and plunder our nation.  That’s why I’ve announced that we will soon begin imposing reciprocal tariffs on any country that engages in unfair and unequal trading practices.  If they tariff us, as I said, we will tariff them at the exact same rate.  So, if a certain country — because some of these countries, even countries that I’ve already mentioned, are extremely aggressive with tariffs.  Nobody knows that. \n\nThe European Union, they have a VAT tax that’s devastating.  It’s very tough for people on the outside.  Hard to sell cars.  Really impossible to sell them, because they also have nonmonetary tariffs that are very, very tough.  But if you take a look at that, it’s a very unfair situation.  And the VAT tax is similar to the tariff.\n\nAround the world, I’m moving quickly to end wars, settle conflicts, and restore the planet to peace.  I want peace, and I don’t want to see these — everybody being killed.  And you take a look at the death in the Middle East and the death that’s taking place between Russia and Ukraine that’s been going on, and we’re going to end it. \n\nThere’s no profit for anyone in having World War III, and you’re not so far away from it.  I’ll tell you right now, you’re not so far away.  If we would have had this administration for another year, you would have been in World War III, and now it’s not going to happen.\n\nIn the Middle East, I’ve restored my policy of maximum pressure on Iran, designed to — to bring peace.  (Applause.)  And we’ve designated the Houthis a terrorist organization.  They’re, you know, destroying shipping lanes all over the place.  They’re making it very hard for people to get their product delivered.  They’re making it very difficult.  But we’ll take care of that situation.\n\nAnd we’ve secured a ceasefire in Gaza, and we’re bringing in the hostages, and we’re bringing them home to their families.  Some of them are in pretty bad shape, I have to tell you. \n\nTo end the horrible war in Ukraine, I have spoken with President Putin and President Zelenskyy, and our teams began negotiations this week in Saudi Arabia.  I want to thank Saudi Arabia for that.  That was so great.  (Applause.)  Yeah. \n\nAnd I want to thank, in particular — I mean, we have so many of the people — Yasir, Mohammed, all the people — but — but, in particular, we have to thank Crown Prince Mohammed bin Salman for hosting these historic talks — (applause) — and talks that went very, very well. \n\nSteve was there — Steve Witkoff was there, and Michael was there — Michael Waltz — and others.  And they really went well.  It’s a big — it’s a big step.  We’ve got to get that war over with. \n\nYou have to see the people that are dying.  I look at the pictures, the — the satellite pictures of the field.  It’s a level field, and it looks like a modern-day version of Gettysburg, and you know what that means.  It is just carnage.  It’s horrible. \n\nAnd, you know, it’s not American soldiers.  It’s not even soldiers from the Middle East, in the case of Ukraine-Russia, but it’s people.  It’s young people from Russia and Ukraine, mostly, that are just being decimated.  It’s flat fields, and a bullet goes, and a bullet only stops when it hits somebody.  And the level of people being killed in that battle — soldiers, young soldiers — in some cases, old soldiers, because they’re running out of people; they’re running out of soldiers, one case. \n\nBut think of it, a modestly successful comedian, President Zelenskyy, talked the United States of America into spending $350 billion to go into a war that basically couldn’t be won, that never had to start, and never would have started if I was president — not even a chance.  And it didn’t start for four years.  Never would have started. \n\nBut a war that he, without the U.S. and Trump, will never be able to settle.  They’ll never settle that war without our involvement.  That’s why they did such a great job this weekend.  That’s why Saudi Arabia did such a great job this weekend in hosting.\n\nThe United States has spent $200 billion more than Europe, and Europe’s money is guaranteed.  They get their money back.  It’s a form of a loan.  Nobody knows that.  I know that.  I said, “Why isn’t somebody saying, you know, we do it the same way?”  And we spent much more money.  We have to equalize. \n\nBut while the United States gets nothing back — so, they get their money back.  It’s a loan.  We just give our money. \n\nAnd we had a deal based on rare earth and things, but they broke that deal.  But we — they broke it two days ago.  We had a deal, because I said, “We’re spending $350 billion, and Europe gets their money back in the form of a loan and we don’t.  We’re just giving the money hand over fist.”  That’s the Biden administration for you.  But they’re no longer dealing with the same United States as they were dealing with a few months ago.  Why didn’t crooked Joe Biden demand equalization? \n\nAnd that this war is far more important to Europe than it is to us, and that there’s a very big, beautiful ocean as separation.  This is — you know, we’re helping Europe.  We’re trying to help Europe. \n\nOn top of this, Zelenskyy admits that half of the money that we sent them is missing.  They don’t know where the money is.  He said, “Well, we don’t know where half of it is.”  That’s great.  Wonderful.  (Laughter.)\n\nHe refuses to have elections.  He’s low in the real Ukrainian polls.  I mean, how can you be high with every city is being demolished?  It’s hard to be high.  Somebody said, “Oh, no, his polls are good.”  Give me a break.  (Laughter.)  Every city is being demolished.  They look like a demolition site, every single one of them. \n\nAnd the only thing he was really good at was playing Joe Biden like a fiddle.  He played him like a fiddle.  That’s an expression we use, Yasir, to say that he’s pretty easy.  Pretty easy.  (Laughter.)\n\nA dictator without elections, Zelenskyy better move fast or he’s not going to have a country left.  Got to move.  Got to move fast, because that war is going in the wrong direction. \n\nIn the meantime, we’re successfully negotiating an end to the war with Russia — something all admit that only Trump is going to be able to do and the Trump administration.  We’re going to be able to do it.  I think Putin even admitted that.\n\nBiden never tried.  Europe has failed to bring peace.  And Zelenskyy probably wants to — maybe he wants to keep the gravy train going.  I don’t know what’s the problem, but he hasn’t been able to — he’s very upset that he wasn’t invited — he could have come if he wanted to — but that he wasn’t invited to Saudi Arabia.  But he’s been working for three years.  There’s never been even meetings or phone calls to stop this war. \n\nIt’s a horrible thing.  I figure Russia has lost 900,000 soldiers.  I think that Ukraine has lost probably 700,000, and it’s a terrible thing.  You’ll see body parts — bodies and body parts all over the field.  All over.  We see them through — very accurately through satellites. \n\nI love Ukraine, but Zelenskyy has done a terrible job.  His country is shattered, and millions and millions of people have unnecessarily died.  And you can’t bring a war to an end if you don’t talk to both sides.  You got to talk.  They haven’t been talking for three years. \n\nSo, we hope to see a ceasefire soon and to reestablish stability in Europe and the Middle East.  (Applause.)\n\nBut as I — thank you very much.  And as I’ve said before, it’s my hope that my greatest legacy will be as a peacemaker and a unifier.  That would be a great legacy.  (Applause.)\n\nSo, in conclusion, the golden age of America is upon us, and I’m inviting everyone here today and every citizen across our land to take part in the most extraordinary period of peace, prosperity, growth, innovation, wealth creation, and expansion the world has ever seen. \n\nWe’re on our way.  I mean, everyone is talking about us.  Three weeks.  We’re in there for a couple of days more than three weeks, and everyone is talking about it.  You have to see the crowds of people outside.  It’s pretty amazing what’s happening. \n\nWe’re on the verge of soaring markets, surging incomes, booming production, groundbreaking technologies, thrilling discoveries, and a quantum leap in the quality of life.  Absolutely, a quantum leap. \n\nOne day very soon, our country will have the greatest economy in the history of the world, because we once again have a president who puts America first.  And we put America first, and your country should put your country first, but in the end, we want America first.  And when it’s all beautiful, which it’s going to be pretty soon, we want to help other countries and you want to help other countries. \n\nBut, you know, I tell your leaders — and some of the leaders are in this room right now — you got to put your country first.  Whether it’s Saudi Arabia, whether it’s something else, you’re going to put your country first, but we’re going to have plenty left over to help others also. \n\nAs long as you invest in America, build in America, and hire in America, that means that I’m fighting for you.  I am fighting very hard for you.\n\nTogether, we’re going to make the United States of America bigger, better, bolder, richer, and greater than ever before.  It’s going to be stronger than ever before.  We’re going to be a peacemaker and a peacekeeper.  We’re going to stop people from these stupid, never-ending wars.  We’re not going to partake in them ourselves, but we’ll be stronger and more powerful than anybody by far.  And if it ever came to war, there is nobody that will be able to come close to us, but we don’t think that’s going to ever happen. \n\nSo, I want to thank you all very much.  It’s a great honor to be here. \n\nAnd I think somebody said they’re going to ask questions, and I didn’t say, “Gee, what are the questions,” like Biden does.  I say, “Just ask.  It doesn’t matter.”  You ask a question, and I give an answer. \n\nSo, I think, Richard, you’re going to come up and you’re going to give me some questions. \n\nThank you very much.  (Applause.)\n\nMR. ATTIAS:  Thank you.  Thank you very much, Mr. President.  Please, a round of applause for the president of United States of America.  Thank you.  (Applause.)\n\nTHE PRESIDENT:  Thank you.\n\nMR. ATTIAS:  Mr. President, thank you for accepting to take a few questions.  Twenty years ago, I don’t know if you will remember, we were under the same roof in Orlando, and you were delivering an amazing speech in front of 3,000 sales rep, giving them the best advice to be successful.  So, what is the best piece of advice that you have ever received?\n\nTHE PRESIDENT:  Well, I think it was watching my father.  You know, my father was a very hard worker, and he just worked hard and he was very smart.  He had good genetics.  His brother was the longest-serving professor in the history of MIT, Dr. John Trump.  And my father was every bit as smart, but my father was — had to work. \n\nHe was older, and he put his brother through school.  In fact, he once said, “Boy, I put him through so much school.”  He had three different degrees, and they asked him to stay on at MIT.  But my father was the same ilk. \n\nAnd I noticed that my father was a happy man, and what he did is he worked.  He just worked all the time.  He worked, worked, worked, and he loved it. \n\nAnd, really, I think the best piece of advice I got from that is you have to love what you do, and if you love what you do, you’re going to have a happy life.  If you don’t — I mean, I see so many people, they’re in businesses that they don’t want to be in.  They’re in businesses that, you know, they’re bored in or they’re not good at, they don’t have a natural ability at it.  There is such a thing as natural ability, whether it’s sports or acting or anything else.  I mean, some people have an ability for something.  Try and find that ability.\n\nBut you have to love what you do.  If you love what you do, you’re going to be — at least you have a good chance of being successful.\n\nMR. ATTIAS:  Mr. President, it’s almost time for — (applause) — for an early dinner.  So, if you are throwing a dinner party, and you can invite three fascinating guests, living or dead, who would you bring? \n\nTHE PRESIDENT:  Well, they’re all sitting right in the front row.  (Laughter and applause.)  Yasir, are you ready? Mohammed, are you ready?  Steve Witkoff. \n\nAnd we have Mr. — the most important person, at least until the World Cup is over, is here.  Gianni, stand up.  He gave the United States the World Cup.  (Applause.)  Gianni, thank you very mu- — I didn’t know you were here.  That’s very good.  He’s the king of soccer.  That’s not bad.  And you’ve done a fantastic job.\n\nYou know, but it’s very interesting, when I was president, I got the World Cup and I got all of the — you know, we have the 250 anniversary, so that fell in this administration.  That’s a big deal: 250 years.  But we have all of these things happening, and I also got the Olympics. \n\nAnd I was called by the mayor of Los Angeles, “Sir, would you call up the Olympic Committee because” — it was at that time — “President Obama will not take their phone call.  And we’re going to get the Olympics in Los Angeles.” \n\nAnd, by the way, they’ve recommitted to Los Angeles at a level that — you know, I was very worried about that.  And they’ve — the opposite.  You know, somebody could have said, “Well, we’re going to do it someplace else until” — they have actually recommitted.  They’re going to make it bigger and better than ever.  So, I want to let you know that.  (Applause.)\n\nBut I got — I had the Olympics.  So, I got the Olympics.  I got the World Cup, and I said — and the 250, but that one I didn’t get.  But it was there.  It was in this term. \n\nAnd I ran an election, and we did fantastic in 2016.  We did much better — millions and millions — tens of millions, but millions and millions of votes better.  And bad things happened, and I didn’t get that one. \n\nAnd I said, “You know” — when I originally signed the Olympics, I said, “I won’t be able to even be president, and I got the Olympics,” because if I didn’t — when I spoke with the people — the organizing committee and the people in different parts of the world — they asked me to do it because the president wouldn’t do it.  I was president-elect, and I gave them a talk.  I couldn’t get them off the phone.  They were starving for love.  And the bottom line: They gave us the Olympics. \n\nAnd I said, “You know, isn’t it sad I won’t be president?”  Then we had the election result, and now I’m president for the Olympics and for the World Cup.  (Applause.)  So, I’m very happy about that, Gianni.  Thank you very much. \n\nThank you, G- — (laughs) — I’ll be there.  I promise, I’ll be there.\n\nMR. ATTIAS:  And, by the way, Mr. President, backstage, you have a gift from Gianni.  He gave us the first ball with your name —\n\nTHE PRESIDENT:  Ooh —\n\nMR. ATTIAS:  — which will be played for the cup — World Cup in America.\n\nTHE PRESIDENT:  That’s great.  It’s going to be great.  Thank you, Gianni, very much.  (Applause.)\n\nMR. ATTIAS:  I doubt that any day you will take a sabbatical year, but if you could take a sabbatical year, Mr.  President, what unconventional thing would you do?\n\nTHE PRESIDENT:  What was the word?\n\nMR. ATTIAS:  Sabbatical.  You don’t work for one year.\n\nTHE PRESIDENT:  Oh, sabbatical.  I thought — thought you said “sabbath.”  (Laughter.)  That’s a big difference.  It’s almost the opposite, when you think about it.  Right?  (Laughter.)\n\nI think what I’d do is — look, what I’m doing now is the most exciting job in the world.  It’s a hard job, not an easy job.  It’s a nasty job.  It could be a lot easier with — you know, I — I think that the — the news media has to straighten themselves out, because people are getting it.  You know, they — they’re losing tremendous popularity, and they’ve lost their prestige and they’ve lost their credibility.  And I think it’s a very important thing, the news media, but I think they have to straighten themselves out, because the people are going around them.\n\nNow, they have so many different things with — like Elon with X, which was a big — a big thing.  And we have Truth, which has been fantastic.  And we have so many other things that you don’t really need traditional.\n\nBut I — I will tell you that there is just nothing I could do to enjoy my life, whether it’s that or anything else that you’d ask, because this is the ultimate.  I mean, I had to make a big decision, and it was a very risky decision, because if I would have lost, my life would have been a much different life.  It would have been a very nasty life.  They were going after me at levels that nobody has ever seen before — not Andrew Jackson, not Abraham Lincoln. \n\nYou know, the historians say that the president that was treated the worst by far by the media and overall was Andrew Jackson.  In fact, his wife died of heartbreak.  They were treated really rough.  And Abraham Lincoln was second, but he had a civil war.  You know, you can understand that. \n\nBut nobody was treated like me.  Nobody.  And I will tell you, you learn a lot about yourself.  But there’s nothing I’d rather do. \n\nI had to make a decision: Do I do this?  Because if I lost, it would have been very, very bad.  It was dangerous, actually.  Very dangerous in so many different ways. \n\nAnd I decided to do it.  And I said, “I have to win, because if I don’t” — when I spoke to a friend of mine the other night, he said, “You know, if you lost, it would have been very” — it was actually Sean Hannity, just before we did the interview last night.  He said, “Boy, if you would have lost, it would have — you would have had a tough life.  You would have had a very tough life.” \n\nSo, it was — there was a certain amount of courage involved in this decision to run.  And it’s a great honor to win by this much — to win all seven swing states, the popular vote. \n\nPopular vote doesn’t get won that much by Republicans, for whatever reason.  I think that’s changing, because, again, we’re the party of common sense and they’re the party of some real bad things. \n\nAnd I think they’ll change.  I think they have to change.  It would be wonderful.  I’m going to be having lunch with some of the Democrats next week, and it would be wonderful if we could work together.  I think working together would be great.  But they have to change.  You can’t get elected on the programs that they want, and that’s one of — that’s really what America wants to see.\n\nSo, there’s nothing I’d rather do than what I’m doing right now.  (Applause.)\n\nMR. ATTIAS:  When we started this conference — Mr. President, when we started this conference, Yasir and I, His Royal Highness Crown Prince told us, “I want that to be the place where people will come to understand where to invest in terms of geographies and sector.”  So, what is the best investment you have made in your personal growth, Mr. President?\n\nTHE PRESIDENT:  Well, I was involved in real estate from, you know, most of my life and was — you know, guys like Witkoff will tell you I was really good at it and I was successful at it — very successful at it.  I’ve been involved in things prior to being president, but during the four years — during the last four years, you know, I followed sort of the trends, and I’ve made a lot of money with following some of these trends. \n\nAnd, you know, it’s — again, it’s something that you do.  You — it’s — I really believe that some people have instinct.  I think I’ve always had an instinct for making money.  I make money.\n\nAnd I went into show business.  I had one of the most successful shows on television.  I wrote books, and they were all bestsellers.  Virtually every book a bes- — was a big bestseller, some really big bestsellers. \n\nAnd so, I don’t know, it’s — whatever I do, I just want to make it successful.  It’s very important to me. \n\nThere are many ways to make money.  You can be in many different fields, and a lot of them is being in the right country.  You know, if you’re in a certain country — our country was actually getting very bad — a very dangerous place, actually.  Bad things were happening.  But if you’re in a certain country, you have a chance to do well.  And no matter how good you are, if you were born into the wrong country, you’re not going to make money. \n\nNow, you can do other things.  You can attain power, I guess.  Maybe it’s the wrong kind of power, but it’s power.  But being in the right country, where you have the right incentives and, you know, entrepreneurship, et cetera.\n\nAnd America has always been sort of at the top — or one of the top, but always pretty much at the top.  But it was losing that — it was losing that position and, I think, losing it rapidly.\n\nThis last administration — look, I don’t want to be — I wish I could say I — I wouldn’t have run if — if I thought Biden was doing a good job, if I thought they were — I wouldn’t have run, because, as I said, it was very dangerous to run in a lot of ways.  In fact, my ear will show that when you look at it closely.  My ear — I have that throbbing feeling every once in a while.  But it was dangerous in a lot of different ways.  But he was so bad that I had no choice but to do it. \n\nIf I thought he was doing a great job, I wouldn’t have run, and I would be very happy.  I actually wanted him to do a good job.  I was saying, “Do this.  Do that.”  I’m telling them do things.  They should have done what I said.  And — but I would have been — I would have been very happy not to have run and, frankly, to have seen somebody do a good job.  But our country was going to hell, and I really sort of had to run.\n\nMR. ATTIAS:  If you were a historical ruler, would you prefer to rule during war or peace?\n\nTHE PRESIDENT:  Well, I — I’d — I want to be, again, a peacemaker and I want to keep us out of war.  But sometimes, to do that, you have to have a very strong country.  You have to have a very strong military.  And as I said, we have a much stronger military than anyone would know. \n\nWe have the best equipment, and I bought a lot of it.  I rebuilt our military in the first four years.  I rebuilt it.  We gave a lot of it away to Afghanistan, to the Taliban, stupidly — but that’s a very small amount, relative.  It was billions and billions, but it’s still a very small amount relatively to what we built.  But I rebuilt — largely rebuilt our military. \n\nNow I’m going to have to do it again, because so much has been given away, so much has been treated so badly.\n\nAnd — but to keep peace, you really have to — I have a thing: strength through — and I mean it, you really have it.  You have strength, and you need the strength, but it’s really peace through strength, because without the strength, it’s going to be very hard to have peace because you’re going to be taken over, bad things are going to happen.  So, you really want to have peace through strength, and that’s where I’ve done it.\n\nHaving strength, having power, in that sense, to protect yourself and your people is a very important thing.  Hopefully, you don’t have to use that power. \n\nI will tell you, I was dealing with President Putin very successfully on denuclearization.  We were talking about it very seriously, and then COVID came and lots of things came.  And we had also talked to China about it. \n\nNow, Russia and us have the biggest nuclear by far.  China is not close, but they will be close.  In three or four years or five years, they’ll be equal.  But we were going to talk to China, and I spoke to President Xi about it very successfully.  I think we were going to denuclearize it.  We were — had to get the smaller nuclear powers, of which there are four — three, maybe, but four probably — to do something.  We would have been able to do that.  But I was having very strong talks with President Putin about denuclearization. \n\nAnd, you know, if you’re president, you get presentations about what we’re building; what we’re having; the power of weapons; the power of many things besides weapons, per se. \n\nWhen I saw the power of nuclear weapons — and we can never let that happen.  If that happens, the ball game will be — the world will be destroyed.  The power is so enormous.  You look at Hiroshima, you look at Nagasaki — multiply that times 500 times, and the world would be destroyed. \n\nSo, you want somebody as your president or you want somebody as your leader that understands that.  We just can’t let that happen. \n\nWe can’t let other countries get nuclear weapons — not only Iran.  Iran is a good example, and maybe the one that people think about, but we can’t let that happen. \n\nThe power of weaponry today is so enormous that the world — the world would disintegrate.  So, we can’t let it happen.\n\nMR. ATTIAS:  Mr. President, if you had to describe United States of America in just three words, what would they be?\n\nTHE PRESIDENT:  In three words?\n\nMR. ATTIAS:  Three words.\n\nTHE PRESIDENT:  Love, respect, and strength.  (Applause.)\n\nThat’s a tough question.  That might be my best answer, Yasir.  That’s — that reminds me of high school, that one.  But that may have been the toughest question, actually. \n\nDo you think Joe Biden could have done that?  I don’t think so.  (Laughter.)  I don’t think so.\n\nMR. ATTIAS:  We’re almost at the end, Mr. President.  But talking about United States of America, what is one cultural habit in the Uni- — in the U.S. business that the rest of the world could learn from?  What is the best practice that (inaudible).\n\nTHE PRESIDENT:  Well, I think we love our families, but I think a lot of the world loves their families, you know?\n\nI was speaking to the head of Mexico, because I complain constantly about people pouring in.  Now our border is the strongest border we’ve ever had.  We’ve gone from the worst border ever in history to the strongest border.  But I was speaking to the president of Mexico — a very wonderful woman, actually — and I said — we were talking about drugs — “You can’t let people come through your country and come into the country.”  You know, I was not that nice, but they understood what I was saying. \n\nAnd she said something that really got me.  She said — I said, “Are you a — you’re not a big drug-taking nation?”  And she said, “No, we are not a consumer.”  And I said, “A consumer.  What a — you know, an interesting word.  ‘We’re not a consumer nation.  We’re not a consumer of drugs.’”  I said, “What an interesting — and why — why is that?”  He said — she said, “Well, we have very strong family values.”  I said, “But we do too.  We do too.”  We have very strong — our families are devastated by what’s happening with fentanyl.\n\nAnd China will not be doing — we’re going to make a deal with China.  We’re not letting that happen anymore.  And I had a deal — by the way, before I left, I had a deal with President Xi where they were going to give the maximum penalty to anybody making fentanyl and sending it into the United States, and their maximum penalty is the death penalty.  And it would have stopped.  But when the election turned out to be a rigged election — but that’s okay — when election turned out to be — it was an election that shouldn’t have happened. \n\nAll the — all the things that happened — I give you an example: We wouldn’t have had October 7th Israel attack.  We wouldn’t have had Ukraine and Russia fighting.  We wouldn’t have had inflation.  We wouldn’t have had all of these things that, you know, happened. \n\nBut in speaking with her — she said about family values —  I said, “Well, you’re not really saying anything there, because we have great families too.  We have great family values.”  She said, “Plus, we advertise a lot.”  I said, “Ooh.  You mean you advertise about how bad drugs are?”  “Yes, we do.  We spend a lot of money on advertising.”  And I said, “Unbelievable.” \n\nThat was such a great conversation, because we’re going to spend hundreds of millions of dollars advertising how bad drugs are so that kids don’t use them — that they chew up your brain; they destroy your teeth, your skin, your everything.  (Applause.)\n\nAnd I thanked her for that.  You know, I — I make so many calls, and I never learn anything from anybody.  I know everything, and I never learned anything from anybody.  (Laughter.)  And I spoke to this woman — as soon as she said it — she didn’t have to say exactly what — I said, “Exactly.  What a great idea.” \n\nAnd I think we’re going to have a — and I saw pieces of it.  We’re going to go in with $100 million and then another $100 million initially.  But I saw some of the ads, and they are really violent.  I said, “You have to make them strong.”  Your skin practically comes off after a period of time.  You lose your hearing.  You — you lose your teeth.  You lose — I mean, you — it — it is terrible, and we show this happening to people. \n\nAnd I think we’re going to — you know, we — we did very well with — we had blue-ribbon committees, headed up by the first lady of the United States and a lot of other people that — you know, they have no idea the viciousness of these cartels and these people.  And they’re smarts.  I mean, they’re very smart, tough people — making a fortune, by the way — an absolute fortune. \n\nBut we got it down 18 percent, which was a record.  But 18 percent is not great, when you think about it.  I think we could get it down 50 or 55 or maybe even 60 percent with advertising. \n\nSo, she really gave me something.  I — I was going to call her and tell her that she did, but now I don’t have to call her because she’s going to be seeing this right now.  (Laughter.)\n\nSo, to the president of Mexico: Thank you very much.  I appreciate it.\n\nBut we’re going to do a great advertising campaign saying how bad it is, how drugs are so bad for you.  (Applause.)\n\nMR. ATTIAS:  My last question, Mr. President.  You have mentioned briefly in your speech about the legacy.  What would you like your legacy to be, if you can tell us more about it?\n\nTHE PRESIDENT:  That I came into a country that was great but is in trouble, and I made America great again, and I got it out of trouble.  And people respect America now.  And we were a country of peace, and we brought peace to the rest of the world.  (Applause.)\n\nMR. ATTIAS:  Thank you.  Thank you very much, Mr. President.  (Applause.)\n\nTHE PRESIDENT:  Thank you very much, everybody.  Thank you.  (Applause.)\n\n                         END                    6:54 P.M. EST\n",
  "summary": "# Summary\n\nOn February 19, 2025, President Donald Trump addressed the Future Investment Initiative Institute Priority Summit held at the Faena Hotel in Miami Beach, Florida. During his speech, he highlighted economic and political strategies aimed at bolstering the United States' growth and global standing. Under his administration's policies, Trump announced various initiatives aimed at reducing government waste, reforming immigration and Social Security, and advancing energy independence. He also emphasized efforts to maintain global peace, with specific focus on the Middle East and Ukraine.\n\nTrump discussed significant international investments, citing examples like DAMAC and SoftBank, which plan to bring substantial financial commitments to America, thereby creating new jobs. Additionally, he emphasized advancements in artificial intelligence and crypto-friendly policies. With a renewed focus on deregulation, tax cuts, and domestic manufacturing incentives, Trump aims to usher in a 'golden age' for the American economy, encouraging businesses worldwide to invest in the United States.\n",
  "eli5": "President Trump spoke about making America a better place by making it cheaper to live, building more stuff here, and keeping peace in the world. He wants people to work in offices again and stop wasting money on silly things.",
  "keywords": [
    "Donald Trump",
    "Future Investment Initiative",
    "Miami Beach",
    "economic strategy",
    "investment",
    "government reform",
    "international relations",
    "energy independence"
  ],
  "issues": [
    "Lack of specific data or sources for economic claims",
    "Potential bias in reporting election results",
    "Claims about Social Security discrepancies"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}