{
  "title": "President George Washington's Birthday, 2025 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President George Washington's Birthday, 2025",
  "og:description": "By the President of the United States of America A Proclamation Today, our Nation commemorates the Father of our country, the patriarch of our freedom,",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/president-george-washingtons-birthday-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-17T21:03:57+00:00",
  "article:modified_time": "2025-02-18T22:30:25+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPRESIDENT GEORGE WASHINGTON’S BIRTHDAY, 2025\t\t\t\t\n\nFebruary 17, 2025\n\nBy the President of the United States of America\n\nA Proclamation\n\nToday, our Nation commemorates the Father of our country, the patriarch of our freedom, and a timeless exemplar of valor and virtue:  the first President of the United States, George Washington.  On President Washington’s Birthday, we honor his heroic legacy and steadfast love of country.\n\nAs our Nation’s first chief executive, President Washington was a key architect of our Federal Government and constitutional order.  He was a visionary unifier, a fierce advocate for an America First foreign policy, and a man of devout faith.  To this day, he lives on in our souls as the original American patriot, the face of the American Revolution, and a legendary titan of American liberty.\n\nThrough his presidency, private life, and personal conduct, George Washington was a model of public service and a living reminder that no challenge is too great for the strength of the American spirit.\n\nIn the winter of 1776, with the Revolutionary War raging and the Continental Army on the verge of collapse, General Washington refused to surrender.  Low on supplies and teetering on the edge of defeat, he carried on, writing “Victory or Death” before departing for battle.  In the waning hours of Christmas night, Washington’s Continental Army ventured through miles of ice-cold darkness with nothing but patriotism in their hearts, courage in their veins, and faith in their God — going on to defeat the enemy and forever change the course of history.\n\nPresident Washington’s unflinching devotion to the common good remains the mandate of every American citizen.  As my Administration continues the work of reforming our country, we look to George Washington, the sacrifices he made, and the victories he won.\n\nNOW, THEREFORE, I, DONALD J. TRUMP, President of the United States of America, by virtue of the authority vested in me by the Constitution and the laws of the United States, do hereby proclaim February 17, 2025, as a reserved holiday commemorating George Washington’s Birthday.\n\n     IN WITNESS WHEREOF, I have hereunto set my hand this\n\nseventeenth day of February, in the year of our Lord two thousand twenty-five, and of the Independence of the United States of America the two hundred and forty-ninth.\n",
  "summary": "The proclamation presented is issued by President Donald J. Trump to commemorate George Washington's Birthday on February 17, 2025. It pays tribute to George Washington's role as the first President of the United States and asserts his significance as a unifying figure who helped shape the Federal Government and America's constitutional foundation. The document describes Washington's patriotic leadership during pivotal moments in the Revolutionary War, notably highlighting his decision to continue fighting despite adversity, which culminated in his crossing of the Delaware River and subsequent victory. \n\nPresident Trump uses this occasion to reflect on how George Washington's unwavering commitment to public service and national unity serves as an enduring example for current and future American citizens. The proclamation underlines that Washington's values are aligned with the objectives of Trump's administration as it aims to implement reforms and uphold the common good. The proclamation officially designates the date as a day to honor George Washington's legacy.",
  "eli5": "President Trump is telling everyone that February 17, 2025, will be a special day to remember George Washington, who was the very first President of the United States. Washington was a hero and helped America win its freedom a long time ago!",
  "keywords": [
    "George Washington",
    "Donald J. Trump",
    "Presidential Proclamation",
    "February 17, 2025",
    "American Revolution",
    "patriotism",
    "federal government"
  ],
  "issues": [
    "The document is set in a future context, questioning President Trump’s role beyond an elected term."
  ],
  "citations": [],
  "document_type": "Proclamation"
}