{
  "title": "President Trump Announces Presidential Delegation to attend the Commemoration of the 80th Anniversary of the Liberation of Auschwitz-Birkenau in Oświęcim, Poland – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Presidential Delegation to attend the Commemoration of the 80th Anniversary of the Liberation of Auschwitz-Birkenau in Oświęcim, Poland – The White House",
  "og:description": "FOR IMMEDIATE RELEASE01/24/25 President Trump Announces Presidential Delegation to attend the Commemoration of the 80th Anniversary of the Liberation of",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/president-trump-announces-presidential-delegation-to-attend-the-commemoration-of-the-80th-anniversary-of-the-liberation-of-auschwitz-birkenau-in-oswiecim-poland/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-24T16:38:24+00:00",
  "article:modified_time": "2025-01-28T15:09:33+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tPresident Trump Announces Presidential Delegation to attend the Commemoration of the 80th Anniversary of the Liberation of Auschwitz-Birkenau in Oświęcim, Poland\t\t\t\t\n\nJanuary 24, 2025\n\n**FOR IMMEDIATE RELEASE**01/24/25\n\n**President Trump Announces Presidential Delegation to attend the Commemoration of the 80th Anniversary of the Liberation of Auschwitz-Birkenau in Oświęcim, Poland**\n\nPresident Donald J. Trump today announced the designation of a Presidential Delegation to Poland to attend the Commemoration of the 80th Anniversary of the Liberation of Auschwitz-Birkenau on January 27, 2025.The Honorable Steve Witkoff, United States Special Envoy to the Middle East and Howard Lutnick, nominee for Secretary of Commerce, will lead the delegation.**Members of the Presidential Delegation:**Mr. Charles Kushner, United States Ambassador to France NomineeMr. Isaac PerlmutterMs. Laura PerlmutterMs. Allison LutnickMr. Robert BookMr. Michael FriedmanMr. Boris Epshteyn Mr. Daniel Lawton, Chargé d’Affaires a.i., United States Mission to PolandMs. Ellen Germain, United States Special Envoy for Holocaust Issues\n",
  "summary": "On January 24, 2025, President Donald J. Trump announced the formation of a Presidential Delegation to attend the 80th Anniversary of the Liberation of Auschwitz-Birkenau, set to take place on January 27, 2025, in Oświęcim, Poland. The delegation will be led by Steve Witkoff, the United States Special Envoy to the Middle East, and Howard Lutnick, nominee for Secretary of Commerce. This event commemorates a significant historical milestone and emphasizes the ongoing importance of Holocaust remembrance.\n\nThe members of the delegation include notable figures such as Mr. Charles Kushner, Mr. Isaac Perlmutter, Ms. Laura Perlmutter, Ms. Allison Lutnick, Mr. Robert Book, Mr. Michael Friedman, Mr. Boris Epshteyn, Mr. Daniel Lawton, Chargé d’Affaires at the United States Mission to Poland, and Ms. Ellen Germain, United States Special Envoy for Holocaust Issues. This group reflects a broad inclusion of individuals from different backgrounds, emphasizing the bilateral relationship between the U.S. and Poland, and showcasing dedication to Holocaust education and memory.",
  "eli5": "President Trump is sending a group of important people to Poland to remember a very sad event that happened a long time ago, when many people were freed from a place called Auschwitz.",
  "keywords": [
    "President Donald J. Trump",
    "Presidential Delegation",
    "Liberation of Auschwitz-Birkenau",
    "Oświęcim, Poland",
    "Holocaust Remembrance",
    "Steve Witkoff",
    "Howard Lutnick"
  ],
  "issues": [
    "Future political context as of 2025 under President Trump",
    "Nominees mentioned might have conflicts of interest"
  ],
  "citations": [],
  "document_type": "Press Release"
}