{
  "title": "President Trump is Undoing Biden’s Economic Damage – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump is Undoing Biden’s Economic Damage",
  "og:description": "President Donald J. Trump took office on a promise to lower costs for the American people — and the actions he has taken are already paying off while the",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/president-trump-is-undoing-bidens-economic-damage/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T02:38:47+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tPresident Trump is Undoing Biden’s Economic Damage\t\t\t\t\n\nMarch 4, 2025\n\nPresident Donald J. Trump took office on a promise to lower costs for the American people — and the actions he has taken are already paying off while the work continues to turn back the economic plague unleashed by the Biden Administration.\n    - President Trump  put into action  a comprehensive plan to lower egg prices.\n    - President Trump  directed  the heads of all executive departments and agencies to “deliver emergency price relief … to the American people and increase the prosperity of the American worker.”\n    - President Trump  established  the National Energy Dominance Council to maximize use of the U.S.’ extensive energy resources — thereby enabling lower energy prices.       - Crude oil prices have  fallen  over 5% since President Trump took office. \n    - The Trump Administration postponed burdensome Biden-era efficiency standard rules for the following appliances, saving American consumers large sums:       - Central air conditioners: Biden rules were slated to  make  air conditioners $1,100 more expensive.\n      - Gas water heaters: Biden rules were slated to  make  water heaters $2,800 more expensive.\n      - Gas stoves: Biden rules were slated to  make  stoves $3,250 more expensive.\n      - Clothes washers and dryers: Biden rules were slated to  make  washers $200 more expensive.\n      - Light bulbs: Biden rules were slated to  make  light bulbs $140 more expensive. \n    - The Trump Administration is  requiring  agencies to identify at least ten existing rules or regulations to be repealed for every one new rule or regulation they promulgate — putting the country on track to severely reduce costs for everyday Americans.       - In 2023, the total cost of federal regulations was a record-breaking $2.1 trillion, or $15,788 per U.S. household,  according to one analysis  — while another  found  the cost of federal regulations was even greater at $3.079 trillion in 2022. \n    - President Trump directed the Department of Government Efficiency (DOGE) to root out bureaucratic waste — and within weeks, it has already  saved  taxpayers billions of dollars.\n    - The Trump Administration eliminated the overbearing Biden-era electric vehicle mandate by resetting Corporate Average Fuel Economy (CAFE) standards.       - NBER economist Mark R. Jacobsen  estimates  that “a one-mpg increase in CAFE standards costs consumers of all income levels approximately 0.5% of their income in the first year of the increase. By the 10th year following the increase, however, this cost becomes regressive, as the increase drives up the price of used cars. A one-mpg increase in CAFE standards costs consumers earning less than $25,000 per year 1.12% of their income, but only costs consumers earning more than $75,000 per year 0.41% of their income.”\n",
  "summary": "President Donald J. Trump has initiated a series of measures aimed at reversing economic difficulties attributed to the Biden Administration. As of March 4, 2025, his administration has implemented plans to lower egg prices and directed executive agencies to provide emergency price relief. A National Energy Dominance Council has been established to lower energy prices, succeeding in reducing crude oil prices by over 5% since his tenure began. Additionally, Trump has halted various efficiency standard rules from the previous administration to prevent increased consumer costs on appliances. \n\nTrump's administration is actively seeking to cut regulatory burdens, aiming to repeal ten regulations for every new one introduced. In a bid to reduce government waste, the Department of Government Efficiency (DOGE) has reportedly saved taxpayers billions. Furthermore, Trump has dismantled the Biden-era electric vehicle mandate, adjusting CAFE standards to avoid potential income regressivity. These efforts are part of a broad strategy to lower costs for American households, which they argue had risen due to federal regulations amounting to trillions of dollars annually.",
  "eli5": "President Trump is working hard to make things cheaper for everyone in America by using a lot of energy from the U.S., stopping expensive rules for homes and cars, and saving money that the government spends unnecessarily.",
  "keywords": [
    "President Trump",
    "economic policy",
    "Biden Administration",
    "energy prices",
    "regulatory reform",
    "consumer costs",
    "appliance standards",
    "government efficiency",
    "CAFE standards"
  ],
  "issues": [
    "Verification of economic outcomes attributed to these policies",
    "Lack of specific data supporting claims of savings and price reduction",
    "Potential environmental concerns related to reduced appliance efficiency and energy dominance"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}