{
  "title": "President Trump Announces Appointments to the White House Office of Political Affairs – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Appointments to the White House Office of Political Affairs",
  "og:description": "Trevor Naglieri will join the White House as Special Assistant to the President and Deputy Director of the Office of Political Affairs. Naglieri",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/president-trump-announces-appointments-to-the-white-house-office-of-political-affairs/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-19T16:57:30+00:00",
  "article:modified_time": "2025-02-19T16:57:31+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tPresident Trump Announces Appointments to the White House Office of Political Affairs\t\t\t\t\n\nFebruary 19, 2025\n\n**Trevor Naglieri** will join the White House as Special Assistant to the President and Deputy Director of the Office of Political Affairs. Naglieri previously served as Political Budget, Paid Voter Contact, &amp; External Campaigns Research Director for the Trump-Vance 2024 Campaign in the General Election, and as New Hampshire State Director for Donald J. Trump for President in the Primary Campaign.**Christopher Escobedo** will join the White House as Special Assistant to the President and Western Regional Political Director of the Office of Political Affairs. Escobedo previously served as State Director in the battleground state of Arizona for the Trump-Vance 2024 Campaign.**Jon George** will join the White House as Special Assistant to the President and Southeast Regional Political Director of the Office of Political Affairs. George previously served as State Director in the battleground state of Georgia for the Trump-Vance 2024 Campaign.**Marshall Moreau** will join the White House as Special Assistant to the President and Midwest Regional Political Director of the Office of Political Affairs. Moreau previously served as National Volunteer Director for the Trump-Vance 2024 Campaign in the General Election, and as Iowa State Director for Donald J. Trump for President in the Primary Campaign.**Ashley Walukevich** will join the White House as Special Assistant to the President and Northeast Regional Political Director of the Office of Political Affairs. Walukevich previously served as State Director in the battleground state of Pennsylvania for the Trump-Vance 2024 Campaign.**Samantha Feldman** will join the White House as a Staff Assistant in the Office of Political Affairs. Feldman previously served as an Election Integrity Data Coordinator for the Trump-Vance 2024 Campaign.**Jack Mahoney**will join the White House as a Political Coordinator in the Office of Political Affairs. Mahoney previously served as an associate for Fabrizio, Lee &amp; Associates during the Trump-Vance 2024 Campaign.**Trey Senecal** will join the White House as a Political Coordinator in the Office of Political Affairs. Senecal previously served as Political Coordinator for the National Republican Congressional Committee.\n\n**About the Office of Political Affairs:**The White House Office of Political Affairs (OPA) reports to Assistant to the President and White House Deputy Chief of Staff, James Blair. The Office is managed by Deputy Assistant to the President and OPA Director, Matt Brasseaux. The White House Office of Political Affairs serves as the chief correspondent between state and national political affairs across the country and the Administration, with an emphasis on educating and communicating the President’s legislative agenda to the American people.\n",
  "summary": "On February 19, 2025, President Donald Trump announced new appointments to the White House Office of Political Affairs (OPA). The appointees include Trevor Naglieri, Christopher Escobedo, Jon George, Marshall Moreau, Ashley Walukevich, Samantha Feldman, Jack Mahoney, and Trey Senecal. Each of these individuals brings specific experience from the Trump-Vance 2024 Campaign, having served in roles such as state directors in key battleground states or in national capacities for the campaign.\n\nThe OPA, under the leadership of Deputy Assistant to the President and OPA Director Matt Brasseaux and overseen by Assistant to the President and White House Deputy Chief of Staff James Blair, is responsible for coordinating political communications between the state and federal levels. The new appointees are expected to enhance the office's role in advancing the President’s legislative agenda and fostering effective engagement with the American public.",
  "eli5": "The President picked some people to help him talk to the states about his ideas. These people helped him during the last big election, so he trusts them to do a good job.",
  "keywords": [
    "President Trump",
    "White House",
    "Office of Political Affairs",
    "appointments",
    "2024 Campaign",
    "political strategy"
  ],
  "issues": [
    "No direct citation of legal or regulatory frameworks",
    "Potential bias due to political affiliations"
  ],
  "citations": [],
  "document_type": "Press Release"
}