{
  "title": "President Trump is Restoring Common Sense to Government – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump is Restoring Common Sense to Government",
  "og:description": "President Donald J. Trump believes government should work for the people — and his historic action has ensured government policies reflect the",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/president-trump-is-restoring-common-sense-to-government/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T02:32:29+00:00",
  "article:modified_time": "2025-03-05T02:32:30+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tPresident Trump is Restoring Common Sense to Government\t\t\t\t\n\nMarch 4, 2025\n\nPresident Donald J. Trump believes government should work for the people — and his historic action has ensured government policies reflect the longstanding values of the Americans it serves.\n    - President Trump  designated  English as the official language of the United States.\n    - President Trump  declared  an end  to lower standards in the name of discriminatory “diversity, equity, and inclusion” (DEI) initiatives.       - The Trump Administration  dismissed  Biden-era lawsuits against police and fire departments that were portrayed as racist for using writing tests, physical exams, and credit checks in their hiring processes. \n    - President Trump  ordered  an end to the weaponization of the Federal Government against American citizens.       - The Department of Justice immediately began  rooting out  politically motivated lawfare that occurred in the Biden Administration. \n    - President Trump  eliminated  discriminatory DEI offices, employees, and practices across the bureaucracy alongside a  return  to merit-based hiring —  including  at the Federal Aviation Administration, where the Biden Administration specifically recruited individuals with intellectual disabilities and psychiatric issues.       - As a result, taxpayer-funded PBS  closed  its DEI office, Disney  dropped  two of its DEI programs, Goldman Sachs  ended  its DEI policy, and Institutional Shareholder Services  announced  it would no longer consider the gender, racial, or ethnic diversity of company boards when making its voting recommendations.\n      - The Federal Communications Commission  opened  an investigation into discriminatory DEI policies at Comcast, an entity it regulates. \n    - President Trump  ordered  an end to all censorship of Americans by the federal government.\n    - President Trump  banned  COVID-19 vaccine mandates at schools that receive federal funding.\n    - President Trump  rolled back  the Biden-era push to mandate paper straws.\n    - President Trump  ordered  an end to anti-Christian bias in the Federal Government.\n    - President Trump  ordered  an examination of all regulations to assess any infringements on Americans’ Second Amendment rights.\n    - President Trump  directed  full enforcement of the Hyde Amendment, which bars taxpayer dollars from being used to fund or promote elective abortion.\n    - President Trump  ordered  the declassification of documents related to the assassinations of President John F. Kennedy, Jr., Sen. Robert F. Kennedy, and Rev. Dr. Martin Luther King, Jr.\n    - President Trump  proclaimed  February 9, 2025, as “Gulf of America Day” after the Department of the Interior officially  established it  on its mapping databases.\n    - The Department of Transportation  terminated  the approval for New York City’s burdensome “congestion pricing” scheme.\n",
  "summary": "On March 4, 2025, President Donald J. Trump announced a series of initiatives aimed at reforming various government policies. These actions include designating English as the official language of the United States and ending certain diversity, equity, and inclusion (DEI) initiatives seen as lowering standards. The Trump Administration also dismissed lawsuits from the Biden era against police and fire departments deemed discriminatory.\n\nAdditionally, the administration took steps to stop the Federal Government from restricting American freedoms, including ordering an end to censorship and banning COVID-19 vaccine mandates at federally funded schools. Trump also emphasized a return to merit-based hiring practices in federal agencies and initiated an examination of regulations related to Second Amendment rights. New national recognitions, such as \"Gulf of America Day,\" were also declared, and specific historical documents were ordered to be declassified.",
  "eli5": "President Trump wants to change some rules. He said everyone should speak English in America, and he stopped some rules that people thought were unfair. He also said no more rules about getting shots at school if they get help from the government.",
  "keywords": [
    "President Trump",
    "government reform",
    "official language",
    "diversity initiatives",
    "DEI",
    "censorship",
    "vaccine mandate",
    "Second Amendment",
    "Gulf of America Day",
    "declassification"
  ],
  "issues": [
    "The accuracy and feasibility of designating English as the official language.",
    "Legal implications of dismissing lawsuits and ending DEI initiatives.",
    "The potential impact on civil rights and inclusion efforts.",
    "Concerns about the safety implications of banning vaccine mandates.",
    "The factual basis for the claimed lowering of standards by DEI initiatives."
  ],
  "citations": [
    "Hyde Amendment (referenced in abortion funding context)"
  ],
  "document_type": "Article"
}