{
  "title": "President Trump, VP Vance Are Standing Up for Americans – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump, VP Vance Are Standing Up for Americans",
  "og:description": "President Donald J. Trump and Vice President JD Vance will always stand up for the interests of the American people and those who respect the United",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/president-trump-vp-vance-are-standing-up-for-americans/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-28T19:42:18+00:00",
  "article:modified_time": "2025-02-28T19:42:19+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tPresident Trump, VP Vance Are Standing Up for Americans\t\t\t\t\n\nFebruary 28, 2025\n\nPresident Donald J. Trump and Vice President JD Vance will always stand up for the interests of the American people and those who respect the United States’ position in the world — and will never allow the American people to be taken advantage of.\n\n[**President Trump**](https://x.com/RapidResponse47/status/1895528201713283105)**:****“Let me tell you, you don’t have the cards. With us, you have the cards — but without us, you don’t have any cards.”**\n    - More than half (52%) of Ukrainians want a quick end to the war and believe Ukraine “should be open to ceding some territory in exchange for peace,”  according to a November Gallup poll .\n    - Since martial law was declared in Ukraine, 1,000,050 Ukrainians have been  drafted  into military service. In October 2024, Ukraine announced it would be drafting another 160,000 — bringing the total number of conscripted Ukrainians to 1,160,050.       - The average  age  of Ukrainian troops is 43 years old.\n      - “Even if the West did come through with all the weapons they have pledged, ‘we don’t have the men to use them,’ one of Ukrainian president Volodymyr Zelensky’s close aides  told  Time’s Simon Shuster, revealing that the average age of a Ukrainian soldier has already reached 43.” \n    - One of Zelenskyy’s closest aides  told  TIME in 2023 that he is “[deluding] himself … We’re out of options. We’re not winning. But try telling him that.”\n    - The Ukrainian army is  facing rising desertions  as “ill-trained and exhausted soldiers [go] AWOL,” with the military further strained by struggles in recruiting and the “arrests of respected and popular combat officers.”\n\n[**President Trump**](https://x.com/RapidResponse47/status/1895527936939487722)**: “You’re gambling with World War III.”**\n    - Zelesnkyy himself has  acknowledged  that the situation in Ukraine could lead to WWIII, and that without U.S. aid, they would lose: “A third world war could start in Ukraine, continue in Israel, and move on from there to Asia, and then explode somewhere else.”\n\n[**President Trump**](https://x.com/RapidResponse47/status/1895528201713283105)**: “****I gave you the javelins to take out all those tanks. Obama gave you sheets.”**\n    - President Trump  gave  anti-tank javelin missiles to Ukraine, while Obama  gave  non-lethal aid only,  including  blankets.       - EURACTIV :  “ Poroshenko asks Obama for weapons, obtains blankets”       - President Trump  approved  lethal weapons sales to Ukraine in 2017: “The new arms include American-made Javelin anti-tank missiles, U.S. officials said.”        - President Trump  approved  a $39 million sale of defensive lethal weapons to Ukraine in 2019: “The new package will include Javelin anti-tank weapons, with one U.S. official saying it includes 150 missiles and two launchers.” \n\n[**Vice President Vance**](https://x.com/RapidResponse47/status/1895527936939487722)**: “You went to Pennsylvania and campaigned for the opposition in October.”**\n    - Zelenskyy was called out for  campaigning  against President Trump in Pennsylvania.       - “Zelenskyy was flown to Pennsylvania in an Air Force C-17 plane.”\n",
  "summary": "President Donald J. Trump and Vice President JD Vance are committed to defending the interests of the American people and maintaining the country's global standing. They assert that a strong relationship with the U.S. benefits other countries, particularly in the context of the ongoing conflict in Ukraine. President Trump highlighted the challenges faced by Ukraine, including a significant draft of its citizens into military service, high average age among troops, and increasing desertions due to exhaustion and insufficient training.\n\nPresident Trump emphasized his administration's support for Ukraine through the provision of Javelin anti-tank missiles, contrasting this with the Obama administration's supply of non-lethal aid. He also critiqued Ukraine's ability to handle its military challenges without U.S. help, warning that the situation could lead to World War III. Vice President Vance criticized Ukrainian President Zelenskyy for allegedly campaigning against Trump in Pennsylvania, suggesting interference in U.S. politics.\n\nUKraine is receiving significantly less aid from its Western allies than requested, raising concerns about its capacity to defend itself. Trump's remarks underline the geopolitical tensions involving global powers, while his provision of military aid underscores his commitment to pushing back against adversaries with concrete support. Despite these actions, the situation's volatility continues to demand vigilant international oversight.",
  "eli5": "President Trump gave Ukraine weapons to help them in a war because he thinks they need it. He believes helping them means America stays strong. Vice President Vance says someone from Ukraine supported their rivals in America.",
  "keywords": [
    "Donald Trump",
    "JD Vance",
    "Ukraine",
    "World War III",
    "Javelin missiles",
    "military aid",
    "U.S.-Ukraine relations",
    "geopolitics",
    "Zelenskyy"
  ],
  "issues": [
    "Potential bias in content",
    "Accuracy of military statistics and claims",
    "Allegations against Ukraine's political activities",
    "The long-term impact of U.S. foreign policy on global tensions"
  ],
  "citations": [],
  "document_type": "Press Release"
}