{
  "title": "President Trump is Removing Killers, Rapists and Drug Dealers from Our Streets – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump is Removing Killers, Rapists and Drug Dealers from Our Streets",
  "og:description": "President Donald J. Trump has launched the largest criminal illegal immigrant deportation operation in American history — and despite resistance from",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/president-trump-is-removing-killers-rapists-and-drug-dealers-from-our-streets/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T03:08:44+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tPresident Trump is Removing Killers, Rapists and Drug Dealers from Our Streets\t\t\t\t\n\nMarch 4, 2025\n\nPresident Donald J. Trump has launched the largest criminal illegal immigrant deportation operation in American history — and despite resistance from Democrat politicians in so-called “sanctuary cities,” illegal immigrant killers, rapists, and drug dealers have been taken off the streets in droves as the heroes of law enforcement are once again empowered to do their jobs.\n\n**Here is just a tiny sample of the cold-blooded criminals arrested under President Trump:**\n    - A Portuguese national  convicted  of sexual exploitation of a minor—child pornography, apprehended in Philadelphia.\n    - A Guatemalan national  charged  with armed home invasion, kidnapping, intimidation, and assault with a dangerous weapon, apprehended in Rhode Island.\n    - A Haitian national  charged  with three murders, apprehended in North Carolina.\n    - A Salvadoran national and MS-13 gang member  convicted  of aggravated assault with bodily injury and DWI, apprehended in Houston.\n    - A Guatemalan national  charged  with multiple counts of child rape, apprehended in Massachusetts.\n    - A Brazilian national and confirmed gang member  convicted  of assault and battery, apprehended in Boston.\n    - A Honduran national  convicted  of criminal sexual conduct with a minor, apprehended in Minnesota.\n    - A Salvadoran national  convicted  of sodomy/anal intercourse with a child less than 13 years of age, apprehended in Washington.\n    - An Ecuadorian national  convicted  of rape, arrested in Buffalo.\n    - A Guatemalan national  charged  with multiple counts of child rape, apprehended in Massachusetts.\n    - A Dominican Republican national  convicted  of sexual conduct against a child, apprehended in Buffalo.\n    - A Mexican national  convicted  of sexual exploitation of a child, apprehended in San Francisco.\n    - A Turkish national who is a  known  or suspected terrorist, apprehended in New York City.\n    - A Mexican national  convicted  of drug trafficking, apprehended in Texas.\n    - A Venezuelan national and  known  member of the brutal Tren de Aragua gang, arrested in San Antonio.\n    - A Salvadoran national and  high-ranking  leader of the brutal MS-13 gang charged with firearm possession, extortion and terrorist affiliation, arrested in Maryland.\n    - A Venezuelan national and known Tren de Aragua gang member —  connected  to a deadly shooting in Aurora, Colorado — charged with being a fugitive from justice in possession of a firearm, arrested in New York City.\n",
  "summary": "President Donald J. Trump initiated a significant deportation operation targeting criminal illegal immigrants, described as the largest in American history, on March 4, 2025. This operation involves local law enforcement efforts to remove individuals with criminal backgrounds, including charges and convictions for murder, sexual offenses, and involvement in gangs, from U.S. streets. Notably, these actions face resistance from politicians in cities classified as sanctuary cities, where policies may offer protection against deportation.\n\nThe document lists specific cases from various states including, but not limited to, a Portuguese individual convicted of child pornography in Philadelphia and a Guatemalan charged with multiple counts of child rape in Massachusetts. Arrests have occurred in multiple locations such as Philadelphia, Rhode Island, and Texas, among others. Law enforcement officers are positioned as instrumental in apprehending these individuals, furthering the narrative of restoring safety by deportation.\n",
  "eli5": "President Trump is supporting police in catching criminals like people who hurt others or belong to gangs, and sending them out of the U.S. to make the streets safer.",
  "issues": [
    "Ethical concerns about highlighting nationality in context of criminal activities.",
    "Possible legal challenges from sanctuary cities against federal deportation efforts.",
    "Lack of detailed data regarding the scope of deportations and their impact on communities."
  ],
  "citations": [],
  "keywords": [
    "Donald Trump",
    "deportation",
    "illegal immigrants",
    "law enforcement",
    "sanctuary cities",
    "criminal activity",
    "gangs"
  ],
  "document_type": "Articles"
}