{
  "title": "President Donald J. Trump Secures Release of Another American Held Hostage – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Donald J. Trump Secures Release of Another American Held Hostage",
  "og:description": "An American citizen held hostage in Belarus has been released thanks to the leadership of President Donald J. Trump and his administration — the second",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/president-donald-j-trump-secures-release-of-another-american-held-hostage/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-13T01:30:03+00:00",
  "article:modified_time": "2025-02-13T01:46:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tPresident Donald J. Trump Secures Release of Another American Held Hostage\t\t\t\t\n\nFebruary 12, 2025\n\nAn American citizen held hostage in Belarus has been released thanks to the leadership of President Donald J. Trump and his administration — the second American released from captivity abroad in the past 24 hours and the eleventh since President Trump took office.\n\n**The remarkable success in freeing American citizens comes as the United States displays a renewed strength under President Trump.**In the [words of Special Envoy for Hostage Affairs Adam Boehler](https://x.com/RapidResponse47/status/1889737340513403371), President Trump “has made bringing Americans home a top priority and people respond to that.”\n    - **Secretary of State Marco Rubio:**  “President Trump’s strong leadership has led to the release of an American unjustly detained in Belarus and two political prisoners … We remain committed to the release of other U.S. citizens in Belarus and elsewhere.”\n    - **Press Secretary Karoline Leavitt:**  “It speaks to President Trump’s dealmaking ability … It’s a remarkable victory on the heels of Marc Fogel returning to America last night.”\n    - **Special Envoy Adam Boehler:**  “It’s happening now because the President of the United States has made it a top priority — and he leads through strength.”\n    - **Deputy Assistant Secretary of State Chris Smith:**  “A huge win — and a response to President Trump’s Peace through Strength agenda … We’re going to keep working until we get all Americans out.”\n    - **U.S. Ambassador to Lithuania Kara McDonald:**  “It is a big day for Team America, for the President, for the Secretary of State…”\n\n**Promises made, promises kept.**\n",
  "summary": "On February 12, 2025, an American citizen previously held hostage in Belarus was freed thanks to efforts led by President Donald J. Trump and his administration. This release marks the second hostage returned safely to the United States in the last 24 hours and the eleventh since President Trump assumed office. The administration's accomplishments in securing the freedom of U.S. hostages showcase the intensified U.S. resolve under President Trump's leadership. \n\nKey figures in the administration, such as Secretary of State Marco Rubio and Press Secretary Karoline Leavitt, praised the president's leadership and deal-making capabilities. They emphasized the administration's ongoing commitment to securing the release of Americans held abroad. Special Envoy for Hostage Affairs Adam Boehler noted the president's prioritization of these efforts as a major factor in the success of these operations. The sentiment was echoed by other officials, reflecting broad support for the president's approach to international diplomacy and hostage negotiations.",
  "eli5": "President Trump helped get an American who was stuck in another country back home safely. Lots of people are saying he's doing a great job at bringing Americans back, and this is something he is working very hard on.",
  "keywords": [
    "Donald J. Trump",
    "hostage release",
    "Belarus",
    "American citizen",
    "foreign policy",
    "Marco Rubio",
    "Adam Boehler",
    "diplomacy"
  ],
  "issues": [
    "Accuracy of the events reported in the future context",
    "Verification of involved parties' statements",
    "Potential geopolitical implications of such actions"
  ],
  "citations": [],
  "document_type": "Press Release"
}