{
  "title": "Presidential Message on the Lunar New Year, 2025 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Presidential Message on the Lunar New Year, 2025",
  "og:description": "Melania and I send our warmest greetings to those in the United States and around the world who are celebrating the Lunar New Year. Our Nation is blessed",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/presidential-message-on-the-lunar-new-year-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-29T22:02:00+00:00",
  "article:modified_time": "2025-02-05T22:03:49+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tPresidential Message on the Lunar New Year, 2025\t\t\t\t\n\nJanuary 29, 2025\n\nMelania and I send our warmest greetings to those in the United States and around the world who are celebrating the Lunar New Year.Our Nation is blessed with a passionate and strong Asian-American community that has made countless contributions to our proud history.  For many Americans of Asian heritage, this is a time of rich family traditions.  As people gather together for fireworks and parades, The First Lady and I join them in celebrating and welcoming the Year of the Snake.Traditionally, the snake is associated with wisdom, spirituality, and good fortune.  As we begin America’s golden age, I ask God to bless our Nation with these gifts—may this year bring peace, happiness, and success to all.Happy New Year!\n",
  "summary": "In a 2025 message, the President and First Lady, Melania, extend greetings to those celebrating the Lunar New Year both in the United States and globally. The message highlights the contributions of the Asian-American community in America and acknowledges the rich family traditions associated with this celebration. The President and First Lady express solidarity with those partaking in festivities such as fireworks and parades as they usher in the Year of the Snake.\n\nThe message associates the snake with wisdom, spirituality, and good fortune. It emphasizes their hope for blessings of peace, happiness, and success for the nation in 2025, as they describe this period as America’s golden age. The message ends with warm wishes for a happy new year to all.",
  "eli5": "The President and First Lady are wishing everyone celebrating the Lunar New Year a happy time. They hope that the new year, which is the Year of the Snake, will bring everyone lots of good things like happiness and success.",
  "keywords": [
    "Lunar New Year",
    "Asian-American community",
    "Year of the Snake",
    "wisdom",
    "spirituality",
    "good fortune",
    "peace",
    "happiness",
    "success",
    "America’s golden age"
  ],
  "issues": [
    "Lack of specific cultural details about the Lunar New Year celebrations",
    "No acknowledgment of diverse Asian cultures that celebrate the Lunar New Year variably"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}