{
  "title": "President Trump is Securing Our Homeland – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump is Securing Our Homeland",
  "og:description": "After four years of Biden’s open borders, President Donald J. Trump launched an unprecedented crackdown on the illegal immigrants and deadly drugs allowed",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/president-trump-is-securing-our-homeland/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T02:29:18+00:00",
  "article:modified_time": "2025-03-05T02:29:19+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tPresident Trump is Securing Our Homeland\t\t\t\t\n\nMarch 4, 2025\n\nAfter four years of Biden’s open borders, President Donald J. Trump launched an unprecedented crackdown on the illegal immigrants and deadly drugs allowed to enter our country to remarkable success — and he [didn’t need legislation to do it](https://x.com/RapidResponse47/status/1896922571637227913).\n    - In February — President Trump’s first month in office — illegal border crossings  fell  to the lowest level ever recorded,  down 94%  from last February and  down 96%  from the all-time high of the Biden Administration.       - ICE arrests of illegal immigrants have  surged  627%.       - Would-be illegal border crossers have “ given up ” and are returning to their own countries in a “ reverse flow ” across South America.       - Mexican cartel operatives  say  they are “genuinely” fearful “for the first time in years” amid the Trump Administration’s crackdown.        - Migrant shelters across the country — run by organizations that once facilitated the invasion of illegal immigrants — have been  forced to shutter  because they are no longer necessary. \n    - Illegal immigrants removed from the country has  topped 50,000  as the Trump Administration continues getting illegal immigrant killers, rapists, and drug dealers  off our streets .\n    - Mexico  announced  a deployment of 10,000 troops to the border to combat illegal immigration and fentanyl trafficking, while Canada  announced  a flurry of measures to combat fentanyl manufacturing and trafficking following President Trump’s  imposition of tariffs  on the two countries.       - President Trump  secured  the extradition of 29 Mexican drug cartel bosses to face charges for their crimes in the United States. \n\n**The crackdown began on Day One:**\n    - President Trump  ended  “catch-and-release,” reversing the dangerous Biden-era policy that released dangerous illegal aliens back into our communities.\n    - President Trump  shut down  the “CBP One” app, which “ paroled ” more than one million illegal immigrants into the country.\n    - President Trump  signed  the Laken Riley Act into law, which  requires  illegal immigrants arrested or charged with theft or violence to be detained — honoring the legacy of Laken Riley, a Georgia college student brutally murdered by an illegal alien released into the country.\n    - President Trump  terminated  all taxpayer-funded public benefits for illegal aliens.\n    - President Trump  re-established  the successful “Remain in Mexico” policy.\n    - President Trump  restarted  construction of the border wall.\n    - The Trump Administration  declared  Tren de Aragua, MS-13, the Sinaloa Cartel, the Jalisco New Generation Cartel, the United Cartels, the Gulf Cartel, the Northeast Cartel, and the Michoacán Family as Foreign Terrorist Organizations.\n    - U.S. drones have been  deployed  on missions to locate deadly fentanyl labs in Mexico.\n    - President Trump  revoked  Temporary Protected Status for Haitians as part of his promise to rescind policies that were magnets for illegal immigration.\n    - President Trump  ordered  an end to birthright citizenship.\n    - President Trump  suspended  the U.S. Refugee Admissions Program.\n",
  "summary": "In March 2025, President Donald J. Trump initiated a comprehensive series of actions aimed at curbing illegal immigration and drug trafficking in the United States. These efforts came after what was portrayed as four years of open border policies under President Biden. Trump's administration reported a significant decrease in illegal border crossings, aggressive increases in ICE arrests, and the dismantling of programs facilitating illegal immigration. Additionally, the administration worked on removing illegal immigrants from the country, collaborating with neighboring countries to enhance border security, and targeting the operations of drug cartels.\n\nKey measures included the suspension of 'catch-and-release' policies and the reinstatement of the 'Remain in Mexico' policy. The administration also terminated the CPB One app, curtailed public benefits for unauthorized immigrants, and pursued new legislative actions like the Laken Riley Act. Furthermore, President Trump declared several drug cartels as Foreign Terrorist Organizations and deployed drones to dismantle fentanyl labs across borders. These actions were part of a strategic shift to reverse immigration policies and fortify homeland security.",
  "eli5": "President Trump did a lot of things to stop people coming into the country without permission and to catch bad guys bringing in drugs. He made rules to make sure everyone enters legally and got help from other countries to keep things safe.",
  "keywords": [
    "Trump administration",
    "immigration crackdown",
    "border security",
    "illegal immigration",
    "drug trafficking",
    "ICE arrests",
    "fentanyl",
    "border wall",
    "Remain in Mexico",
    "Laken Riley Act"
  ],
  "issues": [
    "The impact of revoking Temporary Protected Status and ending birthright citizenship.",
    "Legal and humanitarian concerns regarding the suspension of the U.S. Refugee Admissions Program.",
    "Implications of declaring certain organizations as Foreign Terrorist Organizations.",
    "Effectiveness and consequences of using drones in foreign territories to locate drug labs."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}