{
  "title": "President's Council of Advisors on Science and Technology – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President's Council of Advisors on Science and Technology",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, and in order to establish an advisory council",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/presidents-council-of-advisors-on-science-and-technology/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T21:12:13+00:00",
  "article:modified_time": "2025-01-24T16:32:13+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident’s Council of Advisors on Science and Technology\t\t\t\t\n\nJanuary 23, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, and in order to establish an advisory council on science and technology, it is hereby ordered as follows:\n\nSection 1.  Purpose.  The American story is one of boundless creativity and bold ambition, driven by an indomitable pioneering spirit that propels exploration and discovery.  It is this spirit that illuminated the world with Edison’s lightbulb, carried the Wright brothers into the skies, and sent Armstrong to the moon.  Today, a new frontier of scientific discovery lies before us, defined by transformative technologies such as artificial intelligence, quantum computing, and advanced biotechnology.  Breakthroughs in these fields have the potential to reshape the global balance of power, spark entirely new industries, and revolutionize the way we live and work.  As our global competitors race to exploit these technologies, it is a national security imperative for the United States to achieve and maintain unquestioned and unchallenged global technological dominance.  To secure our future, we must harness the full power of American innovation by empowering entrepreneurs, unleashing private-sector creativity, and reinvigorating our research institutions.\n\nAt the heart of scientific progress lies the pursuit of truth.  But this foundational principle, which has driven every major breakthrough in our history, is increasingly under threat. Today, across science, medicine, and technology, ideological dogmas have surfaced that elevate group identity above individual achievement, enforce conformity at the expense of innovative ideas, and inject politics into the heart of the scientific method.  These agendas have not only distorted truth but have eroded public trust, undermined the integrity of research, stifled innovation, and weakened America’s competitive edge.\n\nThis order establishes the President’s Council of Advisors on Science and Technology to unite the brightest minds from academia, industry, and government to guide our Nation through this critical moment by charting a path forward for American leadership in science and technology.\n\nSec. 2.  Establishment.  (a)  There is hereby established the President’s Council of Advisors on Science and Technology (PCAST).(b)  The PCAST shall be composed of not more than 24 members.  The Assistant to the President for Science and Technology (APST) and the Special Advisor for AI &amp; Crypto shall be members of the PCAST.  If also serving as the Director of the Office of Science and Technology Policy, the APST may designate the U.S. Chief Technology Officer as a member.  The remaining members shall be distinguished individuals and representatives from sectors outside of the Federal Government appointed by the President.  These non-Federal members shall have diverse perspectives and expertise in science, technology, education, and innovation.(c)  The APST and the Special Advisor for AI &amp; Crypto shall serve as Co-Chairs of the PCAST.  The Co-Chairs may designate up to two Vice Chairs of the PCAST from among the non-Federal members of the PCAST, to support the Co-Chairs in the leadership and organization of the PCAST.\n\nSec. 3.  Functions.  (a)  The PCAST shall advise the President on matters involving science, technology, education, and innovation policy.  The Council shall also provide the President with scientific and technical information that is needed to inform public policy relating to the American economy, the American worker, national and homeland security, and other topics.(b)  The PCAST shall meet regularly and shall:(i)    respond to requests from the President or the Co-Chairs for information, analysis, evaluation, or advice;(ii)   solicit information and ideas from a broad range of stakeholders, including the research community; the private sector; universities; national laboratories; State, local, and Tribal governments; foundations; and nonprofit organizations;(iii)  serve as the advisory committee identified in section 101(b) of the High-Performance Computing Act of 1991 (Public Law 102-194), as amended (15 U.S.C. 5511(b)), in which capacity the PCAST shall be known as the President’s Innovation and Technology Advisory Committee; and(iv)    serve as the advisory panel identified in section 4 of the 21st Century Nanotechnology Research and Development Act (Public Law 108-153), as amended (15 U.S.C. 7503), in which capacity the PCAST shall be known as the National Nanotechnology Advisory Panel.(c)  The PCAST shall provide advice from the non-Federal sector to the National Science and Technology Council (NSTC) in response to requests from the NSTC.\n\nSec. 4.  Administration.  (a)  The heads of executive departments and agencies shall, to the extent permitted by law, provide the PCAST with information concerning scientific and technological matters when requested by the PCAST Co-Chairs and as required for the purpose of carrying out the PCAST’s functions.(b)  In consultation with the Co-Chairs, the PCAST is authorized to create standing subcommittees and ad hoc groups, including technical advisory groups, to assist the PCAST and provide preliminary information directly to the PCAST.(c)  In order to allow the PCAST to provide advice and analysis regarding classified matters, the Co-Chairs may request that members of the PCAST, its standing subcommittees, or ad hoc groups who do not hold a current clearance for access to classified information receive security clearance and access determinations pursuant to Executive Order 12968 of August 2, 1995 (Access to Classified Information), as amended, or any successor order.(d)  The Department of Energy shall provide such funding and administrative and technical support as the PCAST may require, to the extent permitted by law and as authorized by existing appropriations.(e)  Members of the PCAST shall serve without any compensation for their work on the PCAST, but may receive travel expenses, including per diem in lieu of subsistence, as authorized by law for persons serving intermittently in the government service (5 U.S.C. 5701–5707).(f)  Insofar as the Federal Advisory Committee Act, as amended (5 U.S.C. App.), may apply to the PCAST, any functions of the President under that Act, except that of reporting to the Congress, shall be performed by the Secretary of Energy, in accordance with the guidelines and procedures established by the Administrator of General Services.\n\nSec. 5.  Termination.  The PCAST shall terminate 2 years from the date of this order unless extended by the President.\n\nSec. 6.  Revocation.  Executive Order 14007 of January 27, 2021 (President’s Council of Advisors on Science and Technology), as amended by Executive Order 14109 of September 29, 2023 (Continuance of Certain Federal Advisory Committees and Amendments to Other Executive Orders), is hereby revoked.\n\nSec. 7.  General Provisions*.***(a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE    January 23, 2025.\n",
  "summary": "The **President's Council of Advisors on Science and Technology (PCAST)** has been established by an executive order signed on January 23, 2025. The council aims to guide the United States in maintaining global technological leadership amidst rapid advances in fields such as artificial intelligence, quantum computing, and biotechnology. Chaired by the Assistant to the President for Science and Technology and the Special Advisor for AI & Crypto, PCAST is composed of up to 24 members from various sectors, bringing their diverse expertise to the table.\n\nPCAST's main purpose is to advise the President on issues related to science, technology, education, and innovation policy. The Council will engage with stakeholders across different sectors, providing insights that inform public policy and enhance America's competitive edge. Additionally, it will serve specific advisory roles under existing legislative frameworks, like the High-Performance Computing Act and the 21st Century Nanotechnology Research and Development Act.\n\nIn administrating PCAST, members will serve without compensation but may have travel expenses covered. The Secretary of Energy will perform relevant functions under the Federal Advisory Committee Act as applicable. The order specifies the council's authority and its ability to form subcommittees, with a two-year term ending unless extended by the President. Furthermore, it revokes a previous Executive Order from 2021 related to an earlier version of PCAST.",
  "eli5": "The President decided to bring together really smart people to help the U.S. be the best at new technology like AI and big computers. They will meet often to give advice and share new ideas.",
  "keywords": [
    "PCAST",
    "science and technology",
    "innovation",
    "advisory council",
    "AI",
    "quantum computing",
    "biotechnology",
    "Executive Order"
  ],
  "issues": [
    "Potential overlap with previous councils and other advisory committees.",
    "The impact of the revocation of the previous Executive Order.",
    "How diverse perspectives in the council will be ensured."
  ],
  "citations": [
    "15 U.S.C. 5511(b)",
    "15 U.S.C. 7503",
    "5 U.S.C. 5701–5707",
    "Federal Advisory Committee Act",
    "Executive Order 12968"
  ],
  "document_type": "Executive Order"
}