{
  "title": "President Trump Takes Decisive Action to Deliver Relief to Kentucky – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Takes Decisive Action to Deliver Relief to Kentucky",
  "og:description": "President Donald J. Trump granted a Major Disaster Declaration for the Commonwealth of Kentucky on Monday following severe storms and flooding.The",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-takes-decisive-action-to-deliver-relief-to-kentucky/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-25T12:59:21+00:00",
  "article:modified_time": "2025-02-25T13:00:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident Trump Takes Decisive Action to Deliver Relief to Kentucky\t\t\t\t\n\nFebruary 25, 2025\n\nPresident Donald J. Trump granted a Major Disaster Declaration for the Commonwealth of Kentucky on Monday following severe storms and flooding.The President’s [action](https://www.fema.gov/press-release/20250225/president-donald-j-trump-approves-major-disaster-declaration-kentucky) will make federal funding available for individuals in impacted areas. The assistance can include grants for temporary housing and other programs to help individuals and businesses recover. Federal funding will also be made available to the Commonwealth, local governments, and certain nonprofit organizations.\n\nActing FEMA Administrator Cameron Hamilton: “President Trump clearly understands that when Americans are in need, we all have to act together. Starting with his decisive action on February 16 that allowed us to activate search and rescue assets and other emergency efforts to save lives to his major declaration, I know the people of Kentucky value his leadership which will now open up the full suite of FEMA support to those impacted.”Kush Desai, Deputy White House Press Secretary: “In response to the tragic loss of life and destruction gripping Kentucky, President Trump has issued a Major Disaster Declaration to ensure that Kentucky gets the support it needs. In addition to our and the nation’s prayers, the Trump Administration is committed to marshaling every resource that Kentucky needs to save lives, rebuild communities, and emerge stronger in the face of tragedy.”Governor Andy Beshear [said](https://www.wkyt.com/2025/02/24/president-approves-disaster-declaration-kentucky/): “We are thankful to President Trump and his administration for approving this funding. This support will be a big help for our families and communities as they recover and rebuild from yet another terrible storm.”Congressman Hal Rogers [said](https://www.wkyt.com/2025/02/24/president-approves-disaster-declaration-kentucky/): “I’m grateful for President Trump’s expedited Major Disaster Declaration for Kentucky, which includes public assistance and individual assistance for ten counties.”President Trump’s approval of a Major Disaster Declaration on Monday follows the [initial](https://www.whitehouse.gov/presidential-actions/2025/02/president-donald-j-trump-approves-kentucky-emergency-declaration/) emergency declaration last week. Governor Beshear [noted](https://x.com/RapidResponse47/status/1891555123010195934) that President Trump has “responded to all of our requests — turned around the declaration of emergency about as quickly as I’ve ever seen.”\n",
  "summary": "On February 25, 2025, President Donald J. Trump granted a Major Disaster Declaration for Kentucky in response to severe storms and flooding. This action enables federal funding to be available for individuals and communities affected by the disaster. The assistance covers temporary housing, business recovery, and support for local governments and nonprofit organizations.\n\nActing FEMA Administrator Cameron Hamilton emphasized the importance of President Trump's early involvement, which led to an emergency response starting from February 16. Trump administration officials, including Deputy Press Secretary Kush Desai, assured commitment to providing the necessary resources to help Kentucky recover. Governor Andy Beshear and Congressman Hal Rogers expressed gratitude for the rapid federal response and assistance provided.\n\nThe disaster declaration follows an earlier emergency declaration, with Governor Beshear noting the swift governmental response. This action highlights a coordinated effort by state and federal agencies to address the needs of Kentucky residents and ensure a path toward rebuilding and recovery.",
  "eli5": "President Trump helped Kentucky after a really bad storm by sending extra money and help to fix things like homes and businesses.",
  "keywords": [
    "Trump",
    "Kentucky",
    "Disaster Declaration",
    "FEMA",
    "Federal Aid",
    "Flooding",
    "Emergency Response",
    "Recovery"
  ],
  "issues": [
    "Confirmation of continued federal support",
    "Specific allocation and utilization of funds",
    "Long-term recovery plans"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}