{
  "title": "Press Gaggle by President Trump Aboard Air Force One En Route to Miami, Florida – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Press Gaggle by President Trump Aboard Air Force One En Route to Miami, Florida – The White House",
  "og:description": "PRESS GAGGLE BY PRESIDENT TRUMP Aboard Air Force One En Route Miami, Florida (January 25, 2025) 3:07 P.M. PST",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/press-gaggle-by-president-trump-aboard-air-force-one-en-route-to-miami-florida/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-25T15:29:00+00:00",
  "article:modified_time": "2025-01-28T16:25:10+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tPRESS GAGGLE BY PRESIDENT TRUMP Aboard Air Force One En Route to Miami, Florida\t\t\t\t\n\nJanuary 25, 2025\n\nPRESS GAGGLE BY\n\nPRESIDENT TRUMP\n\nAboard Air Force One\n\nEn Route Miami, Florida\n\n(January 25, 2025)\n\n3:07 P.M. PST\n\n     Q    Welcome back, Mr. President. \n\nTHE PRESIDENT:  Hello, everybody.  How are you?\n\nQ    Welcome back. \n\nTHE PRESIDENT:  Welcome back to you. \n\nQ    How are you liking Air Force One so far, sir?\n\nTHE PRESIDENT:  I think it’s nice.  Hasn’t changed. \n\nQ    Yeah.\n\nTHE PRESIDENT:  Hasn’t changed very much. \n\nHow’s everything going?  Good?  Everybody happy? \n\nQ    Yes, very much so.\n\nTHE PRESIDENT:  You’re getting a little bit more access to your president than you did the last time, slightly — like, by about 5,000 percent.  (Laughter.)\n\nWe had a very good week — first week.  Almost complete.  I guess one day is left, if you think about it.  We’re heading to Florida.  We’re going to be at Doral because I’m making a speech there the following day for a group — a very important group.  And then, I guess we come back to Washington.\n\nSo, we’re heading, as you know, to Miami — Doral. \n\nOkay.  Any questions?\n\nQ    Are you going to get a round of golf in?\n\nTHE PRESIDENT:  No, I don’t think so.  It’s so busy. \n\nQ    What’s your favorite part on the plane, Mr. President?  What do you like — you know?\n\nTHE PRESIDENT:  Which plane?\n\nQ    Like, this one.  Air Force One.  When you were back, what did you like —\n\nTHE PRESIDENT:  The plane?  No, I’ve been on the plane many, many times, as you know.  It’s a great plane.  It’s a special plane.\n\nQ    Do you still want to change the colors?\n\nTHE PRESIDENT:  Who?\n\nQ    Do you still want to change the colors — the exterior?\n\nTHE PRESIDENT:  I would change them.  Sure.  It’d be a much more appropriate plane, rather than the baby blue.  We want power blue, not baby blue. \n\nBut no, you know, this is nice, but everything has its time and place.  We’ll be changing the colors. \n\nQ    Can you talk to us about the firing of the inspectors general?  Why did you do that?  And is it the —\n\nTHE PRESIDENT:  Because it’s a very common thing to do.  And not all of them.  Michael Horowitz, we’re keeping.  I thought his report on Comey was incredible, actually.  It was such an accurate, well-done report.  I only wish Bill Barr used it, which he chose not to.  But it was — it was an incredible report.  Michael Horowitz wrote the definitive report on James Comey and the FBI.  It really got that going. \n\nAnd I understand.  I don’t know them, but some people thought that some were unfair or some were not doing the job.  And it’s a very standard thing to do, very much like the U.S. attorneys.\n\nQ    Do you plan to bring your own people in those positions, Mr. President?\n\nTHE PRESIDENT:  Which people?\n\nQ    The — in the — in the inspectors general role?\n\nTHE PRESIDENT:  It’s not my people.  They’re not my people.  I don’t know anybody that would do that, but we’ll put people in there that will be very good. \n\nQ    Mr. President, there’s reports that Elon Musk now must go through Susie Wiles and that he doesn’t have an office in the West Wing.  I’m curious if — how you feel about that.\n\nTHE PRESIDENT:  No, no, not — it’s not Elon’s office.  We have an office that’s set up for purposes of — when I do an executive order, that the order is carried out, not that it sits around for three months.  And we’ll have about 20 people, maybe more, working out of that office.  It’s really an office for a lot of people that go and make sure that the executive office —\n\nYou know, when I do an executive document, very important executive do- — I want to make sure that that is done.  And there’s about 20 or 25 people that will be working out of that office, and it’s really a “go get ‘em” office to make sure it gets done.  That’s what that is. \n\nQ    So, you’re a week in now to your presidency.  How does it compare to your first week in 2017?  Did you learn any lessons or are you trying to do something differently?\n\nTHE PRESIDENT:  Well, I come in now with great knowledge and experience and you could say that no — if you call it “new president” has ever had this kind of experience, that’s for sure.  Whereas before, I had never done it before, but we did well. \n\nWe had a very — we had a great presidency, but this one could be really outstanding.  I think you’re seeing the same reports that I see.  And you write the reports.  Most of you are writing the important reports.  We’re getting A-pluses on the work done and also the amount of work done.  I mean, nobody else has done this. \n\nYou go to North Carolina.  Then you go to Los Angeles.  And then you stop on the way home and — and that was “no tax on tips,” but it was really a stop to thank the people of Nevada for having been — you know, it’s a very hard state to win as a — as a Republican, and we won it very conclusively.  So, it was really more of a thank you to the people of Nevada.  So, I stopped there.  And I have a lot of meetings once I get back, once I get to Miami. \n\nBut no, it’s — I think we had — people are saying it was the most successful first week that anybody can remember a president having.\n\nQ    Mr. President, you were so nice to Governor Newsom yesterday.  No “News-” — you know, “Governor Newscum.”  What was that about?\n\nTHE PRESIDENT:  I decided to be nice.  It was nice that he came to the plane, honestly.  You know, I didn’t know he’d be at the plane.  It was nice that he came to the plane. \n\nAnd in the end, you know, we have the same goal.  We want to make — take that catastrophe and make it as good as possible. \n\nWe disagree in some things.  I guess he’s not so set on water, and I like water for putting out fires.  I find it to be extremely good.  Very — a little old fashioned, but about the best thing that God has ever created for putting out fires. \n\nAnd so, we’re going to be doing something on that.  But no, I get along — I actually always got along with him well until fairly recently.\n\nQ    If I could ask you about the first lady —\n\nTHE PRESIDENT:  And I very much — you know, I very much predicted that was going to happen.  Because if you go back, like, six years, I said, “If you don’t start getting this place taken care of and mitigating some of the problems that are here, you’re going to end up with a fire like you had ever seen.”  I turned out to be right.\n\nQ    If I could ask you about the first lady.  She seems to be taking a more public-facing role.  I just wonder how you envision her spending the next four years. \n\nTHE PRESIDENT:  Well, I think she was always very much involved, but you didn’t see her — more behind the scenes.  But she was always a “front of the scenes” person, and I think she really wanted — she felt badly about North Carolina, and she felt very badly about California.  Los Angeles — got a lot of friends.  I have a lot of friends in North Carolina and — and both.  And she has a lot of friends in California. \n\nSo, she wanted to be with me for that.  Yeah.  For both of them.\n\nQ    Mr. President, is your preference for Larry Ellison to work to obtain TikTok?  Or do you have any preference on how this deal is going?\n\nTHE PRESIDENT:  I haven’t spoken — Larry is a friend of mine.  Lives in — you know, right in — near Mar-a-Lago, right down the road.  I never spoke to Larry about TikTok. \n\nQ    But there is —\n\nTHE PRESIDENT:  I’ve spoken to many people about TikTok, and there’s great interest in TikTok.  And as you know, I have the right to sell it or close it, depending on what I think is best for the country. \n\nSo, we’ll make a decision over the next 90 days or so.\n\nQ    There is a report, Mr. President, that says that you are putting together a deal with Oracle and outside investors to help them buy TikTok and save TikTok.  Is that happening?\n\nTHE PRESIDENT:  No, not with Oracle.  With — numerous people are talking to me — very substantial people — about buying it.  And I’d make that decision over the next — probably over the next 30 days. \n\nI have 90 days.  Congress has given 90 days, and we’ll see.  If we could save TikTok, I think it would be a good thing. \n\nSo, we’ll make a decision.  We have a lot of interest in it.  And the United States will be a big beneficiary if we do it.  I’d only do it if the United States benefits. \n\nI mean, I have a warm spot in my heart for TikTok because I won on TikTok — and I ended up winning by a lot — young people.  And as you know, Republicans historically — I don’t think — ever won young people, and I won them by a lot.  So, I do have a little bit of a warm spot.\n\nBut, you know, it’s a very popular site, and the kids are loving it, and some of the parents are loving it.  And if we can save it, I think that would be a very good thing.  And I think it would be economically good for America. \n\nQ    Mr. President, could I ask you about Ukraine?  Do you have any update on when you are going to talk to Russian president Vad- — Russian President Putin?\n\nTHE PRESIDENT:  He wants to speak, and we’ll be speaking soon.  And I’ve spoken to President Zelenskyy numerous times, and they’d like to see peace.  They would like to see an end to the war.  And I think President Putin would like to see an end to the war too.  So, we’ll see if we can help it along. \n\nQ    On the —\n\nTHE PRESIDENT:  I think it’s a shame.  It’s a war that would have never happened if I were president.  It’s a shame.\n\nQ    We’ve seen a lot of people being fired from the federal government.  What’s the sort of criterion you’re using for this?  Is it loyalty to you?  And can we expect more of these purges?\n\nTHE PRESIDENT:  You have to show up to work, basically.  You have to show up to work.  You have to go to your office, and you have to work.  And otherwise, you’re not going to have a job. \n\nQ    Do you worry that that limits the pool of talent?\n\nTHE PRESIDENT:  No, I think the talent is deep.  We have very deep talent.  But we also have a lot of excess people.  You know, this was just a — this was a gimmick for Democrats, to a certain extent.  But we have a lot of excess people, but the talent is very deep. \n\nQ    Now that you’ve done your first domestic trip, have you given any thought to where you want to go for your first international trip?\n\nTHE PRESIDENT:  Well, it could be Saudi Arabia.  It could be UK.  Traditionally, it’s been UK. \n\nLast time, I went to Saudi Arabia because they agreed to buy 450 billion dollars’ worth of United States merchandise, including a lot of military equipment and farm equipment and other equipment.  And if that offer were right, I’d do that again. \n\nQ    If you go to the UK, do you think you’ll get along with Keir Starmer and the Labor government?\n\nTHE PRESIDENT:  I do.  I mean, I’ve met him already three times.  He’s come over to see me twice.  I have a call — he and I have a call over the next 24 hours. \n\nNo, I get along with him well.  I like him a lot.  He’s liberal, which is a little bit different for me.  But I think he’s a very good person.  I think he’s — he’s done a very good job thus far.  He’s very new on the job, but he’s represented his country in terms of his philosophy.  I may not agree with his philosophy, but I have a very good relationship with him. \n\nI’ve seen him twice.  Had dinner with him at Trump Tower, as you probably know.  You know that, right?\n\nQ    Just on Saudi, Mr. President.  You spoke to the crown prince.  Did you discuss a normalization deal between Israel and Saudi?\n\nTHE PRESIDENT:  No, I discussed getting oil prices down. Because if you get oil prices down, Russia will stop the war, and Biden should have never allowed them to go up so high. \n\nWhen Biden let them go up to that level, he was just inducing Russia, which sells oil, to go into a war.  So, he should have never allowed — the Democrats, namely Biden, allowed oil prices to go up.  That’s one of the reasons that you have the Ukraine catastrophe.\n\nQ    How do you bring the prices down?\n\nTHE PRESIDENT:  Volume.  Yeah.\n\nQ    (Inaudible) increasing production.\n\nTHE PRESIDENT:  Yeah.\n\nQ    Can you tell us about your call with the king of Jordan today, please?\n\nTHE PRESIDENT:  It was a very good call.  He’s a friend of mine.  I know him very well.  I’ve gotten along with him over the years very well, and he’s done a wonderful job. \n\nHe really houses, you know, millions of Palestinians, and he does it in a very humane way.  And I compliment him on that.  But he really — Jordan has done an amazing job of housing largely Palestin- — Palestinians.  And he’s done it in a very successful way.\n\nQ    So, what was the subject of discussion?  Was it — was it —\n\nTHE PRESIDENT:  It was that.  I said to him, “I’d love you to take on more.”  Because I’m looking at the whole Gaza Strip right now, and it’s a mess.  It’s a real mess.\n\nQ    So, you’d like Jordan to house people from Gaza?\n\nTHE PRESIDENT:  You have to take people.  I’d like Egypt to take people.  I’m meeting with — I’m talking to General el-Sisi tomorrow — sometime, I believe.  And I’d like Egypt to take people, and I’d like Jordan to take people.\n\nI can — I mean, you’re talking about probably a million and a half people, and we just clean out that whole thing.  It’s — you know, it’s — over the centuries, that’s — that’s many, many conflicts, that site. \n\nAnd I don’t know.  It’s something has to happen, but it’s literally a demolition site right now.  Almost everything is demolished, and people are dying there.  So, I’d rather get involved with some of the Arab nations and build housing at a different location where they can maybe live in peace for a change. \n\nQ    Temporary?  Or would they — would they ever go back?\n\nTHE PRESIDENT:  It could be either.  It could be temporarily, could be long term. \n\nQ    Go ahead.\n\nQ    You’ve spoken about artificial intelligence quite a bit this week. \n\nTHE PRESIDENT:  Yeah.\n\nQ    Do you have any concerns about the risks to — to humanity about artificial superintelligence?\n\nTHE PRESIDENT:  Well, look, artificial intelligence is the — it’s where all of the smart countries want to be going.  Great for coming up with cures to disease, great with coming up with everything, but there are always risks.\n\nAnd it’s the first question I ask: How do you absolve yourself from (inaudible), et cetera?  Because it could be the rabbit that gets away.  We’re not going to let that happen.\n\nBut it’s going to be the biggest field — maybe the biggest field in the world, and we’re going to be equipped to take it.  And we’re already leading.  I mean, we’re going to be leading.  Very shortly, we’re going to be leading by a lot. \n\nWhat they do need is tremendous energy.  They need electricity at levels that nobody has ever seen before, and we’ll be able to supply that electric.  I’m going to use —\n\nQ    The Pentagon —\n\nTHE PRESIDENT:  I’ll be using emergency power to give that electric. \n\nQ    The Pentagon, Mr. President, just lifted a hold on 2,000-pound bombs for Israel, which was blocked by Biden.  Can you — do you have a comment on that, sir?\n\nTHE PRESIDENT:  On the what?\n\nQ    On the 2,000-pound bombs —\n\nTHE PRESIDENT:  Oh.\n\nQ    — that Biden had put a hold on.\n\nTHE PRESIDENT:  We released them. \n\nQ    Yeah.\n\nTHE PRESIDENT:  We released them today, and they’ll have them, and they paid for them, and, you know, they’ve been waiting for them for a long time.  They’ve been in storage for a long time. \n\nBut we released them today to Israel. \n\nQ    Why did you do that, sir?\n\nTHE PRESIDENT:  Because they bought them.\n\nQ    There are reports, Mr. President, that you spoke to the Danish prime minister and she told you Greenland is not for sale.  Will you take no for an answer on that?\n\nTHE PRESIDENT:  Who are you with?\n\nQ    CNN.\n\nTHE PRESIDENT:  Oh.\n\nQ    (Laughs.)  Your favorite.\n\nTHE PRESIDENT:  No, they’re terrible.  Honestly, that’s why they’re going out of business.  It’s terrible.  Or they’ll be bought cheap.  Maybe some rich guy will buy them cheap.  But anyway, it’s just the tone of your question every time.\n\nI think Greenland will be worked out with us.  I think we’re going to have it.  And I think the people want to be with us, as you know.  There’s 55,000 people there.  They want to be with us. \n\nI don’t know, really, what claim Denmark has to it, but it would be a very unfriendly act if they didn’t allow that to happen.  Because that’s for protection of the free world.  It’s not for us; it’s for the free world. \n\nRight now, you have Russian ships.  You have China ships.  You have ships from various countries.  It’s not a good situation. \n\nAnd I believe we’ll get that.  Yeah, I do believe it.  I think we’ll get other things too that you’re talking about, that nobody knows.  But I think we’ll get other — other things. \n\nBut I do believe Greenland we’ll get, because it really has to do with freedom of the world, not just freedom of — it has nothing to do with the United States, other than we’re the one that can provide the freedom.  They can’t.  They can’t. \n\nI mean, they put two dog sleds there two weeks ago.  They thought that was protection. \n\nQ    But the other thing is Canada —\n\nTHE PRESIDENT:  And you know what?  The people don’t like the way they’ve been treated by Denmark.  They don’t like the way they’ve been treated by Denmark.  And they do like us.\n\nQ    Mr. President, on the Senate confirmations, Senat- — or Vice President JD Vance had to come and — to pass the tiebreaking vote.  I’m curious if you’re concerned at all about any of the other nominees.\n\nTHE PRESIDENT:  No.  Whatever it is, it is.  I think they’re doing well.  I think we just had a big — a big win today, as you know.  Kristi Noem, I think, will be outstanding at Homeland. \n\nAnd we have some other ones going.  And no, I don’t — you know, I don’t see any major problems.\n\nQ    The U.S. — the U.S. has suspended most foreign aid, including PEPFAR, which is a program that’s credited with saving millions of lives in Africa.  Is there a timeline for opening up U.S. aid?  Is there a review —\n\nTHE PRESIDENT:  We’ll see — we’ll see about that.  But we want other people to join us, because we’re like a one-way street.  So, we want other people to help us, and we want other people to join us. \n\nWe’re spending billions and billions and billions of dollars, and other countries that are wealthy are spending zero. And we want them to help.  Why should we be the only one?  So, they understand that.  They’ve been told that. \n\nIt’s a little like NATO.  I mean, we were spending — we were almost paying for all of NATO.  And yet, they were taking advantage of us on trade.  Similar countries.  The same and similar countries. \n\nAnd after I got involved, they were paying a lot of money on NATO.  The Secretary General was very generous in his statements about me with respect to NATO. \n\nSo, we’ll see.  I think NATO should be more too, though.  I think it should be more than the two.  It should be — should be five, actually.\n\nQ    The CIA, Mr. President, prefers to — prefers the lab leak theory to explain COVID’s origins now.  I was curious to hear your thoughts on that. \n\nTHE PRESIDENT:  Well, you have a good man there.  A very good man.  And John is — he’s just gotten approved, as you know.  John Ratcliffe also got approved.  And I’d rather have you ask him that question. \n\nHe’ll be — he knows everything about it right now.\n\nQ    Have you had a chance — have you given any thought to the future of the air base at Diego Garcia, which, as you know, is part of the Chagos Islands, which Britain is returning to the Mauritius islands.  There are concerns that could open it up to spying by Iran or China.  Do you have —\n\nTHE PRESIDENT:  I mean, it hasn’t been number one on my list, I’ll be honest with you.  That was not number one.\n\nQ    (Inaudible) you didn’t talk about Canada, about the Panama Canal.  You mentioned today expansion —\n\nTHE PRESIDENT:  I think Canada has been treating us very unfairly on trade, and they’ve taken advantage of us for years, and we’re not going to allow that to happen. \n\nI love Canada.  I have so many friends up in Canada, and they like us and they like me.  But Canada has been taking advantage of the United States for years, and we’re not going to let that happen.\n\nAnd without our subsidy, Canada, you know, doesn’t exist really.  It’s very — it’s — Canada is totally reliant on us, therefore they should be a state.  Canada — we lose $250 billion a year on Canada.  I could stop that in one day.  And if I stopped that, Canada wouldn’t exist as a state, you know, as a — as a country.\n\nAnd I think if that’s going to — if we’re going to have to give that kind of subsidy — and we’re not even talking about tariffs yet, but that’ll happen on February 1st.\n\nBut if we’re going to lose $250 billion for the sake of supporting a country, it’s not fair to us.  And they do about almost 90 percent of their business with the United States, whereas with us, it’s the opposite.  It’s, you know, relatively small. \n\nSo, I don’t want to spend hundreds of billions of dollars on supporting a country unless that country is a state.  And if it is a state, the people of Canada would pay a much lower tax.  You know, their taxes would be cut in half.  They would have no military problems.  They’d be much more secure in every way. \n\nAnd I think it’s a great thing for Canada.  And I view it as, you know, honestly, a country that should be a state, and they’ll get much better treatment, much better care, and much lower taxes, and they’ll be much more secure. \n\nThank you very much, everybody. \n\nQ    Thank you for coming back.\n\nTHE PRESIDENT:  Thank you.\n\n                              END                 3:27 P.M. PST\n",
  "summary": "President Trump addressed the press aboard Air Force One en route to Miami, Florida on January 25, 2025. During the session, he discussed a range of topics including his recent firing of inspectors general, changes planned for Air Force One, and various international issues such as the Ukraine conflict and dealings with TikTok. Trump also talked about his intentions regarding foreign aid, NATO contributions, and potential expansions involving Diego Garcia and Greenland. \n\nThe President elaborated on domestic matters, including regulatory changes and personnel decisions within the federal government, emphasizing a need for productivity and accountability. He addressed queries about potential economic and international trips, indicating Saudi Arabia and the UK as possibilities. Discussion also included artificial intelligence development in the U.S. and a call with the King of Jordan regarding regional housing issues.\n\nTrump emphasized logistical and diplomatic strategies, showcasing his second presidential term filled with engagements in both foreign and domestic policy. His focus remained on improving business transactions, enhancing international relations, and revising administrative practices.",
  "eli5": "President Trump talked to reporters on his plane about fixing big problems like TikTok, foreign countries, and airplane decorations while heading to Miami. He wants to make America better by changing some rules and helping with important issues around the world.",
  "keywords": [
    "President Trump",
    "Air Force One",
    "Inspectors general",
    "TikTok",
    "Ukraine",
    "Foreign aid",
    "NATO",
    "Artificial intelligence",
    "Greenland",
    "Diego Garcia",
    "Press Gaggle"
  ],
  "issues": [
    "Firing of inspectors general",
    "Elon Musk's involvement with executive orders",
    "Foreign relations with Saudi Arabia and UK",
    "Aid distribution to foreign countries",
    "Greenland acquisition",
    "Military equipment dealings with Israel",
    "TikTok ownership issues"
  ],
  "citations": [],
  "document_type": "Press Release"
}