{
  "title": "President Trump Announces Appointments to the White House Offices of Communications, Public Liaison, and Cabinet Affairs – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Appointments to the White House Offices of Communications, Public Liaison, and Cabinet Affairs",
  "og:description": "President Trump announced key appointments to the White House Office of Communications, Public Liaison, and Cabinet Affairs, which will be overseen by",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/president-trump-announces-appointments-to-the-white-house-offices-of-communications-public-liaison-and-cabinet-affairs/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-25T02:51:12+00:00",
  "article:modified_time": "2025-01-27T15:47:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tPresident Trump Announces Appointments to the White House Offices of Communications, Public Liaison, and Cabinet Affairs\t\t\t\t\n\nJanuary 24, 2025\n\nPresident Trump announced key appointments to the White House Office of Communications, Public Liaison, and Cabinet Affairs, which will be overseen by Deputy Chief of Staff for Communications and Public Liaison, and Cabinet Secretary Taylor Budowich.\n\n**COMMUNICATIONS**President Trump previously announced the appointments of Assistant to the President and White House Communications Director Steven Cheung and Assistant to the President and Press Secretary Karoline Leavitt. Today’s announcements include:**Alex Pfeiffer** will join the White House as a Deputy Assistant to the President and Principal Deputy Communications Director after previously serving as a Communications Adviser for the Trump-Vance 2024 Campaign and Communications Director for MAGA Inc. Pfeiffer previously served as an Investigative and Editorial Producer for Fox News’ Tucker Carlson Tonight.**Kaelan Dorr** will return to the White House as a Deputy Assistant to the President and Deputy Communications Director after serving as Senior Strategist and Spokesperson for MAGA Inc. Dorr previously served as Senior Advisor for Public Affairs at the Department of Treasury, Congressional Communications Director and Strategic Communications Advisor in the Executive Office of the President in the Trump Administration, Global Head of Marketing and Engagement for GETTR, Vice President of Communications for America First Policy Institute, and Chief Marketing Officer for Donald J. Trump for President.**Harrison Fields** will return to the White House as Special Assistant to the President and Principal Deputy Press Secretary, having previously served as Assistant Press Secretary in the Trump Administration. Fields has also served as Senior Advisor to Congressman Byron Donalds and Assistant Director of Media and Public Relations at The Heritage Foundation.**Anna Kelly** will join the White House as a Deputy Press Secretary after serving as National Press Secretary for the Republican National Committee. Previously, Kelly was Communications Director for Congressman Derrick Van Orden, Michels for Governor, and the Republican Party of Wisconsin.**Kush Desai** will serve as a Deputy Press Secretary after serving as Deputy Battleground States &amp; Pennsylvania Communications Director at the Republican National Committee. Desai also served as Deputy Communications Director for the 2024 Republican National Convention and Communications Director for the Republican Party of Iowa.**Ian Kelley** will join the White House as Special Assistant to the President and War Room Director after serving as War Room Director for the Trump-Vance 2024 Campaign. Previously, Ian worked as Rapid Response Manager for the social media platform GETTR.**Dylan Johnson** will join the White House as Special Assistant to the President and Assistant Communications Director for Special Projects after serving as a Deputy Director of Communications for the Trump-Vance 2024 Campaign. Johnson previously served as the Campaign Manager for the Greitens for U.S. Senate campaign and was an Executive Producer for Just The News.**Sonny Joy Nelson** will join the White House as Special Assistant to the President and Media Affairs Director, after serving as Director of Media Affairs and Surrogates for the Trump-Vance 2024 Campaign. Previously, Nelson served as Director of Media Affairs for the social media platform GETTR, Booking Producer for Real America’s Voice, Director of Media Affairs for the Republican National Committee, and Associate Director of Strategic Communications for Donald J. Trump for President, Inc.**Dan Boyle** will join the White House as the White House Director of Research after serving as a Research Consultant on the Trump-Vance 2024 Campaign, and previously as Director of Research for MAGA Inc. Boyle previously served as the Research Director for Citizens United and as a Research Analyst for the Government Accountability Institute.**Johanna Persing** will join the White House as Cabinet Communications Director after playing an integral role in the Trump-Vance 2024 campaign’s surrogate operation, including leading the media booking operation at the 2024 Republican Convention in Milwaukee.  Persing previously served as the Deputy Communications Director for the Republican National Committee and as Communications Director for Congressman Ryan Costello.**Charyssa Parent** will join the White House as Congressional Communications Director after serving as the Communications Director for Senator Roger Marshall. Parent previously served as the Deputy Director of Communications for the House Republican Conference and as the Director of Broadcast Media for the Republican National Committee.**Jacki Kotkiewicz** will join the White House as Policy Communications Director after working as a Vice President at Argus Insight. Kotkiewicz previously served as the Director of Policy Research at the Republican National Committee and was a Research Analyst on the Trump 2020 campaign.**Jake Schneider** will join the White House as Rapid Response Director after serving as Rapid Response Director for the Trump-Vance Campaign. Schneider previously served as the Deputy Director of Rapid Response for the 2020 Trump campaign and as Communications Director and Press Secretary for Congresswoman Michelle Fischbach.\n\n**OFFICE OF PUBLIC LIAISON****Jim Goyer** will return to the White House as Deputy Assistant to the President and Director of the Office of Public Liaison. Goyer served President Donald J. Trump in his first Administration as Special Assistant to the President and Deputy Director of the Office of Public Liaison. Goyer previously served as Political Coordinator at the National Republican Senatorial Committee. Goyer is joining from Goldman Sachs, where he served as an Associate of Asset and Wealth Management.**Lynne Patton**will serve as Deputy Assistant to the President and Director of Minority Outreach, where she will be charged with ensuring that President Trump continues to build upon his historic Election Day support from Blacks, Latinos and Women.  Patton served as Senior Advisor on the Trump Campaign and has been one of the Trump family’s longest serving and most trusted aides.  Prior to joining the Trump campaign, Patton was the Regional Administrator for Federal Region II at the U.S. Department of Housing and Urban Development and Senior Advisor to Secretary Ben Carson.  At HUD, Lynne worked tirelessly to bring accountability, reform and results to some of the most challenging housing issues facing our country.  From championing the rights of underserved communities to exposing corruption and mismanagement within public housing systems, Lynne consistently fought for fairness and opportunity, earning her the bipartisan respect of industry peers and local elected officials alike.  Lynne’s deep connection to the issues affecting minority communities combined with her remarkable interpersonal skills, makes her the ideal person to lead this critical outreach effort.  She holds a B.S. from the University of Miami and attended Quinnipiac University, School of Law. **Brette Powell** will return to the White House as Special Assistant to the President and Deputy Director of the Office of Public Liaison, having previously served for three years in the White House Management Office and the Advance Office in the Trump Administration. Powell previously served the President for four years through his Save America PAC and the Trump-Vance 2024 campaign as the Director of Strategic Political Stakeholder Engagement.**Hailey Borden** will return to the White House as Special Assistant to the President and Director of Business Outreach in the Office of Public Liaison, having previously served as Associate Director of the Office of Public Liaison in the Trump Administration. Borden previously was Director of Coalitions and Member Services on the House Committee on Small Business and is currently the Director of Business Coalitions for House Majority Whip Tom Emmer.**Alex Flemister** will return to the White House as Director of Strategic Initiatives in the Office of Public Liaison, having previously served as Associate Director in the Office of Public Liaison in the Trump Administration. Flemister previously worked for Governor Sarah Huckabee Sanders on her campaign as Advisor and Director of Operations and worked in her official governor’s office as the Director of Office Appointments. Flemister is currently the Founder and President of The Flemister Group.**CABINET AFFAIRS****Lea Bardon** will join the White House as a Special Assistant to the President and Director of Cabinet Affairs. Bardon previously served as Director of Development Operations at the America First Policy Institute. Bardon also served on President Trump’s reelection campaign in 2020 and as Executive Roundtable Manager at the Republican Attorneys General Association.**Thomas Bradbury** will join the White House as Associate Director for Policy. Bradbury is currently the Director of Advocacy and Policy at American Conservative Union (CPAC).**Cami Connor** will return to the White House as Associate Director for Agency Outreach, having previously served as Associate Director of Agency Outreach in the first Trump Administration. Connor currently serves on the Government Operations team at The Boeing Company.\n",
  "summary": "### Summary\n\nOn January 24, 2025, President Trump announced several key appointments to the White House Offices of Communications, Public Liaison, and Cabinet Affairs. These appointments aim to strengthen the administration's communication efforts and public outreach. Notable appointees in the communications sector include Alex Pfeiffer, Kaelan Dorr, Harrison Fields, Anna Kelly, and others who have previous experience in campaigns and communications roles.\n\nIn the Office of Public Liaison, Jim Goyer and Lynne Patton will oversee outreach efforts, with Goyer returning as the Deputy Assistant to the President and Director of the Office of Public Liaison. Lynne Patton is tasked with enhancing outreach to minority communities, leveraging her experience in housing and urban development. Lea Bardon will lead the Cabinet Affairs as Director, ensuring coordinated efforts between the Cabinet and the President’s office. These appointments illustrate a strategic emphasis on leveraging experienced personnel to enhance the administration's effectiveness in communication and public engagement.",
  "eli5": "President Trump picked some new people to help him talk to the public and work with other leaders. They will help make sure everyone knows what's happening and that the right people are doing the right jobs.",
  "keywords": [
    "President Trump",
    "White House",
    "Appointments",
    "Communications",
    "Public Liaison",
    "Cabinet Affairs",
    "Taylor Budowich",
    "Executive Office"
  ],
  "issues": [
    "The announcement may cause concerns about the political backgrounds of the appointees and their potential bias.",
    "Potential conflicts of interest might arise due to previous roles in campaigns and political organizations."
  ],
  "citations": [],
  "document_type": "Press Release"
}