{
  "title": "President Trump is Putting American Workers First — And Bringing Back American Manufacturing – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump is Putting American Workers First — And Bringing Back American Manufacturing",
  "og:description": "President Donald J. Trump is standing up for American workers, strengthening American industries, and making clear to the world that America will no",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/president-trump-is-putting-american-workers-first-and-bringing-back-american-manufacturing/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T02:56:36+00:00",
  "article:modified_time": "2025-03-05T02:56:37+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tPresident Trump is Putting American Workers First — And Bringing Back American Manufacturing\t\t\t\t\n\nMarch 4, 2025\n\nPresident Donald J. Trump is standing up for American workers, strengthening American industries, and making clear to the world that America will no longer be ripped off — a push that has already delivered historic results.\n\n**President Trump is leveling the playing field for American workers.**\n    - President Trump  restored  a 25% tariff on steel imports and  elevated  the tariff to 25% on aluminum imports to protect these critical American industries from unfair foreign competition.       - The move was praised by the  Steel Manufacturers Association , the  Aluminum Association , and  businesses  across the country.\n      - Robert Simon, CEO of JSW Steel USA,  praised  the steel and aluminum tariffs “as a project that will flood the U.S. with jobs as trading partners move their industries to U.S. soil to avoid tariffs.” \n    - President Trump  unveiled  a plan for fair and reciprocal trade, making clear to the world that the United States will no longer tolerate being  ripped off  — a plan met with  praise  across the board.       - American Iron and Steel Institute:  “American steel producers know well the negative impact of foreign unfair trade practices, including subsidies, currency manipulation and other unfair and discriminatory policies and practices, on domestic industries and their workers.”\n      - Renewable Fuels Association:  “For almost a decade now, we have spent precious time and resources fighting back against an unfair and unjustified tariff regime imposed by Brazil’s government on U.S. ethanol imports … We thank President Trump for taking this action and hope this reciprocal tariff will help encourage a return to free and fair ethanol trade relationship with Brazil.” \n\n**President Trump is securing historic investments as companies seek to make their products in America instead of paying tariffs.**\n    - Nissan CEO Makoto Uchida said President Trump’s tariffs could  push  the car manufacturer to move its production from Mexico to the U.S.\n    - Honda is  expected  to produce its next-generation Civic hybrid model in Indiana.\n    - After a meeting with President Trump, Stellantis  announced  it will reopen its assembly plant in Belvidere, Illinois — putting 1,500 employees back to work — and  build  its next-generation Dodge Durango in Detroit, Michigan. The company also announced new investments in their Toledo, Ohio, and Kokomo, Indiana, facilities.\n\n**In total, President Trump has secured [nearly $2 trillion](https://x.com/RapidResponse47/status/1894463845734777158) in new U.S. investments.**\n    - TSMC  announced  an unprecedented $100 billion investment in U.S.-based semiconductor chip manufacturing.\n    - Apple  announced  a historic $500 billion investment that will create 20,000 new U.S.-based jobs.\n    - President Trump  announced  the largest artificial intelligence infrastructure project in history, securing $500 billion in planned private sector investment — with major CEOs  agreeing  it would not have been possible without President Trump’s leadership.\n    - President Trump  secured  a $20 billion investment by DAMAC Properties to build new U.S.-based data centers.\n    - Wisconsin-based Clarios, a leader in low-voltage energy storage,  announced  a $6 billion plan to expand its U.S.-based manufacturing.\n    - Eli Lilly and Company  announced  a $27 billion investment in its U.S.-based manufacturing.\n    - Saudi Arabia  declared  its intention to invest $600 billion in the United States over the next four years.\n    - Taiwan  pledged  to boost its investment in the United States.\n    - Electronics giants Samsung and LG “are  considering  moving their plants in Mexico to the U.S.” now that President Trump is back in office.\n",
  "summary": "President Donald J. Trump announced measures to prioritize American workers and industries by implementing a 25% tariff on steel and aluminum imports, intending to protect domestic industries from unfair foreign competition. This action was commended by several industry associations like the Steel Manufacturers Association and the Aluminum Association. Furthermore, President Trump unveiled a plan emphasizing fair and reciprocal trade to prevent the United States from being taken advantage of, which received broad approval from various industry leaders.\n\nThe administration's actions to incentivize domestic production have led to significant economic commitments. Major companies like Stellantis, Apple, and TSMC have announced substantial investments in U.S.-based manufacturing, amounting to nearly $2 trillion in total. This includes notable projects such as a $100 billion investment in semiconductor manufacturing and significant expansions by companies in multiple states. These investments are aimed at creating jobs and fostering economic growth within the United States.",
  "eli5": "President Trump made it harder for other countries to sell metal here and encouraged big companies to build more things in the USA, which means more jobs for people.",
  "keywords": [
    "President Trump",
    "American workers",
    "tariffs",
    "steel imports",
    "aluminum imports",
    "U.S. investments",
    "domestic manufacturing",
    "economic growth"
  ],
  "issues": [
    "The accuracy of the projected $2 trillion in investments.",
    "Long-term economic impacts of imposed tariffs.",
    "Potential international trade tensions."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}