{
  "title": "Press Gaggle by President Trump Aboard Air Force One En Route Joint Base Andrews – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Press Gaggle by President Trump Aboard Air Force One En Route Joint Base Andrews",
  "og:description": "9:00 P.M. EST      THE PRESIDENT:  Hello, everybody.  Hello.      Q    Hello.",
  "og:url": "https://www.whitehouse.gov/remarks/2025/02/press-gaggle-by-president-trump-aboard-air-force-one-en-route-joint-base-andrews/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-19T21:34:27+00:00",
  "article:modified_time": "2025-02-20T21:36:38+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tPRESS GAGGLE BY PRESIDENT TRUMP Aboard Air Force OneEn Route Joint Base Andrews\t\t\t\t\n\nFebruary 19, 2025\n\n9:00 P.M. EST\n\n     THE PRESIDENT:  Hello, everybody.  Hello.\n\n     Q    Hello.\n\n     THE PRESIDENT:  Hello, everybody. \n\nSo, you just saw this.  (The president holds up a USA Today article entitled “How America voted, which counties shifted toward Trump and a look at voter turnout.”)  This just came out, and I’d say that’s quite good.  Right?  By any standard, that’s quite good. \n\nI shouldn’t leave USA — is anybody here from USA Today?\n\nQ    Yesterday, we had someone from —\n\nTHE PRESIDENT:  Yesterday.  We missed him. \n\nDoes everybody know Steven Cheung?  He’s a sweetheart.  You wouldn’t want to get in a fight with him, right?\n\nAnyway, what’s up?\n\nQ    Mr. President, the TikTok deal, any developments there?\n\nTHE PRESIDENT:  No, there’s a lot of people interested in TikTok, and I think we have a chance of doing something good.  And we’ll be speaking to China about that also, because they’re a party to it, obviously.  But it would be great to keep TikTok alive, sell it to somebody that’s going to do a great job with it.\n\nQ    Did you see the CEO today at the event, sir?\n\nTHE PRESIDENT:  Did I what?\n\nQ    Did you see the CEO today at the event?\n\nTHE PRESIDENT:  No, I didn’t.  I didn’t speak to him.  Was he there?\n\nQ    He was supposed to be there.\n\nTHE PRESIDENT:  I think so, yeah, but I did not see him.\n\nQ    Sir, Elon Musk is proposing potentially giving money to Americans based on what DOGE is finding.  Do you have any thoughts on that?\n\nTHE PRESIDENT:  I love it.  A 20 percent dividend, so to speak, for the money that we’re saving by going after the waste and fraud and abuse and all of the other things that are happening.  I think it’s a great idea.\n\nQ    How much money do you think Americans —\n\nTHE PRESIDENT:  It could be a lot.  I mean, if it’s 20 percent, we’d give back a lot of money to the taxpayer.  And also, it’d give an incentive for the taxpayer to go out and report things to us where we can save money.\n\nQ    So, you signed an immigration-related executive order today.  Ho- — what do you think of ICE arrests right now?  Do you think that they need to increase the number of people they’re arresting —\n\nTHE PRESIDENT:  Where?\n\nQ    — increase the — the pace of the ICE arrests?\n\nTHE PRESIDENT:  No, I think they’re doing a great job.  You know, you have people that are hiding.  They are professionals at hiding.  That’s what they’ve done for a big part of their lives. \n\nAnd they’re criminals.  In many cases, very serious criminals, including murderers.  And, obviously, they’re not easy to capture, but they’re being captured in record numbers, and they’re being brought out of our country, being brought back to where they came from.\n\nQ    Mr. President, on Boeing.  You mentioned maybe taking a different route.  What would a different route entail?\n\nTHE PRESIDENT:  On what?\n\nQ    On Boeing, with the Air Force One plane.\n\nTHE PRESIDENT:  No, I’m not happy with Boeing.  It takes them a long time to do —\n\nYou know, Air Force One, we gave that contract out a long time ago.  It was a fixed-price contract, and I’m not happy with the fact that it’s taking so long.  And we may do something else.  We may go out and buy a plane or get a plane or something, but I’m not happy with the fact that it’s taken Boeing so long.  There no excuse for it. \n\n(Cross-talk.)\n\nAnd, you know, they had a fixed-price contract.  I made that deal, and now they — supposedly, they’re losing a lot of money and they’d like to see if they could, you know, up the price.  But I make fixed-price deals.  I don’t like time and material deals. \n\nQ    Sir, the only other commercial aircraft maker that could make a plane that big is Airbus.  Would you consider buying a —\n\nTHE PRESIDENT:  No, I would not consider Airbus over Boeing, no.  But I could buy one that was used and convert it.  I could buy one from another country, perhaps, or get one from another country. \n\nSo, we’re looking at other alternatives, because it’s taking Boeing too long. \n\n(Cross-talk.)\n\nYou know, they were supposed to be finished, like, years ago.\n\nQ    Yeah.\n\nTHE PRESIDENT:  Years ago.\n\nQ    Sir, and you —\n\nTHE PRESIDENT:  Don’t forget, I signed that contract during my term, and it was a very good contract.  And I took, like, a billion six off the price, and it was supposed to be done, you know, quickly, and it’s a long time.  Right?\n\nQ    Would you push for your preferred color scheme for Air Force One?\n\nTHE PRESIDENT:  Oh, no, it’s going to be that color, yeah.  No matter what, it’s going to be for that color. \n\nQ    Sir, about Gaza.  Do you e- — do you find the Egyptian proposal to redevelop Gaza acceptable?  And does that change your —\n\nTHE PRESIDENT:  I haven’t seen it.  I haven’t seen it.  When I see it, I’ll let you know.\n\nQ    Sir, can I you about Ukraine?\n\nTHE PRESIDENT:  Yeah.\n\nQ    You — you said today that you had a deal on critical minerals, and Ukraine broke it.\n\nTHE PRESIDENT:  Yeah, we had a deal where we were going to get — look, you have to understand, Europe is being paid back the money that they put up, and they’re only putting up a fraction of what we’re putting up.  I think they’re in for $100 billion, and we’re in for $350 billion.  There’s no reason that should have happened.  It’s Biden’s fault.  He shouldn’t have allowed that to happen. \n\nBut on top of it all, they’re getting their $100 billion back, and we’re not.  And I’ve been talking about this for two years.  I said, “You have to loan them the money so that if things work out, they’re going to pay you back.”  And they didn’t do that.  So, Biden didn’t do it.  It’s his fault.  Nobody has ever seen anything so stupid. \n\nSo, Europe gets their money back, and they’re only in for a small fraction.  And, obviously, everything is important, but it’s more important for them because they’re right next to Russia.  So, it’s more important than — we have an ocean in between us.  So, it’s obviously more important to the European countries than it is to the U.S.\n\n(Cross-talk.)\n\nBut here’s the thing, we don’t get our money back.  And we told them that the deal is we’ll do something for the rare earth and some oil, et cetera, et cetera, and that would be all right.  And they agreed to it, more or less. \n\nAnd then Scott Bessent actually went there and was treated rather rudely, because — essentially, they told him no, and Zelenskyy was sleeping and unavailable to meet him.  He traveled many hours on the train, which is a dangerous trip.  And we’re talking about the secretary of the Treasury.  He went there to get a document signed.  And when he got there, he came back empty.  They wouldn’t sign the document. \n\nBut for Europe, they pay back their money.  It’s a loan.  Think of that.  And we should’ve had a loan, too, but we had an administration that was incompetent.\n\nQ    Can you resurrect that deal?  Is there anything that you can do?\n\nTHE PRESIDENT:  Yeah, I think I’m going to resurrect it, or, you know, we’ll see what happens.  But I’m going to resurrect it, or things are not going to make him too happy. \n\nAnd, look, it’s time for elections.  They haven’t had an election in a long time.  It’s wonderful to say, “You know, we can’t have an election.”  But it’s time for elections.\n\nAnd it’s also time to find out what happened with all the money, because he made the statement that half of it he doesn’t know where it is or something like that.  And I’d like to find out: All the money that we’ve been sending to Ukraine, where is it?\n\nAnd I can tell you we’re doing very well with Russia.  We’re going to do something with Russia that he was unable to do.  We can make a deal with Russia to stop the killing of, you know, potentially additional millions of people.  The soldiers are being just wiped out on both sides.  Wiped out.  It’s horrible. \n\nYou know, the weaponry today is so powerful, so, you know, strong that it’s killing a lot of soldiers.  And I don’t want to sol- — they’re Russian and they’re Ukrainian.  I don’t want to see those soldiers killed.  They have mothers and fathers.  They have sisters and brothers.  I don’t want to see them killed.\n\nQ    Mr. President, on tariffs, you mentioned lumber.  That’s something that I don’t believe we’ve heard before.  Any specific —\n\nTHE PRESIDENT:  Lumber, yeah.  Forest — forest product, yeah. \n\nQ    And do you have a rate in mind for that?\n\nTHE PRESIDENT:  No, but we’re thinking about maybe 25 percent.\n\nQ    And would that also be April 2nd?  On or before April 2nd?\n\nTHE PRESIDENT:  In that vicinity, yeah.  A little bit later.\n\nQ    And also, which car companies did you — you said that you spoke with some car companies.\n\nTHE PRESIDENT:  I spoke to all car companies.  Everybody is coming back into America.\n\nQ    So, these are foreign car companies?\n\nTHE PRESIDENT:  Including foreign companies, yeah.  They’re going to be coming in, because they don’t want to pay the tariffs. \n\nQ    You said you’ll be having lunch with some Democrats next week.\n\nTHE PRESIDENT:  Yeah.\n\nQ    Can you elaborate on who that is and what you all plan to discuss?\n\nTHE PRESIDENT:  Well, you’ll see when I do it, but some good ones.\n\n     Q    Are you —\n\n     THE PRESIDENT:  Some biggies. \n\nQ    Are you con- — are you concerned about congressional funding?\n\nTHE PRESIDENT:  No, I’m just —\n\nQ    Is that on the table?\n\nTHE PRESIDENT:  I think we’re going to just talk. \n\nI think it would be great if Republicans and Democrats could get along.  It’s time.  It’s time.  It makes sense.\n\nQ    Sir, would you say you trust the Russians to negotiate in good faith going forward?  Do you trust them?\n\nTHE PRESIDENT:  I do.  I think the Russians want to see the war end.  And I do.  I really do.  But I think they have the cards a little bit, because, you know, they’re — they’ve taken a lot of territory, so they have the cards. \n\nQ    Mr. President, have you set a date for the British prime minister’s visit to Washington?\n\nTHE PRESIDENT:  No.  He’ll be coming soon, though.  He has asked to come and see me.  So, he’ll be coming.\n\nQ    What about Macron?\n\nTHE PRESIDENT:  And president of France also.  Macron will be coming.\n\nQ    But no set dates yet?\n\nTHE PRESIDENT:  Very soon.  Maybe Monday.\n\nQ    Mr. President, on congestion pricing.  So — they’re going to be — it’s supposed to have saved about — or raised about $15 billion to help the MTA.  Do you have an alternative way that — to fund the MTA system now that there won’t be cong- —\n\nTHE PRESIDENT:  No, that’s up to New York.  They have to do that. \n\nLook, New York has treated a lot of people very badly.  And it’s hard to — you know, it’s hard to feel sorry for what’s happened in New York.  It’s sad to see the way they’ve treated people, and they continue to do it. \n\nAnd, you know, look at what’s going on with the mayor.  Look at what’s going on with so many other things.  So, congestion pricing is not a good situation, and they’re treating the people of New York very badly. \n\nThat’s a — supposing you worked in a shoe shop or you worked in a restaurant as a waiter, and you have to come into Manhattan, and they’re taking, you know, many, many dollars out of your pocket.  You can’t afford to do it. \n\nAnd price — you know, you — if you take a look, traffic will go down because people aren’t going to come.  If people don’t come, that means the whole place is — it’s going to be a disaster. \n\nSo, it could be, and it’s probably going to show that.  Traffic will come down, but that means they’re not going to spend their money in New York.  They’ll go someplace else.\n\nQ    (Inaudible) prepared to go to court if lawsuits ensue?\n\nTHE PRESIDENT:  Well, we’ll see what happens.  You could give me the final, because I haven’t seen it as of late today because I was making a speech. \n\nDid I make a good speech?  Yes. \n\nOkay.  Go ahead.  What else?\n\nQ    Can I ask you about the Chinese?  So, you know, eventually, you would like to meet with President Xi.\n\nTHE PRESIDENT:  Yeah.\n\nQ    But we heard —\n\nTHE PRESIDENT:  I have very good relationship with President Xi.  I think a great relationship with President Xi.  But remember, he loves China, and I love the USA.  So, you know, right there, there’s a little bit of competitiveness.  But the relationship I have with President Xi is, I would say, a great one. \n\nQ    We heard that you —\n\nTHE PRESIDENT:  It was obviously hurt by COVID coming in.  It hurt them, hurt us, hurt everybody.  Hurt the whole world.  But outside of that, I have a very, very good relationship with President Xi.\n\nQ    Are you looking to make a new trade deal?\n\nTHE PRESIDENT:  I think he’s — I think he’s — I think he’s a very unique person.\n\nQ    Would you make a new trade deal with China?  I mean, you know, the —\n\nTHE PRESIDENT:  Yeah, it’s possible.\n\nQ    One trade deal never really got —\n\nTHE PRESIDENT:  It’s possible. \n\nWell, we did a great trade deal with China.  We did it — great for the farmers, great for manufacturers.  They had to buy 50 billion dollars’ worth of our product, and we were making them buy it.  The problem is that Biden didn’t push them to adhere to it. \n\nQ    Sir, do you think D.C. should govern itself, or do you think that governing of District of Columbia should go back to Congress? \n\nTHE PRESIDENT:  I think that we should govern District of Columbia.  It’s so important, the D.C. situation.  I think that we should run it strong, run it with law and order, make it absolutely flawlessly beautiful. \n\nAnd I think we should take over Washington, D.C.  Make it safe.  People are getting killed.  People are being hurt.  You have great police department there, but, somehow, they’re not utilized properly. \n\nWe should govern D.C.  I think the federal government should take over the governance of D.C. and run it really, really properly. \n\nAnd I like the mayor.  I get along great with the mayor, but they’re not doing the job.  Too much crime.  Too much graffiti.  Too many tents on the lawns of these magnificent lawns, and there’s tents.  And, you know, it’s a — it’s a sad thing.  You know, homeless people all over the place, and we got to take care of the homeless.  But you can’t have that in Washington, D.C.\n\nYou know, when they come over to see me — like Macron is coming and the prime minister of UK is coming and all these people are coming over to see me — we’ll have, ultimately, President Xi, and we’ll have everybody coming, right?  And you can’t let that be.  You just can’t let that happen.  You can’t have tents all over your beautiful — your once magnificent plazas and lawns and all of it.  You just can’t do it.\n\n(Cross-talk.)\n\nMR. CHEUNG:  We’ll do — we’ll do a couple more.\n\nQ    Sir, do you think you can still pay for extending your tax cuts without cutting both Medicaid and Medicare?\n\nTHE PRESIDENT:  Yeah, absolutely.\n\nQ    House Republicans are planning to make cuts to Med- —\n\nTHE PRESIDENT:  Well, I think we’re going to take in tremendous tariff money, number one.  And number two, you take a look at DOGE, and you see what’s happening.  We’re saving billions of dollars.\n\nQ    On DOGE.  Do you know what they’re looking at, specifically, at the Department of Defense right now?  And —\n\nTHE PRESIDENT:  Yeah, they’re looking at everything.\n\nQ    And are they going to cut more national security —\n\nTHE PRESIDENT:  They’re looking — and we’re going to go into Fort Knox to make sure the gold is there. \n\nQ    Are they going to cut more —\n\nTHE PRESIDENT:  Do you know that?  We’re going to go into Fort Knox.  Do you know about that?\n\nQ    Sir — sir —\n\n(Air Force One experiences turbulence.)\n\nTHE PRESIDENT:  That was a bad bump.\n\nQ    Are they going to eliminate more national security positions, civilians there at DOD?\n\nTHE PRESIDENT:  We’ll see what happens.\n\nBut one of the things — we do want to look.  I mean, we hope everything’s fine with Fort Knox, but we’re going to go to Fort Knox — the fabled Fort Knox — to make sure the gold is there. \n\nQ    Where would the gold have gone?\n\nTHE PRESIDENT:  If the gold isn’t there, we’re going to be very upset.\n\nQ    Can you bring us along?\n\nQ    You haven’t brought up Greenland in a — in a while.  Are you seeing —\n\nTHE PRESIDENT:  No, no, very — we need Greenland from the standpoint of national security and international security.  We have to do something with Greenland.  We have to protect Greenland.  But we need it for national security, and we need it, maybe more importantly, for international security.\n\n(Cross-talk.)\n\nMR. CHEUNG:  All right, we’ll just do one more.  One more.\n\nQ    Can I just follow up?  Are you seeing it as part of any of the discussions you’re having with Europeans and Putin in some sort of peace deal?\n\nTHE PRESIDENT:  No, no.  We have to have Greenland because of the national security picture, even more so now than it would have been 20 years ago, 30 years ago, when they talked about it then too. \n\nYou know, they used to talk about it.  Years ago, they were talking about Greenland, but much more so now with, you know, modern weaponry, planes and the speed of planes, and all of the things.  So, we have to have Greenland. \n\nThank you very much. \n\nEND                  9:14 P.M. EST\n",
  "summary": "### Summary\n\nOn February 19, 2025, President Trump conducted a press gaggle aboard Air Force One while en route to Joint Base Andrews. During the session, he discussed various topics, including the TikTok acquisition, asserting that there's interest in keeping the app alive and potentially selling it to a suitable company. He also expressed dissatisfaction with Boeing over delays related to the Air Force One project and contemplated alternatives, although he ruled out switching to Airbus planes. Additionally, Trump commented on his plans to engage with Democrats for potential bipartisan cooperation and highlighted ongoing issues with immigration enforcement.\n\nRegarding international matters, Trump criticized the existing financial arrangements with Ukraine, suggesting that the U.S. should have negotiated a loan rather than direct financial aid and mentioned dissatisfaction over an unfulfilled deal on critical minerals. He also addressed the need for a national security-driven engagement with Greenland and expressed interest in a potential deal with Russia to end the conflict involving Ukraine. Presidential trips and potential trade deals with China were also on the agenda, with Trump maintaining a positive view of his relationship with President Xi.\n\nOn domestic issues, he raised concerns about congestion pricing in New York, stating it could harm local businesses and affect traffic adversely. He also criticized the governance of Washington D.C., suggesting a federal intervention to address crime and homelessness issues. Trump concluded by addressing tariff strategies and fiscal policies, reaffirming plans to ensure the integrity of Fort Knox and extract efficiencies from the Department of Defense's budget through DOGE (Deficiency Obligation Governance Efficiency).",
  "eli5": "President Trump talked to reporters on a plane about many things, like selling TikTok, fixing some planes, and being worried about money given to Ukraine and New York's traffic problems. He also said he'd like to work with Democrats and make deals with other countries.",
  "keywords": [
    "President Trump",
    "Air Force One",
    "TikTok",
    "Boeing",
    "immigration",
    "Ukraine",
    "Greenland",
    "Russia",
    "China",
    "trade deals",
    "New York",
    "Washington D.C.",
    "tariffs",
    "Fort Knox",
    "DOGE"
  ],
  "issues": [
    "Delay in Boeing's contract for Air Force One",
    "Concerns over financial agreements with Ukraine",
    "Tariff impacts on international trade",
    "Federal governance of Washington D.C.",
    "Integrity of Fort Knox's gold reserves"
  ],
  "citations": [],
  "document_type": "Press Release"
}