{
  "title": "President Trump Announces Appointments to the White House Office of Legislative Affairs – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Appointments to the White House Office of Legislative Affairs",
  "og:description": "Jordan Cox will serve as Special Assistant to the President in the White House Office of Legislative Affairs for the U.S. House of Representatives. Prior",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/president-trump-announces-appointments-to-the-white-house-office-of-legislative-affairs/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-15T17:44:03+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tPresident Trump Announces Appointments to the White House Office of Legislative Affairs\t\t\t\t\n\nFebruary 15, 2025\n\nJordan Cox will serve as Special Assistant to the President in the White House Office of Legislative Affairs for the U.S. House of Representatives. Prior to this role, he worked as Executive Director of Political Operations for House Republican Chief Deputy Whip Guy Reschenthaler. Andrew (Drew) Dziedzic: Drew Dziedzic will serve as Special Assistant to the President in the White House Office of Legislative Affairs for the U.S. Senate. Prior to joining the White House, he served as Legislative Director for Sen. Eric Schmitt (MO). Taylor LaJoie: Taylor LaJoie will serve as Special Assistant to the President in the White House Office of Legislative Affairs for the U.S. Senate.  He has worked on Capitol Hill in a variety of legislative roles, including Senior Legislative Assistant to then-Senator JD Vance (OH), as well as Legislative Director in both the House of Representatives and the Senate. Natalie McIntyre: Natalie McIntyre will serve as the Special Assistant to the President in the White House Office of Legislative Affairs for the U.S. Senate. Previously, Natalie was the Legislative Director for Senator Bill Hagerty (TN). Prior to joining the Senator’s office, she was the Deputy to the Associate Director for Legislative Affairs at the Office of Management and Budget (OMB) during the first Trump Administration. She previously served as the Senior Policy Advisor and White House Liaison at the Office of National Drug Control Policy. Jack Rosemond: Jack Rosemond will serve as Special Assistant to the President in the White House Office of Legislative Affairs for the U.S. House of Representatives. Prior to joining the White House, he served as Senior Advisor to Chairman Jason Smith (MO) at the House Ways and Means Committee, where he previously held the position of Director of Member Services.Stephen Siao: Stephen Siao will serve as Special Assistant to the President in the White House Office of Legislative Affairs for the U.S. House of Representatives. He most recently served as Staff Director of the U.S. House Committee on Homeland Security and as Chief of Staff to U.S. Congressman Mark Green (TN).\n\n**About the Office of Legislative Affairs:**The Office of Legislative Affairs (OLA) reports to Assistant to the President and White House Deputy Chief of Staff James Blair.  The Office is managed by Deputy Assistant to the President and OLA Director James Braid.  Braid has three OLA Deputy Directors, Deputy Assistants to the President Jay Fields (internal lead), Jeff Freeland (House lead), and Pace McMullan (Senate lead).  White House Legislative Affairs Liaisons are commissioned as Special Assistants to the President and report up to the Deputy OLA Director that leads their respective portfolios.\n",
  "summary": "On February 15, 2025, the White House announced the appointments of several individuals to key positions within the Office of Legislative Affairs under President Trump. Jordan Cox, Andrew Dziedzic, Taylor LaJoie, Natalie McIntyre, Jack Rosemond, and Stephen Siao have been appointed as Special Assistants to manage relations with the U.S. House of Representatives and Senate. Each brings substantial experience from their previous roles in various legislative and political capacities.\n\nThe Office of Legislative Affairs operates under the supervision of James Blair, Deputy Chief of Staff. The office is headed by James Braid, Director of the Office of Legislative Affairs. It includes three Deputy Directors: Jay Fields, Jeff Freeland, and Pace McMullan, who oversee internal, House, and Senate relations, respectively. The Special Assistants report to their respective Deputy Directors, who manage specific portfolios to ensure smooth operations between the White House and Congress.",
  "eli5": "President Trump picked a bunch of really smart people to help him talk to the people who make rules and laws in the government. They help him figure out how to work with those people to get things done.",
  "keywords": [
    "White House",
    "Office of Legislative Affairs",
    "President Trump",
    "appointments",
    "U.S. House of Representatives",
    "U.S. Senate",
    "Jordan Cox",
    "Andrew Dziedzic",
    "Taylor LaJoie",
    "Natalie McIntyre",
    "Jack Rosemond",
    "Stephen Siao"
  ],
  "issues": [
    "The document does not provide specific legislative priorities or policies these appointees will focus on.",
    "It might be unclear how these appointments align with President Trump's broader legislative strategy."
  ],
  "citations": [],
  "document_type": "Press Release"
}