{
  "title": "President Trump Announces Appointments to the White House Office of Intergovernmental Affairs – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Appointments to the White House Office of Intergovernmental Affairs",
  "og:description": "Alex Meyer will join the White House as a Deputy Assistant to the President and Director of the White House Office of Intergovernmental Affairs. Meyer",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-appointments-to-the-white-house-office-of-intergovernmental-affairs/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-20T00:15:09+00:00",
  "article:modified_time": "2025-02-20T00:17:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident Trump Announces Appointments to the White House Office of Intergovernmental Affairs \t\t\t\t\n\nFebruary 19, 2025\n\n**Alex Meyer**will join the White House as a Deputy Assistant to the President and Director of the White House Office of Intergovernmental Affairs. Meyer previously served as the Deputy Political Director for the Trump-Vance 2024 Campaign directly managing President Trump’s victorious operations in the battleground states of Georgia, North Carolina, and Pennsylvania. Meyer in the 2024 Presidential Primary served as the Senior Advisor for President Trump’s Iowa Caucus Campaign. Meyer brings over a decade of successful campaign experience up and down the ballot.**Jared Borg** will join the White House as Special Assistant to the President and Deputy Director of the White House Office of Intergovernmental Affairs for State Governments. Jared is a campaign veteran of both President Trump’s 2020 and 2024 campaigns. He has also been a part of several high-profile national races throughout his career. Borg is a graduate of The Ohio State University and is a United States Navy Veteran.**Christine Serrano Glassner** will join the White House as Special Assistant to the President and Deputy Director of the White House Office of Intergovernmental Affairs for Local and Tribal Governments. Prior to joining the White House, she served as Mayor of the Borough of Mendham, New Jersey for the last six years and on Council for two years.**Connor Reardon** will join the White House as Associate Director in the White House Office of Intergovernmental Affairs. Prior to this role, Reardon served as Pennsylvania State Director for the Republican National Committee and, most recently, as Pennsylvania Director of Operations for the Trump-Vance 2024 Campaign.**Chase Wilson** will join the White House as Associate Director in the White House Office of Intergovernmental Affairs. Prior to joining the White House, Wilson served as State Director of Oklahoma during the 2024 Presidential Primary and then Deputy State Director in North Carolina for the Trump-Vance 2024 Campaign.**Michael Silvio**will join the White House as Associate Director in the White House Office of Intergovernmental Affairs. Most recently, Michael served as the Nevada State Director for the Trump-Vance 2024 Campaign. Prior to that, Michael served as Political Director for Trump-endorsed Daniel Cameron for Governor (KY).**Sam Martinez** will join the White House as Associate Director in the White House Office of Intergovernmental Affairs. Prior to joining the White House, Martinez served as Pennsylvania Deputy State Director for the Trump-Vance 2024 Campaign.**Hope Moreland** will join the White House as Deputy Associate Director in the White House Office of Intergovernmental Affairs. Prior to joining the White House, Moreland served as Iowa Political Coordinator and Fulton County Field Director for the Trump-Vance 2024 Campaign.**Finley Varughese** will join the White House as Coordinator in the White House Office of Intergovernmental Affairs. Prior to joining the White House, he served as Programming &amp; Political Manager and Regional Political Coordinator at the Republican National Committee.**Elizabeth McAlindon**will join the White House as Staff Assistant in the White House Office of Intergovernmental Affairs. Prior to joining the White House, McAlindon served as Assistant to the Chief of Staff for U.S. Senator Marsha Blackburn (TN).\n\n**About the Office of Intergovernmental Affairs:**The White House Office of Intergovernmental Affairs (IGA) reports to Assistant to the President and White House Deputy Chief of Staff James Blair. The Office is managed by Deputy Assistant to the President and IGA Director Alex Meyer. The White House Office of Intergovernmental Affairs serves as the Administration’s principal liaison to state, local, tribal, and territorial governments, fostering an open channel for advancing key administration priorities and interagency coordination.\n",
  "summary": "President Trump announced new appointments to the White House Office of Intergovernmental Affairs on February 19, 2025. The Office serves as the main link between the Administration and state, local, tribal, and territorial governments to promote key administrative priorities and ensure coordination across various agencies. Alex Meyer has been appointed as Deputy Assistant to the President and Director of the Office, having previously led operations in key battleground states during the 2024 Trump-Vance Campaign.\n\nOther notable appointees include Jared Borg, who will serve as Special Assistant to the President and Deputy Director for State Governments, and Christine Serrano Glassner, who will serve as Deputy Director for Local and Tribal Governments. The appointees have extensive political experience from previous campaigns, bringing varied expertise to the Office to help build and maintain governmental relationships across different levels.",
  "eli5": "The president picked a bunch of new people to help him work with other important government leaders, like mayors and governors, so they can all work together better.",
  "keywords": [
    "Trump Administration",
    "White House",
    "Intergovernmental Affairs",
    "Appointments",
    "2025",
    "State and Local Government",
    "Office of Intergovernmental Affairs"
  ],
  "issues": [],
  "citations": [],
  "document_type": "Presidential Action"
}