{
  "title": "President Donald J. Trump Approves Kentucky Emergency Declaration – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Donald J. Trump Approves Kentucky Emergency Declaration",
  "og:description": "Today, President Donald J. Trump declared that an emergency exists in the Commonwealth of Kentucky and ordered Federal assistance to supplement",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/president-donald-j-trump-approves-kentucky-emergency-declaration/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-16T20:17:51+00:00",
  "article:modified_time": "2025-02-16T20:17:52+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# **President Donald J. Trump Approves Kentucky Emergency Declaration**\n\nFebruary 16, 2025\n\nToday, President Donald J. Trump declared that an emergency exists in the Commonwealth of Kentucky and ordered Federal assistance to supplement Commonwealth and local response efforts due to the emergency conditions resulting from severe storms, straight-line winds, flooding, and landslides beginning on February 14, 2025, and continuing. \n\nThe President’s action authorizes the Department of Homeland Security, Federal Emergency Management Agency (FEMA), to coordinate all disaster relief efforts which have the purpose of alleviating the hardship and suffering caused by the emergency on the local population. FEMA will provide appropriate assistance for required emergency measures, authorized under Title V of the Stafford Act, to save lives and to protect property and public health and safety, and to lessen or avert the threat of a catastrophe in all 120 counties of the Commonwealth of Kentucky.Specifically, FEMA is authorized to identify, mobilize, and provide, at its discretion, equipment and resources necessary to alleviate the impacts of the emergency.  Emergency protective measures, limited to direct federal assistance, will be provided at 75 percent Federal funding. Mr. Jeremy Slinker of FEMA has been appointed to coordinate Federal recovery operations in the affected areas.FOR FURTHER INFORMATION MEDIA SHOULD CONTACT THE FEMA NEWS DESK AT (202) 646-3272 OR [FEMA-NEWS-DESK@FEMA.DHS.GOV](mailto:FEMA-NEWS-DESK@DHS.GOV).\n",
  "summary": "On February 16, 2025, President Donald J. Trump declared an emergency in the Commonwealth of Kentucky due to substantial damage caused by severe weather conditions, including storms, winds, flooding, and landslides, starting on February 14, 2025. This declaration facilitates Federal assistance to bolster state and local responses, aiming to alleviate the hardship experienced by the residents of the area.\n\nThe Federal Emergency Management Agency (FEMA) has been empowered to lead all disaster relief efforts aimed at mitigating the aftermath of these crises. Under the authority granted by Title V of the Stafford Act, FEMA will coordinate the provision of necessary equipment and resources to address the emergency's impacts. Assistance is restricted to direct federal aid, funded at a rate of 75 percent, with Mr. Jeremy Slinker appointed as the coordinator for Federal recovery operations in the 120 affected counties.\n\nFor further details, media representatives can reach the FEMA News Desk either by phone or email.",
  "eli5": "President Trump said Kentuckians need help after a big storm and told FEMA to step in and help people and places get better. They will pay three-quarters of the costs to protect people and property.",
  "keywords": [
    "Kentucky",
    "Trump",
    "Emergency Declaration",
    "FEMA",
    "Federal Assistance",
    "Storms",
    "Flooding",
    "Stafford Act"
  ],
  "issues": [
    "Verification of date and accuracy regarding President Trump's term in 2025",
    "Comprehensiveness of FEMA's plan and readiness"
  ],
  "citations": [
    "Title V of the Stafford Act"
  ],
  "document_type": "Presidential Action"
}