{
  "title": "President Trump Announces the President’s Intelligence Advisory Board – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces the President’s Intelligence Advisory Board",
  "og:description": "Today, President Donald J. Trump is pleased to announce a distinguished and trusted group of Patriots to serve on the President’s Intelligence Advisory",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/president-trump-announces-the-presidents-intelligence-advisory-board/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-12T00:21:06+00:00",
  "article:modified_time": "2025-02-12T00:21:22+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident Trump Announces the President’s Intelligence Advisory Board\t\t\t\t\n\nFebruary 11, 2025\n\nToday, President Donald J. Trump is pleased to announce a distinguished and trusted group of Patriots to serve on the President’s Intelligence Advisory Board (PIAB). These individuals will advise the President on our nation’s most important security challenges and ensure that the Intelligence Community is working to advance the President’s America First agenda. The President’s PIAB appointees represent a broad range of experience and intellect that will help restore integrity to our Intelligence Community. The following individuals have been appointed to the PIAB:Devin Gerald Nunes, ChairScott GlabeAmaryllis Fox KennedyBrad Robert WenstrupWayne BermanReince PriebusRobert O’BrienJoshua LobelSander R. GerberKatie MillerJeremy KatzThomas Ollis Hicks, Jr.\n",
  "summary": "On February 11, 2025, President Donald J. Trump announced the appointment of members to the President’s Intelligence Advisory Board (PIAB). This board is composed of a group of thoughtfully chosen individuals who are tasked with advising the President on substantial national security issues. The main aim is to ensure that the Intelligence Community operates in alignment with the President’s 'America First' agenda.\n\nThe appointees to the PIAB include a range of experienced individuals, namely: Devin Gerald Nunes, who will serve as Chair, alongside members Scott Glabe, Amaryllis Fox Kennedy, Brad Robert Wenstrup, Wayne Berman, Reince Priebus, Robert O’Brien, Joshua Lobel, Sander R. Gerber, Katie Miller, Jeremy Katz, and Thomas Ollis Hicks, Jr. These appointments are intended to bring diverse expertise to restore integrity to the Intelligence Community.",
  "eli5": "President Trump picked a team of smart and experienced people to help him with big security problems in the country. They are called the President’s Intelligence Advisory Board, and they help make sure the country's secrets are safe and work with President Trump's plans.",
  "keywords": [
    "President Trump",
    "Intelligence Advisory Board",
    "national security",
    "America First agenda",
    "Devin Nunes",
    "appointments"
  ],
  "issues": [
    "Potential bias or conflict of interest due to political affiliations of appointees.",
    "Lack of transparency regarding the selection process for board members.",
    "How the PIAB will interact with existing intelligence structures."
  ],
  "citations": [],
  "document_type": "Presidential Action"
}