{
  "title": "Presidential Message on Susan B. Anthony Day, 2025 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Presidential Message on Susan B. Anthony Day, 2025",
  "og:description": "Today, we celebrate the birthday of Susan B. Anthony, a warrior for women and hero of Equality, Justice, and the Constitutional rule of law. For her",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/presidential-message-on-susan-b-anthony-day-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-15T17:28:23+00:00",
  "article:modified_time": "2025-02-16T17:29:38+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tPresidential Message on Susan B. Anthony Day, 2025\t\t\t\t\n\nFebruary 15, 2025\n\nToday, we celebrate the birthday of Susan B. Anthony, a warrior for women and hero of Equality, Justice, and the Constitutional rule of law.\n\nFor her entire life, Susan B. Anthony was fiercely devoted to the principle that every American, regardless of race or sex, is born with the God-given right to enjoy the blessings of Life, Liberty, and the pursuit of Happiness. Years later, her fearless crusade for Equality culminated in the ratification of the Nineteenth Amendment of the Constitution, which blocked states from denying citizens the right to vote on the basis of sex. Throughout her storied life, she also emerged as a champion of the abolitionist movement and a tireless advocate for the sanctity of life.\n\nAs President, I have already taken historic action to advance the sacred causes that Susan B. Anthony cherished so deeply. I was honored to sign an Executive Order safeguarding women’s sports—ensuring the survival of free and competitive spaces for female athletes. Additionally, I was proud to order the end of taxpayer-funded abortion—a big win for the most vulnerable among us.\n\nWhile my Administration continues to honor the legacy of Susan B. Anthony and promote our shared cause of Liberty and Justice for all, I also want to thank our Nation’s First Lady, Melania Trump, for previously hosting a White House celebration with America’s youth to honor the centennial anniversary of the ratification of the Nineteenth Amendment. I know she looks forward to continuing to help empower and support girls and women in the United States and around the globe.\n\nToday, Melania joins me in paying tribute to Susan B. Anthony’s perseverance, leadership, and monumental achievements. Let us continue her life’s work of creating a culture that celebrates the enduring triumph of Freedom, the dignity of life, and the full glory of the American promise.\n",
  "summary": "The White House issued a presidential message on February 15, 2025, to commemorate the birthday of Susan B. Anthony, a pivotal figure in advocating for women's rights and equality. Susan B. Anthony is celebrated for her relentless efforts in advancing the Nineteenth Amendment, which guaranteed women the right to vote, as well as her dedication to the abolitionist movement and the protection of life. \n\nThe President highlighted his administration's commitment to Susan B. Anthony's causes by mentioning efforts such as the signing of an Executive Order to protect women's sports and ceasing taxpayer-funded abortions. Furthermore, the First Lady, Melania Trump, was acknowledged for her role in promoting women's empowerment, including hosting a White House event celebrating the centennial of the Nineteenth Amendment. Together, they honor Anthony's legacy and encourage a culture that cherishes freedom and dignity for all Americans.",
  "eli5": "The President says 'Happy Birthday' to a famous woman named Susan B. Anthony, who helped make sure women could vote. He also talks about things he's done to help protect girls and women.",
  "keywords": [
    "Susan B. Anthony",
    "women's rights",
    "Nineteenth Amendment",
    "Executive Order",
    "women's sports",
    "taxpayer-funded abortion",
    "First Lady",
    "Melania Trump",
    "celebration"
  ],
  "issues": [
    "Clarification needed on the scope and implications of the Executive Order regarding women's sports and taxpayer-funded abortions.",
    "Potential political controversy surrounding the actions mentioned and the way they are framed in relation to Susan B. Anthony's legacy."
  ],
  "citations": [],
  "document_type": "Presidential Message"
}