{
  "title": "Progress on the Situation at Our Southern Border – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Progress on the Situation at Our Southern Border – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/progress-on-the-situation-at-our-southern-border/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-03T23:43:12+00:00",
  "article:modified_time": "2025-02-04T00:27:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tProgress on the Situation At Our Southern Border\t\t\t\t\n\nFebruary 3, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 *et seq*.) (IEEPA), the National Emergencies Act (50 U.S.C. 1601 *et seq*.), section 604 of the Trade Act of 1974, as amended (19 U.S.C. 2483), and section 301 of title 3, United States Code, it is hereby ordered:\n\nSection 1.  Background.  On February 1, 2025, I determined that the failure of Mexico to arrest, seize, detain, or otherwise intercept Mexican drug trafficking organizations, other drug and human traffickers, criminals at large, and illicit drugs constitutes an unusual and extraordinary threat, which has its source in substantial part outside the United States, to the national security, foreign policy, and economy of the United States.  To address that threat, I invoked my authority under section 1702(a)(1)(B) of IEEPA to impose ad valorem tariffs on articles that are products of Mexico. Sec. 2.  Immediate Steps.  Pursuant to section 3 of my Executive Order of February 1, 2025, titled “Imposing Duties to Address the Situation at Our Southern Border” (“the Executive Order of February 1, 2025”), I have determined that the Government of Mexico has taken immediate steps designed to alleviate the illegal migration and illicit drug crisis through cooperative actions.  Further time is needed, however, to assess whether these steps constitute sufficient action to alleviate the crisis and resolve the unusual and extraordinary threat beyond our southern border.Sec. 3.  Pause.  (a)  In recognition of the steps taken by the Government of Mexico, and in order to assess whether the threat described in section 1 of this order has abated, the additional 25 percent ad valorem rate of duty shall be paused and will not take effect until March 4, 2025, at 12:01 am eastern time. Accordingly, sections 2(a), sections 2(d), and section 2(e) of the Executive Order of February 1, 2025, are amended by striking the term “February 4, 2025,” where it appears in those sections and inserting in lieu thereof the term “March, 4, 2025.”  The exceptions set forth in section 2(a) of the Executive Order of February 1, 2025, related to covered goods loaded onto a vessel at a port of entry or in transit on the final mode of transport prior to entry into the United States are, hereby, withdrawn.     (b)  During this pause, the Secretary of Homeland Security, in consultation with the Secretary of State, the Attorney General, the Assistant to the President for National Security Affairs, and the Assistant to the President for Homeland Security, shall continue to assess the situation at our southern border, as provided in section 3 of the Executive Order of February 1, 2025.     (c)  If the illegal migration and illicit drug crises worsen, and if the Government of Mexico fails to take sufficient steps to alleviate these crises, the President shall take necessary steps to address the situation, including by immediate implementation of the tariffs described in the Executive Order of February 1, 2025. Sec. 4.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.Sec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:     (i)   the authority granted by law to an executive department or agency, or the head thereof; or     (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    February 3, 2025.\n",
  "summary": "The document, dated February 3, 2025, details presidential actions taken by the President of the United States to address the situation at the southern border, particularly concerning Mexico's role. The President determined that Mexico's failure to effectively combat drug trafficking and illegal migration constitutes a severe threat to the U.S. As a response, tariffs on Mexican imports were imposed, invoking the International Emergency Economic Powers Act and other statutory authorities.\n\nIn recognition of immediate steps taken by Mexico to address these issues, the additional tariffs were paused until March 4, 2025, to allow further assessment of the situation. This order specifies that if the situation deteriorates or if Mexico does not take adequate actions, the tariffs will be implemented without delay. The document outlines consultations among various U.S. departments and officials to continuously evaluate the situation, ensuring that efforts are aligned with U.S. laws and available resources.",
  "eli5": "The President decided to place extra taxes on things coming from Mexico because they're not doing enough to stop bad people and drugs from coming into the U.S. But because Mexico is trying to fix things, the President paused these extra taxes to see if the situation gets better.",
  "keywords": [
    "Presidential Actions",
    "Mexico",
    "Southern Border",
    "Tariffs",
    "Illegal Migration",
    "Drug Trafficking",
    "IEEPA",
    "National Security"
  ],
  "issues": [
    "Effectiveness of Mexico's actions to combat trafficking",
    "Impact of tariffs on U.S.-Mexico relations",
    "Long-term economic effects of imposing tariffs"
  ],
  "citations": [
    "50 U.S.C. 1701 et seq.",
    "50 U.S.C. 1601 et seq.",
    "19 U.S.C. 2483",
    "3 U.S.C. 301"
  ],
  "document_type": "Presidential Action"
}