{
  "title": "Progress on the Situation at Our Northern Border – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Progress on the Situation at Our Northern Border – The White House",
  "og:description": "     By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/progress-on-the-situation-at-our-northern-border/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-04T00:27:01+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tProgress on the Situation at Our Northern Border\t\t\t\t\n\nFebruary 3, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 *et seq*.) (IEEPA), the National Emergencies Act (50 U.S.C. 1601 *et seq*.), section 604 of the Trade Act of 1974, as amended (19 U.S.C. 2483), and section 301 of title 3, United States Code, it is hereby ordered:\n\nSection 1.  Background. On February 1, 2025, I determined that the failure of Canada to arrest, seize, detain, or otherwise intercept drug trafficking organizations, other drug and human traffickers, criminals at large, and illicit drugs constitutes an unusual and extraordinary threat, which has its source in substantial part outside the United States, to the national security, foreign policy, and economy of the United States.  To address that threat, I invoked my authority under section 1702(a)(1)(B) of IEEPA to impose ad valorem tariffs on articles that are products of Canada.\n\nSec. 2.  Immediate Steps.  Pursuant to section 3 of my Executive Order of February 1, 2025, titled “Imposing Duties to Address the Situation at Our Northern Border” (“the Executive Order of February 1, 2025”), I have determined that the Government of Canada has taken immediate steps designed to alleviate the illegal migration and illicit drug crisis through cooperative actions.  Further time is needed, however, to assess whether these steps constitute sufficient action to alleviate the crisis and resolve the unusual and extraordinary threat beyond our northern border.\n\nSec. 3.  Pause.  (a)  In recognition of the steps taken by the Government of Canada, and in order to assess whether the threat described in section 1 of this order has abated, the additional 25 percent ad valorem rates of duty, and 10 percent ad valorem rates of duty as to energy products, shall be paused and will not take effect until March 4, 2025, at 12:01 a.m. eastern time.  Accordingly, section 2(a), section 2(b), section 2(e), and section 2(f) of the Executive Order of February 1, 2025, are amended by striking the term “February 4, 2025,” where it appears in those sections and inserting in lieu thereof the term “March 4, 2025.”  The exceptions set forth in section 2(a) and section 2(b) of the Executive Order of February 1, 2025, related to covered goods loaded onto a vessel at a port of entry or in transit on the final mode of transport prior to entry into the United States are, hereby, withdrawn.(b)  During this pause, the Secretary of Homeland Security, in consultation with the Secretary of State, the Attorney General, the Assistant to the President for National Security Affairs, and the Assistant to the President for Homeland Security shall continue to assess the situation at our northern border, as provided in section 3 of the Executive Order of February 1, 2025.(c)  If the illegal migration and illicit drug crises worsen, and if the Government of Canada fails to take sufficient steps to alleviate these crises, the President shall take necessary steps to address the situation, including by immediate implementation of the tariffs described in the Executive Order of February 1, 2025.\n\nSec. 4.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.\n\nSec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:(i)   the authority granted by law to an executive department or agency, or the head thereof; or(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.THE WHITE HOUSE,    February 3, 2025.\n",
  "summary": "On February 3, 2025, the President of the United States issued an order addressing a national security threat posed by drug trafficking and illegal migration across the northern border with Canada. By invoking the International Emergency Economic Powers Act and other legal frameworks, the President initially imposed tariffs on Canadian goods due to Canada's insufficient actions against these threats. The government of Canada has since taken steps to combat these issues, leading the President to pause the implementation of additional tariffs until March 4, 2025, to give time for further assessment of Canada's efforts.\n\nDuring this pause, the Secretary of Homeland Security, alongside key officials, will continue evaluating the situation to determine if the steps taken by Canada adequately mitigate the crisis. If the situation worsens or Canada fails in its efforts, the President will enforce the previously stated tariffs. The order also outlines severability and general provisions to ensure the continuity and enforceability of its terms, regardless of potential legal challenges.",
  "eli5": "The President decided to put extra charges on things we get from Canada because they weren't stopping bad things like drugs coming to the U.S. But now, Canada is trying to help, so these charges are on hold until the President's team sees if things improve by next month.",
  "keywords": [
    "US-Canada relations",
    "tariffs",
    "drug trafficking",
    "national security",
    "International Emergency Economic Powers Act",
    "illegal migration"
  ],
  "issues": [
    "Effectiveness of Canada's measures against drug trafficking",
    "Potential economic impact of tariffs",
    "Legal challenges to the Executive Order",
    "Long-term impact on US-Canada relations"
  ],
  "citations": [
    "50 U.S.C. 1701 et seq.",
    "50 U.S.C. 1601 et seq.",
    "19 U.S.C. 2483",
    "Section 1702(a)(1)(B) of IEEPA"
  ],
  "document_type": "Presidential Action"
}