{
  "title": "Protecting The United States From Foreign Terrorists And Other National Security And Public Safety Threats – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Protecting The United States From Foreign Terrorists And Other National Security And Public Safety Threats – The White House",
  "og:description": "PROTECTING THE UNITED STATES FROM FOREIGN TERRORISTS AND OTHER NATIONAL SECURITY AND PUBLIC SAFETY THREATS By the authority vested in me as President by",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-united-states-from-foreign-terrorists-and-othernational-security-and-public-safety-threats/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:46:18+00:00",
  "article:modified_time": "2025-01-21T02:18:36+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPROTECTING THE UNITED STATES FROM FOREIGN TERRORISTS AND OTHERNATIONAL SECURITY AND PUBLIC SAFETY THREATS\t\t\t\t\n\nJanuary 20, 2025\n\nPROTECTING THE UNITED STATES FROM FOREIGN TERRORISTS AND OTHER\n\nNATIONAL SECURITY AND PUBLIC SAFETY THREATS\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act (INA), 8 U.S.C. 1101 *et seq.*, and section 301 of title 3, United States Code, it is hereby ordered:\n\nSection 1.  Policy and Purpose.  (a)  It is the policy of the United States to protect its citizens from aliens who intend to commit terrorist attacks, threaten our national security, espouse hateful ideology, or otherwise exploit the immigration laws for malevolent purposes.\n\n(b)  To protect Americans, the United States must be vigilant during the visa-issuance process to ensure that those aliens approved for admission into the United States do not intend to harm Americans or our national interests.  More importantly, the United States must identify them before their admission or entry into the United States.  And the United States must ensure that admitted aliens and aliens otherwise already present in the United States do not bear hostile attitudes toward its citizens, culture, government, institutions, or founding principles, and do not advocate for, aid, or support designated foreign terrorists and other threats to our national security.\n\nSec. 2.  Enhanced Vetting and Screening Across Agencies.\n\n(a)  The Secretary of State, in coordination with the Attorney General, the Secretary of Homeland Security, and the Director of National Intelligence, shall promptly:\n\n(i)    identify all resources that may be used to ensure that all aliens seeking admission to the United States, or who are already in the United States, are vetted and screened to the maximum degree possible;\n\n(ii)   determine the information needed from any country to adjudicate any visa, admission, or other benefit under the INA for one of its nationals, and to ascertain whether the individual seeking the benefit is who the individual claims to be and that the individual is not a security or public-safety threat;\n\n(iii)  re-establish a uniform baseline for screening and vetting standards and procedures, consistent with the uniform baseline that existed on January 19, 2021, that will be used for any alien seeking a visa or immigration benefit of any kind; and\n\n(iv)   vet and screen to the maximum degree possible all aliens who intend to be admitted, enter, or are already inside the United States, particularly those aliens coming from regions or nations with identified security risks.\n\n(b)  Within 60 days of the date of this order, the Secretary of State, the Attorney General, the Secretary of Homeland Security, and the Director of National Intelligence shall jointly submit to the President, through the Assistant to the President for Homeland Security, a report:\n\n(i)   identifying countries throughout the world for which vetting and screening information is so deficient as to warrant a partial or full suspension on the admission of nationals from those countries pursuant to section 212(f) of the INA (8 U.S.C. 1182(f)); and\n\n(ii)  identifying how many nationals from those countries have entered or have been admitted into the United States on or since January 20, 2021, and any other information the Secretaries and Attorney General deem relevant to the actions or activities of such nationals since their admission or entry to the United States.\n\n(c)  Whenever information is identified that would support the exclusion or removal of any alien described in subsection 2(b), the Secretary of Homeland Security shall take immediate steps to exclude or remove that alien unless she determines that doing so would inhibit a significant pending investigation or prosecution of the alien for a serious criminal offense or would be contrary to the national security interests of the United States.\n\nSec. 3.  Additional Measures to Protect the Nation.  As soon as possible, but no later than 30 days from the date of this order, the Secretary of State, in coordination with the Attorney General, the Secretary of Homeland Security, and the Director of National Intelligence, shall also:\n\n(a)  Evaluate and adjust all existing regulations, policies, procedures, and provisions of the Foreign Service Manual, or guidance of any kind pertaining to each of the grounds of inadmissibility listed in sections 212(a)(2)-(3) of the INA (8 U.S.C. 1182(a)(2)-(3)), to ensure the continued safety and security of the American people and our constitutional republic;\n\n(b)  Ensure that sufficient safeguards are in place to prevent any refugee or stateless individual from being admitted to the United States without undergoing stringent identification verification beyond that required of any other alien seeking admission or entry to the United States;\n\n(c)  Evaluate all visa programs to ensure that they are not used by foreign nation-states or other hostile actors to harm the security, economic, political, cultural, or other national interests of the United States;\n\n(d)  Recommend any actions necessary to protect the American people from the actions of foreign nationals who have undermined or seek to undermine the fundamental constitutional rights of the American people, including, but not limited to, our Citizens’ rights to freedom of speech and the free exercise of religion protected by the First Amendment, who preach or call for sectarian violence, the overthrow or replacement of the culture on which our constitutional Republic stands, or who provide aid, advocacy, or support for foreign terrorists;\n\n(e)  Ensure the devotion of adequate resources to identify and take appropriate action for offenses described in 8 U.S.C. 1451;\n\n(f)  Evaluate the adequacy of programs designed to ensure the proper assimilation of lawful immigrants into the United States, and recommend any additional measures to be taken that promote a unified American identity and attachment to the Constitution, laws, and founding principles of the United States; and\n\n(g)  Recommend any additional actions to protect the American people and our constitutional republic from foreign threats.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20 2025.\n",
  "summary": "On January 20, 2025, a presidential order was issued with the aim of bolstering U.S. national security by enhancing the vetting and screening procedures for foreign nationals entering the United States. The order leveraged the authority granted to the President by the Constitution, the Immigration and Nationality Act (INA), and U.S. Code. The directive instructs key government officials, including the Secretary of State, Attorney General, Secretary of Homeland Security, and Director of National Intelligence, to utilize maximum resources for vetting individuals seeking entry to the U.S.\n\nThe order specifies the need to identify and mitigate threats from countries with inadequate screening processes and calls for potential suspension of nationals from such countries. It also outlines steps to improve existing regulations and policies to ensure national safety. Enhanced measures should prevent admission of refugees or stateless individuals without stringent verification and protect against foreign influences undermining U.S. constitutional rights.\n\nWithin 30 to 60 days of the order, various secretaries and agencies are required to submit reports and recommendations on necessary actions and resource allocations. The order stresses ensuring adherence to existing laws and appropriation limits, while also maintaining the objective of securing the nation from foreign threats without creating enforceable legal rights for individuals.",
  "eli5": "The President made new rules to keep bad people out of the country. They want to check everyone really carefully who wants to come in, especially if they're from places that might be dangerous.",
  "keywords": [
    "national security",
    "foreign terrorists",
    "immigration",
    "vetting",
    "screening",
    "INA",
    "public safety",
    "immigration laws"
  ],
  "issues": [
    "Potential impact on international relations",
    "Effectiveness of enhanced vetting",
    "Balancing national security and individual rights",
    "Implementation challenges across various agencies"
  ],
  "citations": [
    "Immigration and Nationality Act (INA), 8 U.S.C. 1101 et seq.",
    "Section 301 of title 3, United States Code",
    "8 U.S.C. 1182(f)"
  ],
  "document_type": "Executive Order"
}