{
  "title": "Protecting The Meaning And Value Of American Citizenship – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Protecting The Meaning And Value Of American Citizenship",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:37:50+00:00",
  "article:modified_time": "2025-01-21T02:23:21+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPROTECTING THE MEANING AND VALUE OF AMERICAN CITIZENSHIP \t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose.  The privilege of United States citizenship is a priceless and profound gift.  The Fourteenth Amendment states:  “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.”  That provision rightly repudiated the Supreme Court of the United States’s shameful decision in *Dred Scott v. Sandford*, 60 U.S. (19 How.) 393 (1857), which misinterpreted the Constitution as permanently excluding people of African descent from eligibility for United States citizenship solely based on their race. \n\nBut the Fourteenth Amendment has never been interpreted to extend citizenship universally to everyone born within the United States.  The Fourteenth Amendment has always excluded from birthright citizenship persons who were born in the United States but not “subject to the jurisdiction thereof.”  Consistent with this understanding, the Congress has further specified through legislation that “a person born in the United States, and subject to the jurisdiction thereof” is a national and citizen of the United States at birth, 8 U.S.C. 1401, generally mirroring the Fourteenth Amendment’s text.  \n\nAmong the categories of individuals born in the United States and not subject to the jurisdiction thereof, the privilege of United States citizenship does not automatically extend to persons born in the United States:  (1) when that person’s mother was unlawfully present in the United States and the father was not a United States citizen or lawful permanent resident at the time of said person’s birth, or (2) when that person’s mother’s presence in the United States at the time of said person’s birth was lawful but temporary (such as, but not limited to, visiting the United States under the auspices of the Visa Waiver Program or visiting on a student, work, or tourist visa) and the father was not a United States citizen or lawful permanent resident at the time of said person’s birth.\n\nSec. 2.  Policy.  (a)  It is the policy of the United States that no department or agency of the United States government shall issue documents recognizing United States citizenship, or accept documents issued by State, local, or other governments or authorities purporting to recognize United States citizenship, to persons:  (1) when that person’s mother was unlawfully present in the United States and the person’s father was not a United States citizen or lawful permanent resident at the time of said person’s birth, or (2) when that person’s mother’s presence in the United States was lawful but temporary, and the person’s father was not a United States citizen or lawful permanent resident at the time of said person’s birth.\n\n(b)  Subsection (a) of this section shall apply only to persons who are born within the United States after 30 days from the date of this order.\n\n(c)  Nothing in this order shall be construed to affect the entitlement of other individuals, including children of lawful permanent residents, to obtain documentation of their United States citizenship. \n\nSec. 3.  Enforcement.  (a)  The Secretary of State, the Attorney General, the Secretary of Homeland Security, and the Commissioner of Social Security shall take all appropriate measures to ensure that the regulations and policies of their respective departments and agencies are consistent with this order, and that no officers, employees, or agents of their respective departments and agencies act, or forbear from acting, in any manner inconsistent with this order.\n\n(b)  The heads of all executive departments and agencies shall issue public guidance within 30 days of the date of this order regarding this order’s implementation with respect to their operations and activities.\n\nSec. 4.  Definitions.  As used in this order:\n\n(a)  “Mother” means the immediate female biological progenitor.\n\n(b)  “Father” means the immediate male biological progenitor.\n\nSec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20, 2025.\n",
  "summary": "The document is an executive order issued by the President of the United States on January 20, 2025, titled 'Protecting the Meaning and Value of American Citizenship.' It addresses the interpretation of birthright citizenship under the Fourteenth Amendment, which states that people born or naturalized in the United States and subject to its jurisdiction are citizens. This order specifies that certain individuals born in the U.S. are not automatically granted citizenship, particularly when the criteria concerning the legal and residency status of their parents are unmet. \n\nSpecifically, it limits citizenship for those born to parents where the mother is either unlawfully present or there temporarily, and neither parent is a U.S. citizen or lawful permanent resident. The document sets guidelines and policies for government departments not to issue citizenship documents to individuals fitting these criteria, applies 30 days post-order, and ensures existing processes for others, like lawful permanent residents' children, are unaffected. Agencies such as the State Department, Justice Department, Homeland Security, and Social Security are tasked with enforcing these measures.\n\nFurthermore, all executive departments and agencies have to provide guidance within 30 days for implementing this order. Definitions are provided for terms like 'Mother' and 'Father,' and provisions stipulate that the order does not alter existing authorities or create enforceable legal rights. The document underscores its alignment with legal and budgetary regulations.",
  "eli5": "This document from the President says that not all babies born in the U.S. can become citizens automatically. If the baby's parents are not legally living in the U.S. or are only here temporarily, the baby might not get U.S. citizenship.",
  "keywords": [
    "birthright citizenship",
    "Fourteenth Amendment",
    "U.S. citizenship",
    "executive order",
    "immigration",
    "jurisdiction",
    "lawful permanent resident",
    "legal status",
    "United States"
  ],
  "issues": [
    "Potential challenges to the interpretation of the Fourteenth Amendment.",
    "Impact on individuals born to non-citizen parents in the U.S.",
    "Compliance with international human rights norms.",
    "Legal challenges and implications for families."
  ],
  "citations": [
    "Fourteenth Amendment of the United States Constitution",
    "8 U.S.C. 1401"
  ],
  "document_type": "Executive Order"
}