{
  "title": "Protecting The American People Against Invasion – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Protecting The American People Against Invasion – The White House",
  "og:description": "PROTECTING THE AMERICAN PEOPLE AGAINST INVASION By the authority vested in me as President by the Constitution and the laws of the United States of",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-american-people-against-invasion/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:45:42+00:00",
  "article:modified_time": "2025-01-21T02:19:59+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPROTECTING THE AMERICAN PEOPLE AGAINST INVASION\t\t\t\t\n\nJanuary 20, 2025\n\nPROTECTING THE AMERICAN PEOPLE AGAINST INVASION\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act (INA) (8 U.S.C. 1101 *et seq*.) and section 301 of title 3, United States Code, it is hereby ordered:\n\nSection 1.  Purpose.  Over the last 4 years, the prior administration invited, administered, and oversaw an unprecedented flood of illegal immigration into the United States.  Millions of illegal aliens crossed our borders or were permitted to fly directly into the United States on commercial flights and allowed to settle in American communities, in violation of longstanding Federal laws.\n\nMany of these aliens unlawfully within the United States present significant threats to national security and public safety, committing vile and heinous acts against innocent Americans.  Others are engaged in hostile activities, including espionage, economic espionage, and preparations for terror-related activities.  Many have abused the generosity of the American people, and their presence in the United States has cost taxpayers billions of dollars at the Federal, State, and local levels.\n\nEnforcing our Nation’s immigration laws is critically important to the national security and public safety of the United States.  The American people deserve a Federal Government that puts their interests first and a Government that understands its sacred obligation to prioritize the safety, security, and financial and economic well-being of Americans.\n\nThis order ensures that the Federal Government protects the American people by faithfully executing the immigration laws of the United States.\n\nSec. 2.  Policy.  It is the policy of the United States to faithfully execute the immigration laws against all inadmissible and removable aliens, particularly those aliens who threaten the safety or security of the American people.  Further, it is the policy of the United States to achieve the total and efficient enforcement of those laws, including through lawful incentives and detention capabilities.\n\nSec. 3.  Faithful Execution of the Immigration Laws.  In furtherance of the policies described in section 2 of this order:\n\n(a)  Executive Order 13993 of January 20, 2021 (Revision of Civil Immigration Enforcement Policies and Priorities), Executive Order 14010 of February 2, 2021 (Creating a Comprehensive Regional Framework To Address the Causes of Migration, To Manage Migration Throughout North and Central America, and To Provide Safe and Orderly Processing of Asylum Seekers at the United States Border), Executive Order 14011 of February 2, 2021 (Establishment of Interagency Task Force on the Reunification of Families), and Executive Order 14012 of February 2, 2021 (Restoring Faith in Our Legal Immigration Systems and Strengthening Integration and Inclusion Efforts for New Americans) are hereby revoked; and\n\n(b)  Executive departments and agencies (agencies) shall take all appropriate action to promptly revoke all memoranda, guidance, or other policies based on the Executive Orders revoked in section 3(a) of this order and shall employ all lawful means to ensure the faithful execution of the immigration laws of the United States against all inadmissible and removable aliens.\n\nSec. 4.  Civil Enforcement Priorities.  The Secretary of Homeland Security shall take all appropriate action to enable the Director of U.S. Immigration and Customs Enforcement, the Commissioner of U.S. Customs and Border Protection, and the Director of U.S. Citizenship and Immigration Services to set priorities for their agencies that protect the public safety and national security interests of the American people, including by ensuring the successful enforcement of final orders of removal.  Further, the Secretary of Homeland Security shall ensure that the primary mission of U.S. Immigration and Customs Enforcement’s Homeland Security Investigations division is the enforcement of the provisions of the INA and other Federal laws related to the illegal entry and unlawful presence of aliens in the United States and the enforcement of the purposes of this order.\n\nSec. 5.  Criminal Enforcement Priorities.  The Attorney General, in coordination with the Secretary of State and the Secretary of Homeland Security, shall take all appropriate action to prioritize the prosecution of criminal offenses related to the unauthorized entry or continued unauthorized presence of aliens in the United States.\n\nSec. 6.  Federal Homeland Security Task Forces.  (a)  The Attorney General and the Secretary of Homeland Security shall take all appropriate action to jointly establish Homeland Security Task Forces (HSTFs) in all States nationwide.\n\n(b)  The composition of each HSTF shall be subject to the direction of the Attorney General and the Secretary of Homeland Security, but shall include representation from any other Federal agencies with law enforcement officers, or agencies with the ability to provide logistics, intelligence, and operational support to the HSTFs, and shall also include representation from relevant State and local law enforcement agencies.  The heads of all Federal agencies shall take all appropriate action to provide support to the Attorney General and the Secretary of Homeland Security to ensure that the HSTFs fulfill the objectives in subsection (c) of this section, and any other lawful purpose that fulfills the policy objectives of this order.\n\n(c)  The objective of each HSTF is to end the presence of criminal cartels, foreign gangs, and transnational criminal organizations throughout the United States, dismantle cross-border human smuggling and trafficking networks, end the scourge of human smuggling and trafficking, with a particular focus on such offenses involving children, and ensure the use of all available law enforcement tools to faithfully execute the immigration laws of the United States.\n\n(d)  The Attorney General and the Secretary of Homeland Security shall take all appropriate action to provide an operational command center to coordinate the activities of the HSTFs and provide such support as they may require, and shall also take all appropriate action to provide supervisory direction to their activities as may be required.\n\nSec. 7.  Identification of Unregistered Illegal Aliens.  The Secretary of Homeland Security, in coordination with the Secretary of State and the Attorney General, shall take all appropriate action to:\n\n(a)  Immediately announce and publicize information about the legal obligation of all previously unregistered aliens in the United States to comply with the requirements of part VII of subchapter II of chapter 12 of title 8, United States Code;\n\n(b)  Ensure that all previously unregistered aliens in the United States comply with the requirements of part VII of subchapter II of chapter 12 of title 8, United States Code; and\n\n(c)  Ensure that failure to comply with the legal obligations of part VII of subchapter II of chapter 12 of title 8, United States Code, is treated as a civil and criminal enforcement priority.\n\nSec. 8.  Civil Fines and Penalties.  (a)  The Secretary of Homeland Security, in coordination with the Secretary of Treasury, shall take all appropriate action to ensure the assessment and collection of all fines and penalties that the Secretary of Homeland Security is authorized by law to assess and collect from aliens unlawfully present in the United States, including aliens who unlawfully entered or unlawfully attempted to enter the United States, and from those who facilitate such aliens’ presence in the United States.\n\n(b)  Within 90 days of the date of this order, the Secretary of the Treasury and the Secretary of Homeland Security shall submit a report to the President regarding their progress implementing the requirements of this section and recommending any additional actions that may need to be taken to achieve its objectives.\n\nSec. 9.  Efficient Removals of Recent Entrants and Other Aliens.  The Secretary of Homeland Security shall take all appropriate action, pursuant to section 235(b)(1)(A)(iii)(I) of the INA (8 U.S.C. 1225(b)(1)(A)(iii)(I)), to apply, in her sole and unreviewable discretion, the provisions of section 235(b)(1)(A)(i) and (ii) of the INA to the aliens designated under section 235(b)(1)(A)(iii)(II).  Further, the Secretary of Homeland Security shall promptly take appropriate action to use all other provisions of the immigration laws or any other Federal law, including, but not limited to sections 238 and 240(d) of the INA (8 U.S.C. 1228 and 1229a(d)), to ensure the efficient and expedited removal of aliens from the United States.\n\nSec. 10.  Detention Facilities.  The Secretary of Homeland Security shall promptly take all appropriate action and allocate all legally available resources or establish contracts to construct, operate, control, or use facilities to detain removable aliens.  The Secretary of Homeland Security, further, shall take all appropriate actions to ensure the detention of aliens apprehended for violations of immigration law pending the outcome of their removal proceedings or their removal from the country, to the extent permitted by law.\n\nSec. 11.  Federal-State Agreements.  To ensure State and local law enforcement agencies across the United States can assist with the protection of the American people, the Secretary of Homeland Security shall, to the maximum extent permitted by law, and with the consent of State or local officials as appropriate, take appropriate action, through agreements under section 287(g) of the INA (8 U.S.C. 1357(g)) or otherwise, to authorize State and local law enforcement officials, as the Secretary of Homeland Security determines are qualified and appropriate, to perform the functions of immigration officers in relation to the investigation, apprehension, or detention of aliens in the United States under the direction and the supervision of the Secretary of Homeland Security.  Such authorization shall be in addition to, rather than in place of, Federal performance of these duties.  To the extent permitted by law, the Secretary of Homeland Security may structure each agreement under section 287(g) of the INA (8 U.S.C. 1357(g)) in the manner that provides the most effective model for enforcing Federal immigration laws in that jurisdiction.\n\nSec. 12.  Encouraging Voluntary Compliance with the Law.  The Secretary of Homeland Security shall take all appropriate action, in coordination with the Secretary of State and the Attorney General, and subject to adequate safeguards, assurances, bonds, and any other lawful measure, to adopt policies and procedures to encourage aliens unlawfully in the United States to voluntarily depart as soon as possible, including through enhanced usage of the provisions of section 240B of the INA (8 U.S.C. 1229c), international agreements or assistance, or any other measures that encourage aliens unlawfully in the United States to depart as promptly as possible, including through removals of aliens as provided by section 250 of the INA (8 U.S.C. 1260).\n\nSec. 13.  Recalcitrant Countries.  The Secretary of State and the Secretary of Homeland Security shall take all appropriate action to:\n\n(a)  Cooperate and effectively implement, as appropriate, the sanctions provided by section 243(d) of the INA (8 U.S.C. 1253(d)), with the Secretary of State, to the maximum extent permitted by law, ensuring that diplomatic efforts and negotiations with foreign states include the foreign states’ acceptance of their nationals who are subject to removal from the United States; and\n\n(b)  Eliminate all documentary barriers, dilatory tactics, or other restrictions that prevent the prompt repatriation of aliens to any foreign state.  Any failure or delay by a foreign state to verify the identity of a national of that state shall be considered in carrying out subsection (a) this section, and shall also be considered regarding the issuance of any other sanctions that may be available to the United States.\n\nSec. 14.  Visa Bonds.  The Secretary of Treasury shall take all appropriate action, in coordination with the Secretary of State and the Secretary of Homeland Security, to establish a system to facilitate the administration of all bonds that the Secretary of State or the Secretary of Homeland Security may lawfully require to administer the provisions of the INA.\n\nSec. 15.  Reestablishment of the VOICE Office and Addressing Victims of Crimes Committed by Removable Aliens.  The Secretary of Homeland Security shall direct the Director of U.S. Immigration and Customs Enforcement (ICE) to take all appropriate and lawful action to reestablish within ICE an office to provide proactive, timely, adequate, and professional services to victims of crimes committed by removable aliens, and those victims’ family members.  The Attorney General shall also ensure that the provisions of 18 U.S.C. 3771 are followed in all Federal prosecutions involving crimes committed by removable aliens.\n\nSec. 16.  Addressing Actions by the Previous Administration.  The Secretary of State, the Attorney General, and the Secretary of Homeland Security shall promptly take all appropriate action, consistent with law, to rescind the policy decisions of the previous administration that led to the increased or continued presence of illegal aliens in the United States, and align any and all departmental activities with the policies set out by this order and the immigration laws.  Such action should include, but is not limited to:\n\n(a)  ensuring that the parole authority under section 212(d)(5) of the INA (8 U.S.C. 1182(d)(5)) is exercised on only a case-by-case basis in accordance with the plain language of the statute, and in all circumstances only when an individual alien demonstrates urgent humanitarian reasons or a significant public benefit derived from their particular continued presence in the United States arising from such parole;\n\n(b)  ensuring that designations of Temporary Protected Status are consistent with the provisions of section 244 of the INA (8 U.S.C. 1254a), and that such designations are appropriately limited in scope and made for only so long as may be necessary to fulfill the textual requirements of that statute; and\n\n(c)  ensuring that employment authorization is provided in a manner consistent with section 274A of the INA (8 U.S.C. 1324a), and that employment authorization is not provided to any unauthorized alien in the United States.\n\nSec. 17.  Sanctuary Jurisdictions.  The Attorney General and the Secretary of Homeland Security shall, to the maximum extent possible under law, evaluate and undertake any lawful actions to ensure that so-called “sanctuary” jurisdictions, which seek to interfere with the lawful exercise of Federal law enforcement operations, do not receive access to Federal funds.  Further, the Attorney General and the Secretary of Homeland Security shall evaluate and undertake any other lawful actions, criminal or civil, that they deem warranted based on any such jurisdiction’s practices that interfere with the enforcement of Federal law.\n\nSec. 18.  Information Sharing.  (a)  The Secretary of Homeland Security shall promptly issue guidance to ensure maximum compliance by Department of Homeland Security personnel with the provisions of 8 U.S.C. 1373 and 8 U.S.C. 1644 and ensure that State and local governments are provided with the information necessary to fulfill law enforcement, citizenship, or immigration status verification requirements authorized by law; and\n\n(b)  The Attorney General, the Secretary of Health and Human Services, and the Secretary of Homeland Security shall take all appropriate action to stop the trafficking and smuggling of alien children into the United States, including through the sharing of any information necessary to assist in the achievement of that objective.\n\nSec. 19.  Funding Review.  The Attorney General and the Secretary of Homeland Security shall:\n\n(a)  Immediately review and, if appropriate, audit all contracts, grants, or other agreements providing Federal funding to non-governmental organizations supporting or providing services, either directly or indirectly, to removable or illegal aliens, to ensure that such agreements conform to applicable law and are free of waste, fraud, and abuse, and that they do not promote or facilitate violations of our immigration laws;\n\n(b)  Pause distribution of all further funds pursuant to such agreements pending the results of the review in subsection (a) of this section;\n\n(c)  Terminate all such agreements determined to be in violation of law or to be sources of waste, fraud, or abuse and prohibit any such future agreements;\n\n(d)  Coordinate with the Director of the Office of Management and Budget to ensure that no funding for agreements described in subsection (c) of this section is included in any appropriations request for the Department of Justice or the Department of Homeland Security; and\n\n(e)  Initiate clawback or recoupment procedures, if appropriate, for any agreements described in subsection (c) of this section.\n\nSec. 20.  Denial of Public Benefits to Illegal Aliens.  The Director of the Office of Management and Budget shall take all appropriate action to ensure that all agencies identify and stop the provision of any public benefits to any illegal alien not authorized to receive them under the provisions of the INA or other relevant statutory provisions.\n\nSec. 21.  Hiring More Agents and Officers.  Subject to available appropriations, the Secretary of Homeland Security, through the Commissioner of U.S. Customs and Border Protection and the Director of U.S. Immigration and Customs Enforcement, shall take all appropriate action to significantly increase the number of agents and officers available to perform the duties of immigration officers.\n\nSec. 22.  Severability.  It is the policy of the United States to enforce this order to the maximum extent possible to advance the interests of the United States. Accordingly:\n\n(a)  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its other provisions to any other persons or circumstances shall not be affected thereby; and\n\n(b)  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid because of the failure to follow certain procedures, the relevant executive branch officials shall implement those procedural requirements to conform with existing law and with any applicable court orders.\n\nSec. 23.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)  the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n     January 20, 2025.\n",
  "summary": "On January 20, 2025, a presidential order was issued focusing on bolstering enforcement against illegal immigration in the United States. The order outlines multiple actions to enforce federal immigration laws, prioritizing the removal of inadmissible aliens, especially those posing security threats. It rescinds previous executive orders from 2021 seen as easing immigration policies, emphasizing a renewed strict approach.\n\nThe order directs several federal agencies, including the Department of Homeland Security and the Department of Justice, to adopt measures such as establishing Homeland Security Task Forces nationwide, enforcing civil and criminal penalties against immigration violations, and facilitating the swift removal of illegal aliens. Additional measures include increasing detention capacities, enhancing cooperation with state and local law enforcement through agreements like the 287(g), and imposing penalties on jurisdictions not cooperating with federal immigration enforcement.\n\nMoreover, the order addresses funding to NGOs assisting undocumented immigrants, calls for a review of public benefits access for illegal aliens, and mandates the reestablishment of an office to support victims of crimes by removable aliens. This comprehensive approach aims to realign immigration-related activities of federal agencies with stricter legal interpretations and enforcement policies.",
  "eli5": "The President made some new rules to make sure people coming into the country without permission are stopped or sent back, and that the laws are followed very closely. They're making sure everyone who helps with this will work together well.",
  "keywords": [
    "immigration",
    "national security",
    "federal enforcement",
    "illegal aliens",
    "homeland security"
  ],
  "issues": [
    "Potential conflict with state and local laws",
    "Impact on immigrant communities",
    "Cost of implementing increased enforcement measures",
    "International diplomatic relations",
    "Legal challenges over immigration policy changes"
  ],
  "citations": [
    "8 U.S.C. 1101 et seq.",
    "section 301 of title 3, United States Code",
    "Executive Orders 13993, 14010, 14011, 14012",
    "8 U.S.C. 1357(g)",
    "section 287(g) of the INA",
    "section 212(d)(5) of the INA",
    "section 274A of the INA"
  ],
  "document_type": "Executive Order"
}