{
  "title": "Protecting Second Amendment Rights – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Protecting Second Amendment Rights",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/protecting-second-amendment-rights/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-08T00:04:14+00:00",
  "article:modified_time": "2025-02-12T14:39:16+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tProtecting Second Amendment Rights\t\t\t\t\n\nFebruary 7, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:     Section 1.  Purpose.  The Second Amendment is an indispensable safeguard of security and liberty.  It has preserved the right of the American people to protect ourselves, our families, and our freedoms since the founding of our great Nation.  Because it is foundational to maintaining all other rights held by Americans, the right to keep and bear arms must not be infringed.      Sec. 2.  Plan of Action.  (a)  Within 30 days of the date of this order, the Attorney General shall examine all orders, regulations, guidance, plans, international agreements, and other actions of executive departments and agencies (agencies) to assess any ongoing infringements of the Second Amendment rights of our citizens, and present a proposed plan of action to the President, through the Domestic Policy Advisor, to protect the Second Amendment rights of all Americans.     (b)  In developing such proposed plan of action, the Attorney General shall review, at a minimum:          (i)    All Presidential and agencies’ actions from January 2021 through January 2025 that purport to promote safety but may have impinged on the Second Amendment rights of law-abiding citizens;          (ii)   Rules promulgated by the Department of Justice, including by the Bureau of Alcohol, Tobacco, Firearms, and Explosives, from January 2021 through January 2025 pertaining to firearms and/or Federal firearms licensees;          (iii)  Agencies’ plans, orders, and actions regarding the so-called “enhanced regulatory enforcement policy” pertaining to firearms and/or Federal firearms licensees;          (iv)   Reports and related documents issued by the White House Office of Gun Violence Prevention;          (v)    The positions taken by the United States in any and all ongoing and potential litigation that affects or could affect the ability of Americans to exercise their Second Amendment rights;          (vi)   Agencies’ classifications of firearms and ammunition; and          (vii)  The processing of applications to make, manufacture, transfer, or export firearms.     Sec. 3.  Implementation.  Upon submission of the proposed plan of action described in section 2 of this order, the Attorney General shall work with the Domestic Policy Advisor to finalize the plan of action and establish a process for implementation.     Sec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:          (i)   the authority granted by law to an executive department, agency, or the head thereof; or          (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n",
  "summary": "On February 7, 2025, a new presidential order was issued to protect the Second Amendment rights of American citizens. The President directed the Attorney General to review all executive actions from January 2021 to January 2025 that may have infringed upon these rights, focusing on actions purporting to promote safety and regulations regarding firearms and firearms licensees. This comprehensive review includes examining rules promulgated by the Bureau of Alcohol, Tobacco, Firearms, and Explosives and agency actions around regulatory enforcement policies on firearms.\n\nThe order requires the Attorney General to present a proposed plan of action to the President within 30 days to ensure Second Amendment rights are upheld. This plan must also consider litigation positions, firearm classifications, and the processing of firearm-related applications. Upon submission, the Attorney General will work with the Domestic Policy Advisor to finalize and implement this plan, ensuring it aligns with applicable laws and budgetary constraints.\n\nThe order emphasizes its alignment with existing laws and assures it does not create new enforceable rights against the U.S. government. It underscores the Second Amendment as fundamental to American liberty and aims to correct or prevent any potential unconstitutional actions identified in the review process.",
  "eli5": "The President wants to make sure that everyone in the country can still have their gun rights, like the Constitution says. So, the President asked a special helper, called the Attorney General, to check all the rules about guns from the past few years and make a plan to keep those rights safe.",
  "keywords": [
    "President",
    "Second Amendment",
    "Attorney General",
    "Firearms",
    "Regulations",
    "Executive Order",
    "Gun Rights",
    "Policy Review"
  ],
  "issues": [
    "Potential misinterpretation of the scope of actions reviewed",
    "How will 'enhanced regulatory enforcement policy' be defined?",
    "Balance between safety regulations and Second Amendment rights",
    "Impact on ongoing and future litigations"
  ],
  "citations": [],
  "document_type": "Executive Order"
}