{
  "title": "Public Comment Invited on Artificial Intelligence Action Plan – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Public Comment Invited on Artificial Intelligence Action Plan",
  "og:description": "WASHINGTON, D.C. – President Trump’s recent Artificial Intelligence (AI) Executive Order shows that this Administration is dedicated to America’s global",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/public-comment-invited-on-artificial-intelligence-action-plan/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-25T13:55:17+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tPublic Comment Invited on Artificial Intelligence Action Plan\t\t\t\t\n\nFebruary 25, 2025\n\n**WASHINGTON, D.C.** – President Trump’s recent Artificial Intelligence (**AI**) Executive Order shows that this Administration is dedicated to America’s global leadership in AI technology innovation. This Order directed the development of an AI Action Plan to sustain and enhance America’s global AI dominance. Today, the American people are encouraged to share their policy ideas for the AI Action Plan by responding to a Request for Information (**RFI**), available on [the Federal Register’s website](https://www.federalregister.gov/public-inspection/2025-02305/request-for-information-development-of-an-artificial-intelligence-action-plan) through March 15.\n\n“The Trump Administration is committed to ensuring the United States is the undeniable leader in AI technology. This AI Action Plan is the first step in securing and advancing American AI dominance, and we look forward to incorporating the public’s comments and innovative ideas,” said Lynne Parker, Principal Deputy Director of the Office of Science and Technology Policy (**OSTP**).\n\nThe AI Action Plan will define priority policy actions to enhance America’s position as an AI powerhouse and prevent unnecessarily burdensome requirements from hindering private sector innovation. With the right governmental policies, continued U.S. AI leadership will promote human flourishing, economic competitiveness, and national security.\n\nToday’s RFI from OSTP seeks input from interested public parties, including academia, industry groups, private sector organizations, state, local and tribal governments, and others on actions that should be included in the AI Action Plan.\n\nComments can be submitted online and will be accepted until **11:59PM on March 15, 2025.**\n\nPlease [**click here**](https://www.federalregister.gov/public-inspection/2025-02305/request-for-information-development-of-an-artificial-intelligence-action-plan) for submission information.\n",
  "summary": "On February 25, 2025, an announcement was made regarding President Trump's recent Executive Order on Artificial Intelligence (AI), emphasizing the administration’s commitment to maintaining America’s global leadership in AI technology. The order mandates the development of an AI Action Plan aimed at sustaining and enhancing U.S. dominance in AI innovation. The American public is invited to contribute their policy ideas by responding to a Request for Information (RFI) available through the Federal Register’s website until March 15, 2025.\n\nThe AI Action Plan seeks to define strategic policy actions to strengthen America’s position as a leader in AI while avoiding excessive regulations that could hinder private sector innovation. The Office of Science and Technology Policy (OSTP) is soliciting input from various parties, including academia, industry, and government groups, to ensure the plan supports human flourishing, economic competitiveness, and national security.",
  "eli5": "The government wants to make sure the U.S. is really good at using robots and computers smartly, so they're asking everyone to share their ideas on how to do that before March 15, 2025.",
  "keywords": [
    "Artificial Intelligence",
    "AI Action Plan",
    "Trump Administration",
    "Request for Information",
    "OSTP",
    "Public Comment",
    "Technology Innovation"
  ],
  "issues": [
    "Lack of specific details on the Executive Order",
    "Potential bias towards industry and innovation over regulation",
    "Concerns about insufficient inclusion of ethical considerations in AI",
    "Balancing national security with technological advancement"
  ],
  "citations": [
    "Federal Register’s website",
    "Executive Order on Artificial Intelligence"
  ],
  "document_type": "Press Release"
}