{
  "title": "Putting People Over Fish: Stopping Radical Environmentalism to Provide Water to Southern California – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Putting People Over Fish: Stopping Radical Environmentalism to Provide Water to Southern California – The White House",
  "og:description": "January 20, 2025 MEMORANDUM FOR THE SECRETARY OF COMMERCE THE SECRETARY OF THE INTERIOR  SUBJECT:       Putting People",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/putting-people-over-fish-stopping-radical-environmentalism-to-provide-water-to-southern-california/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:39:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPutting People over Fish:  Stopping RadicalEnvironmentalism to Provide Water to SouthernCalifornia\t\t\t\t\n\nJanuary 20, 2025\n\nJanuary 20, 2025\n\nMEMORANDUM FOR THE SECRETARY OF COMMERCE\n\nTHE SECRETARY OF THE INTERIOR \n\nSUBJECT:       Putting People over Fish:  Stopping Radical\n\nEnvironmentalism to Provide Water to Southern\n\nCalifornia\n\nI hereby direct the Secretary of Commerce and Secretary of the Interior, in consultation with the heads of other departments and agencies of the United States as necessary, to immediately restart the work from my first Administration by the National Marine Fisheries Service, U.S. Fish and Wildlife Service, Bureau of Reclamation, and other agencies to route more water from the Sacramento-San Joaquin Delta to other parts of the state for use by the people there who desperately need a reliable water supply. \n\nDuring my first term, the State of California, at the direction of its Governor, filed a lawsuit to stop my Administration from implementing improvements to California’s water infrastructure.  My Administration’s plan would have allowed enormous amounts of water to flow from the snow melt and rainwater in rivers in Northern California to beneficial use in the Central Valley and Southern California.  This catastrophic halt was allegedly in protection of the Delta smelt and other species of fish.  Today, this enormous water supply flows wastefully into the Pacific Ocean. \n\nThe recent deadly and historically destructive wildfires in Southern California underscore why the State of California needs a reliable water supply and sound vegetation management practices in order to provide water desperately needed there, and why this plan must immediately be reimplemented.\n\nWithin 90 days of the date of this memorandum, the Secretary of Commerce and Secretary of the Interior shall report to me regarding the progress made in implementing the policies in this memorandum and provide any recommendations regarding future implementation.\n",
  "summary": "The document is a Presidential Memorandum dated January 20, 2025, addressed to the Secretary of Commerce and the Secretary of the Interior. It directs these officials, along with other relevant departments and agencies such as the National Marine Fisheries Service and the U.S. Fish and Wildlife Service, to resume efforts to redirect water from the Sacramento-San Joaquin Delta to Southern California. This water routing initiative is aimed at providing a stable water supply to this region, as opposed to the current situation where significant amounts of water flow into the Pacific Ocean, allegedly for the protection of certain fish species.\n\nDuring the President's first term, similar efforts were halted due to a lawsuit from the State of California, citing environmental concerns for the Delta smelt and other fish species. The memorandum emphasizes the necessity of providing a reliable water supply to combat the destructive wildfires in Southern California. The President mandates a progress report within 90 days regarding the implementation of this directive and suggestions for its future execution.",
  "eli5": "The President is telling some government helpers to make sure Southern California gets more water from rivers because they need it, especially to help prevent serious fires. Some people stopped this plan before to protect some fish, but now the President wants it to start again.",
  "keywords": [
    "Presidential Memorandum",
    "Water Supply",
    "Southern California",
    "Sacramento-San Joaquin Delta",
    "Delta smelt",
    "Environmentalism",
    "Wildfires"
  ],
  "issues": [
    "Potential conflict with environmental protection laws",
    "Impact on local ecosystems and species",
    "Legal implications of restarting halted projects"
  ],
  "citations": [],
  "document_type": "Presidential Memorandum"
}