{
  "title": "Readout of President Donald J. Trump’s Call with Prime Minister Starmer of the United Kingdom – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout of President Donald J. Trump’s Call with Prime Minister Starmer of the United Kingdom – The White House",
  "og:description": "Today, President Donald J. Trump held a call with Prime Minister Keir Starmer of the United Kingdom. President Trump offered his condolences for the",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/readout-of-president-donald-j-trumps-call-with-prime-minister-starmer-of-the-united-kingdom/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-26T21:47:06+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tReadout of President Donald J. Trump’s Call with Prime Minister Starmer of the United Kingdom\t\t\t\t\n\nJanuary 26, 2025\n\nToday, President Donald J. Trump held a call with Prime Minister Keir Starmer of the United Kingdom. President Trump offered his condolences for the recent loss of the Prime Minister’s brother and expressed his well wishes for the British Royal Family. The two leaders also discussed the recent release of Israeli-British national Emily Damari from Hamas captivity and how both countries can promote a fair bilateral economic relationship.\n",
  "summary": "# Summary\n\nOn January 26, 2025, President Donald J. Trump engaged in a phone call with Prime Minister Keir Starmer of the United Kingdom. The primary purpose of the conversation was to express condolences on the loss of the Prime Minister's brother and to extend well wishes to the British Royal Family, demonstrating diplomatic respect and empathy.\n\nIn addition to these expressions of sympathy, the dialogue between the two leaders also included significant international topics. They discussed the recent safe release of Emily Damari, an Israeli-British national who had been held captive by Hamas. Their conversation also covered the prospects for enhancing the bilateral economic relationship between the United States and the United Kingdom, emphasizing the importance of fair and mutually beneficial economic ties.",
  "eli5": "President Trump called the Prime Minister of the UK to say sorry for his brother's loss and to talk about how a British lady was rescued. They also chatted about working together fairly in business.",
  "keywords": [
    "Donald J. Trump",
    "Keir Starmer",
    "United Kingdom",
    "condolences",
    "Emily Damari",
    "Hamas",
    "bilateral economic relationship"
  ],
  "issues": [
    "Verification of the actual engagement or existence of the events described, considering the future date and individuals involved."
  ],
  "citations": [],
  "document_type": "Press Release"
}