{
  "title": "Readout of President Donald J. Trump's Call with President Nayib Bukele – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout of President Donald J. Trump's Call with President Nayib Bukele",
  "og:description": "Today, President Donald J. Trump held a call with President Nayib Bukele of the Republic of El Salvador. The two leaders discussed working together to",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/readout-of-president-donald-j-trumps-call-with-president-bukele/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T23:29:44+00:00",
  "article:modified_time": "2025-01-23T23:40:53+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tReadout of President Donald J. Trump’s Call with President Nayib Bukele \t\t\t\t\n\nJanuary 23, 2025\n\nToday, President Donald J. Trump held a call with President Nayib Bukele of the Republic of El Salvador. The two leaders discussed working together to stop illegal immigration and crack down on transnational gangs like Tren de Aragua. President Trump also praised President Bukele’s leadership in the region and the example he sets for other nations in the Western Hemisphere.\n",
  "summary": "On January 23, 2025, President Donald J. Trump had a telephone conversation with President Nayib Bukele of El Salvador. The purpose of the call was to discuss mutual efforts to combat illegal immigration and fight transnational criminal organizations, such as the Tren de Aragua gang. During the call, President Trump commended President Bukele's leadership and the positive influence he is exerting in the Western Hemisphere. \n\nThis conversation was part of ongoing diplomatic efforts to strengthen bilateral cooperation between the United States and El Salvador. By collaborating on these issues, both countries aim to enhance regional stability and security. President Trump's acknowledgment of President Bukele’s role highlights the importance of strong leadership and partnership in addressing common challenges.",
  "eli5": "President Trump talked on the phone with President Bukele of El Salvador about stopping illegal immigration and fighting bad gangs. President Trump said President Bukele is doing a good job and setting a good example.",
  "keywords": [
    "Donald J. Trump",
    "Nayib Bukele",
    "El Salvador",
    "illegal immigration",
    "transnational gangs",
    "Tren de Aragua",
    "leadership",
    "Western Hemisphere",
    "diplomacy",
    "regional security"
  ],
  "issues": [
    "The document does not specify the outcomes or agreements resulting from the discussion.",
    "No detailed action plan for addressing illegal immigration and transnational gangs is provided."
  ],
  "citations": [],
  "document_type": "Press Release"
}