{
  "title": "Readout of President Donald J. Trump’s Call with President el-Sisi of Egypt – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout of President Donald J. Trump’s Call with President el-Sisi of Egypt – The White House",
  "og:description": "On Saturday, President Donald J. Trump received a call from President Abdel Fattah el-Sisi of Egypt, in which President el-Sisi congratulated President",
  "og:url": "https://www.whitehouse.gov/uncategorized/2025/02/readout-of-president-donald-j-trumps-call-with-president-el-sisi-of-egypt/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-01T13:17:12+00:00",
  "article:modified_time": "2025-02-03T13:19:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Uncategorized](https://www.whitehouse.gov/uncategorized/)\n\n# \t\t\t\t\tReadout of President Donald J. Trump’s Call with President el-Sisi of Egypt\t\t\t\t\n\nFebruary 1, 2025\n\nOn Saturday, President Donald J. Trump received a call from President Abdel Fattah el-Sisi of Egypt, in which President el-Sisi congratulated President Trump on his inauguration.  President Trump thanked President el-Sisi for his friendship, and discussed the Grand Ethiopian Renaissance Dam.  The two leaders also discussed Egypt’s important role in the release of hostages from Gaza and President el-Sisi expressed his confidence that President Trump’s leadership could usher in a golden age of Middle East peace.\n",
  "summary": "### Summary\n\nOn February 1, 2025, President Donald J. Trump engaged in a telephone conversation with Egyptian President Abdel Fattah el-Sisi. During this call, President el-Sisi extended his congratulations to President Trump on his recent inauguration. President Trump reciprocated by thanking President el-Sisi for his friendship.\n\nThe discussion also covered significant topics such as the Grand Ethiopian Renaissance Dam and Egypt's instrumental role in facilitating the release of hostages from Gaza. President el-Sisi expressed optimism that under President Trump’s leadership, there could be a new period of Middle East peace.",
  "eli5": "President Trump spoke with Egypt's President el-Sisi on the phone. They talked about important things like a big dam and helping people find peace in the Middle East.",
  "keywords": [
    "Donald J. Trump",
    "Abdel Fattah el-Sisi",
    "inauguration",
    "Grand Ethiopian Renaissance Dam",
    "Middle East peace",
    "hostages",
    "Gaza"
  ],
  "issues": [
    "No specific policy outcomes were discussed",
    "Limited detail on the content of the conversation"
  ],
  "citations": [],
  "document_type": "Press Release"
}