{
  "title": "Readout of President Donald J. Trump Call with Crown Prince Mohammed bin Salman – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout of President Donald J. Trump Call with Crown Prince Mohammed bin Salman – The White House",
  "og:description": "On Wednesday, President Donald J. Trump held his first foreign leader call with Crown Prince Mohammed bin Salman of the Kingdom of Saudi Arabia. The two",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/readout-of-president-donald-j-trump-call-with-crown-prince-mohammad-bin-salman/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T16:25:09+00:00",
  "article:modified_time": "2025-01-23T18:42:51+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tReadout of President Donald J. Trump Call with Crown Prince MohammEd Bin Salman\t\t\t\t\n\nJanuary 23, 2025\n\nOn Wednesday, President Donald J. Trump held his first foreign leader call with Crown Prince Mohammed bin Salman of the Kingdom of Saudi Arabia. The two leaders discussed efforts to bring stability to the Middle East, bolster regional security, and combat terrorism. Additionally, they discussed the Kingdom of Saudi Arabia’s international economic ambitions over the next four years as well as trade and other opportunities to increase the mutual prosperity of the United States and the Kingdom of Saudi Arabia.\n",
  "summary": "On January 23, 2025, President Donald J. Trump engaged in his first foreign leader call with Crown Prince Mohammed bin Salman of Saudi Arabia. During the call, the leaders talked about various significant issues, including efforts to stabilize the Middle East, enhance regional security, and combat terrorism. The conversation also covered Saudi Arabia's economic goals for the ensuing four years and discussed avenues for mutual prosperity through trade and cooperation between the United States and Saudi Arabia.\n\nThis call reflects ongoing diplomatic relations and strategic discussions between the United States and Saudi Arabia, focusing on shared interests and regional stability. By exploring economic opportunities, both leaders aim to bolster their countries’ economic ties and security cooperation in the Middle East.",
  "eli5": "President Trump called a prince from Saudi Arabia to talk about working together to make their countries safer and richer.",
  "keywords": [
    "President Donald J. Trump",
    "Crown Prince Mohammed bin Salman",
    "Saudi Arabia",
    "Middle East stability",
    "regional security",
    "terrorism",
    "economic ambitions",
    "trade",
    "mutual prosperity"
  ],
  "issues": [
    "There is a need to verify the exact date of the call.",
    "Considering the potential impact of these discussions on international relations.",
    "The nature and details of the mutual trade opportunities were not specified."
  ],
  "citations": [],
  "document_type": "Press Release"
}