{
  "title": "Readout of President Donald J. Trump’s Meeting with King Abdullah II of Jordan – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout of President Donald J. Trump’s Meeting with King Abdullah II of Jordan",
  "og:description": "Yesterday, President Donald J. Trump and His Majesty King Abdullah II of Jordan held a warm and productive working meeting at the White House. King",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/readout-of-president-donald-j-trumps-meeting-with-king-abdullah-ii-of-jordan/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-12T15:54:53+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tReadout of President Donald J. Trump’s Meeting with King Abdullah II of Jordan\t\t\t\t\n\nFebruary 12, 2025\n\nYesterday, President Donald J. Trump and His Majesty King Abdullah II of Jordan held a warm and productive working meeting at the White House. King Abdullah congratulated President Trump on his very successful first weeks in office, and thanked the President for his leadership in securing the release of hostages from Gaza and a temporary pause in hostilities. The President affirmed the strength of relations between the United States and Jordan, and thanked His Majesty for the Kingdom’s longstanding commitment to promoting and advancing regional peace.\n\nPresident Trump and King Abdullah also discussed the situation in Gaza. The President reiterated that Hamas must release all hostages, including all Americans, by Saturday, and asked for the King’s assistance in ensuring that Hamas, as well as the leaders of the region, understand the severity of the situation.\n\nThe two leaders also discussed the President’s goal of ensuring that Gaza is rebuilt beautifully after the conflict ends, and providing options for the people of Gaza that allow them to live in security and dignity, and free of Hamas’s tyranny.\n",
  "summary": "On February 12, 2025, President Donald J. Trump and King Abdullah II of Jordan met at the White House for a constructive discussion. King Abdullah congratulated President Trump on his early achievements in office and praised his leadership in securing the release of hostages from Gaza, as well as establishing a ceasefire. They reiterated the strong diplomatic relations between the United States and Jordan, emphasizing Jordan's role in promoting peace in the region.\n\nTheir conversation addressed the ongoing situation in Gaza, with President Trump firmly stating that Hamas must release all hostages, including American citizens, by Saturday. He sought King Abdullah’s help to convey the critical urgency of the matter to regional leaders and Hamas. Additionally, both leaders discussed rebuilding Gaza post-conflict, aiming to provide its residents with security, dignity, and freedom from Hamas's control.",
  "eli5": "President Trump talked to King Abdullah of Jordan at the White House. They said it's really important to help free people captured in Gaza and want to make Gaza a nice and safe place to live again.",
  "keywords": [
    "Donald Trump",
    "King Abdullah II",
    "Gaza",
    "hostages",
    "Hamas",
    "United States",
    "Jordan",
    "peace",
    "conflict"
  ],
  "issues": [
    "The validity of the meeting date, considering real-world events.",
    "The absence of specific strategies detailing how the hostages' release will be secured.",
    "The logistics and feasibility of rebuilding Gaza 'beautifully' post-conflict."
  ],
  "citations": [],
  "document_type": "Press Release"
}