{
  "title": "Readout of President Donald J. Trump’s Call with Prime Minister Modi of India – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout of President Donald J. Trump’s Call with Prime Minister Modi of India – The White House",
  "og:description": "Today, President Donald J. Trump held a productive call with Prime Minister Narendra Modi of India. The two leaders discussed expanding and deepening",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/readout-of-president-donald-j-trumps-call-with-prime-minister-modi-of-india/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-27T19:21:42+00:00",
  "article:modified_time": "2025-01-27T22:31:16+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tReadout of President Donald J. Trump’s Call with Prime Minister Modi of India\t\t\t\t\n\nJanuary 27, 2025\n\nToday, President Donald J. Trump held a productive call with Prime Minister Narendra Modi of India. The two leaders discussed expanding and deepening cooperation. They also discussed a range of regional issues, including security in the Indo-Pacific, the Middle East, and Europe. The President emphasized the importance of India increasing its procurement of American-made security equipment and moving toward a fair bilateral trading relationship. The leaders discussed plans for Prime Minister Modi to visit the White House, underscoring the strength of the friendship and strategic ties between our nations. Both leaders emphasized their commitment to advance the U.S.-India strategic partnership and the Indo-Pacific Quad partnership, with India hosting Quad Leaders for the first time later this year.\n",
  "summary": "On January 27, 2025, President Donald J. Trump and Prime Minister Narendra Modi of India engaged in a call to discuss enhancing bilateral cooperation. The conversation revolved around various regional issues, notably focusing on the Indo-Pacific, the Middle East, and Europe. President Trump underscored the significance of India purchasing more American-made security equipment and moving towards a more equitable trade relationship.\n\nFurthermore, they discussed an upcoming visit by Prime Minister Modi to the White House, which highlights the robust friendship and strategic alliance between the two nations. The leaders reaffirmed their dedication to advancing the U.S.-India strategic partnership and the Indo-Pacific Quad partnership, with India slated to host Quad Leaders for the first time later that year.",
  "eli5": "President Trump and India’s Prime Minister Modi talked on the phone about working together more closely. They want to focus on buying security stuff from each other, being fair in trading, and having a big meeting of important leaders in India soon!",
  "keywords": [
    "Donald Trump",
    "Narendra Modi",
    "U.S.-India relations",
    "security equipment",
    "Indo-Pacific",
    "trade relations",
    "strategic partnership",
    "Quad partnership",
    "regional security"
  ],
  "issues": [
    "Clarification needed on the specific agreements or outcomes of the call.",
    "Details on how the fair bilateral trading relationship will be achieved are not provided."
  ],
  "citations": [],
  "document_type": "Press Release"
}