{
  "title": "Readout from First Lady Melania Trump’s Roundtable Discussion on Online Protection and the Take It Down Act – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout from First Lady Melania Trump’s Roundtable Discussion on Online Protection and the Take It Down Act",
  "og:description": "WASHINGTON, D.C. - Today, First Lady Melania Trump, U.S. Senator Ted Cruz, and U.S. Representative Maria Salazar hosted a roundtable on Capitol Hill with",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/03/readout-from-first-lady-melania-trumps-roundtable-discussion-on-online-protection-and-the-take-it-down-act/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-03T22:45:00+00:00",
  "article:modified_time": "2025-03-04T18:14:10+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tReadout from First Lady Melania Trump’s Roundtable Discussion on Online Protection and the Take It Down Act\t\t\t\t\n\nMarch 3, 2025\n\nWASHINGTON, D.C. – Today, First Lady Melania Trump, U.S. Senator Ted Cruz, and U.S. Representative Maria Salazar hosted a roundtable on Capitol Hill with Members of Congress, Survivors of Non-Consensual Intimate Imagery (NCII), and online safety advocates for a discussion focused on promoting online protection of children and passing [S.146](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=8a44a9779f&amp;e=8b071a776a)/[H.R.633](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=8fa38fb0f0&amp;e=8b071a776a), the *Take It Down Act.*\n\nThe First Lady delivered opening remarks thanking the U.S. Senate for passing the *Take It Down Act,*calling on the U.S. House of Representatives to also pass the bill, and expressing her commitment to making the internet a safer platform for young Americans in the digital era.\n\n“It’s heartbreaking to witness young teens, especially girls, grappling with the overwhelming challenges posed by malicious online content, like deepfakes. This toxic environment can be severely damaging. We must prioritize their well-being by equipping them with the support and tools necessary to navigate this hostile digital landscape. Every young person deserves a safe online space to express themself freely, without the looming threat of exploitation or harm,” said First Lady Melania Trump.\n\nFollowing Mrs. Trump’s remarks, Members of Congress spoke and multiple survivors of NCII and advocates for online safety shared their personal stories. They joined in calling for the passage of the *Take It Down Act.*The Discussion addressed online protection, child well-being, and how artificial intelligence is changing the social media landscape.\n\nSenator Ted Cruz, commented: “For victims of revenge or AI-generated explicit imagery, life can change instantly and permanently. Everyone has the right to have these disturbing images removed from the internet immediately. The bipartisan *Take It Down Act* empowers victims across the United States, and I am honored that First Lady Melania Trump has lent her strong voice to this cause. Her presence and advocacy are driving real action for teens and children, and her support will be crucial in advancing this bill. I am encouraged by my House colleagues who joined us today, united in their commitment to take swift action. Following the Senate’s unanimous approval, the House must act quickly to send this legislation to President Trump’s desk before more victims are left without recourse.”\n\n*Take It Down Act*Advocate, Francesca Mani, said: “A strong Federal law is crucial – one that shifts power back to the victims, ensuring they can remove harmful images within 48 hours. That’s not just policy – that’s real, tangible protection. That’s *Take it Down*.” \n\n*Take It Down Act* Advocate, Elliston Berry, said: “This bipartisan bill is meant to protect American children. Thank you to the First Lady and House leadership for understanding how important this issue is and taking time to learn about this vital piece of legislation. I share my story to give victims a voice they never had and change this horrible situation into something good.”\n\n###\n",
  "summary": "First Lady Melania Trump, along with U.S. Senator Ted Cruz and Representative Maria Salazar, hosted a roundtable discussion on March 3, 2025, in Washington, D.C., focused on promoting the \u0002A\u00002ATake It Down Act\u00002A\u00002A, which addresses online protection for children. The discussion involved Members of Congress, survivors of Non-Consensual Intimate Imagery (NCII), and online safety advocates, emphasizing the urgent need to safeguard young Americans from harmful online content.\n\nFirst Lady Melania Trump opened the event by urging the U.S. House of Representatives to pass the \u00002A\u00002ATake It Down Act\u00002A\u00002A, which had already gained Senate approval. The Act aims to remove damaging images from the internet swiftly, particularly those impacting children and teens, such as deepfakes. Senator Ted Cruz underscored the Act's empowerment of victims across the country and commended the First Lady for her influential advocacy supporting the bill. Advocates Francesca Mani and Elliston Berry also spoke, stressing the Act's importance in providing quick protection and support to victims.\n\nThe \u00002A\u00002ATake It Down Act\u00002A\u00002A is positioned as a critical legislative step toward creating a safer digital environment for children by allowing for the removal of harmful imagery within 48 hours, and it seeks rapid action from the House to become law.",
  "eli5": "First Lady Melania Trump and some other important people met to talk about a new law called the 'Take It Down Act' that would help keep kids safe from bad pictures online. They want the government to make this law soon, so kids won't have to worry about mean stuff on the internet.",
  "keywords": [
    "Melania Trump",
    "Take It Down Act",
    "online protection",
    "children safety",
    "non-consensual imagery",
    "Senator Ted Cruz",
    "Maria Salazar",
    "digital safety"
  ],
  "issues": [
    "Potential delay in House passing the bill",
    "Ensuring rapid removal of harmful content",
    "Impact of deepfakes on young individuals"
  ],
  "citations": [
    "S.146",
    "H.R.633"
  ],
  "document_type": "Press Release"
}