{
  "title": "Realigning the United States Refugee Admissions Program – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Realigning the United States Refugee Admissions Program – The White House",
  "og:description": "REALIGNING THE United States REFUGEE ADMISSIONS PROGRAM By the authority vested in me as President by the Constitution and the laws of the United States",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/realigning-the-united-states-refugee-admissions-program/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:37:49+00:00",
  "article:modified_time": "2025-01-21T01:37:50+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tREALIGNING THE UNITED STATES REFUGEE ADMISSIONS PROGRAM\t\t\t\t\n\nJanuary 20, 2025\n\nREALIGNING THE United States REFUGEE ADMISSIONS PROGRAM\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act (INA), 8 U.S.C. 1101 *et seq.*, and section 301 of title 3, United States Code, it is hereby ordered:\n\nSection 1.  Purpose.  Over the last 4 years, the United States has been inundated with record levels of migration, including through the U.S. Refugee Admissions Program (USRAP).  Cities and small towns alike, from Charleroi, Pennsylvania, and Springfield, Ohio, to Whitewater, Wisconsin, have seen significant influxes of migrants.  Even major urban centers such as New York City, Chicago, and Denver have sought Federal aid to manage the burden of new arrivals.  Some jurisdictions, like New York and Massachusetts, have even recently declared states of emergency because of increased migration.\n\nThe United States lacks the ability to absorb large numbers of migrants, and in particular, refugees, into its communities in a manner that does not compromise the availability of resources for Americans, that protects their safety and security, and that ensures the appropriate assimilation of refugees.  This order suspends the USRAP until such time as the further entry into the United States of refugees aligns with the interests of the United States.\n\nSec. 2.  Policy.  It is the policy of the United States to ensure that public safety and national security are paramount considerations in the administration of the USRAP, and to admit only those refugees who can fully and appropriately assimilate into the United States and to ensure that the United States preserves taxpayer resources for its citizens.  It is also the policy of the United States that, to the extent permitted by law and as practicable, State and local jurisdictions be granted a role in the process of determining the placement or settlement in their jurisdictions of aliens eligible to be admitted to the United States as refugees.\n\nSec. 3.  Realignment of the U.S. Refugee Admissions Program.  (a)  I hereby proclaim, pursuant to sections 212(f) and 215(a) of the INA, 8 U.S.C. 1182(f) and 1185(a), that entry into the United States of refugees under the USRAP would be detrimental to the interests of the United States.  I therefore direct that entry into the United States of refugees under the USRAP be suspended — subject to the exceptions set forth in subsection (c) of this section — until a finding is made in accordance with section 4 of this order.  This suspension shall take effect at 12:01 am eastern standard time on January 27, 2025.\n\n(b)  The Secretary of Homeland Security shall suspend decisions on applications for refugee status, until a finding is made in accordance with section 4 of this order.\n\n(c)  Notwithstanding the suspension of the USRAP imposed pursuant to subsections (a) and (b) of this section, the Secretary of State and the Secretary of Homeland Security may jointly determine to admit aliens to the United States as refugees on a case-by-case basis, in their discretion, but only so long as they determine that the entry of such aliens as refugees is in the national interest and does not pose a threat to the security or welfare of the United States.\n\n(d)  The Secretary of Homeland Security, in consultation with the Attorney General, shall examine existing law to determine the extent to which, consistent with applicable law, State and local jurisdictions may have greater involvement in the process of determining the placement or resettlement of refugees in their jurisdictions, and shall devise a proposal to lawfully promote such involvement.  In all cases, the Secretary of State and the Secretary of Health and Human Services shall ensure that the State and local consultation requirements in 8 U.S.C. 1522(a)(2) are carried out with respect to all refugees admitted to the United States.\n\nSec. 4.  Resumption of the U.S. Refugee Admissions Program.  Within 90 days of this order, the Secretary of Homeland Security, in consultation with the Secretary of State, shall submit a report to the President through the Homeland Security Advisor regarding whether resumption of entry of refugees into the United States under the USRAP would be in the interests of the United States, in light of the policies outlined in section 2 of this order.  The Secretary of Homeland Security, in consultation with the Secretary of State, shall submit further reports every 90 days thereafter until I determine that resumption of the USRAP is in the interests of the United States.\n\nSec. 5.  Revocation.  Executive Order 14013 of February 4, 2021 (Rebuilding and Enhancing Programs To Resettle Refugees and Planning for the Impact of Climate Change on Migration), is hereby revoked.\n\nSec. 6.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its other provisions to any other persons or circumstances shall not be affected thereby.\n\nSec. 7.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,     January 20, 2025.\n",
  "summary": "On January 20, 2025, the President of the United States issued an executive order to realign the United States Refugee Admissions Program (USRAP). The order temporarily suspends the admission of refugees, citing concerns about the country's ability to appropriately assimilate large numbers of migrants without compromising resources, safety, and security for American citizens. This suspension will remain until it is determined that refugee admissions align with national interests.\n\nThe executive order outlines several key policies, prioritizing national security and the strategic assimilation of refugees. It instructs the Secretary of Homeland Security to suspend decisions on refugee applications and to review existing laws regarding state and local jurisdictions' involvement in refugee placement. Exceptions to the suspension may be made on a case-by-case basis if considered in the national interest.\n\nThe order revokes a previous executive order focused on enhancing refugee resettlement programs, reflecting a shift in policy. Regular reports will be submitted to review the suspension's necessity, and the suspension will be lifted if deemed beneficial to the United States. The executive order includes provisions for its implementation and ensures it does not impair existing law or create enforceable rights.",
  "eli5": "The President decided to pause letting refugees into the country for now because they want to make sure it is safe and there's enough resources to help everyone, including the people already living here.",
  "keywords": [
    "Refugee admissions",
    "United States",
    "Executive Order",
    "Suspension",
    "Assimilation",
    "National Security",
    "Homeland Security"
  ],
  "issues": [
    "Potential impact on refugees waiting for resettlement",
    "State and local government roles in refugee placement",
    "Effect on international relations and humanitarian commitments",
    "Impact on communities already planning for refugee arrivals"
  ],
  "citations": [
    "8 U.S.C. 1101 et seq.",
    "Section 301 of title 3, United States Code",
    "Sections 212(f) and 215(a) of the INA, 8 U.S.C. 1182(f) and 1185(a)",
    "8 U.S.C. 1522(a)(2)",
    "Executive Order 14013"
  ],
  "document_type": "Executive Order"
}