{
  "title": "Reciprocal Trade and Tariffs – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Reciprocal Trade and Tariffs",
  "og:description": "MEMORANDUM FOR THE SECRETARY OF THE TREASURY THE SECRETARY OF COMMERCE THE SECRETARY OF HOMELAND SECURITY THE DIRECTOR OF THE OFFICE OF MANAGEMENT",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/reciprocal-trade-and-tariffs/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-13T20:56:42+00:00",
  "article:modified_time": "2025-02-13T20:58:35+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tReciprocal Trade and Tariffs \t\t\t\t\n\nFebruary 13, 2025\n\nMEMORANDUM FOR THE SECRETARY OF THE TREASURY\n\nTHE SECRETARY OF COMMERCE\n\nTHE SECRETARY OF HOMELAND SECURITY\n\nTHE DIRECTOR OF THE OFFICE OF MANAGEMENT AND BUDGET\n\nTHE UNITED STATES TRADE REPRESENTATIVE\n\nTHE ASSISTANT TO THE PRESIDENT FOR ECONOMIC POLICY\n\nTHE SENIOR COUNSELOR TO THE PRESIDENT FOR TRADE AND MANUFACTURING\n\n----\n\nSUBJECT: Reciprocal Trade and Tariffs\n\nSection1.  Background.  The United States has one of the most open economies and has among the lowest average weighted tariff rates in the world.  The United States imposes fewer barriers to imports than other major world economies, including those with similar political and economic systems.  For many years, the United States has been treated unfairly by trading partners, both friend and foe.  This lack of reciprocity is one source of our country’s large and persistent annual trade deficit in goods — closed markets abroad reduce United States exports and open markets at home result in significant imports.       Our workers and industries bear the brunt of unfair practices and limited access to foreign markets.  As noted in the Presidential Memorandum of January 20, 2025 (America First Trade Policy Memorandum), this situation is untenable.  The trade deficit of the United States threatens our economic and national security, has hollowed out our industrial base, has reduced our overall national competitiveness, and has made our Nation dependent on other countries to meet our key security needs.  By making trade more reciprocal and balanced, we can reduce the trade deficit; grow the United States economy; and improve our trade relationships with trading partners to the benefit of American workers, manufacturers, farmers, ranchers, entrepreneurs, and businesses.  Sec. 2.  Policy.  It is the policy of the United States to reduce our large and persistent annual trade deficit in goods and to address other unfair and unbalanced aspects of our trade with foreign trading partners.  In pursuit of this policy, I will introduce the “Fair and Reciprocal Plan”(Plan).  Under the Plan, my Administration will work strenuously to counter non-reciprocal trading arrangements with trading partners by determining the equivalent of a reciprocal tariff with respect to each foreign trading partner.  This approach will be of comprehensive scope, examining non-reciprocal trade relationships with all United States trading partners, including any:      (a)  tariffs imposed on United States products;      (b)  unfair, discriminatory, or extraterritorial taxes imposed by our trading partners on United States businesses, workers, and consumers, including a value-added tax;      (c)  costs to United States businesses, workers, and consumers arising from nontariff barriers or measures and unfair or harmful acts, policies, or practices, including subsidies, and burdensome regulatory requirements on United States businesses operating in other countries;      (d)  policies and practices that cause exchange rates to deviate from their market value, to the detriment of Americans; wage suppression; and other mercantilist policies that make United States businesses and workers less competitive; and       (e)  any other practice that, in the judgment of the United States Trade Representative, in consultation with the Secretary of the Treasury, the Secretary of Commerce, and the Senior Counselor to the President for Trade and Manufacturing, imposes any unfair limitation on market access or any structural impediment to fair competition with the market economy of the United States.      The Plan shall ensure comprehensive fairness and balance across the international trading system by factoring in losses as a result of measures that disadvantage the United States as applied, regardless of what they are called or whether they are written or unwritten.  Sec. 3.  Taking Action.  (a)  After the submission of the specified agency reports due under the America First Trade Policy Memorandum, the Secretary of Commerce and the United States Trade Representative, in consultation with the Secretary of the Treasury, the Secretary of Homeland Security, the Assistant to the President for Economic Policy, the Senior Counselor to the President for Trade and Manufacturing, and the heads of such other executive departments and agencies as the Secretary of Commerce and the United States Trade Representative deem relevant, shall initiate, pursuant to their respective legal authorities, all necessary actions to investigate the harm to the United States from any non-reciprocal trade arrangements adopted by any trading partners.  Upon completion of such necessary actions, they shall submit to me a report detailing proposed remedies in pursuit of reciprocal trade relations with each trading partner.     (b)  Within 180 days of the date of this memorandum, the Director of the Office of Management and Budget shall assess all fiscal impacts on the Federal Government and the impacts of any information collection requests on the public, and shall deliver an assessment in writing to the President. Sec. 4.  Definitions.  For the purposes of this memorandum:    (a)  “Value-added tax” means a type of consumption tax that is levied on the incremental increase in value of a good or service at each stage of the supply chain.     (b)  “Nontariff barrier” or “measure” means any government-imposed measure or policy or nonmonetary barrier that restricts, prevents, or impedes international trade in goods, including import policies, sanitary and phytosanitary measures, technical barriers to trade, government procurement, export subsidies, lack of intellectual property protection, digital trade barriers, and government-tolerated anticompetitive conduct of state-owned or private firms.     Sec. 5.  General Provisions.  (a)  Nothing in this memorandum shall be construed to impair or otherwise affect:          (i)   the authority granted by law to an executive department or agency, or the head thereof; or          (ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.     (b)  This memorandum shall be implemented consistent with applicable law and subject to the availability of appropriations.     (c)  This memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.     (d)  The United States Trade Representative is authorized and directed to publish this memorandum in the Federal Register.\n",
  "summary": "The memorandum, dated February 13, 2025, addresses the issue of reciprocal trade and tariffs, directed by the President to various key economic officers, including the Secretaries of the Treasury and Commerce among others. The document emphasizes the need to balance the trade deficit and improve the economic standing of the United States by adjusting the current trade policies. It introduces the 'Fair and Reciprocal Plan,' aiming to ensure that trade arrangements with international partners are equitable and fair by examining tariff and non-tariff barriers. \n\nThe document notes that the U.S. currently has a large trade deficit and one of the most open economies with low tariffs compared to other major economies. The President's plan entails implementing reciprocal tariffs and addressing unfair and unbalanced trading practices to strengthen the U.S.' competitiveness globally. It calls for comprehensive evaluations and actions led by the relevant departments to remedy non-reciprocal trade practices detrimental to the American economy, seeking to enhance fairness on an international scale.",
  "eli5": "The President wants to make sure countries around the world trade fairly with the U.S. So, he plans to change some rules about how we do business with them to help our businesses and workers.",
  "keywords": [
    "United States",
    "trade policy",
    "tariffs",
    "trade deficit",
    "reciprocal trade",
    "Fair and Reciprocal Plan",
    "international trade",
    "economic policy"
  ],
  "issues": [
    "Impact of reciprocal tariffs on international relations",
    "Potential conflicts with existing trade agreements",
    "Economic impact of new policies on domestic prices and consumer costs"
  ],
  "citations": [],
  "document_type": "Presidential Memorandum"
}