{
  "title": "Reevaluating And Realigning United States Foreign Aid – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Reevaluating And Realigning United States Foreign Aid",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/reevaluating-and-realigning-united-states-foreign-aid/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:43:20+00:00",
  "article:modified_time": "2025-01-21T02:20:55+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tREEVALUATInG AND REALIGNING UNITED STATES FOREIGN AID \t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose*.*The United States foreign aid industry and bureaucracy are not aligned with American interests and in many cases antithetical to American values.  They serve to destabilize world peace by promoting ideas in foreign countries that are directly inverse to harmonious and stable relations internal to and among countries.\n\nSec. 2.  Policy*.*  It is the policy of United States that no further United States foreign assistance shall be disbursed in a manner that is not fully aligned with the foreign policy of the President of the United States. **\n\nSec. 3.  (a)  *90-day pause in United States foreign development assistance for assessment of programmatic efficiencies and consistency with United States foreign policy.*All department and agency heads with responsibility for United States foreign development assistance programs shall immediately pause new obligations and disbursements of development assistance funds to foreign countries and implementing non-governmental organizations, international organizations, and contractors pending reviews of such programs for programmatic efficiency and consistency with United States foreign policy, to be conducted within 90 days of this order.  The Office of Management and Budget (OMB) shall enforce this pause through its apportionment authority.\n\n(b)  *Reviews of United States foreign assistance programs.*Reviews of each foreign assistance program shall be ordered by the responsible department and agency heads under guidelines provided by the Secretary of State, in consultation with the Director of OMB.\n\n(c)  *Determinations.*The responsible department and agency heads, in consultation with the Director of OMB, will make determinations within 90 days of this order on whether to continue, modify, or cease each foreign assistance program based upon the review recommendations, with the concurrence of the Secretary of State.\n\n(d)  *Resumption of paused development assistance funding.*New obligations and disbursements of foreign development assistance funds may resume for a program prior to the end of the 90-day period if a review is conducted, and the Secretary of State or his designee*,*in consultation with the Director of OMB*,* decide to continue the program in the same or modified form.  Additionally, any other new foreign assistance programs and obligations must be approved by the Secretary of State or his designee, in consultation with the Director of OMB.\n\n(e)  *Waiver.*  The Secretary of State may waive the pause in Section 3(a) for specific programs.  \n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20, 2025.\n",
  "summary": "The document outlines a Presidential order issued on January 20, 2025, concerning the reevaluation and realignment of United States foreign aid. The President of the United States has determined that the current foreign aid paradigm does not align with American interests and may even destabilize global peace by promoting the opposite of harmonized international relations. Therefore, it is mandated that all foreign assistance should align with the President's foreign policy.\n\nA significant component of this order is the implementation of a 90-day pause on foreign development assistance. During this period, the heads of relevant departments and agencies must conduct a thorough assessment of their assistance programs to ensure they align with U.S. foreign policy and operate with programmatic efficiency. The Office of Management and Budget (OMB) will use its authority to enforce this pause. After the review, decisions will be made on whether to continue, modify, or cease each program based on the review's findings and with the Secretary of State's concurrence.\n\nMoreover, any resumption of paused programs or initiation of new foreign assistance programs requires approval by the Secretary of State, in consultation with the OMB. There is also a provision that allows the Secretary of State to waive the 90-day pause for specific programs. The order includes general provisions to ensure it aligns with existing laws and does not create any enforceable rights for individuals.",
  "eli5": "The President wants to make sure the money the U.S. gives to help other countries is used in a way that matches what the U.S. wants. So, for the next 90 days, they're stopping this help to check if it's being used the best way possible.",
  "keywords": [
    "United States",
    "foreign aid",
    "policy",
    "90-day pause",
    "efficiency",
    "Office of Management and Budget",
    "Secretary of State",
    "review"
  ],
  "issues": [
    "Potential disruption in ongoing international aid projects.",
    "Impact on diplomatic relations during the 90-day pause.",
    "Criteria for programmatic efficiency and policy alignment subjective assessment.",
    "Risk of program cessation affecting vulnerable populations in need."
  ],
  "citations": [],
  "document_type": "Presidential Action"
}