{
  "title": "Reinstating Service Members Discharged Under the Military's COVID-19 Vaccination Mandate – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Reinstating Service Members Discharged Under the Military's COVID-19 Vaccination Mandate",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.  Purpose and",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/reinstating-service-members-discharged-under-the-militarys-covid-19-vaccination-mandate/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-28T04:35:04+00:00",
  "article:modified_time": "2025-01-28T22:07:49+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tREINSTATING SERVICE MEMBERS DISCHARGED UNDER THE MILITARY’S COVID-19 VACCINATION MANDATE \t\t\t\t\n\nJanuary 27, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose and Policy*.* On August 24, 2021, the Secretary of Defense mandated that all service members receive the COVID-19 vaccine.  The Secretary of Defense later rescinded the mandate on January 10, 2023.  The vaccine mandate was an unfair, overbroad, and completely unnecessary burden on our service members.  Further, the military unjustly discharged those who refused the vaccine, regardless of the years of service given to our Nation, after failing to grant many of them an exemption that they should have received.  Federal Government redress of any wrongful dismissals is overdue. \n\nSec. 2.  Redress*.***Consistent with the policies announced in section 1 of this order, the Secretary of Defense or the Secretary of Homeland Security, as appropriate, shall take all necessary action permitted by law to:\n\n(a)  make reinstatement available to all members of the military (active and reserve) who were discharged solely for refusal to receive the COVID-19 vaccine and who request to be reinstated;\n\n(b)  enable those service members reinstated under this section to revert to their former rank and receive full back pay, benefits, bonus payments, or compensation; and\n\n(c)  allow any service members who provide a written and sworn attestation that they voluntarily left the service or allowed their service to lapse according to appropriate procedures, rather than be vaccinated under the vaccine mandate, to return to service with no impact on their service status, rank, or pay.\n\nSec. 3.  Additional Agency Responsibilities*.*(a)  Nothing in this order precludes disciplinary or administrative action for conduct that is proscribed by chapter 47 of title 10, United States Code (Uniform Code of Military Justice, 10 U.S.C. 801-946a).\n\n(b)  Within 60 days of the date of this order, the Secretary of Defense and the Secretary of Homeland Security shall report to the President through the Assistant to the President for National Security Affairs on their progress in implementing this order.\n\nSec. 4.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.\n\nSec. 5.  General Provisions*.*  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 27, 2025.\n",
  "summary": "**Reinstating Service Members Discharged Under the Military's COVID-19 Vaccination Mandate**\n\nOn January 27, 2025, a presidential order was issued aimed at redressing the wrongful discharges of service members who were dismissed due to non-compliance with the military's COVID-19 vaccine mandate. Initially mandated by the Secretary of Defense on August 24, 2021, the COVID-19 vaccination policy was later rescinded on January 10, 2023. The mandate was characterized as an unfair burden, with the new order directing the Secretaries of Defense and Homeland Security to facilitate reinstatement for those affected.\n\nThe order outlines steps that include providing reinstatement to service members discharged solely for refusing the vaccine, restoring their former rank, and ensuring they receive full back pay and benefits. Additionally, it allows those who voluntarily left service instead of getting vaccinated to return without impacting their service record. The order also specifies that nothing in its provisions affects existing legal authorities or budgetary operations and clarifies it does not create enforceable rights.\n",
  "eli5": "**Some military folks were kicked out for not getting the COVID shot. Now, the President says they can come back to their jobs and get paid for the time they missed.**",
  "keywords": [
    "Reinstatement",
    "COVID-19 vaccine",
    "Military",
    "Discharge",
    "Back pay",
    "Service members",
    "Mandate"
  ],
  "issues": [
    "Potential challenges in determining eligibility for reinstatement.",
    "Implementation complexities regarding back pay and benefits.",
    "Clarification on how to handle voluntary separations under the mandate.",
    "Impact on military readiness and administration."
  ],
  "citations": [
    "Chapter 47 of title 10, United States Code (Uniform Code of Military Justice, 10 U.S.C. 801-946a)"
  ],
  "document_type": "Executive Order"
}