{
  "title": "Remarks by President Trump Before Air Force One Departure – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump Before Air Force One Departure – The White House",
  "og:description": "Los Angeles International AirportLos Angeles, California (January 24, 2025) 6:41 P.M. PST      THE PRESIDENT: So, thank you very",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-before-air-force-one-departure/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-25T02:09:00+00:00",
  "article:modified_time": "2025-01-27T15:30:47+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tRemarks by President Trump Before Air Force One Departure\t\t\t\t\n\nJanuary 24, 2025\n\nLos Angeles International AirportLos Angeles, California(January 24, 2025)\n\n6:41 P.M. PST     THE PRESIDENT: So, thank you very much.  We just heard that we have a great Secretary of Defense.  We’re very happy about that, and we appreciate everybody’s vote.     And very importantly, I think we had two fantastic meetings in North Carolina and also in Los Angeles, and we made a lot of progress.  It’s – they’re tragic events, really tragic.And we appreciate your being here, and we’re going home.Q    What did you promise the — the governor, Mr. President?  Did he ask for federal dollars?  Did he ask for your help?THE PRESIDENT:  No, no, we just had a good talk.  We’re on the same team.  We want to get it fixed.  So, we had a very good talk.  With the governor, I had a very, very good talk.Q    What do you think of Mitch McConnell voting against Hegseth’s nomination?THE PRESIDENT:  I didn’t know that.  I just know we won.  I didn’t know that.Q    Do you think the mayor got the message that she’s got to cut red tape and get (inaudible)?THE PRESIDENT:  I hope the mayor got the message.  Yeah.  I don’t know.  (Laughs.)  I’m not sure, but I hope so.  Now, look, I think she means well, but these people want to get about building their house. They’re not going to wait around 18 months, and they’re not going to wait around a long time.Q    Mr. President, are you —THE PRESIDENT:  So, we’re going to give an immediate permit.Q    Are you concerned about any other nominations for confirmation in the Senate?THE PRESIDENT:  No.  No, I’m honored to have Pete. I think Pete is going to be a great Secretary of Defense — Pete Hegseth — and we’re honored to have him.Q    I apologize.  I couldn’t hear you.  Did you say you were speaking to him on the phone?THE PRESIDENT:  No, I did speak to Pete — yeah — in the plane, in the helicopter.  I think Pete is going to be a great Secretary of Defense.Q    Are you disappointed that McConnell voted no?THE PRESIDENT:  No, I didn’t even know that.  No, I don’t know that.  I just heard that we won.  Winning is what matters, right?So, thank you very much everybody.  Are you going on the plane? Q    Yes.THE PRESIDENT:  Good.  Maybe I’ll see you on the plane.Q    That would be great.THE PRESIDENT:  We’ll see you on the plane.Q    Come back.Q    Come back and say hello, okay?THE PRESIDENT:  I will.\n\nEND             6:43 P.M. PST\n",
  "summary": "President Trump, speaking at Los Angeles International Airport on January 24, 2025, acknowledged the approval of a newly appointed Secretary of Defense, Pete Hegseth. He expressed satisfaction with the progress made in meetings held in North Carolina and Los Angeles, which focused on addressing recent tragic events. Trump emphasized the government's commitment to swift action and collaboration with local leaders, including governors and mayors, to expedite the rebuilding process in affected areas.\n\nDuring the briefing, Trump addressed questions about Senate confirmation votes, expressing no concern over Mitch McConnell's vote against Hegseth. He highlighted the importance of winning the overall vote and reiterated his confidence in Hegseth's abilities. The President also hinted at efforts to reduce bureaucratic delays in rebuilding, promising immediate permits for those impacted.\n\nThe press interaction concluded with President Trump acknowledging the ongoing partnership and efforts to support affected communities. He invited the press aboard Air Force One, suggesting informal engagements to discuss further plans and strategies during the flight.",
  "eli5": "President Trump talked about putting a new leader in charge of defense and fixing problems fast when things go wrong. He wants to help people rebuild their homes quickly, and he's happy his team made important decisions.",
  "keywords": [
    "Trump",
    "Secretary of Defense",
    "Pete Hegseth",
    "Los Angeles",
    "North Carolina",
    "rebuilding",
    "bureaucracy",
    "Senate confirmation"
  ],
  "issues": [
    "Mitch McConnell voting against the nomination",
    "Long-term bureaucratic delays in rebuilding",
    "Lack of detailed plan for immediate permits"
  ],
  "citations": [],
  "document_type": "Press Release"
}