{
  "title": "Remarks by President Trump Before Marine One Departure – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump Before Marine One Departure – The White House",
  "og:description": "  REMARKS BY PRESIDENT TRUMPBEFORE MARINE ONE DEPARTURE South Lawn  9:10 A.M. EST      THE PRESIDENT:  Hello,",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-before-marine-one-departure/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-24T16:57:20+00:00",
  "article:modified_time": "2025-01-27T15:19:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMPBEFORE MARINE ONE DEPARTURE\t\t\t\t\n\nJanuary 24, 2025\n\nREMARKS BY PRESIDENT TRUMPBEFORE MARINE ONE DEPARTURE\n\nSouth Lawn\n\n 9:10 A.M. EST     THE PRESIDENT:  Hello, everybody.  Thank you very much.  Thank you very much.So, we’re going to North Carolina.  It’s been a horrible thing the way that’s been allowed to fester, and we’re going to get it fixed up — it should have been done months ago — from the hurricane that took place almost four months ago. North Carolina has been treated very badly, so we’re stopping there. And we’re going to then go to Los Angeles and take a look at a fire that could have been put out if they let the water flow, but they didn’t let the water flow.  And they still haven’t for whatever reason.      So, I think we’re going to have a very interesting time.  I think many of you are going with us.  If you’d like to have a ride on the plane, we’d love to give it to you.     Q    Mr. President, why did you invite Adam Schiff on your trip given you called him “scum” earlier this week?     THE PRESIDENT:  I don’t know.  Is he — is he going?  Is he going?     Q    No.     THE PRESIDENT:  I don’t know.  I mean, I really don’t.  You know, because if he’s going to be there, it would be cheaper,  but I didn’t invite him.  Somebody did.     (Cross-talk.)     Q    Pete Hegseth — Pete Hegseth lost two Republican votes yesterday.  Are you at all concerned about his prospects?     THE PRESIDENT:  Look, whatever it is, it is.  He’s a good man.  I don’t know what’s going to happen; you never know in those things.  But Pete is a very, very good man.  I hope he makes it.  I hope he makes it.     I was very surprised that Collins and Murkowski would do that.  And, of course, Mitch is always a “no” vote, I guess.  Is Mitch a “no” vote?  How about Mitch?     Q    He hasn’t said yet.     THE PRESIDENT:  Huh?  He what?     Q    He hasn’t said yet.     THE PRESIDENT:  Let’s see what happens.     (Cross-talk.)     Q    The March for Life is today.  Sir, the March for Life.  Mr. President, the March for Life, sir.  Mr. President, the March for Life.  The March for Life is today.      THE PRESIDENT:  I did a big clip for the March for Life, and we look forward to seeing it.  I’m going to be watching it.  And JD Vance, our vice president, is there, and he’s going to be representing us very well.  Taking place in a little while, and other than being a little bit cold, it’s a beautiful day.     (Cross-talk.)     Q    How will your — Mr. President, how will your administration — how will your administration protect —     Q    Mr. President, will you give Italy a break of tariffs?     Q    — sir, how will your administration protect pro-life of Americans going forward?THE PRESIDENT:  Oh, we’re all — we’re all for it.  In fact, as you know, I just signed a pardon, and in the pardon, we released 23 people that were unjustly put in having to do with pro-life.  And they will be released, and they’ll be out very shortly.  It was disgraceful what happened to them.  That was a persecution.(Cross-talk.)Q    Mr. President, will you give — will you give Italy a break on tax — on tariffs, sir?THE PRESIDENT:  Well, I like her very much.  Let’s see what happens.Have a good time.  (Inaudible.)\n\nEND                 9:12 A.M. EST\n",
  "summary": "President Trump made remarks on the South Lawn before departing on Marine One on January 24, 2025. He mentioned his plan to visit North Carolina to address hurricane recovery efforts, which he felt had been neglected. Additionally, he planned to visit Los Angeles to assess fire damages, attributing the severity to water management issues. During the exchange with reporters, he responded to questions regarding his criticism of Adam Schiff, the Senate confirmation prospects of Pete Hegseth, and the March for Life event held on the same day. President Trump also mentioned a recent pardon he signed, releasing 23 individuals involved in pro-life activities.\n\nWhen asked about tariffs, particularly with Italy, President Trump made a brief but unclear remark, showing a non-committal stance. He also addressed the potential participation of reporters on his plane for the trip. The remarks were succinct, spanning only about two minutes, and included several instances of cross-talk as journalists sought answers to various questions.",
  "eli5": "President Trump talked to reporters about visiting North Carolina and Los Angeles to fix problems there and answered some questions. He also talked about freeing people involved in helping with pro-life causes.",
  "issues": [
    "The specific details of the hurricane relief efforts in North Carolina and why they were delayed.",
    "Concerns about why water management issues in Los Angeles have not been resolved.",
    "The implications of the pardon for 23 individuals involved in pro-life activities.",
    "Potential diplomatic tensions due to the mention of tariffs involving Italy without clear resolution."
  ],
  "citations": [],
  "keywords": [
    "President Trump",
    "Marine One",
    "North Carolina hurricane",
    "Los Angeles fires",
    "Adam Schiff",
    "Pete Hegseth",
    "March for Life",
    "Pro-life pardon",
    "Tariffs",
    "Italy"
  ],
  "document_type": "Press Release"
}