{
  "title": "Remarks by President Trump at the National Prayer Breakfast – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump at the National Prayer Breakfast",
  "og:description": "THE WHITE HOUSE Office of Communications ________________________________________________________________ For Immediate Release                         ",
  "og:url": "https://www.whitehouse.gov/remarks/2025/02/remarks-by-president-trump-at-the-national-prayer-breakfast/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-06T21:45:29+00:00",
  "article:modified_time": "2025-02-06T22:04:07+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMPAT THE NATIONAL PRAYER BREAKFAST\t\t\t\t\n\nFebruary 6, 2025\n\nTHE WHITE HOUSE\n\nOffice of Communications\n\n                      ________________________________________________________________\n\n  For Immediate Release                         \n\nU.S. Capitol\n\nWashington, D.C.\n\n8:18 A.M. EST\n\n THE PRESIDENT:  Thank you very much.  This is very beautiful, I must say.  This is a beautiful place.  And our country is starting to do very well again.  It’s happening fast — a little faster than people thought. \n\nThank you especially to Senator Marshall for the beautiful introduction.  Appreciate it very much.  Thank you.  Great senator you are. \n\nI also want to thank a friend and a man of profound faith and tremendous patriotism who’s also become a great friend.  You become much friendlier when you have a majority of two or three or four.  Could even be five pretty soon.  (Laughter.)  But for a little while, it was one.  That’s Mike Johnson, speaker.  Thank you very much, Mike — very much.  (Applause.)\n\nAnd thanks, as well to somebody who’s doing a fantastic job: Senator Thune.  Thank you very much, Senator.  (Applause.)  It’s not easy.  It’s not easy.  It’s really great. \n\nAnd Leader Scalise — Steve, wherever you may be.   I think you’re here someplace.  There he is.  A brave guy, too.  A brave guy.  I always say it. \n\nAnd Senator Chuck Schumer.  Chuck, thank you very much.  Thank you.\n\nSenator Hassan, thank you very much.  Thank you.  Very nice to see you. \n\nCongressman Jeffries, thank you.\n\nAnd many other very distinguished leaders in the room.  Great, great group of people.  If we could ever come together, it would be unbelievable.  It may not happen, but it should and maybe it will. \n\nFrom the earliest days of our republic, faith in God has always been the ultimate source of the strength that beats in the hearts of our nation. \n\nWe have to bring religion back.  We have to bring it back much stronger.  It’s one of the biggest problems that we’ve had over the last fairly long period of time.  We have to bring it back. \n\nThomas Jefferson himself once attended Sunday services held in the old House Chamber on the very ground where I stand today, so there could be nothing more beautiful than for us to gather in this majistic place — it is majestic — and reaffirm that America is and will always be “one nation under God.” \n\nAt every stage of the American story, our country has drawn hope and courage and inspiration from our trust in the Almighty.  Deep in the soul of every patriot is the knowledge that God has a special plan and a glorious mission for America.  And that plan is going to happen.  It’s going to happen.  I hope it happens sooner rather than later.  It’s going to happen. \n\nAnd it’s His hand that guides us every single step of the way.  And all of you and the things we have to do is to see the defining role that faith and prayer have played in the life of our nation.  And you just have to look at this building, and you can look at each other.  You can really look at each other.  It’s defined almost everyone in this room.  I think faith has been very strong with the people in this room. \n\nJust steps away from here, in the Hall of Columns, is the statue of John Winthrop, who famously proclaimed that America would stand as “a city upon a hill, a light to all nations with the eyes of all people upon us.”\n\nToday, almost 400 years after that famous sermon, we see that with the Lord’s help, the city stands taller and shines brighter than ever before — or at least it soon will. \n\nIn that same hall, we also find the statue of the great Roger Williams, who founded the state of Rhode Island, named its capital city Providence, and built the First Baptist Church in America. \n\nIt’s Williams that we have to thank for making religious liberty part of the bedrock of American life.  And today we must protect the fundamental freedom with absolute devotion.  We must stand strong, just like generations of Americans have done on the battlefields all around the world. \n\nFeet away from the magnificent rotunda, another statue watches over visitors to the Capitol.  George Washington, the founder of our country, often called for Americans to join together in prayer — very often.  And more than two centuries later, this morning, we heed President Washington’s wisdom and follow in his mighty footsteps.  He was a strong man and of great religious strength. \n\nThe stories of legends like Washington, Winthrop, and Williams remind us that without faith in God, there would be no American story.  Every citizen should be proud of this exceptional heritage.  We have an unbelievable heritage, and we have to use that and make life better for everyone. \n\nThat’s why, as we approach the 25th-times-10 anniversary — think of that, 250; 250 years we’ll be celebrating next year — of our country’s founding, I have signed an executive order to resume the process of creating a new national park full of statues of the greatest Americans who ever lived. \n\nWe’re going to be honoring our heroes, honoring the greatest people from our country.  We’re not going to be tearing down.  We’re going to be building up. \n\nIt will be called the National Garden of American Heroes.  Some of you will be on that soon-to-be hallowed ground — some of you.  Let’s see.  I can pick a few of you right now by looking — (laughter) — because there’s a couple of you right now, I can see.  Let’s see.  (Laughter.)  It’s the president’s sole opinion.  (Laughter.)  And I’ve given myself a 25-year period — (laughter) — and then somebody else.  By that time, it will be very, very built up.  (Laughter.)\n\nNo, it will be something very special, and I hope that Congress will fully fund this wonderfully unifying project at the first possible opportunity — it’s not going to be a lot of money; going to be very important, however — so that more of our people can be inspired by the faith and courage of patriots like those who we honor in these halls.  One of the incredible Americans whose memory my order will celebrate is also recognized with a statue in the Capitol, representing the great state of North Carolina, and that’s a man known — who everybody loved: Reverend Billy Graham. \n\n     He was something.  My father used to take me to watch the “Crusades.”  He would take me to Yankee Stadium.  I remember it so well.  I remember it more than I remember any Yankee game, and I’ve seen a lot of Yankee games.  (Laughter.)  Can you believe it?  And Billy didn’t have a bat, so, you know, he’s pretty good.  It was amazing.  You’d have 60- or 70,000 people, and they loved him.  They loved him. \n\n     I saw him with Franklin.  I don’t know if Franklin is here.  I just don’t know, but I’ve gotten to know Franklin.  He’s done a great job with helping on tragedies, on problems like in North Carolina, California.  He’s always the first one there.  The work he does is — his father is very proud of him, I can tell you that.  But Billy Graham was very special. \n\n     One floor below us, Reverend Graham’s statue stands with an open Bible, the page turned to a letter from the apostle Paul, which reads, “Let us not grow weary of doing good, for in due season, we will reap if we do not give up.”  Never give up.  Never ever give up.  You can’t. \n\n     How about me?  If I would have given up, I would not be here right now.  Who the hell knows where I’d be?  (Laughter.)  It might not be a good place.  If it was up to the Democrats, it would not be a good place at all.  (Laughter.)  \n\n     Never ever give up.  There could be no better message for the leaders gathered here — and you are real leaders — that we must never give up, and we must never grow tired.  We must never grow weary, and we always must practice good.\n\n     As you know, last week, only a few miles from here, our nation witnessed a terrible tragedy when 67 people were killed in a horrible accident near Reagan Airport.  As one nation, we take solace in the knowledge that their journey that night did not end in the icy waters of the Potomac, but in the warm embrace of a very loving God.  None of us knows exactly when our time on Earth will be over.  You never know.\n\n     A truth I confronted a few short months ago when there was an incident that wasn’t — it was not fun.  It was not a good thing.  But God was watching me.  The chances of me being here — my sons are shooters.  They’re really good shooters, Don and Eric.  And they said the chances of missing from that range with that gun are — but Don equated it to a one-foot putt.  That’s pretty bad.  Two feet I can see missing.  (Laughter.)  But one foot you can’t miss.  It was the equivalent of a one-foot putt, is what he told me. \n\n     He said — in fact, he gained some religion.  He gained — he went up 25 percent.  (Laughter.)  And if you know him, that’s a lot.  (Laughter.)  But he said, “There had to be somebody that saved you, and I think I know who it is.”  And he looked up.  And I said, “Whoa, Don, that’s come — you’ve come a long way.”  (Laughter.)  He’s a good guy.\n\n     But they my two sons just really couldn’t believe it.  Had I not turned that right turn just at that time — and the audience — 55,000 people standing this way.  There were just a few people in the back on the bleachers.  There was nobody over there, except for my all-time favorite chart in history, a chart on immigration.  Immigration saved my life.  See?  So, we’re going to be good for immigration, okay? \n\nBut had I not made that turn — boom — and quickly.  It was almost as though a deer bolted.  You know, they say the only way you miss when you’re a good shot is if it bolts?  I bolted.  I turned to the right to look at the chart, and I said, “Wow, what was that?  What was that?” \n\n     So, you never know, but God did that.  I mean, it had to be.  The chances of turning, because there’s no reason to turn to the right.  You know, the chart is rarely brought down.  I brought it down maybe 20 percent and — 20 percent of the time.  And it’s never on my right.  It’s always on my left.  And it’s always at the end of the speech, never the beginning of the speech. \n\nAnd if I was a little more than that 90-degree angle, it would be no good.  And if I was a little less, it would be no good.  It had to be perfect.  The thing went “shhh” right along the edge.  It didn’t affect my hair.  Can you believe that?    (Laughter.)  It might’ve touched it.  Might have touched it, but not where it counts, not — (laughter) — not the skin part.\n\n     But it changed something in me, I feel.  I feel even stronger.  I believed in God, but I feel much more strongly about it.  Something happened.  And so — (applause) — thank you.  Thank you.\n\n     But that event, like the tragedy last week, should remind us all that we have to make the most out of every single day that we have.  Who would think that you’re in space and two things collide?  The odds of that happening are so small, even without proper control. \n\nWe should have had the proper control.  We should have had better equipment.  We don’t.  We have obsolete equipment.  They were understaffed, for whatever reason.  I guess the helicopter was high, and we’ll find out exactly what happened.  But the odds, even if you had nothing — if you had nobody, the odds of that happening are extremely small. \n\n     It’s like, did you ever see — you go to a driving range in golf and you’re hitting balls, hundreds of balls, thousands of hours.  I never see a ball hit another ball.  Balls going up all over the place.  You never see them hit. \n\n It was amazing that that could happen.  There was a lot of mistakes made, and it should have never happened.  But\n\nregardless of that, it’s amazing that it happened. \n\n And I think that’s going to be used for good.  I think what is going to happen is we’re all going to sit down and do a great\n\ncomputerized system for our control towers, brand-new — not pieced together, obsolete, like it is — land-based — trying to hook up a land-based system to a satellite system. \n\nAnd the first thing that some experts told me when this happened is you can’t hook up land to satellites, and you can’t hook up satellites to land.  It doesn’t work.  And we spent billions and billions of dollars trying to renovate an old, broken system, instead of just saying, “Cut it loose, and let’s spend less money and build a great system.”  Done by two or three companies — very s- — good companies, specialists.  That’s all it is. \n\n     They used 39 companies.  That means that 39 different hookups have to happen.  And I don’t know how many people of you are good in terms of all of the kind of things necessary for that — and it’s very complex stuff — but when you have 39 different companies working on hooking up different cities and different people — you need one company with one set of equipment. \n\nAnd there are some countries that have unbelievable air controller systems, and they would have — bells would have gone off when that helicopter literally even hit the same height, because it traveled a long distance before it hit.  It was just like — just wouldn’t stop — you follow the line.  But bells and whistles would have gone off.  They have them where it actually could virtually turn the thing around.  It would have just never happened if we had the right equipment. \n\nAnd one of the things that’s going to be — I’m going to be speaking to John and to Mike and to Chuck and to everybody.  We have to get together and just — as a single bill, just pass where we get the — the best control system.\n\nWhen I land in my plane, privately, I use a system from another country, because my captain tells me — I’m landing in New York, and I’m using — I won’t tell you what country, but I use a system from another country, because the captain says, “This thing is so bad.  It’s so obsolete.”  And we can’t have that. \n\nSo, we’re going to have the best system and it’s a lot of money, but it’s not that much money.  And it’ll happen fast, and it’ll be done by total professionals.  And when it’s done, you’re not going to have accidents.  It’s just not — they’re not — they’re virtually not possible to have. \n\nEach of us is blessed with a precious chance to help lead America to renew our pledges of faith and everything else and bring us to new heights and create a future of promise for our people and for ourselves. \n\nYou know, we have the most important people in the country, in a true sense, here, because you’re the ones that are going to make the decision.  You’re the ones that are leading us into so many different things, whether it’s the right air control system or the right size military or what to do and what not to do — most important people.\n\nAnd many of you are very religious.  I know so many of you are very religious.  And I just think that our country has been so badly hurt.  We’re very hurt by what COVID did to religion.  It really hurt it badly.  People couldn’t go to church for a long period of time.  Even going outside, they were given a hard time.  And I’m not blaming anybody for that, but — but it was very hard to gather. \n\nSo, they start using computers, if that.  And when they come back, it’s just, you know, a whole new experience they have to get used to.  But it is starting to come back. \n\nWe had a fantastic thing happen yesterday.  The Army had the best recruitment numbers that they’ve had in more than 15 years.  They think it could be 25 years, actually — they’re going to probably put that out — but more than 15 years just now.  (Applause.)\n\nAnd we were worried about it.  We were talking about it numerous times that, you know, we don’t have people joining our military services.  We don’t have people joining our police force.  We have to cherish our police. \n\nIt’s so dangerous.  You open a car and somebody starts shooting.  They have blackened windows.  You don’t even have any idea who’s in the car.  Oftentimes, they have the dark windows — which they’re not, in theory, supposed to have, but they have them.  The door opens and a gun is pointed at your face, and you can’t do a thing about it.  It’s just nothing you’re going to do about it.  Your friends will take them out, and it’s happened so many times, but you just — it’s so — such a dangerous thing.  We have to cherish these people. \n\nSo, today, we join our hearts and prayers in recommitting to putting our country first.  We have to put our country first, making America stronger and greater and more exceptional than ever before.\n\nAnd we have to make religion a much more important factor now.  We have to make it an important factor.  And if we do that, it’s going to be — our job is just going to be much easier.  It unifies people.  It brings people together.  Democrats are going to be able to have lunch again and dinner with Republicans. \n\nAnd I remember, just as — growing up, I’d see — you know, I revered senators and congressmen as something very special, but they were out to dinner all the time.  We had an old congressman, maybe some of — Sey Halpern from Queens,\n\nand he was a friend of my father.  But he’d have dinner with — he was a Democrat, but he would have dinner with Republicans, and he’d be at it.  It wouldn’t even make a difference.\n\nToday, it’s like shocking.  And it shouldn’t be.  You have to get together.  We really have to get together. \n\nWe all know what’s right and what’s wrong, and\n\nthere’s going to be compromise on both sides, but we have to just do the right thing, and we have to get together.  \n\nYou did it with Marco Rubio.  He got everybody who was — 99 votes.  And the only vote was our VP, who — who maybe we should have been there just to make it a hundred, but I think I would have been angered if it was a hundred.  That might be a step too far, right?  (Laughter.)  But, no, it was great to see a vote. \n\nPam Bondi had support from Democrats, and some of the others had some pretty good support.  So, you know, it’s doable.\n\nWe had a recent bill having to do with a very beautiful young lady who was killed from Georgia, and that bill was very bipartisan.  It was a very beautiful thing to watch, actually.  And so, I think we just have to — if possible, we have to unify.\n\nThere’s big division.  I mean, some people want an open border and some people want a closed border.  We want it closed, and they want it open.  Now, that’s a big difference.  How do you solve that problem?  It’s a big difference. \n\nSome people want men in women’s sports and some people don’t.  And I was with somebody yesterday who was so upset that the bill was signed, where men cannot participate in women’s sports.  And I said — he’s a very smart guy —\n\nwent to a great school, was a great student.  And he actually feels, you know, that that should happen: Men should be able to play — meaning transition into women sports.\n\nAnd you talk to him, and it’s just — you know, I don’t understand it. I think it — I don’t understand how the problem ever got started in the first place.  It just seems so simple.\n\nBut he’s a good person and just believes it.  He just believes it.  Not going to be easy to convince him otherwise. \n\nSo, where is a middle ground?  It’s just hard to have a middle ground if there’s two ways.  I mean, you can either do it or you can’t. \n\nBut I think a lot of good things are going to happen.  You know, a lot of people might be surprised to hear me say that, of all people, but I think a lot of good things are going to happen.  Because our country has got some big headaches, but we have tremendous spirit right now. \n\nThe spirit is as high as it’s been.  It was up 49 points this morning — 49 points.  That’s the biggest increase in the history of whatever the poll was. \n\nSo, the spirit is there.  That’s a big factor.  That’s probably the hardest thing to get back, to be honest.  The rest is easy.  The rest is easy. \n\nSo, I want to just thank you all.  I want to congratulate a lot of the new members.  I see so many of you that ran great races.  David, that was a great race.  But so many that ran great races.  And on both sides, you ran some incredible races.  So, it’s good to be with you. \n\nAnd God bless everybody.  We want to come together.  And the happiest — the person, the element, the everything that’s going to be happy.  People of religion are going to be happy again. \n\nAnd I really believe you can’t be happy without religion, without that belief.  I really believe it.  I just don’t see how you can be.  (Applause.)\n\nSo, let’s bring religion back.  Let’s bring God back into our lives. \n\nThank you all very much.  Thank you very much.  Great honor.  Thank you.  (Applause.)\n\nEND                  8:42 A.M. EST\n",
  "summary": "At the National Prayer Breakfast on February 6, 2025, President Trump delivered a speech at the U.S. Capitol, Washington, D.C. He emphasized the importance of faith and religion in American society, highlighting how religion has played a crucial role in the country's history. Citing historical figures like Thomas Jefferson, John Winthrop, and Roger Williams, he called for a resurgence of religious values and announced an executive order for creating a new park to honor American heroes.\n\nDuring his address, he also discussed the importance of unity among political leaders and the need to prioritize America and its values. He recalled a personal incident and emphasized the role of faith in overcoming challenges. Additionally, he addressed recent national tragedies, elaborated on issues in aviation control safety, and advocated for modernization of air traffic control systems.\n\nThe President's speech included comments on the recent improvement in army recruitment numbers and highlighted his belief in the necessity of having God and religion play a more prominent role in everyday American life, urging for national unity and collective faith.",
  "eli5": "President Trump gave a speech saying that religion and faith are very important for America. He wants to make sure religion comes back stronger and wants to honor important people in a new park.",
  "keywords": [
    "President Trump",
    "National Prayer Breakfast",
    "Faith",
    "Religion",
    "American History",
    "Unity",
    "National Garden of American Heroes",
    "Executive Order",
    "Tragedy",
    "Air Traffic Control"
  ],
  "issues": [
    "Potential bias towards religious enthusiasts",
    "Handling of national tragedies",
    "Modernization of air traffic systems",
    "Focus on religious revival"
  ],
  "citations": [],
  "document_type": "Press Release"
}