{
  "title": "Remarks by President Trump Before Cabinet Meeting – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump Before Cabinet Meeting",
  "og:description": "Cabinet Room 11:42 A.M. EST      THE PRESIDENT:  Okay.  Thank you very much.  We appreciate you being here.  And",
  "og:url": "https://www.whitehouse.gov/remarks/2025/02/remarks-by-president-trump-before-cabinet-meeting/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-26T22:58:31+00:00",
  "article:modified_time": "2025-02-26T22:58:32+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMP BEFORE CABINET MEETING\t\t\t\t\n\nFebruary 26, 2025\n\nCabinet Room\n\n11:42 A.M. EST\n\n     THE PRESIDENT:  Okay.  Thank you very much.  We appreciate you being here.  And we’ve put together a great Cabinet.  And we’ve had tremendous success.  We’ve been given a lot of credit for having a very successful first month, and we want to make that many months — and years, actually.  But we’re going to have many good months, and we’re going to have many good years, I hope.  And we’re going to solve a lot of problems.      We’re doing very well with Russia-Ukraine.  President Zelenskyy is going to be coming on Friday.  It’s now confirmed.  And we’re going to be signing an agreement, which will be a very big agreement.  And I want to thank Howard and Scott for the job you guys did in putting it together.  Really did an amazing job.  And that’ll be on rare earth and other things.      And as you know, we’re in for, probably, $350 billion and Europe is in for $100 billion.  And that’s a big difference.  So, we’re in for, probably, three times as much.  And yet, it’s very important to everybody, but Europe is very close.  We have a big ocean separating us.  So, it’s very important for Europe.  And they, hopefully, will step up and do maybe more than they’re doing and maybe a lot more.\n\n     The previous administration put us in a very bad position, but we’ve been able to make a deal where we’re going to get our money back and we’re going to get a lot of money in the future.  And I think that’s appropriate, because we have taxpayers that are — shouldn’t be footing the bill, and they shouldn’t be footing the bill at more than the Europeans are paying.      So, it’s all been worked out.  We’re happy about it.  And I think that, very importantly, we’re going to be able to make a deal.      Most importantly, by far, we’re going to make a deal with Russia and Ukraine to stop killing people.  They’ll stop killing young Russian soldiers and young Ukrainian soldiers and other people, in addition, in the towns and cities.  And we will consider that a very important thing and a big accomplishment, because it was going nowhere until this administration came in.  They hadn’t spoken to President Putin in two years.  And so, we’ll keep you advised.     Before we begin the Cabinet, I’d like to have Scott\n\nand a couple of people say a few things.  But most importantly — where are you?     SECRETARY TURNER:  I’m right here, sir.     THE PRESIDENT:  This is a gentleman who’s going places — the head of HUD.  And he’s going to say — you all know him.  And you’re going to say grace —     SECRETARY TURNER:  Yes, sir.     THE PRESIDENT:  — and then we’ll have our meeting, right?\n\nSECRETARY TURNER:  Yes.\n\n     THE PRESIDENT:  Thank you very much.      SECRETARY TURNER:  Thank you, Mr. President.  Let’s pray.     Father, we thank you for this awesome privilege, Father, to be in your presence.  God, thank you that you’ve allowed us to see this day.  The Bible says that your mercies are new every morning.  And, Father God, we give you the glory and the honor.  Thank you, God, for President Trump, Father, for appointing us.  Father God, thank you for anointing us to do this job.  Father, we pray you’ll give the president and the vice president wisdom, Father God, as they lead.      Father, I pray for all of my colleagues that are here around the table and in this room.  Lord God, we pray that we would lead with a righteous clarity, Father God, and as we serve the people of this country and every perspective agency, every job that we have, Father, we would humble ourselves before you that we would lead in a manner that you’ve called us to lead and to serve.      Father, the Bible says the blessed is the nation whose God is the Lord.  But, Father, we today honor you.  And in your rightful place, Father, thank you for giving us this opportunity to restore faith in this country and be a blessing to the people of America.  And, Lord God, today in our meeting, we pray that you will be glorified in our conversation.     In Jesus’ name, amen.     PARTICIPANTS:  Amen.     THE PRESIDENT:  Scott, that was a very good job you did.  You’ve done that before, haven’t you?  (Laughter.)  Wow.      So, Scott Turner is a terrific young guy.  He’s heading up HUD, and he’s going to make us all very proud, right?     SECRETARY TURNER:  Thank you, Mr. President.  Yes, sir.\n\n     THE PRESIDENT:  Thank you very much.  Great job.      In just over one month, illegal border crossings have plummeted by numbers that nobody has actually ever seen before.  It’s much more than 100 percent. \n\nAnd we’ve unleashed American energy at levels that will soon be reported, but we think we’re going to get it going very quickly.  We have incredible people on the energy front. \n\nI think we have really great people on every front.  I’ll let you know if they’re not good, but I think they really are. \n\nAnd we’re fighting every day to get the prices down.  The inflation is stopping slowly, but part of the reason it’s stopping is because of high interest rates and other problems that we inherited.  But we have to get the prices down — not the inflation down — the prices of eggs and various other things.  Eggs are a disaster.      The secretary of Agriculture is going to be showing you a chart that’s actually mindboggling what’s happened — how low they were with us and how high they are now.  But I think we can do something about it —     SECRETARY ROLLINS:  Yes, sir.     THE PRESIDENT:  — Madam Secretary.     SECRETARY ROLLINS:  Yes, sir.     THE PRESIDENT:  And I think you’re going to do a fantastic job in that position. \n\nOne of the most important initiatives is DOGE, and we have cut billions and billions and billions of dollars.  We’re looking to get it maybe to a trillion dollars.  If we can do that, we’re going to start getting to be at a point where we can think in terms of balancing budgets, believe it or not, something you haven’t heard in many, many years — decades, actually.  And it’s a big — whether it’s this year or next year, I think we’ll be very close to balancing budgets.  And the DOGE is very important. \n\nAnd Elon is here to give you a summary of what’s happening, some of the things they found — some of the horrible things they found — some of the theft and fraud, and we call it waste and abuse, but a lot of fraud, and probably some fraud that we’re not going to be able to prove is fraud, but when you hear the names and the places where this money is going, it’s a disgrace.      But we’ve requested that a lot of people — we want to make sure that the people are working.  So, letters were sent out, and I think everyone at this table is very much behind it.  And if they aren’t, I’d want them to speak up.  But they’re very much behind it.      Letters were sent out to people just to find out, if the people exist, do they work?  Who do they work for?  Where are they?  You know, where have they been working?  Have they been working for other companies or other entities at all and being paid by the government, so they have two jobs, but they’re supposed to have one? \n\nAnd the letter asks some simple questions like, “What have you done lately?”  And if they can answer that — because I can.  I can tell you everything I’ve done for the last long period of time — a lot more than a week. \n\nAnd in many cases, we haven’t gotten responses.  Usually that means that maybe that person doesn’t exist or that person doesn’t want to say they’re working for another company while being paid by the United States government. \n\nSo, there’s a lot of interesting things.  It’s very unique, but we have a very unique situation because we have a lot of people that were scamming our country.  We have a lot of dishonest people.  We have a lot of people that took advantage of a lot of different situations, and we’re not going to let that happen. \n\nSo, I’m going to ask, if it’s possible, to have Elon get up first and talk about DOGE, because it seems to be of great interest to everyone. \n\nI will say that there is a large group of people in this country that have such admiration for what we’re doing.  I got elected with a tremendous vote — winning every swing state, winning the popular vote, winning the counties by thousands of counties.  I think it was 2,800 to 500.  2,800 counties to 500 counties.  Think of that. \n\nAnd so, we have a mandate to do this, and this is part of the reason I got elected.  I got elected based on taxes and based on many things, the border, but also based on balancing budgets and getting our country back into shape, and this is a big part of it. \n\nSo, Elon, if you could get up and explain where you are, how you’re doing, and how much we’re cutting.  And it’s an honor to have you.  He’s been a tremendously successful guy.  He’s really working so hard.  And he’s got businesses to run.  And in many ways, they say, “How do you do this?”  And, you know, he’s sacrificing a lot and — getting a lot of praise, I’ll tell you, but he’s also getting hit.  And we would expect that, and that’s the way it works. \n\nSo, I’d like to have Elon Musk please say a few words.     MR. MUSK:  Well, tha- — thank you —     THE PRESIDENT:  Thank you, Elon.\n\nMR. MUSK:  Thank you, Mr. President.  Well, I a- — I actually just call myself humble tech support here — (laughter) — because this is actually — as crazy as it sounds, that — that is almost a literal description of the work that the DOGE team is doing is helping fix the government computer systems.  Many of these systems are extremely old.  They don’t communicate.  There are a lot of mistakes in the systems.  The software doesn’t work.  The — so, we are actually tech support.  It’s — it’s a — it’s ironic, but it’s true.\n\nThe — the overall goal here with the DOGE team is to help address the enormous deficit.  We simply cannot sustain, as a country, $2 trillion deficits.  The interest rates — just the interest on the national debt now exceeds the Defense Department spending. \n\nWe spend a lot on the Defense Department, but we’re spending, like, over a trillion dollars on interest.  If this continues, the country will go — become de facto bankrupt.  It’s — it’s not an optional thing.  It is an essential thing.  That — that’s — that’s the reason I’m here and taking a lot of flak and getting a lot of death threats, by the way.  I can, like, stack them up, you know.\n\nBut if we don’t do this, America will go bankrupt.  That’s why it has to be done.  And I’m confident, at this point — knock on wood, you know — knock on my wooden head — (laughter) — the — there’s a lot of wood up there — that we can actually find a trillion dollars in savings.  That would be roughly 15 percent of the $7 trillion budget.\n\nAnd obviously, that can only be done with the support of everyone in this room.  And I’d like to thank everyone for — for your support.  Thank you very much this.  This — this can only be done with — with your support.\n\nSo, this is — it’s really — DOGE is a support function for the president and for the — the agencies and departments to help achieve those savings and to effect- — effectively find 15 percent in reduction in fraud and — and waste.\n\nAnd — and we bring the receipts.  So, people say, like, “Well, is this real?”  Just go to DOGE.gov.  We l- — we — line item by line item, we specify each item.  So — and w- — and I — I should say, we — also, we will make mistakes.  We won’t be perfect.  But when we make mistake, we’ll fix it very quickly. \n\nSo, for example, with USAID, one of the things we accidentally canceled, very briefly, was Ebola — Ebola prevention.  I think we all wanted Ebola prevention.  So, we restored the Ebola prevention immediately, and there was no interruption.\n\nBut we do need to move quickly if we’re — if we’re to achieve a trillion-dollar deficit reduction in tw- — in — in financial year 2026.  It requires saving $4 billion per day, every day from now through the end of September.  But we can do it, and we will do it.\n\nThank you. \n\nTHE PRESIDENT:  Well, do you have any questions of Elon while we’re on the subject of DOGE?  Because we’ll finish off with that.  And if you would have any questions, please ask — you could ask me or Elon.\n\nGo ahead, please. \n\nQ    Thank you, Mr. President.  Thank you, Mr. Musk.  I just wanted to ask you, the — President Trump put out a Truth Social today saying that everybody in the Cabinet was — was happy with you.  I just wondered if that — if you had heard otherwise, and if you had heard anything about members of the Cabinet who weren’t happy with the way things were going.  And if so, what are you doing to address those — any dissatisfaction?\n\nMR. MUSK:  To the best of —\n\nTHE PRESIDENT:  Hey, Elon, let the Cabinet speak just for a second.  (Laughter.)      Is anybody unhappy with Elon?  If you are, we’ll throw them out of here.  (Laughter.)  Is anybody unhappy?  (Applause.)\n\nThey are — they have a lot of respect for Elon and that he’s doing this.  And some disagree a little bit, but I will tell you, for the most part, I think everyone is not only happy, they’re thrilled. \n\nSo, go ahead, Elon.\n\nSECRETARY ROLLINS:  And grateful.\n\nMR. MUSK:  And President Trump has put together, I think, the best cabinet ever, literally.  So, I — and I do not give false praise.  This — this is an incredible group of people.  I don’t think such a talented team has actually ever been assembled.  I think it’s literally the best cabinet that the country has ever had.  And I think the companies should be incredibly appreciative of the people in this room.\n\nQ    Mr. President —\n\nTHE PRESIDENT:  Please.  Yeah.  Go ahead.\n\nQ    Mr. President, thank you.  Mr. Musk.  Are there — about half of the government employees so far appear to have responded to your request for what they’ve been doing over the past week.  Is there a timeline in place for next moves for people being fired?  And when can the American people expect to see results from that?\n\nMR. MUSK:  Yes.  Well, to be — to be clear, like, the — I think that email, perhaps, was misinterpreted as a performance review, but actually it was a pulse check review.  “Do you have a pulse?”  (Laughter.)  “Do you have a pulse and two neurons?”  (Laughter.)  So, if you have a pulse and two neurons, you can reply to an email.\n\nThis is, you know, I think, not a high bar, is what I’m saying.  This is a — should be — anyone could accomplish this. \n\nBut what we are trying to get to the bottom of is we think there are a number of people on the government payroll who are dead, which is probably why they can’t respond, and — and some people who are not real people, like they’re literally fictional individuals that are collecting payche- — well, somebody is collecting paychecks on a fictional individual.  So, we’re just literally trying to figure out are these people real, are they alive, and can they write an email, which I think is a reasonable expectation for the Amer- — you know, the American public would have at least that expectation of someone in the public sector.\n\nQ    Mr. Musk —\n\nQ    Mr. Musk —\n\nQ    — roughly a million employees —\n\nMR. MUSK:  (Laughs.)  This is not a — this is not a high bar, guys.  Come on.  (Laughter.)\n\nQ    Roughly a million employees have responded so far to this email.  Does that mean that the remaining 1 million or so federal employees now risk being terminated?  And is it your understanding and expectation when you post a directive on X that the Cabinet secretaries will follow that order?  Because several agencies have instructed employees that this is voluntary or not to respond.\n\nMR. MUSK:  Yeah.  Well, I mean, to be cl — so, I guess there was a — like, last week, the president en- — encouraged me, via Truth Social and also via phone call, to be more aggressive.  And I was like, “Okay.”  You know, “Yes, sir, Mr. President.  We will indeed do that.”  The president is the commander in chief.  I — I do what the president asks.\n\nSo — and I said, “Can we send out an email to everyone, just saying, ‘What did you get done last week?’”  The president said yes.  So, I — I did that. \n\nAnd, you know, we — we got a partial response.  But we — we’re going to send another email.  But we — our — our goal is not to be capricious or — or unfair.  It’s — we want to give people every opportunity to send an email and the email could simply be “What I’m working on is too sensitive or classified to — to describe.”  Like, literally, just re- — that would be sufficient.  We’re — we’re — you know, I think this is just common sense. \n\nQ    And what is your target number for — for how many workers, employees you’re looking to cut total?\n\nMR. MUSK:  We — we wish to keep everyone who is doing a job that is essential and doing that job well.  But if — if they’re — if the job is not essential or they’re not doing the job well, they obviously should not be on the public payroll. \n\n(Cross-talk.)\n\nTHE PRESIDENT:  No, I have to — I would like to add —\n\n(Cross-talk.)\n\nWait a minute.  Wait.  Wait.  I’d like to add that those million people that haven’t responded, though, Elon, they are on the bubble.  You know, I wouldn’t say that we’re thrilled about it.  You know, they haven’t responded.  Now, maybe they don’t exist.  Maybe we’re paying people that don’t exist.\n\nDon’t forget, we just got here.  This group just got here.  But those people are on the bubble, as they say.  You know, maybe they’re going to be gone.  Maybe they’re not around.  Maybe they have other jobs.  Maybe they moved and they’re not where they’re supposed to be.  A lot of things could have happened.\n\nI wouldn’t say that Biden ran a very tight administration.  They spent money like nobody has ever spent money before, wasted money — the Green New Scam, all of the different things they spent money on. \n\nAnd you’ve seen that.  You’ve seen that with some of the things that I read in speeches.  I read them, and people can’t believe, when I read them, $20 million here, $30 million here for, you know, a little educational course on something.  Circumcision, right?  Circumcision.  $20 million to inform the people of such-and-such a country on other things and other things other than that.\n\nSo, yeah, those people are — right now, we’re trying to find out who those people are that haven’t responded.  Now, there’ll be some agencies — like Marco has people within State that are right now doing very classified, very confidential work.  And we understand that, and we’ve talked.  And, you know, we’re being a little more surgical. \n\nAnd Marco is doing a lot of things himself.  He’s — and some of the secretaries are.  We’re going to be going to them.  We’re going to be talking about it today.  We’re going to ask them to do their own DOGE.  In other words, they’ll look in their group and who —\n\nI spoke with Lee Zeldin, and he thinks he’s going to be cutting 65 or so percent of the people from Environmental, and we’re going to speed up the process, too, at the same time.  He had a lot of people that weren’t doing their job — they were just obstructionists — and a lot of people that didn’t exist, I guess, Lee, too.  You found a lot of empty spots that the people weren’t there.  They didn’t exist.\n\nAnd I think Education is going to be one of those.  You go around Washington, you see all these buildings — the Department of Education.  We want to move education back to the states, where it belongs.  Iowa should have education.  Indiana should run their own education.  You’re going to see education go way up.\n\nRight now, we’re ranked at the very bottom of the list, but we’re at the top of the list in one thing: the cost per pupil.  We spend more money per pupil than any other country in the world, and yet it’s Denmark and Norway, Sweden.  And I — you hate to say this — and, you know, we’re going to get along very well with China, but it’s a competitor: They’re at the top of the list.  They’re among the top 10, usually.  And they’re a very big country, so we can’t use that as an excuse — right? — because we’re a very big country too.\n\nBut we’re – we were ranked last time — under Biden, we were ranked 40 out of 40.  They do the 40 certain nations that they’ve done for a long time.  It seems to be 40, for whatever reason.  And we were ranked number 40.  A year ago, we were 38.  Then we were 39.  We’re — we hit 40.  And so, we’re last in that, and we’re first in cost per pupil.  So, I would say that’s unacceptable.\n\nLawrence, do you have something?  Go ahead.\n\nQ    So, Mr. President, I know you like competition, and I know it’s early.  So, which department are you most impressed with? \n\nAnd then, to Mr. Mu- — (laughter).  That’s the first one.  And, Mr. Musk, which department have you received the most resistance from?      Mr. President, you first.\n\nTHE PRESIDENT:  Well, I think both of those questions are a little bit — well, you’re a pretty controversial guy.  (Laughter.)  Look, it’s very early.  Right now, I think I’m impressed with everybody.  So far, everybody.  If I wasn’t, in the first month, we’d — and some of them just got here.  They just got approved two days ago, right?\n\nBut I think I’m very impressed with everybody.  So far, I’m very happy with all of the choices.\n\nI think that Elon has done incredibly with some groups.  And some groups are much easier than others.  It is true: State is a, you know, very difficult situation.  We’re right now negotiating very successfully, I think, with Russia and with Ukraine, and we have a lot of countries involved.  And we have to be a little bit careful what we do and who we’re terminating.  But Marco is doing that very — I think he’s going to be very precise.  It’s going to be —\n\nWe’re cutting down government.  We’re cutting down the size of government.  We have to.  We’re bloated.  We’re sloppy.  We have a lot of people that aren’t doing their job.  We have a lot of people that don’t exist.      You look at Social Security as an example.  I mean, you have so many people in Social Security where, if you believe it, they’re 200 years old.  And what we’re doing is finding out: Are checks going out for that and is somebody cashing those checks who’s maybe 35 years old?  Okay?      So, there’s a lot of dishonesty.  There’s a lot of fraud.      But I think at this moment, I’ll take Elon off the spot.  I think that he’s impressed — he said it very well –better than I can say it — that he’s impressed with the people in this room.  Very impressed.  And I am too.  And it’s too early to say, but I think everybody is on board.  They all know — we want to balance a budget.  We want to have a balanced budget within a reasonably short period of time, meaning maybe by next year or the year after, but maybe — maybe even sooner than that.      Q    Mr. President, your — your number one issue was the border.  We just got new information that they’re doxing our federal agents.  They’re putting their personal information out there, these activists, and they’re disrupting the operations.  So, you got Tren de Aragua running all across the country —     THE PRESIDENT:  Well, we have activists.  That’s true.  And a lot of those —     Q    So, what are we going to do about the activists —     THE PRESIDENT:  Yeah.  A lot of those activists are acting illegally.  And we’ll give that to our attorney general, and she’ll take a look at that very strongly.  But we’re also having tremendous support from Border Patrol, from ICE.  The ICE agents have been unbelievable.  Border Patrol — their leadership at Border Patrol has been incredible, and they’re working very well.      And, as you know — and I saw you reporting it this morning, actually — we set records on the least number of illegal aliens coming in, migrants coming into our country that we’ve had in more than 50 years.  And we did this all within a period of weeks, because we took over a mess.  The world was pouring in.  And remember, they were coming in from jails and prisons and mental institutions and insane asylums, and they were gang members and drug dealers.  Anybody who wanted to come in, they came.  And from not just South America, from all over the world.  So, it’s amazing what they’ve done.      And Kristi and — and Tom Homan, the job they’ve done has been absolutely amazing.  We set records for — and we want people to come into our country, by the way, but they want to come in — they have to come in legally.      I want that to be really understood.  We want people in our country, but they have to come in legally.      Q    Can I follow on that, Mr. President?\n\nQ    Mr. President.\n\nQ    About the — the Trump gold card idea —     THE PRESIDENT:  Yeah.     Q    — that you unveiled yesterday.     THE PRESIDENT:  I hope you liked it.  (Laughter.)     Q    I await more information.  But the question is: Does this reflect a view, on your part, that the American immigration system has never been properly monetized as you feel it should be?\n\n     THE PRESIDENT:  Well, not so much monetized.  It hasn’t been properly run.  I get calls from, as an example, companies where they want to hire the number one student at a school.  A person comes from India, China, Japan, lots of different places, and they go to Harvard, the Wharton School of Finance.  They go to Yale.  They go to all great schools.  And they graduate number one in their class, and they are made job offers, but the offer is immediately rescinded because you have no idea whether or not that person can stay in the country.  I want to be able to have that person stay in the country.      These companies can go and buy a gold card, and they can use it as a matter of recruitment.      At the same time, the company is using that money to pay down debt.  We’re going to — we’re going to pay down a lot of debt with that.     Q    Are they going to have to —     THE PRESIDENT:  And I think the gold card is going to be used by — not only for that.  I mean, they’ll be used by companies.  I mean, I could see Apple — I’ve spoken with Tim Cook — and, by the way, he’s going to make a $500 billion investment in the country only because of the results of the election and, I think, because of tariffs.  He’s going to want to be in the country because of tariffs.  Because if you’re in the country, there is no tariff.  If you’re out of the country, you got to pay tariffs.  And that’s going to be a great investment, I think, that he’s making.  I know it’s going to be a great investment.      But we have to be able to get people in the country, and we want people that are productive people.  And I will tell you, the people that can pay $5 million, they’re going to create jobs.  They’re going to spend a lot of money on jobs.  They’re going to have to pay taxes on that too.  So, they’re going to be hiring people, they’re going to be bringing people in and companies in.  And, I don’t know, maybe it will sell like crazy.  I happen to think it’s going to sell like crazy.  It’s a bargain.     But we’ll —\n\n     Q    Will they have to commit to a certain number?     THE PRESIDENT:  — know fairly soon.  I think Howard and — and Scott — a few of you, really, are responsible for it.  But, Howard, if you want to discuss that for a couple of minutes, I think I’d like to have you.  I think it’s going to be a very successful program.     SECRETARY LUTNICK:  Sure.     THE PRESIDENT:  This is Commerce.     SECRETARY LUTNICK:  So, the EB-5 program, which has been around for many years, had investment of a million dollars into projects in America.  And those projects were often suspect, they didn’t really work out, there wasn’t any oversight of it.  And so, for a million-dollar investment, you got a visa, and then you came into the country and ended up with a green card.      So, it was poorly overseen, poorly executed.  Then you had our border open, where millions of people came through.      So, the idea is we will have a proper business.  We will modify the EB-5 agreement.  Kristi and I are working on it together.  For $5 million, they’ll get a license from the Department of Commerce.  Then they’ll make a proper investment on the EB-5, right?  And we think Scott and I will design the EB-5 investment model, because Scott and I are the best people together to do that.  So, this is joint.      This is exactly the Trump administration.  We all work together.  We work it out to be the best.  And if we sell — just remember — 200,000 — there’s a line for EB-5 of 250,000 right now — 200,000 of these gold green cards is $1 trillion\n\nto pay down our debt, and that’s why the president is doing it, because we are going to balance this budget, and we are going to pay off the debt under President Trump.      Q    Mr. —\n\nQ    And to qualify, do you have to promise and make commitments to create a certain number of jobs here in the U.S.?     THE PRESIDENT:  No.  No.  Because not all these people are going to be job builders.  They’ll be successful people, or they’ll be people that were hired from colleges, like — sort of like paying an athlete a bonus.  I mean, Apple or one of the companies will go out and they’ll spend five mil- — they’ll buy five of them, and they’re going to get five people.      Look, I’ve had the complaint where — I’ve had the complaint from a lot of companies where they go out to hire people, and they can’t hire them b- — out of colleges.  And you know what they do?  They go back to India, or they go back to the country where they came, and they open up a company, and they become billionaires.  They become — and they’re employing thousands and there are a lot of examples. \n\nThere are some really big examples where they were forced out of the country.  They graduated top in their class at a great school, and they weren’t able to stay.  This is all the time you hear it. \n\nAnd the biggest complaint I get from companies, other than overregulation, which we took care of, but we’re going to have to take care of it here, because a lot of that was put back on by Biden.  But the biggest complaint is the fact that they can’t have any longevity with people.  This way, they have pretty much unlimited longevity. \n\nAlso, with the $5 million, you know, that’s a path to citizenship.  So, that’s going to be — it’s sort of a green card-plus, and it’s a path to citizenship.  We’re going to call it the gold card.  And I think it’s going to be very treasured.  I think it’s going to do very well.  And we’re going to start selling, hopefully, in about two weeks.\n\nNow, just so you understand, if we sell a million — right? — a million, that’s $5 trillion.  Five trillion.  Howard was using a different number, but that’s $5 trillion.  If we sell 10 million, which is possible — 10 million highly productive people coming in or people that we’re going to make productive — they’ll be young, but they’re talented, like a talented athlete — that’s $50 trillion. \n\nThat means our debt is totally paid off, and we have $15 trillion above that.  And — now, I don’t know that we’re going to sell that many.  Maybe we won’t so many at all.  But I think we’re going to sell a lot, because I think there’s — there really is a thirst. \n\nNo other country can do this, because people don’t want to go to other countries.  They want to come here.  Everybody wants to come here, especially since November 5th.  (Laughter.)\n\n(Cross-talk.)\n\nSECRETARY LUTNICK:  They’ll all be vetted, by the way.  All these people will be vetted. \n\nQ    How?\n\nSECRETARY LUTNICK:  Okay?  They’ll be vetted.\n\nQ    Mr. President, on Ukraine.  Can you talk a lot — a little bit about what type of security guarantees you’re willing to make?\n\nTHE PRESIDENT:  Well, I’m not going to make security guarantees beyond very much.  We’re going to have Europe do that, because it’s in — you know, we’re talking about Europe is their next-door neighbor.  But we’re going to make sure everything goes well. \n\nAnd as you know, we’ll be making a — we’ll be really partnering with Ukraine in terms of rare earth.  We very much need rare earth.  They have great rare earth.  We’ll be working with Secretary Burgum and with Chris.  You’ll be working on that together. \n\nAnd we’re going to be able to have tremendous — I mean, this gives us — because we don’t have that much of it here.  We have some, but we don’t have that much, and we need a lot more to really propel us to the next level of — to lead in every way.  We’re leading right now with AI.  We’re leading with everything right now, but we have to — we need resources. \n\nWe have to double our electric capacity.  We have to do many things.  We have to really triple, if you think of it, the electric capacity from what we have right now, if you can believe it.  (Laughter.) \n\nQ    But will the United States — can I —\n\nTHE PRESIDENT:  So, I just say this.  So, the deal we’re making gets us — it brings us great wealth.  We get back the money that we spent, and we hope that we’re going to be able to settle this up. \n\nWe want to settle it.  We want to stop — I tell you what.  I’m doing it for two reasons, but the number one reason, by far, is to watch — all these people being killed.  I see pictures every week from — I assume satellite pictures, mostly, but there’s some pictures on site of thousands of soldiers that are being killed.  They’re being decimated, because equipment today — military equipment is so powerful and so devastating.  And, number one, I want to see people stop. \n\nAnd they’re not from here.  They’re from primarily two other countries. \n\nAnd then, by the way, let’s talk about the Middle East.  We got to solve that problem too.  And that’s come a long way.  We’re doing very well in that also.  A lot of things are happening on that.  But I’m watching soldiers being killed — Ukrainian and Russian soldiers being killed.  My number one thing is to get that stopped. \n\nMy number two thing is I don’t want to have to pay any more money, because we’ve — Biden has spent $350 billion without any chance of getting it back.  Now we’re going to be getting all of that money back, plus a lot more.  And we provided a great thing.  I mean, we’ve provided something very important, and we’ll be working with Ukraine and — because we’ll be taking that — we’re going to be taking what we’re entitled to take. \n\nNow, they spent $350 billion, and Europe spent $100 billion.  Now, does anybody really think that’s fair?  But then we find out, a little while ago — not so long ago, a few months ago, I found out that the money they spent, they get back, but the money we spent, we don’t get back.  I said, “Well, we’re going to get it back.” \n\nAnd we’ll be able to make a deal.  And again, President Zelenskyy is coming to sign the deal.  And it’s a great thing.  It’s a great deal for Ukraine, too, because they get us over there, and we’re going to be working over there.  We’ll be on the land.  And, you know, in that way, it’s — there’s sort of automatic security, because nobody’s going to be messing around with our people when we’re there.  And so, we’ll be there in that way. \n\nBut Europe will be watching it very closely.  I know that UK has said and France has said that they want to put — they volunteered to put so-called peacekeepers on the site.  And I think that’s a good thing.\n\n(Cross-talk.)\n\nQ    Mr. President, you had mentioned the high cost of eggs, and we’ve seen consumer confidence this week have a sharp drop from last month — the biggest dip in, I believe, three years.  Why is that — your assessment, why is that the case and is there anything you can do? \n\nTHE PRESIDENT:  Well, I think that consumer confidence — if you look at confidence in the nation, it had the biggest increase in the history of the chart.  It went up 42 points in a period of, like, days after the election, since the election.  So, since the election, the confidence in our nation — including right track, wrong track — the first time it’s ever happened, where we were on the right track, because this country has been on the wrong track for a long time. \n\nSo, the confidence in business, confidence in the country has reached an all-time high.  We have never reached levels like we are right now.\n\nOkay.\n\n(Cross-talk.)\n\nQ    Mr. President, you said — Mr. President, you’ve been very clear in saying that as long as you’re president, Iran will never get a nuclear weapon. \n\nTHE PRESIDENT:  That’s true. \n\nQ    Is it also your policy that as long as you’re president, China will never take Taiwan by force?\n\nTHE PRESIDENT:  I never comment on that.  I don’t comment on any — because I don’t want to ever put myself in that position.  And if I said it, I certainly wouldn’t be saying it to you.  I’d be saying it to other people, maybe people around this table — (laughter) — and very specific people around this table.  \n\nQ    Is it a concern (inaudible)?\n\nTHE PRESIDENT:  So, I don’t want to put myself in that position.  But I can tell you what, I have a great relationship with President Xi.  I’ve had a great relationship with him.  We want them to come in and invest. \n\nI see so many things saying that we don’t want China in this country.  That’s not right.  We want them to invest in the United States.  That’s good.  That’s a lot of money coming in.  And we’ll invest in China.  We’ll do things with China. \n\nThe relationship we’ll have with China would be a very good one.  I see all of these phony reports that we don’t want their money; we don’t want anything to do with them.  That’s wrong. \n\nWe’re going to have a good relationship with China, but they won’t be able to take advantage of us.  What they did to Biden was — he didn’t know what was happening.  He didn’t know what he was doing.  The administration didn’t know what they were doing.  It was very sad to watch.      But we’re going to have a good relationship with China and Russia and Ukraine and the Middle East.  We’re doing things that —\n\nLook, when I left, we had no wars.  We had defeated ISIS totally.  We had no inflation.  We didn’t have the Afghanistan withdrawal — the worst withdrawal anybody has ever seen.  I think that’s one of the reasons that President Putin looked at that.  He said, “Wow, these guys are a paper tiger.  Look at” — we’re no paper tiger. \n\nDon’t forget: We got rid of ISIS in three weeks.  People said it would take five years.  We did it, because when I came in, I let them do what they had to do.  And the man that headed that operation is now going to be your — your chairman, right?\n\nSECRETARY HEGSETH:  Yes, sir.\n\nTHE PRESIDENT:  Chairman of the Joint Chiefs. \n\nSECRETARY HEGSETH:  Yes, sir.\n\nTHE PRESIDENT:  And — “Razin” Caine.  I liked him right from the beginning.  As soon as I heard his name, I said, “That’s my guy.” \n\nOkay.  Any other questions?\n\n(Cross-talk.)\n\nQ    Mr. President, has there been enough de- — decreases in crossings at the border for you to continue the pause on tariffs against Mexico and Canada?  And, if not —\n\nTHE PRESIDENT:  No, no.  I’m going to — I’m not stopping the tariffs, no.  Millions of people have died because of the fentanyl that comes over the border. \n\nQ    Even with the 90 percent drop in border crossings, though, this —\n\nTHE PRESIDENT:  Well, that’s — well —\n\nQ    — last month compared to about a year ago?\n\nTHE PRESIDENT:  Yeah, they’ve been good, but that’s also due to us.  Mostly due to us.  I mean —\n\nQ    Mr. President —     Q    Mr. President, on CBS — \n\nTHE PRESIDENT:  — it’s very hard.  It’s, right now, very hard to come through the border.  But the — look, the damage has been done.  We’ve lost millions of people due to fentanyl.  It comes mostly from China, but it comes through Mexico, and it comes through Canada. \n\nQ    Mr. Presi- —\n\nTHE PRESIDENT:  And I have to tell you that, you know, on April 2nd — I was going to do it on April 1st, but I’m a little bit superstitious, so I made it April 2nd — the tariffs go on, not all of them but a lot of them.  And I think you’re going to see something that’s going to be amazing. \n\nWe’ve been taken advantage of as a country for a long period of time.  We’ve been — we’ve been tariffed, but we didn’t tariff.  Now, I did.  When I was here, I tariffed.  We took in $700 billion from China — $700 billion.  Not one president in this — in the history of our country took in 10 cents from China.  At the same time, China respected us. \n\nNow, when COVID came in, that was a different deal.  I used to call it the China virus.  I guess I can call it the China virus again, but, you know, it was — it’s an accurate term, but I won’t do that out of respect to China.  Okay?\n\n(Cross-talk.)\n\nSay it again.  What?\n\nQ    On Gaza.  I just wondered if there’s any progress towards the second phase of the ceasefire that you can tell us about.\n\nTHE PRESIDENT:  Well, I’m very disappointed when I see four — four bodies came in today.  These are young people.  Young people don’t die.  Okay?  Young people don’t die.  These are young people.  Four bodies came in today.  They think they’re doing us a favor by sending us bodies. \n\nSo, look, that’s a decision that has to be made by Israel, by Bibi, but Israel has to make that decision.  We got a lot of hostages back, but it’s very sad what happened to those people.  I mean, you had a young lady with her hand practically blown off.  You know why it blew up?  Because she put up her hand to try and stop a bullet that was coming her way, and it hit her hand and blew off her fingers, big part of her hand. \n\nThis is a vicious group of people, and Israel is going to have to decide what they’re doing.  Phase one is going to be ending.  Think of it: Today, they sent in four bodies.  Bodies. \n\nAnd I will say one thing, though.  I’ve spoken to a lot of the parents and a lot of the people involved.  They want those bodies almost as much and maybe even just as much as they wanted their son or their daughter.  Amazing.  “Please, sir.  Please.  My son is dead, but they have his body.  Please can you get it for us?”  They — it’s the biggest thing.  It’s incredible the level — they want the bodies of these people.  They’re dead.  They’re dead. \n\nAnd, you know, when I saw the ones that came in two weeks ago, they looked like they just got out of a concentration camp.  Then, the following week, a group came in, and they weren’t as bad — in as bad of shape.\n\nBut Israel is going to have to make a decision.  You’re right, phase one, and now phase two has started.  And today, we got some, you know, very, very sad — we knew they were dead, by the way.  We knew they were going to be bodies, as opposed to people that were living.  But it’s a very sad situation. \n\nAt some point, somebody is going to say we got to do something about this.\n\n(Cross-talk.)\n\nQ    Mr. President, you were just talking about Afghanistan and the botched withdrawal.  Have all the generals or command staff that were involved with the withdrawal been fired or relieved of duty?\n\nTHE PRESIDENT:  Well, that’s a great idea.  It’s — (laughter) — sorry, I’m not going to tell this man what to do, but I will say that.  If I had his place, I’d fire every single one of them, Pete.  Pete, that’s a very good question. \n\nSECRETARY HEGSETH:  Well, it’s a question we’ve thought a lot about.  We’re doing a complete review of every single aspect of what happened with the botched withdrawal of Afghanistan and plan to have full accountability.  It’s one of the first things we announced at the Defense Department for that reason, sir. \n\nCertainly General “Razin” Caine, who’s on his way in, was not a part of that.  Instead, was a part of leading the effort against ISIS by untying the hands of war fighters and finishing the job properly and then bringing our troops home. \n\nSo, we’re taking a very different view, obviously, than the previous administration, and there will be full accountability. \n\nTHE PRESIDENT:  I don’t see big promotions in that group.  (Laughter.)  And I think they’re going to be largely gone.  I know the man on my left.  I think they’re going to be largely gone. \n\nThat was a horrible display.  And, you know, I’ve dealt with the parents and the family of the 13 that were killed.  But, you know, nobody ever talks about the 40 that were so badly hurt, with the arms and the legs and the face and the whole thing — the missing arms and legs.  It was so terrible, the way that was handled.\n\nAnd it should have been gone through Bagram.  We have a big base with big fences that nobody can get in, and you have, you know, hundreds of acres, instead of a little local airport where the whole place went crazy.  That was so badly handled.  And I would think that most of those people are going to be gone. \n\nQ    Are we going to take Bagram back?\n\nTHE PRESIDENT:  So, I’ll tell you what has bothered me very much — very, very much: We give billions of dollars to Afghanistan.  Nobody knows that.  Nobody knew that.  Do you know we give billions of dollars to Afghanistan?  And yet we left behind all of that equipment, which wouldn’t have happened. \n\nYou know, we were getting out under me.  I’m the one that got it down to 5,000 people.  We were going to get out, but we were going to keep Bagram, not because of Afghanistan but because of China, because it’s exactly one hour away from where China makes its nuclear missiles. \n\nSo, we were going to keep Bagram.  We were going to keep a small force on Bagram.  We were going to have Bagram Air Base, one of the biggest air bases in the world.  One of the biggest runways, one of the most powerful runways, in the sense that it was very heavy concrete and steel.  You could carry about anything.  You could land anything on those runways. \n\nWe gave it up.  And you know who’s occupying it right now?  China.  China.  Biden gave it up.  So, we’re going to keep that, and we’re going to have a withdrawal, and we’re going to take our equipment.  We’re going to do it properly.  We’re going to do it very — we’re going to keep the equipment.      Well, they ran out.  It was — what happened there was a — in fact, you know, in all fairness to Putin, when he saw that, he said, “Well, this is our time to go and go into Ukraine,” I guess, because it was — the timing seemed to be about right.      But we send them billions of dollars in aid, which nobody knows.  If they — if the American public knew that — they know it now.  And if we’re doing that, I think they should give our equipment back.  And I told Pete to study that. \n\nBut we left billions — tens of billions of dollars’ worth of equipment behind.  Brand-new trucks.  You see them display it every year on their little roadway someplace where they have a road and they drive the — you know, waving the flag and talking about America.  Beautiful equipment that’s all — I mean, the top-of-the-line stuff, brand-new stuff.  Now it’s getting older.      But you know what?  We’re going to pay them.  I think we should get a lot of that equipment back.      You know that Afghanistan is one of the biggest sellers of military equipment in the world.  You know why?  They’re selling the equipment that we left.  We’re first.  They were second or third.  Can you believe it?  They’re selling 777,000\n\nrifles, 70,000 armor-plated — many of them were armor-plated trucks and vehicles — 70,000.      If you think of a used car lot, the biggest one in the country, you have — I would say, JD, if somebody had 500 cars, that would be a lot. \n\nTHE VICE PRESIDENT:  Yeah, that would be quite a lot.\n\nTHE PRESIDENT:  This is 70,000 vehicles we had there, and we left it for them.  I think we should get it back.     (Cross-talk.)     Q    Mr. President, the spending bill that passed last night aims to cut $2 trillion.     THE PRESIDENT:  Right.     Q    Can you guarantee that Medicare, Medicaid, Social Security will not be touched?     THE PRESIDENT:  Yeah.  I mean, I have said it so many times, you shouldn’t be asking me that question.  Okay?  This will not be “read my lips.”  It won’t be “read my lips” anymore: We’re not going to touch it.     Now, we are going to look for fraud.  I’m sure you’re okay with that, like people that shouldn’t be on, people that are illegal aliens and others — criminals, in many cases.  And that’s with Social Security.  We have a lot of people — you see that immediately.  When you see people that are 200 years old that are being sent checks for Social Security — some of them are actually being sent checks. \n\nSo, we’re tracing that down, and I have a feeling that Pam is going to do a very good job with that.  But you have a lot of fraud.      But, no, I’m not — we’re not doing anything on that.     Q    Mr. President, part of your mission, sir —     Q    Mr. President — Mr. President, on CBS News.  Mr. President, you’re in litigation —     Q    Part of your mission has been — thank you.  I’m sorry.      Part of your mission has been to restore executive control over the executive branch.  Is it your view of your authority that you have the power to call up any one of or all of the people seated at this table and issue orders that they’re bound to follow?     THE PRESIDENT:  Oh, yeah.  They’ll follow the orders.  Yes, they will.      Q    No exceptions?      THE PRESIDENT:  No except- — well, let’s see.  Let me think.  Oh, yeah.  Yeah.  She’ll have an exception.  (The president points at Secretary Rollins.)  (Laughter.)     Of course, no exceptions.  You know that.     Q    Mr. President, can you clarify the Canada/Mexico tariffs.  You had put that 30-day pause. \n\nTHE PRESIDENT:  Yeah.\n\nQ    You just referred to —     THE PRESIDENT:  It’s 25 percent.     Q    Twenty-five percent.  When does it go into effect?     THE PRESIDENT:  April 2nd.      Q    April 2nd for Canada and Mexico?     THE PRESIDENT:  Correct.  And for —     Q    And for the reciprocal?     THE PRESIDENT:  — and for everything.      SECRETARY LUTNICK:  Well, we have the — the — fentanyl-related is a pause.  If they can prove to the president they’ve done an excellent job, that’s what they first do in 30 days.     Q    Have you guys seen any changes?     SECRETARY LUTNICK:  But then the overall is April 2nd.  So, the big transaction is April 2nd, but the fentanyl-related things, if they’re working hard on the border, at the end of that 30 days, they have to prove to the president that they’ve satisfied him to that regard.  If they have —     THE PRESIDENT:  It’s going to be hard to satisfy.     SECRETARY LUTNICK:  — then we’ll give them a pause or he won’t.      THE PRESIDENT:  It’s going to be hard to satisfy.     SECRETARY LUTNICK:  But that’s up to him to see.     THE PRESIDENT:  We lose 300,000 people a year to fentanyl.  Not 100-, not 95-, not 60-, like you read.  You know, you’ve been reading it for years.      We lost, in my opinion, over the last couple of years, on average, maybe close to 300,000 people dead, and the families are ruined.  You know, when they lose a daughter, when they lose a son, the families are never the same.  You’re never going to be the same.  So, you’re talking about a million people.      But when the daughters die, I see it — daughters die and the sons die because of fentanyl.  And in some cases, they don’t even know they’re taking it.  They — they’re buying something else, and it’s laced with fentanyl, and they end up dying.  And I’ve known many people who have lost children to fentanyl and for other reasons, but to fentanyl.  It’s such a big killer.  And those people are never the same people.      I mean, I’ve seen people that — for the rest of their lives, they’re not the same people.  They’re so different, it’s not even believable.  Dynamic people, happy people that are — they die a miserable death.  And that’s because of the crap that comes in through China and through Mexico and through Canada.  A lot of it comes through Canada.      The — Canada — look, we support Canada $200 billion a year in subsidies one way or the other.  We let them make millions of cars.  We let them send us lumber.  We don’t need their lumber.  We’re going to free up our lumber.  Lee is going to do — the head of environmental.  We’re going to free up our lumber.  We have the best lumber there is.  We don’t need their lumber.  What do we need their lumber for?\n\n     When you look at the — we subsidize them $200 billion a year.  Without us, Canada can’t make it.  You know, Canada relies on us 95 percent.  We rely on them 4 percent.  Big difference.  And I say Canada should be our 51st state.  There’s no tariffs, no nothing.      And — and I say that, we give them military protection.  They have a very small military.  They spend very little money on military.  Or NATO, they’re just about last in terms of payment, because they say, “Why should we spend on military?”  That’s a tremendous cost.  Most nations can’t afford to even think about it.  “Why should we spend on military?  The United States protects us.”      And I would say that’s largely true.  We protect Canada.  But it’s not fair.  It’s not fair that they’re not paying their way.  And if they had to pay their way, they couldn’t exist.      When I spoke to — let’s call it the prime minister, rather than the governor.  (Laughter.)  But when I spoke to him, I said, “Why are we giving you $200 billion a year?”  He was unable to answer the question.  I said, “Why are we letting you make millions of cars and send them in?”  He was unable to answer the question — Justin Trudeau, a nice guy.  I think he’s a very good guy.  I call him Governor Trudeau.      He should be governor, because the fact is that if we don’t give them cars — we don’t have to give them cars.  The c- — tariffs will make it impossible for them to sell cars into the United States.  The tariffs will make it impossible to — for them to sell lumber or anything else into the United States. \n\nAnd all I’m asking to do is break even or lose a little bit, but not lose $200 million.  And we love Canada.  I love Canada.  I love the people of Canada.  And — but, honestly, it’s not fair for us to be supporting Canada.  And if we don’t support them, they don’t subsist as a — as a nation. \n\nOkay.\n\nQ    Mr. President, when you were talking to Elon —\n\nQ    Mr. President, on the EU tariffs.  Mr. President, have you made a decision on what level you will seek on tariffs on the European Union?\n\nTHE PRESIDENT:  We have made a decision, and we’ll be announcing it very soon.  And it’ll be 25 percent, generally speaking, and that’ll be on cars and all other things. \n\nAnd European Union is a different case than Canada — different kind of case.  They’ve really taken advantage of us in a different way.  They don’t accept our cars.  They don’t accept, essentially, our farm products.  They use all sorts of reasons why not.  And we accept everything of them, and we have about a $300 billion deficit with the European Union. \n\nNow, I love the countries of Europe.  I guess I’m from there at some point, a long time ago, right?  (Laughter.)  But indirectly — well, pretty directly, too, I guess.  But I love the countries of Europe.  I — I love all countries, frankly.  All different.\n\nBut European Union has been — it was formed in order to screw the United States.  I mean, look, let’s be honest.  The European Union was formed in order to screw the United States.  That’s the purpose of it, and they’ve done a good job of it, but now I’m president.\n\nQ    What will happen if these countries or the EU retaliate?\n\nTHE PRESIDENT:  They can’t.  I mean, they can try, but they can’t. \n\nQ    China did.  They imposed tariffs —\n\nQ    They are pledging to, sir.\n\nQ    — that are — went into effect, China’s retaliatory tariffs —\n\nTHE PRESIDENT:  That’s right.  That’s right.  But —\n\nQ    — on the — the 10th of February.  Has there been any —\n\nTHE PRESIDENT:  That’s right.\n\nQ    — impact that you’ve been able to observe?\n\nTHE PRESIDENT:  That’s right.  No, they can do it, and they can try, but the numbers can never equal what ours, because we can go off.  We are the pot of gold.  We’re the one that everybody wants.  And they can retaliate, but it cannot be a successful retaliation, because we just go cold turkey.  We don’t buy anymore.  And if that happens, we win. \n\nQ    Are you talking to Erik Prince about privatat- —\n\nTHE PRESIDENT:  No.\n\nQ    — privatizing deportations?\n\nTHE PRESIDENT:  No, I haven’t.  I haven’t.\n\nQ    Mr. President, you’re in litigation with CBS News.  Is this a case that you’d like to see go to trial, or are you open a settelm- —\n\nTHE PRESIDENT:  With who?\n\nQ    CBS, the — “60 Minutes.”\n\nTHE PRESIDENT:  CBS?\n\nQ    Yes.\n\nTHE PRESIDENT:  Well, CBS did something that was amazing.  Kamala was unable to answer a question properly, and they took the question that they asked, and they inserted an answer.  They gave her an answer.  This was two days before the election, right before — the Sunday night before the election.  And they wrote out a — they put her words from another question that was asked about a half an hour later, and they put that into the question. \n\nNobody’s ever even heard of it before.  Nobody’s ever heard of anything like this before.  But they then did it, they say, on numerous occasions.  And the FCC is looking at it very strongly, and everybody’s looking at it, and I’m — but nobody’s ever seen anything. \n\nThink of it.  They took her answers, and they changed them.  And I don’t mean they changed a word or two, or they cut off a half a sentence, or they cut off a couple of words.  I mean, I’ve had that happen too.  But that, you — you just say — you know, then they say, “Well, we want brevity.  You know, we wanted to do it for time.” \n\nQ    Would — would you encourage —\n\nTHE PRESIDENT:  They took out her answer, and they inserted an entirely different answer that made her sound competent.  And they did this, and nobody’s ever — I thought I’ve heard of everything when it comes to that stuff.  No — I’ve never heard of it.  Nobody has ever seen.  So, we sued, and we are in discussions of settlement. \n\nQ    What would a number be?  Like a hu- — what — what’s a number that you would think would be appropriate?\n\nTHE PRESIDENT:  I think it’s a lot.  (Laughter.) \n\nQ    What’s the timeline and process —\n\nTHE PRESIDENT:  No, I mean, it — look, it could have — it probably did affect the election.  I mean, we won by a lot.  As I said, “Too big to rig.”  But it probably did affect the election.  Yeah, probably could have won by more, but I could have lost the election because of that. \n\nIt’s — we have to get to honest elections.  We have to go back to paper ballots.  We have to go back to voter ID.  One-day election, ideally, or short term, not these 48-day and 61-day elections where boxes are put in a room, and, “Oh, let’s move the boxes, because we’re putting in a new air conditioning system.”  Then you see the boxes move, and then you say, “Well, where are all the boxes?”  You know, —\n\nQ    But would you —\n\nTHE PRESIDENT:  “What happened to the boxes that never came back?” \n\nNo, our elections are extremely dishonest.  We’re the only country in the world that has mail-in voting and all of these different things that we put in.  Nobody — no other country in the world has it. \n\nYou know, France went to — they had some of the things that we had, and they went to same-day voting, all paper.  And, you know, paper is very sophisticated now.  It’s a very sophisticated — it’s a very sophisticated form of voting right now.  It’s a very safe form of voting. \n\nYou know, the other thing is for the governors.  I wish the governors would do it, because the paper ballots will cost 9 percent of the machines, and they’re 100 percent.  You know, they’re — I don’t — nothing’s foolproof, but they’re as close as you get.  So, we’ll see what happens. \n\nBut on the “60 Minute” thing, nobody’s ever seen anything like it. \n\nQ    And would you link the FCC action to the litigation?  I mean, does it make se- —\n\nTHE PRESIDENT:  I don’t think it’s linked, but probably the lawyers look at it, you know, because I know it’s going along.  FCC is headed by a very competent person, and you have some very competent people on the board, and so I think they’re looking at it very seriously. \n\nYeah.\n\nQ    Mr. President —\n\nQ    Sir, of all the deals that you’ve done in your life, all the people you’ve sat across from and negotiated with, is President Putin distinct in any way?\n\nTHE PRESIDENT:  He’s a very smart guy.  He’s a very cunning person.  But I’ve dealt with some people that — I’ve dealt with some really bad people.  But I will tell you, as far as this is concerned, we’ve — you have to understand, he was — he had no intention, in my opinion, of settling this war.  I think he wanted the whole thing. \n\nWhen I got elected, we spoke, and I think we’re going to have a deal.  I can’t guarantee you that.  You know, a deal is a deal.  Lots of crazy things happen in deals, right?  But I think we’re going to have a deal. \n\nIf I didn’t get elected, I believe he would have just continued to go through Ukraine, and over a period of time, a lot of people — a lot of people would have been killed.  It would have lasted for a period of time. \n\nAnd the reason that Ukraine — and I give — I have great respect for the Ukraine as fighters.  They have great fighters.  But without our equipment, that war would have been over, like people said, in a very short period of time. \n\nQ    Is there a timeline (inaudible) — \n\nTHE PRESIDENT:  And if you remember, I gave the Javelins, and the Javelins are the things that knocked out those tanks right at the beginning of the war.  They said that — that Obama, at the time, gave sheets, and Trump gave Javelins.  Well, I was the one that did that.  But I want to see it come to an end. \n\nQ    Will he have to make concessions — President Putin?\n\nTHE PRESIDENT:  Yeah, he will.  He will.  He’s going to have to.  And —\n\nQ    Can you preview that?\n\nTHE PRESIDENT:  And I think — I believe that, because we got elected, that war will come to an end.  And I also believe, if we didn’t get elected, if this administration didn’t win the election by a lot, that that war would go on for a long time, and he would want to take the whole thing. \n\nQ    What concessions?  What concessions?\n\nQ    On the — on the —\n\nTHE PRESIDENT:  The big question I had is: Does he want to take the whole thing?  But the reason — and — and the Ukrainians are good fighters, I have to say, but without the equipment — without our equipment — we have the best equipment in the world.  We have the best military equipment in the world.  Without our equipment, that would have been over very quickly. \n\nQ    What concessions would you like to see? \n\nQ    On the (inaudible), sir?  On — on the —\n\nQ    What concessions would you like to see?\n\nTHE PRESIDENT:  Oh, I don’t want to tell right now.  But I can tell you that NATO, you can forget about.  That’s been — I think that’s probably the reason the whole thing started.  And I think, JD, we can say that. \n\nWhat — do you have a statement on that?  You’ve been very much involved. \n\nTHE VICE PRESIDENT:  (Laughs.)\n\nTHE PRESIDENT:  I gave him the beauty.\n\nTHE VICE PRESIDENT:  Great.  You gave me the — the hardest question, sir. \n\nQ    Concessions from Russia.\n\nTHE VICE PRESIDENT:  I mean, look, as the president said, we’re not going to do the negotiation in public with the American media.  He’s going to do it in private with the president of — of Russia, with the president of Ukraine, and with other leaders.  And I think that’s how this has to go. \n\nI think the — I just want to push back against some of the criticism I’ve seen in the administration on this, because every single time the president engages in diplomacy, you guys preemptively accuse him of conceding to Russia.  He hasn’t conceded anything to anyone.  He’s doing the job of a diplomat, and he is, of course, the diplomat in chief as the president of the United States. \n\nQ    On the gold cards, sir.  Can you talk a little bit more about the vetting process, you know —\n\nTHE PRESIDENT:  They’ll go through a process.  The process is being worked out right now, and we’re going to be — we’re going to be very careful. \n\nQ    And will there be restrictions on, for instance, can Chinese nationals get one? \n\nTHE PRESIDENT:  No, we’re not going to restrict. \n\nQ    Can Iranian nationals get —\n\nTHE PRESIDENT:  We’re probably not going to be restricting too much in — in terms of countries, but maybe in terms of individuals.  We want to make sure we have people that love our country and are capable of loving the country.\n\nQ    Is there a process, sir —\n\nQ    Mr. President, there is a measles outbreak in Texas at the moment in which a child is reported to have died.  Do you have concerns about that?  And have you asked Secretary Kennedy to look into that outbreak? \n\nTHE PRESIDENT:  Well, why don’t we — Bobby, do you want to speak on that, please?\n\nSECRETARY KENNEDY:  We are following the measles epidemic every day.  I think there’s 124 people who have contracted measles at this point, mainly in Gaines County, Texas; mainly, we’re told, in the Mennonite community. \n\nThere are two people who have died, but the — we’re watching it.  And there — there are about 20 people hospitalized, mainly for quarantine. \n\nWe’re watching it.  We put out a post on it yesterday, and we’re going to continue to follow it. \n\nQ    Mr. President —\n\nSECRETARY KENNEDY:  Inci- — incidentally, there have been four measles outbreaks this year in this country.  Last year, there were 16.  So, it’s not unusual.  We have measles outbreaks every year. \n\nQ    You sound a little under the weather yourself right now.  Are you all right?\n\nSECRETARY KENNEDY:  I just — I have a permanently bad throat. \n\nQ    (Inaudible) coughing.\n\nQ    Mr. President, would you — would you send U.S. peacekeepers to just — to support the — the European peacekeepers?  Would you do any sort of U.S. —\n\nTHE PRESIDENT:  No, we’re going to support Europe, yeah. \n\nQ    And how would we do that?  How would the United States do that?\n\nTHE PRESIDENT:  We’re very friendly with Europe.  We have a great relationship with Europe.  I mean, you could ask — you could talk about France.  You could talk about any of them.  Yeah, we have a great relationship with Europe. \n\nQ    But how will we — how will the United States do that?  Would there be boots on —\n\nTHE PRESIDENT:  Well, how?  I mean, you’re asking me a question: What are we doing in the — let’s worry — I hope we have that problem, where we can worry about peacekeeping.  We got to get there first.\n\n(Secretary Lutnick knocks on the table.)\n\nBut I hope we have the problem of worrying about peacekeeping.  That’ll be the easiest problem, I think, JD, that we’ve ever had.  (Laughter.)\n\nTHE VICE PRESIDENT:  I think so, sir.\n\nQ    That would be part of the deal, presumably, that the Ukrainians —\n\nTHE PRESIDENT:  We’ll — we’re —\n\nQ    — would want —\n\nTHE PRESIDENT:  We’ll do it at the time, but we’ll — peacekeeping is very easy.  It’s making the deal that’s very tough. \n\nAnd, again, nobody was speaking to Russia at all.  And, you know, probably a million and a half soldiers have been killed — close to a million and a half soldiers, not to mention a treme- — I will tell you, the — the thing with that horrible war that should have never started — it would have never started if I were president, and it didn’t start for four years, and it was not even thought about starting.  But the thing with that war is that you’re highly underestimating the number of people that have been killed.  Far more people have been killed in that war than you talk about.  You know, you like to talk about numbers, like, a million people.  Well, they had much more than a million soldiers killed.\n\nBut you have a lot of cities that have been knocked to the ground.  They’re demolition sites.  Literally, demolition sites.  Every single building is knocked to the ground, and a lot of people were killed in those buildings.  And you’ll hear a report, “Two people were minorly injured” or “just injured a little bit.”  No.  No.  People were killed by the thousands.\n\nAnd there are a lot more people killed in that war than the media wants to talk about, because Biden did a horrible, horrible job.  He should have prevented that war.  He could have prevented that war. \n\nPutin would have never gone in.  I’ll tell you one thing: He would have never gone in.  That war would never have taken place if I were president. \n\nQ    I think what people are trying to understand, Mr. President —\n\nQ    Mr. President —\n\nQ    — is how would the United States — what would you be willing to do to support this European peacekeeping effort?  Would there be —\n\nTHE PRESIDENT:  Again, you’re asking me the same question?  (Laughter.)\n\nQ    I’m just trying —\n\nTHE PRESIDENT:  How many times do you have to answer it?  You’re talking about after we make peace.  Let me make peace first. \n\nOnce we make peace, I’ll give you all the answers you want.  But how many times can you ask the same question?\n\nQ    Mr. President, on the Middle East.  Did you receive —\n\nQ    Is loosening the sanctions on —\n\nTHE PRESIDENT:  Yeah, go ahead.  Behind.\n\nQ    Is loosening the sanctions on Russia a potential option as part of an overall deal?\n\nTHE PRESIDENT:  Not now, no.  No.  We have sanctions on Russia.  No, I want to see if we make a deal first.  But I think we will.  I’ve had very —\n\nQ    But is it a bargaining chip, I’m asking.\n\nTHE PRESIDENT:  I’ve had very good conversations with President Putin.  I’ve had very good conversations with President Zelenskyy.  And until four weeks ago, nobody had conversations with anybody.  It wasn’t even a consideration.  Nobody thought you could make peace.  I think you can. \n\nQ    Mr. President, just —\n\nQ    But if Mr. Putin gets to keep his —\n\nQ    — just to bring this —\n\nQ    — the land that was claimed by force, if the Russians get to keep the territory that they — they claimed by force, doesn’t that send a dangerous message, let’s say, to China about Taiwan?\n\nTHE PRESIDENT:  Oh, okay.  You try and take it away, right?  We’re going to do the best we can.  (Laughter.)  We’re going to do the best we can to make the best deal we can for both sides.  But for Ukraine, we’re going to try very hard to make a good deal so that they can get as much back as possible.  We want to get as much back as possible. \n\nQ    Mr. President, just to bring this full —\n\nTHE PRESIDENT:  And we’ll — we’ll cut it out after maybe this question.  Go ahead.\n\nQ    To bring this full circle, back to —\n\nTHE PRESIDENT:  Unless it’s a bad question, and then we’ll (inaudible).  (Laughter.)\n\nQ    And back to —\n\nTHE PRESIDENT:  You always like to finish on a good one.\n\nTHE VICE PRESIDENT:  But, sir, they want you to negotiate with them instead of President Putin.\n\nTHE PRESIDENT:  I know.  I know.\n\nQ    Back to the question about the —\n\nTHE PRESIDENT:  They want to continue to talk about the peacekeepers.  (Laughter.)  They’re — you have a lot of confidence in us, because you assume there’s going to be peace.  You know, it’s possible it doesn’t work out.  There is possibility. \n\n     Q    And I had —\n\n     THE PRESIDENT:  But I hope it does, for the sake of humanity, because if you look at the pictures that I’ve looked at, you don’t want to look at them.      Go ahead.\n\n     Q    I had a question back on these cuts to the federal workforce.  You mentioned you — you’re interested in doing another round of this email.  When would you like to\n\nsee that?  What would be the deadline?  And —     THE PRESIDENT:  I — I’m not — I think —     Q    — this time, would it be mandatory?     THE PRESIDENT:  I think Elon — I think Elon wants to.  And I think it’s a good idea because, you know, those people, as I said before, they’re on the bubble.  You got a lot of people that have not responded, so we’re trying to figure out, do they exist?  Who are they?  And it’s possible that a lot of those people will be actually fired. \n\n     Q    And —\n\n     THE PRESIDENT:  And if that happened, that’s okay, because that’s what we’re trying to do.      This country has gotten bloated and fat and disgusting and incompetently run. \n\n     I think we had the worst president in the history of our country.  He just left office.  I think he’s a disgrace.  What he’s done to our country by allowing millions of people to come into our country like that and all of the other things — the inflation, which he caused because of energy and stupid spending.  To spend hundreds of millions, trillions and trillions of dollars on the Green New Scam — a total scam.  I have the best energy people, the best environmental people in the world around this table, and they — they can’t even believe he got away with it. \n\n     And then, in leaving office, to send $20 billion here and $20 million there and $10 million and $5 million, and they couldn’t spend the money fast enough, and “Let’s get it out before Trump gets in.  Let’s just get it out to anybody.”  This is a disgrace to our nation.\n\n     And you don’t write the fair thing.  But, look, you know the good news?  The people see it, and that’s why we won the election by so much.      Thank you very much, everybody.  I appreciate it.  Thank you.  Thank you.   \n\n     Q    Thank you, Mr. President.\n\n     THE PRESIDENT:  Thank you very much, Doug.  Pulitzer Prize.\n\n     THE VICE PRESIDENT:  Sir, how many peacekeepers are you going to send to — (laughter) —\n\n     THE PRESIDENT:  “What will you do?”  “How will it be?”  (Laughter.)\n\n     SECRETARY LUTNICK:  “How will you address this?”                                END            12:47 P.M. EST\n",
  "summary": "On February 26, 2025, President Trump addressed his Cabinet in the White House about various policies and initiatives undertaken by his administration. The President highlighted the visit of President Zelenskyy from Ukraine to sign an important agreement concerning rare earth materials. He also commended the Cabinet members on significant achievements, including a reduction in illegal border crossings and efforts to balance the federal budget by reducing government waste and inefficiencies through the Department of Government Efficiency (DOGE). Elon Musk, involved with the DOGE, discussed progress in identifying government inefficiencies and fraudulent activities.\n\nThe President's remarks also touched upon various other key policy areas, such as handling international relations with Russia and Ukraine, which included negotiating peace agreements. He criticized the previous administration for certain policies and aimed to regain the financial expenditures made by the US in global conflicts. Immigration policy was revisited with a focus on introducing a new 'gold card' system aimed at facilitating the entry of high-skilled immigrants and reducing national debt. Additionally, Trump addressed tariffs on Canada, emphasizing economic imbalances and the protection of national interests.\n\nTrump's administration plans to intensify efforts across multiple domains such as improving energy policies, restoring executive controls, and putting strategic international measures in place. The administration's approach towards Israel's conflicts and the situation with Afghanistan and its military equipment were also mentioned. Overall, the Cabinet meeting underscored a comprehensive review of domestic and foreign policies aimed at what Trump described as reclaiming America's strength and fiscal responsibility.",
  "eli5": "President Trump is making plans to do things like fix how money is spent by the government, talk to other countries to stop fights, and figure out how to allow smart people from other countries to work here. He also wants to use less money for unnecessary things, like how your mom and dad might cut back on snacks to save money.",
  "keywords": [
    "Trump",
    "Cabinet Meeting",
    "Ukraine",
    "Russia",
    "DOGE",
    "Elon Musk",
    "Gold Card",
    "Tariffs",
    "International Relations",
    "Immigration"
  ],
  "issues": [
    "Lack of detailed outcomes from the peace negotiations with Russia and Ukraine.",
    "Potential ethical and legal concerns about firing government employees based on email responses.",
    "The implementation and oversight of the 'Gold Card' immigration proposal.",
    "The accuracy of claims regarding economic and immigration reforms."
  ],
  "citations": [],
  "document_type": "Press Release"
}