{
  "title": "Remarks by President Trump During Hurricane Helene Briefing – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump During Hurricane Helene Briefing – The White House",
  "og:description": "For Immediate Release                           January 24, 2025 REMARKS BY PRESIDENT TRUMPDURING HURRICANE HELENE BRIEFING Airport Fire and Rescue",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-during-hurricane-helene-briefing/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-24T21:28:39+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tRemarks by President Trump During Hurricane Helene Briefing\t\t\t\t\n\nJanuary 24, 2025\n\nFor Immediate Release                                                                                         January 24, 2025\n\nREMARKS BY PRESIDENT TRUMPDURING HURRICANE HELENE BRIEFINGAirport Fire and Rescue FacilityFletcher, North Carolina\n\n  11:34 A.M. EST     THE PRESIDENT:  Well, thank you very much.  It’s a little cold outside, but you’re getting used to the cold.And one of the things that are very important to me and one of the reasons I’m happy that we won so convincingly is to help North Carolina get fixed up.  They supported us in record numbers, and I’m supporting them in record numbers too.\n\nAnd they had me set — I wanted to go to Los Angeles and see what was going on with California, why they aren’t releasing the water.  Millions and millions of gallons of water, they’re sending it out to the Pacific.  Someday, somebody’s going — going to explain that one.  In the meantime, they have no water in Los Angeles, where they had the problems.But — so, we’re going there.  But I said, “Well, what about North Carolina?”  “Well, you could do that la-” — “no, I can’t.”  I said, “We’re stopping in North Carolina first, and then we’re going to Los Angeles.”And we just appreciate the outpouring of love that we’ve had here. Lara was, as you know, very instrumental in the campaign, and she lived here and is loved, and we appreciate it. And Michael Whatley has been incredible — wherever Michael is — hello, Michael.  Michael Whatley has been great. And your congressmen have been great. And what we thought we’d do is take a quick look around.  First, we wanted to do this. I — I want to say that we’re very disappointed in FEMA.  Your new governor, it’s not his fault.  He’s brand-new to the whole situation.  But we’re going to work together with the governor.  We’re going to work together with the — your senators, but, really, we’re going to work a lot with your congressman, especially the three that are in the area, and Michael Whatley.  And I’d like to put Michael in charge of making sure everything goes well. And Franklin Graham has been unbelievable.  We’ve made a big contribution to Franklin, and we’ll continue to do so.  But I — I’ve been hearing nothing but praise for the job that Samaritan’s Purse has done with Franklin, and we appreciate it. Where is Franklin?  He’s around here someplace.  (Laughter.)  And — that good-looking guy.  He’s always been a good-looking guy. His father was a good-looking guy, too, I’ll tell you.  We loved his father, right?  I saw his father in the latter years, and I said, “Well, he — he doesn’t have long to go.”  He was having a hard time, and he lived about three, four years after that, right? REVEREND GRAHAM:  That’s right.THE PRESIDENT:  He — he was — they call — they say he was “good stock.”  He had the ultimate good stock. But I want to thank you, Franklin.  You were — you’ve been fantastic here.  And everywhere he goes, he — he’s always — he’s always the first one I see. Does — people don’t realize it, how — how good it is.  A lot of people, they go, “Well, maybe it’s for the people that he’s got.”  And you guys know, because you’re here, but the people that he’s got have done amazing work. So, I just want to thank everybody.  We’re going to get over and take a look.  We’ll say a few words.  I want to just — I do want to introduce some of the people that we have. And our first lady — we’ll start with our first lady.  She wanted to be here because of North Carolina.  And then I said, “Well, you can do that, but you’re going to have to come to California too.”  (Laughter.) THE FIRST LADY:  That’s okay.THE PRESIDENT:  And she said, “That’s okay.”  (Laughter.)And we got to fix that one up too.  That’s — who — do you ever see anything like that one?  It’s — who would have — who would have thought that could have happened. So, Governor Josh Stein, thank you very much.  We appreciate it.  And we’re going to have a — a very long and good relationship. Representatives — maybe stand up, if you would, so we — the press can see.  Representatives Chuck Edwards — Chuck, thank you.  Thank you, Chuck.  Tim Moore.  Virginia.  You know Virginia Foxx, a legend — she is such a powerful woman.  Pat Harrigan.  Pat, thank you very much. Your agriculture commissioner, who I hear is excellent, Steve Troxler — Steve, thank you very much.  Good job, Steve.  You’ve got plenty to do, right?MR. TROXLER:  (Inaudible.)THE PRESIDENT:  (Laughs.)  More than you ever thought. North Carolina Speaker Destin Hall.  Thank you, Destin.  Thanks, Destin.  Very good. House Majority Leader Brenden Jones.  Brenden, thank you very much.  We’re making progress, Brenden. State Representatives Dudley Greene, Karl Gillespie, thank you very much, fellas.  Good, good.  Thank you very much. State Senators Kevin Corbin, Warren Daniel, thank you.  Thank you very much, Kevin, Warren. And County Commissioner Jennifer Best, thank you.  Jennifer, thank you.So, Hurricane Helene was one of the worst natural disasters in American history.  It was far worse than it was even billed.  I have never seen such water damage.  It was largely water damage — wind damage, but water damage nobody has ever seen. I’ve been here, as you know, numerous times, but now I’m here in a position where we can do something, meaning I’ve been in — in office for four days.  And I wanted to come sooner, but actually, they had a little problem with getting, logistically, in here, but I would have been ev- — here even sooner.One oh four — a hundred and four North Carolinians have — at least — have lost their lives.  Is that now a fairly firm number, or are they still finding people?  You know?  Is — what do you think?  They’re still finding people?  Pretty much, okay?  It’s a lot of people. A hundred and four people lost their lives.  Seventy-three thousand homes were severely damaged or destroyed. And I’ll tell you, I’ve been to a lot of them, and this was a — this was like lots of hurricanes in one.  I’ve never seen such damage done by water.  And the — the water came, it was violent, and it left, and there was, like, nothing left.  It’s really pretty amazing. At one point, half of the emergency calls to FEMA went unanswered.  That’s real bad.  FEMA was not doing their job.  The city of Asheville went without running water for two months. A whistleblower testified that some FEMA employees refused to help people who displayed Trump signs on their properties.  I think that’s true, isn’t it?  I read that.  That’s not nice.  That’s not too nice, is it?But whoever those property people were, thank you very much. Michael, is that true?MR. WHATLEY:  (Inaudible.)THE PRESIDENT:  That’s not good — huh? — about the property owners.  You put a Trump sign on it, they wouldn’t help — FEMA. Earlier this year, FEMA kicked 2,000 North Carolinians out of their temporary housing into below-freezing temperatures.  What was that all about?  Is that — do you know about that?  What happened?  Tell me.STATE SPEAKER HALL:  We had an incompetent administration under Biden.  And we had a disaster, and then we call it “the disaster after the disaster” — that was the FEMA response.THE PRESIDENT:  You had nothing but disaster since then.  I — it doesn’t matter at this point.  Biden did a bad job. Some residents still don’t have hot water, drinking water, or anything else.  And m- — many of them don’t have quarters.  They don’t have anything.  They got a stipend for what they lost, and we’re going to take care of it. This is totally unacceptable, and I’ll be taking strong action to get North Carolina the support that you need to quickly recover and rebuild.  We’re working on it very hard.And I think if Michael Whatley does half as good a job for North Carolina as he did for my campaign, we’ll be very happy.  (Laughter.)  Him and Lara were a very powerful team. So, you think you can handle it, Michael?  I don’t know.  I’m not sure, Michael.  (Laughter.)  I think this is maybe, in many ways, easier.  Okay?  Maybe easier.  But you’re going to lead the team. Do you want to say who the — who the congressmen are that you want to appoint?  Do you want to introduce them?MR. WHATLEY:  So, we — we have Virginia Foxx and Chuck Edwards and Tim Moore —THE PRESIDENT:  And —MR. WHATLEY:  — whose districts encompass the area (inaudible) —THE PRESIDENT:  And they are the districts that were most severely impacted, right?  You were — you were affected, then, Virginia?REPRESENTATIVE FOXX:  Yes, sir.  Lost my own property.THE PRESIDENT:  Really? Well, I’ll also be signing an executive order to begin the process of fundamentally reforming and overhauling FEMA or maybe getting rid of FEMA.  I think, frankly, FEMA is not good. I think when you have a problem like this, I think you want to go and — whether it’s a Democrat or a Republican governor, you want to use your state to fix it and not waste time calling FEMA.  And then FEMA gets here, and they don’t know the area, they’ve never been to the area, and they want to give you rules that you’ve never heard about, they want to bring people that aren’t as good as the people you already have. And FEMA has turned out to be a — a disaster.  And you could go back a long way.  You could go back to Louisiana.  You could go back to some of the things that took place in Texas.  It — it turns out to be the state that ends up doing the work.  It just complicates it. I think we’re going to recommend that FEMA go away and we pay directly — we pay a percentage to the state.  But the state should fix this.  If the state did this from the beginning, it would have been a lot better situation. I think you guys agree with that, right?So, I just want to tell that Ash- — say that Asheville — I know it well.  It’s a great place, and we’re going to have it be a great place again.  That was the one that was most severely affected.  But North Carolina is going to come back bigger, better, stronger than ever before, and you’re going to be very thankful. And you’ve already seen — I know that it really began four days ago, but you’ve already seen more action than you have in the last three months.  And we’re going to get it together. We’re informing the Army Corps of Engineers to get going, because you have a lot of river breaks and a lot of areas that you’re going to need some pretty big work.  And they’re on their way.  They’re going to be working very — much harder than they’ve been working in the past.  And we’re going to take care of it. Any questions from the press of any of the congressmen, governor, anybody?Q    Sir, are you going to sign an executive order on FEMA — getting rid of it?  Can you explain more about signing the executive order to get rid of FEMA, please?THE PRESIDENT:  FEMA has been a very big disappointment.  They cost a tremendous amount of money.  It’s very bureaucratic, and it’s very slow. Other than that, we’re very happy with them.  Okay?  (Laughter.)And I think it’s — I think when there’s a — when there’s a problem with the state, I think that that problem should be taken care of by the state.  That’s what we have states for; they take care of problems.  And a governor can handle something very quickly.You know, one of the things I’ve noticed, because I’ve been doing this for a while, and we had a pretty good FEMA.  But I also noticed that when they come, they end up in arguments of — they’re fighting all the time over who does what.  It’s a — just a — it’s just not a good system.This system is so beautifully designed over 250 years, approximately, you know, and we’ll soon be celebrating the 250th year.  It’s going to be a very big celebration.  But it’s been designed very well, and we’re going to leave it that way.When North Carolina, South Carolina, Florida, Tennessee, when — everybody knows the governor of Tennessee, I think — everybody.  Do you — do you know everybody here, pretty much?  He’s o- —GOVERNOR LEE:  I — I’ve introduced myself.  THE PRESIDENT:  I never thought of it, but you’re right over the ridge, right?GOVERNOR LEE:  Right over the hi- — right over the hillside.THE PRESIDENT:  So — so, you’re here to help.  That’s great.GOVERNOR LEE:  These here, thi- — the people in this region, including Tennessee — the people of Appalachia are grateful that you are here and that you haven’t forgotten them. THE PRESIDENT:  Yeah.GOVERNOR LEE:  And that there are other disasters, but this one was enormous for both North Carolina and Tennessee.  So, thank you.THE PRESIDENT:  You know, I’ve seen a lot of disasters, and this — when I came — I came here right after, the day after.  And when I came here, I couldn’t believe it, actually.  I couldn’t believe the damage.  I — and I’ve seen a lot of them.  This was — this was more like a tornado than it was — what we witnessed. So, we’re going to get it very much — very much taken care of.  Good job.  That’s nice that you came.GOVERNOR LEE:  Thank you, sir.THE PRESIDENT:  And so, you call it right — you’re right over the ridge, right?  Tennessee.GOVERNOR LEE:  Right over the ridge, yes, sir.THE PRESIDENT:  I like Tennessee, too.  Let’s see.  Where did I get more votes — Tennessee or North Carolina?  I hate — (laughter) — I hate to tell you, North Carolina, it was Tennessee. GOVERNOR LEE:  There’s one of the counties in this disaster that had 88 percent for you.  So (inaudible) —THE PRESIDENT:  Eighty-eight percent, yeah?  That’s — the people are just incredible people.GOVERNOR LEE:  Yeah.THE PRESIDENT:  So, do you have any questions, press?Q    Yes, Mr. President, you talked about conditions being placed on aid to California — voter ID and the like.  Are there any conditions that you’re going to put on aid to North Carolina?THE PRESIDENT:  Oh, we’re going to do a lot for North Carolina.  You know, they’ve been very slow.  I don’t know why it’s been so bad.  This has been one of the worst I’ve seen. Katrina, of course, you know, was somebo- — something that — obviously, that was a long time ago — that was not good.  But this has been very slow.  I don’t know if that was for political reasons because they lost the state.  You know, Biden lost the state.  Maybe he felt — he doesn’t care.  Maybe there were other reasons.  I don’t know.But this has been very slow.  By any standard, this has been very slow.  And we’re going to — we’re going to make up for lost time.Q    But no conditions you’re going to push for aid, just full stop?THE PRESIDENT:  Well, in California, I have a condition.  In California, we want them to have voter ID so the people have a voice, because right now, the people don’t have a voice because you don’t know who’s voting and it’s very corrupt. And we also want them to release the water.  If they release the water, they wouldn’t have had a problem.  If they released the water when I told them to — because I told them to do it seven years ago — if they would have done it, you wouldn’t have had the problem that you had.  You might have — you might not have even had a fire.So — but here, I don’t have that.  It’s a different thing.  You got hit by a storm.  The people are incredible.  They worked really well.  Franklin was fantastic, and other groups — by the way, other groups came in that were also fantastic.  And other states came in; Tennessee and a couple of others came in, and they really helped.  That’s the way it’s supposed to be.No, this is a different kind of a thing.Q    Mr. President, have you decided how much funding you would allocate for disaster relief in North Carolina?THE PRESIDENT:  About what?Q    Have you decided how much funding you would allocate for disaster relief?THE PRESIDENT:  I haven’t de- — I have to see what it is.Q    Mr. President —Q    Are — are — are you disappointed that Senator Schiff hasn’t joined you on this trip?  It’s reported that you invited Senator Schiff to join you on this trip, and he was too busy.  Are you disappointed by that?THE PRESIDENT:  I don’t know, I — I was told that Schiff was going to travel with us to California.  I wasn’t thrilled, to be honest with you.  (Laughter.) And I saw him last night on television.  It looks like he got hit with a baseball bat or something.  What happened to him?  Something happened to him.Q    Are you still —THE PRESIDENT:  It was a little — it looked like he got hit.  It looked like he got beat around, but —Q    So, did — did you invite him or —THE PRESIDENT:  But I’ll ask Karoline to find out what happened to him. No, if he wanted to come out, I would have done that.  But I don’t know.  I — somebody said that he wanted to come on the plane, but I think he’s staying back for the votes.  There’s some pretty good votes going on.Yeah.Q    Mr. President, what is your timeline for getting rid of FEMA?THE PRESIDENT:  I — I woul- — for the — for this one?  For this one?  Well —Q    For — you just talked about possibly getting rid of FEMA.  What timeline are you looking at, and how would you do that?THE PRESIDENT:  Well, we’re looking here — here, you’re talking about.  To start — we’re going to start immediately — timeline.  And to finish, it’s going to be a period of time. You know, people are also rebuilding their houses.  How long does it take to build a house, right?  It takes a time.And I want them to build houses bigger, better, nicer than they had before, so they can have — at least they get something out of this disaster.  This was a real disaster.No, timeline will be fast.  In terms of infrastructure, I think very fast. I want to thank Elon, because Elon was able to get us communication systems, as you know — Starlink.  We had no communication.  The first day I got here, I was asked by one of the people, one of the really great representatives, professionals that — “Is there any way you could get Starlink here,” because they had no communication whatsoever.  And I called up Elon Musk, and he had, you know, hundreds of units brought here — like, brought immediately.  And it’s hard to get; they couldn’t get them before.  And that made a lot of difference.  I think it saved a lot of lives, actually.Yeah. Infrastructure-wise, we’ll do it quickly.Q    Sir, can you just talk about how long you might — do you think it might take to get rid of FEMA?  What’s the timeline on that if you’re going to roll it back?THE PRESIDENT:  Yeah.  I would say, look, as far as I’m concerned, I’m not really thinking about FEMA right now here.  I’m thinking about Michael Whatley, and I’m thinking about the three congresspeople that you just heard from and also the other people in Congress.  And they’ll be working with the governor.  They’ll be working with the governor.  So, that’s what I see.Q    Change of subject real quickly.  The Laken Riley Act was signed by Mike — Speaker Johnson yesterday.  When do you —THE PRESIDENT:  Yeah.Q    — when do you anticipate to put — to sign that in the Oval Office?\n\nTHE PRESIDENT:  Well, we’re honored by that.  Laken Riley — I was there at the time, and we had a big meeting with the parents right after that horrible thing took place. And we have a — an act.  You all know what that act represents.  And it was a bipartisan bill.  Many Democrats signed — signed on to it.  That’s something that is a tribute to Laken, a beautiful young lady who was killed viciously by an illegal alien.  And we passed a very powerful bill, and it was just approved.  And we’ll have a ceremony sometime very shortly.I’ll be signing it.  In other words, if you’re asking, I will definitely be signing it.  Okay?Yeah.Q    Mr. President, the security detail for Anthony Fauci was terminated last night, and I’m wondering if you have any comment on that?THE PRESIDENT:  About what?Q    The security detail for Anthony Fauci was terminated last night, sir.  Do you have a comment?THE PRESIDENT:  No, I think, you know, when you work for govern- — government, at some point, your security detail comes off.  And, you know, you can’t have them forever.  So, I think it’s very standard.  If it would be for somebody else, you wouldn’t be asking the question. The question is very fair, but, you know, you work for government — we took some off other people too — but you can’t have a security detail for the rest of your life because you worked for government.Q    Did you ask for it to be taken off, sir?THE PRESIDENT:  Well, we’ll see what happens.Q    Would you feel partially responsible if something were to happen to, say, Dr. Fauci —THE PRESIDENT:  No.Q    — or John Bolton?THE PRESIDENT:  No. You know, they all made a lot of money.  They can hire their own security too.  All the people you’re talking about, they can go out — I can give them some good numbers of very good security people.  They can hire their own security.  They all made a lot of money.  Fauci made a lot of money.  They all did. So, if they, you know, felt that strongly, I — I think that — certainly, I would not take responsibility.Q    North Carolina is a state that relies on trade and manufacturing.  Are you going to have an announcement on new tariffs coming soon?  Is there a timeline now?THE PRESIDENT:  Yeah, the tariffs are going to make our country rich.  We’re going to be a rich, rich country very soon.  Tariffs are going to make it rich.  And competence — we have common sense, competence, and tariffs. The word “tariff” is one of the most beautiful words in the dictionary. Q    Jonathan Reynolds, the — the business secretary of the United Kingdom, said that there’s an even trade between the U.S. and — and the UK, so they shouldn’t have tariffs.  Does trade imbalances or a balanced trade affect tariffs and your decisions?THE PRESIDENT:  Yeah, ba- — unbalance and balance, and also deficits, like with Canada.  We lose $200 billion a year with Canada.  That’s because we allow them to make cars.  We allow them to take lumber.  We don’t need their cars.  We don’t need their lumber.  We don’t need their food products because we make the same products right on the other side of the border.  It’s sort of crazy.  So, we’ve just allowed that — you know, bad management has allowed it, over the last four years, in particular, to become very imbalanced. And I said to — I call him “Governor Trudeau,” but he’s Prime Minister Trudeau — when he was prime minister, I asked him, “Why would we do that?  Why?”  And he was unable to give me an answer.  He said, “I don’t know.”  And I said, “Do you think it’s fair that we’re paying $200 billion to keep Canada going?”  “And what would happen” — I said — I asked him, “What would happen if we didn’t do that, if we didn’t subsidize Canada?”  He said, “We’d be a failed nation.”  And I said, “Then you should be a state,” because why are we paying all of that money to Canada when, you know, we — we could use it ourselves, right?So, we take care of their military.  You know, we ordered — we’re going to order about 40 Coast Guard big icebreakers.  Big ones.  And all of a sudden, Canada wants a piece of the deal.  I say, “Why are we doing that?”I mean, I like doing that if they’re a state, but I don’t like doing that if they’re a nation.Also, they’ve been very nasty to us on trade.  Historically, Canada has been very, very bad to us, very unfair to us on trade.  So, we’ll see how it all works out.Q    So, the United Kingdom —THE PRESIDENT:  I would —Q    — might be in a better spot?THE PRESIDENT:  I would love to see Canada be the 51st state.  The Canadian citizens, if that happened, would get a very big tax cut — tremendous tax cut — because they’re very high- — highly taxed.  And you wouldn’t have to worry about military.  You wouldn’t have to worry about many of the things.  You’d have better health coverage.  You’d have much better health coverage. So, I think the people of Canada would like it, you know, if it’s explained.  But I — just to start off, they’d have a very — they’d have a massive tax cut, and they’d have a lot more business, because then we’d let business go to Canada routinely.  And there’d be no tariffs.  You know, if we did that, there’d be no tariffs.Q    So, the United Kingdom might be in a better spot, then?Q    Can you talk about Samaritan’s Purse?  Reverend Franklin Graham has been a great asset to this state.  Talk a little bit about the way the Samaritan Purse has helped North Carolinians.THE PRESIDENT:  Yeah, say it once again.  The first —Q    Reverend Franklin Graham has been a big part of Samaritan Purse and their aid to North Carolina.  I just want to get your thoughts on that.\n\nTHE PRESIDENT:  Yeah.  Well, Franklin Graham has been a big asset to the state.  His father was a big asset to the state, to the country — both of them.  I just think this: I think Franklin and — and other people that are doing what Franklin have done — but I — you know, I’ve known Franklin so long.  He was at the inauguration.  He made a speech, beautiful speech; beautiful prayer.  He just — he does a great job. And we gave — we made a big donation, and it was — it was money well spent.  Sometimes you make donations, it’s not well spent.  He’s done a great job here.  He’s done a really great job.So, I want to thank you.  We’re going to the site now, and — one of the sites — and we’ll — I think you’ll — for those that haven’t seen it, you won’t even believe it, but not enough work was done.  We’ll get it done fast. And I can speak for the Republican congressmen, we’re going to knock it out, right?  We’re going to knock it out.  And I think we take it very personally, because it was — North Carolina was very unfairly treated — very, very unfairly treated.  And it was obvious.  It was too obvious.  And we’re going to make up for lost time. So, thank you to the people of North Carolina. \n\nThank you, everybody.\n\nEND                11:57 A.M. EST\n",
  "summary": "In a briefing held at the Airport Fire and Rescue Facility in Fletcher, North Carolina, President Trump discussed the aftermath of Hurricane Helene on January 24, 2025. The President highlighted the severe impact of the hurricane, noting the loss of lives and destruction of homes, particularly emphasizing the water damage which he described as unprecedented. He criticized FEMA's response, claiming inefficiencies and asserting plans to reform or possibly eliminate it, advocating for state-led disaster management.\n\nPresident Trump acknowledged the support from local leaders and organizations, such as Franklin Graham's Samaritan's Purse, and expressed his gratitude for their efforts in aiding the affected communities. He introduced members of Congress and urged cooperation among them and state officials to facilitate recovery efforts. The President also mentioned possible visits to California and raised issues with water mismanagement there, as well as the need for voter ID laws.\n\nFurthermore, he discussed broader policy topics including tariffs and international trade relations, particularly with Canada and the United Kingdom. President Trump addressed questions regarding the removal of security detail for government officials like Anthony Fauci, capturing a presidential stance on budget management for personal security post-service. The briefing concluded with a commitment to rebuild affected areas swiftly and effectively.",
  "eli5": "President Trump talked about a strong storm called Hurricane Helene that caused a lot of damage in North Carolina. He said he wants local leaders to fix things faster and might change how a group called FEMA helps during disasters.",
  "keywords": [
    "Hurricane Helene",
    "North Carolina",
    "FEMA",
    "disaster response",
    "Franklin Graham",
    "Samaritan's Purse",
    "President Trump",
    "tariffs",
    "international trade",
    "California",
    "voter ID laws",
    "security detail"
  ],
  "issues": [
    "Criticism of FEMA response",
    "Proposed elimination or overhaul of FEMA",
    "Delayed federal aid",
    "Mismanagement of water resources in California",
    "Removal of security detail for government officials"
  ],
  "citations": [],
  "document_type": "Press Release"
}