{
  "title": "Remarks by President Trump After Air Force One Arrival – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump After Air Force One Arrival",
  "og:description": "Palm Beach International Airport West Palm Beach, Florida (February 16, 2025) 4:00 P.M. EST     THE PRESIDENT:  So, Daytona was",
  "og:url": "https://www.whitehouse.gov/remarks/2025/02/remarks-by-president-trump-after-air-force-one-arrival/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-16T16:46:41+00:00",
  "article:modified_time": "2025-02-17T16:48:47+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMP AFTER AIR FORCE ONE ARRIVAL\t\t\t\t\n\nFebruary 16, 2025\n\nPalm Beach International Airport\n\nWest Palm Beach, Florida\n\n(February 16, 2025)\n\n4:00 P.M. EST     THE PRESIDENT:  So, Daytona was fantastic.  The crowd was amazing.  The people love that sport, and they’re wonderful people that run it.  And they had a little rain delay, but we’ll go home and watch it, I guess — or some of you will.  And others will try and create peace throughout the world.     Do you have any questions, please?\n\n     Q    Sir, did you speak to Secretary Rubio this morning?     THE PRESIDENT:  I did.     Q    What is the latest with the negotiations in Saudi Arabia?  What’s he taki- —     THE PRESIDENT:  We’re moving along.  We’re trying to get a peace with Russia-Ukraine, and we’re working very hard on it.  It’s a war that should have never started.     Q    Do you expect Zelenskyy to be involved in these conversations?  What will his role be?     THE PRESIDENT:  Yeah, I do.  I do.  He will be involved, yes.     Q    Mr. President, would you allow the Europeans to buy U.S.-made weapons for Ukrainians?\n\n     THE PRESIDENT:  Yeah, I would.     Q    Sir, Zelenskyy said today that Russia is going to wage war on NATO.  Do you — do you agree with that?  Do you have any concerns about —     THE PRESIDENT:  No, I don’t agree.  I don’t agree with that.  Not even a little bit.\n\n     Q    Vice President Vance said that the United States would potentially take military action against Russia if they won’t come to an agreement.  Do you agree with that stance?     THE PRESIDENT:  I don’t know if that’s what he said.  I don’t think he said that.     Q    Sir, based on your conversations — based on your conversations with President Putin, what do you think he wants, ultimately, in Ukraine?     THE PRESIDENT:  I think he wants to stop fighting.  I see that.  We spoke long and hard.  Steve Witkoff was with him for a very extended period, like about three hours.  I think he wants to stop fighting.     They have a big, powerful machine.  You understand that.  And they defeated Hitler, and they defeated Napoleon.  You know, they’ve been fighting a long time.  They’ve done it before and — but I think he would like to stop fighting.     Q    Do you think he wants the whole of Ukraine, or just a pa- — like, what do you think he wants in terms territory?     THE PRESIDENT:  No, I think he wants to stop.  That was my question to him.  Because if he’s going to go on, that would have been a big problem for us, and that would have caused me a big problem, because you just can’t let that happen.      I think he wants to end it, and they want to end it fast — both of them.  And Zelenskyy wants to end it too.     Q    Sir, when do you think that could actually happen?  When do you think the fighting can stop?     THE PRESIDENT:  Well, we’re working to get it done.  I mean, you know, it’s too bad it started.  It would have been a lot easier to end it before it started.  Right?  But it started because we had an incompetent president that — he didn’t know what he was doing.  That should have never started.     That war was so easy to stop.  Remember this: that under Bush, they took a lot.  Under Obama, they took a lot.  Under Biden, they’re trying to take the whole thing.  And under Trump, they took nothing — nothing.  Nothing was gone, not even a little bit.  So, it’s too bad.  It’s really too bad.      A lot of people are dead right now that should be alive, and a lot of cities are destroyed that can never come back like they were.  Those beautiful golden domes and all of the multi-colored domes that were 1,000 years old, they’re all laying in — you know, just shattered.  So, it’s very sad.  They ruined a culture.\n\n     Q    They’re beginning phase two — they’re beginning phase two of the ceasefire deal —     THE PRESIDENT:  Yeah.     Q    — between Israel and Hama- — Hamas.  What is — what’s going on there?  Have you been briefed on the latest relating to that?     THE PRESIDENT:  Well, I told you — I have been briefed.  I told Bibi, “You do whatever you want.”  Because, you know, my statement was, “They got to come back now.”  The reason I made that statement: because they said they weren’t going to deliver — they were not going to deliver the people that they said they were going to deliver, that they agreed to deliver.  And they did agree to do that, but they broke that agreement.  When I made the statement, they delivered everybody, plus an American.     Now, the good news is, they look like they’re in pretty good shape, because the people from the week before didn’t look like they were in good shape.  They looked like Holocaust survivors, frankly — horrible.  Whatever happened to them was horrible.     But that will be up to Israel what the next step is, in consultation with me.     Q    Sir, what would the — what are they supposed to use these weapons for that you’ve now allowed to be shipped?  Given the fact that there’s a ceasefire supposed to be in effect, why ship those big bombs now?     THE PRESIDENT:  Peace through strength.  You understand that, right?  It’s called peace through strength.  You know, they contracted for those weapons a long time ago, in the Biden administration, and then Biden wouldn’t deliver the weapons.     But I look at it differently.  I say “peace through strength.”  They were sitting there.  Nobody knew what to do with them.  They bought them.  But I believe in that very strongly.     Q    On the EU —     Q    Sir, do you have an update on your —     Q    Sir, on the EU.  The — the European Union is talking about banning food imports from the U.S., kind of along the lines of your reciprocal tariffs.     THE PRESIDENT:  Why is that?  Why?     Q    They says it’s like the reciprocal tariffs.  They don’t like the (inaudible) —     THE PRESIDENT:  That’s all right.  I don’t mind.  Let them do it.  Let them do it.  They’re just hurting themselves if they do that.  I can’t imagine it, but doesn’t matter.     We’re having reciprocal tariffs.  Whatever they charge, we charge.  Very simple.     If a certain country, like India, which is very high tariff — if they charge us X dollars, we charge them X dollars.  It’s all right.  It’s a fair — it’s a fair thing to do.  Even the media said it was fair.  And it’s going to be very good for the United States.     Q    Do you have an update on your timing of your meeting with Putin in Saudi Arabia?     THE PRESIDENT:  No, we — there’s no time set, but it could be very soon.     Q    Like this — this month or —     THE PRESIDENT:  Well, it’ll be soon.  We’ll see what happens.  But they’re meeting right now, and that’s more — I mean, this should have been done four years ago — three years ago, before it started.  But it should have been done immediately after it started, as opposed to now, three years later.     Q    Sir, egg prices have reached an all-time high.  What’s your administra- —     THE PRESIDENT:  Which is?  What?     Q    Egg prices have reached an all-time high.     THE PRESIDENT:  Well, there’s the flu.  And it was a long — before I ever got here, it was at an all-time — this didn’t st- — remember, I’ve been here for three weeks.  And when you saw the inflation numbers, I’ve been here for three weeks.  I have had nothing to do with inflation.  This was caused by Biden.     I had four years of virtually no inflation.  So, I’m just taking over.     But I’ll tell you what, this country has made more progress in the last three weeks than it’s made in the last four years, and we’re respected again as a country.     Thank you very much.  Thank you.                              END                    4:07 P.M. EST\n",
  "summary": "President Trump addressed reporters at Palm Beach International Airport on February 16, 2025, following his arrival on Air Force One. He reflected on his visit to Daytona, highlighted ongoing efforts to mediate peace between Russia and Ukraine, and emphasized the importance of involving Ukrainian President Zelenskyy in the peace talks. Trump expressed his disagreement with assertions that Russia would wage war on NATO and stated that Vice President Vance's comments on potential U.S. military action were misunderstood.\n\nThe President also discussed various international affairs, such as the delivery of U.S. weapons to Israel under a concept of 'peace through strength' and ongoing negotiations involving the European Union's potential food import ban from the U.S. Trump mentioned remarks by Israeli leader Bibi Netanyahu and addressed high egg prices, attributing inflation to issues before his tenure. He concluded by expressing confidence in the U.S. regaining international respect and made a few remarks regarding a potential upcoming meeting with Putin.",
  "eli5": "President Trump talked about trying to help stop the fighting in Ukraine and Russia, and how he's working to make peace there. He said he gave Israel some weapons because he believes in being strong to keep peace.",
  "keywords": [
    "President Trump",
    "Air Force One",
    "Ukraine",
    "Russia",
    "Peace negotiations",
    "Daytona",
    "NATO",
    "Israel",
    "European Union",
    "Inflation",
    "Palm Beach"
  ],
  "issues": [
    "Clarification on Vice President Vance's statement about military action against Russia.",
    "Details on the timing of the meeting with Putin in Saudi Arabia.",
    "Impact of the European Union's potential ban on U.S. food imports."
  ],
  "citations": [],
  "document_type": "Press Release"
}