{
  "title": "Remarks by President Trump After Air Force One Arrival Fletcher, NC – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump After Air Force One Arrival Fletcher, NC – The White House",
  "og:description": "For Immediate Release                      ",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-after-air-force-one-arrival-fletcher-nc/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-24T18:48:13+00:00",
  "article:modified_time": "2025-01-24T18:48:48+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tRemarks by President Trump After Air Force One Arrival Fletcher, NC\t\t\t\t\n\nJanuary 24, 2025\n\nFor Immediate Release                       January 24, 2025\n\nREMARKS BY PRESIDENT TRUMP\n\nAFTER AIR FORCE ONE ARRIVAL\n\nAsheville Regional Airport\n\nFletcher, North Carolina\n\n11:07 A.M. EST\n\nTHE PRESIDENT:  Well, thank you very much.  Everybody thought I was going to California.  I said, “No, no.  I’m stopping in North Carolina first, because they’ve been abused by what’s happened.”  I mean, it’s terrible.  It should have been done.  It should have been — a lot of things should have happened that didn’t happen.  So, we’re here.  We’re going to fix it out. \n\nWe’re working with the gentleman behind me, and you know who they are.  And we’re going to fix it, and we’re going to fix it as fast as you can.  It’s a massive amount of damage.  FEMA has really let us down, let the country down.  And I don’t know if that’s Biden’s fault or whose fault it is, but we’re going to take over, and we’re going to do a good job.  \n\nWe’re going to assign Mr. Whatley — who’s fantastic, frankly — and the governor and everybody else that’s going to work.  We’re going to supply the money — we’ll supply a lot of the money.  Maybe you have to chip in something — you’ll chip in a little something, like —\n\nGOVERNOR STEIN:  We will.\n\nTHE PRESIDENT:  — maybe 25 percent or whatever. \n\nBut we’re going to get it done as quickly as we can, and we want to take care of the people of North Carolina. \n\nIt’s so interesting.  Everybody is talking about California, and that’s a mess.  But I said, “I’m not going to California until I stop in North Carolina.”  So, here we are.  \n\nWe’re going to go visit the site, and we’re going to work with probably three of the congressmen — Republican congressmen — who’ve been fantastic — whose areas have been affected, and with Michael Whatley, the governor, and whoever else is — you know, we decide to get involved.\n\nProbably less FEMA, because FEMA just hasn’t done the job.  And we’re looking at the whole concept of FEMA.  I like, frankly, the concept: When North Carolina gets hit, the governor takes care of it.  When Florida gets hit, the governor takes care of it, meaning the state takes care of it.\n\nTo have a group of people come in from an area that don’t even know where they’re going in order to solve immediately a problem is something that never worked for me.  But this is probably one of the best examples of it not working. \n\nAnd there’s been some others, like in Louisiana, et cetera.  So, we’re going to be doing something on FEMA that I think most people agree. \n\nI’d like to see the states take care of disasters.  Let the state take care of the tornadoes and the hurricanes and all of the other things that happen.  And I think you’re going to find it a lot less expensive.  You’ll do it for less than half, and you’re going to get a lot quicker response. \n\nSo, that seems to be the recommendation, but we’ll be making that recommendation over the next couple of weeks. \n\nWe’re going to go to the site now, and we’re going to figure out a plan — a plan for really demolition and cleaning, because not a lot has been done.  And we’re very disappointed in the Biden administration, but we’re going to make up for lost time. \n\nAnd I said I’d do that, and this is about the earliest we could possibly be here, and we’re honored to be here.  This has been a great state.  They’re great people, and they’ve really been mishandled.  But it’s all — this group is going to be great, and we’re going to get it taken care of. \n\nAny questions?\n\n     Q    How — how will you respond —\n\nQ    How will you make those changes to FEMA?  Do you do you expect to ask Congress for additional aid for North Carolina and California?\n\nTHE PRESIDENT:  Yeah, it will be direct.  In other words, the aid will go through us.  So, rather than going through FEMA, it will go through us.  And I think maybe this is a good place to start, because — and in all fairness to the governor, in all fairness to everybody else, FEMA was not on the ball, and we’re going to turn it all around. \n\nYes.\n\nQ    A lot — a lot of Americans think that this is symbolic of what your campaign was all about: America first, putting your prior- — priorities to Americans, even going to California, where their policies might mo- — have been one of the biggest reasons why they’ve had these problems.  But you’re putting the American people first.  Your thoughts on that?\n\n     THE PRESIDENT:  We are.  We’re puttin- — thank you.  I like that question.  Boy, I want more questions like that.  That’s even a statement.  Thank you very much. \n\n     Q    Thank you.\n\n     THE PRESIDENT: He’s a good man, that guy, and he’s also a very professional reporter, I have to say.  Thank you very much.\n\n     Q    You’re welcome.\n\n     THE PRESIDENT:  Yeah, we’re putting America first.  We’re putting, in this case, North Carolina and California — we’re going to do a good job in California.  That is a disaster like — I don’t know if we’ve ever seen anything like it, frankly.  They say “the biggest in the history of California.”  I think — has anything bigger than that happened in the whole country ever?  It looks like — I don’t want to say what it looks like, but you know what I’m going to say.  It looks like something hit it.\n\n     Q    Yeah.\n\n     THE PRESIDENT:  And we won’t talk about what hit it, but it is a bad, bad situation. \n\nAnd I guess I’m going to meet with some government officials, but, I mean, much more importantly — and in California, just to revert to it for a second, millions of gallons of water are waiting to be poured down through already the half pipes that are already built.  I mean, they’ve been up for 40 years.  And about 20 years ago, they turned off the water.  And it’s the water that comes from the Pacific Northwest — some of it comes out of Canada — and it flows there, and it probably has flowed there for a million years.  And they turned it off, and they route out to the Pacific. \n\nAnd in the meantime, you don’t have water in the hydrants.  You don’t have water in the sprinkler systems.  It’s the craziest thing I’ve ever seen. \n\nAnd everyone’s trying to figure out: Why aren’t they turning it back?  They say it’s the delta smelt — it’s a fish — but I find that hard to believe.  But we’ll —\n\nQ    Mr. President, what you are —\n\nTHE PRESIDENT:  — figure it out.  And without — and without doing that, you’re going to continue to have problems.\n\nQ    Mr. President, what are you prepared to do, sir, if OPEC doesn’t respond to your call to cut oil prices?\n\nTHE PRESIDENT:  Well, we want to see OPEC cut the price of oil, and that will automatically stop the tragedy that’s taking place in Ukraine.  It’s a butchering tragedy for both sides, by the way.  A tremendous number of Russian soldiers are dead; a tremendous number of Ukrainian soldiers, and a lot of people are dead from the bombing of the cities. \n\nBut right now, it’s just bullets whacking and hitting men — mostly men — almost in all cases, men.  And they’re — over a million men are killed, and they’re lo- — they’re losing thousands of people a week.  It’s crazy. \n\nIt’s a crazy war, and it never would have happened if I was president.  Would never have happened.  This is crazy that it happened, but we want to stop it.\n\nNow, one way to stop it quickly is for OPEC to stop making so much money and to drop the price of oil, because they have it nice and high.  And if you have it high, that war is not going to end so easily. \n\nSo, OPEC ought to get on the ball, and they ought to drop the price of oil, and that war will stop right away.\n\nQ    Will you withhold funding to Los Angeles because of its sanctuary city policy?\n\nTHE PRESIDENT:  I want to see two things in Los Angeles:  Voter ID, so that the people have a chance to vote, and I want to see the water be released and come down into Los Angeles and throughout the state.  Those are the two things.\n\nAfter that, I will be the greatest president that California have ever — has ever seen. \n\nQ    Will there —\n\nTHE PRESIDENT:  I want the water to come down and come down to Los Angeles and also go out to all the farmland that’s barren and dry. \n\nYou know, they have land that they say is the equivalent of the land in Iowa, which is about as good as there is anywhere on Earth.  The problem is it’s artificial, because they artificially stop the water from going on to the land. \n\nSo, I want two things.  I want voter ID for the people of California, and they all want it.  Right now, you have no — you don’t have voter ID.  People want to have voter identification.  You want to have proof of citizenship.  Ideally, you have one-day voting, but I just want voter ID as a start.  And I want the water to be released, and they’re going to get a lot of help from the U.S. \n\nThank you very much.  I’ll see you in a little while. \n\nQ    Will there be (inaudible) —\n\nTHE PRESIDENT:  We’ll see you at the site. \n\nQ    Will there —\n\nQ    Thank you, sir. \n\nTHE PRESIDENT:  We’ll see you at the site. \n\nQ    Can you tell us more about the deportation flights?  Where are they going from?  Where —\n\nTHE PRESIDENT:  It’s going very well. \n\nQ    — are they going to?\n\nTHE PRESIDENT:  Deportation is going very well.  We’re getting the bad, hard criminals out.  These are murderers.  These are people that have been as bad as you get, as bad as anybody you’ve seen.  We’re taking them out first. \n\nThank you.\n\nEND                11:15 A.M. EST\n",
  "summary": "President Trump addressed the press at Asheville Regional Airport in Fletcher, NC, on January 24, 2025, after arriving on Air Force One. He highlighted the severe damage North Carolina faced and criticized FEMA's inadequate response, stating a need for quicker intervention. Trump announced plans to have state governors, like North Carolina's Governor Stein, take the lead in disaster management, emphasizing local state efforts over federal control.\n\nThe President also discussed the ongoing conflict in Ukraine and connected it to oil prices. He called on OPEC to lower oil prices to facilitate an end to the hostilities. Additionally, Trump mentioned California's issues, specifically water management and the need for voter ID laws, suggesting these as prerequisites for continued federal support. Furthermore, he briefly addressed the success of deportation flights, targeting serious criminals for removal.",
  "eli5": "President Trump talked about fixing damage in North Carolina quickly because he thinks the current helpers aren’t doing a good job. He also wants other countries to lower oil prices to help stop a war and thinks California needs to change some rules to get more help.",
  "keywords": [
    "President Trump",
    "North Carolina",
    "FEMA",
    "disaster management",
    "OPEC",
    "oil prices",
    "Ukraine",
    "California",
    "voter ID",
    "deportation"
  ],
  "issues": [
    "Criticism of FEMA's effectiveness",
    "Potential shift of disaster management responsibility",
    "Interlinking oil prices with Ukraine conflict",
    "California's policy changes as a condition for support"
  ],
  "citations": [],
  "document_type": "Press Release"
}