{
  "title": "Remarks by President Trump and Vice President Vance at Liberty Ball – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump and Vice President Vance at Liberty Ball",
  "og:description": "REMARKS BY PRESIDENT TRUMPAND VICE PRESIDENT VANCEAT LIBERTY BALL Walter E. Washington Convention CenterWashington, D.C. (January 20, 2025)",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-and-vice-president-vance-at-liberty-ball/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T18:44:01+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tRemarks by President Trump and Vice President Vance at Liberty Ball\t\t\t\t\n\nJanuary 22, 2025\n\nREMARKS BY PRESIDENT TRUMPAND VICE PRESIDENT VANCEAT LIBERTY BALLWalter E. Washington Convention CenterWashington, D.C.(January 20, 2025)\n\n11:27 P.M. ESTTHE VICE PRESIDENT:  Good evening, everybody.  How are we doing?  (Applause.)  Are we ready to make America great again?  (Applause.)I just want to say we’re so grateful to all of you, so grateful for making sure that we made this election too big to rig, because that’s exactly what we did — (applause) — and we did it together.And, of course, I want to thank my dear friend, and I think the best president that this country has had, a man — (applause) — a man who has put everything on the line for the United States of America and gets an opportunity to serve this great country once again: President Donald J. Trump.  (Applause.)So, do we want to hear from the 45th and 47th president of the United States?  (Applause.)Take it away, sir.THE PRESIDENT:  Thank you, JD. This is a hell of a day we’re having, right?  (Applause.)It began very early, and then we decided — you know, we made a good decision, by the way, doing it in the rotunda, as opposed to in about four degrees with the windchill factor.  That would not have been pretty. And, you know, if I made us — did you ever speak in really cold weather?  You can’t.  They would say — the fake news over there, they’d say, “He’s cognitively impaired.  There’s something wrong with him.”  (Laughter.)  So, we didn’t want to give them the chance to do that, did we?We had a — a great time.  We had 72-degree temperature in the rotunda.  We had the people that we needed.  And we had the people that we need tonight, because you guys are unbelievable.  We love you all.  (Applause.)And we said a lot of things today.  I think we got tremendous reviews on the speech.  And, you know, I wanted to put in some really rough stuff, and all of my people, including JD, they said, “You know, let’s not put that paragraph in.”  Oh, I loved that paragraph.  (Laughter.)  There was a paragraph on “Biden shouldn’t be pardoning his family.”  (Applause.)  And we had a couple of others that were far worse than that. But they said, “You know, the speech is so nice and it’s so unifying.”  I said, “All right, we won’t do it.  I’ll do it about two hours later.”  So, we’ve done — (laughter) — we’ve been doing it all night long.But, you know, we’re going to turn this country around and fast.  (Applause.)  We have — we have assets like nobody else.  Number one, we have our people.  That’s our greatest asset, the people of our country.  (Applause.)And I just — and I have a great family.  I really do.  I — I just look around.  My son Eric has been so incredible, married to a woman who became the head of the Republican Party.  I wonder, how the hell did that happen?  (Applause.)  And she’s — she really — her and Michael Whatley, from North Carolina, did a great job.  (Applause.)And then you have — where is my Ivanka?  Have you ever heard of Ivanka and Jared?  (Applause.)And we have — Tiffany is here someplace.  There’s Tiffany.  Have — with — with child, I have to say.  (Applause.)  And Michael.  Thank you very much. And what — look at that group back there.  That’s Kai, our great golfer.  She — a great golfer, that one.  (Applause.)And Don and Don and Chloe.  Chloe — I don’t know, Ivanka, she might be as good as this one.  You have to see her athletic ability.  You wouldn’t believe it.  You look at her, she looks so innocent.  She’s a killer.  (Laughter.)  Chloe is a killer. And we have a great vice president, I want to tell you, and a fantastic — (applause) — and he’s got a fantastic wife and helper, and she’s done — she’s done just incredible things for the party and for him.  And I want to thank you.  Great job.  Great job.  JD Vance, great job.  (Applause.)So — so, we’re going to keep it going.  We’re going to have it turned around quickly.  This big ship, we got to turn it a little bit slower than I’d like, but we’re going to turn it around. We have things that nobody else has.  You know, we — we also have something that — it’s not politically correct to say, but it’s becoming very politically correct: We have more liquid gold under our feet than any other nation in the world.  (Applause.)  And if you don’t mind, we’re going to use it, right?  (Applause.)And we just left the Commander in Chief Ball, which is, like, a similar size.  Everyone — and we’re going to another one in a little while.  We needed three because we have such support.  There’s a longing for competence in this country.  There’s a longing for common sense in this country. And I was saying before, with a party of common sense, you know, we — we don’t want to have men playing in women’s sports.  (Applause.)  We don’t want to have transgender operations for everyone.  (Applause.)  And we just want to have a great country. Wan- — we want education.  We want houses that don’t cost a fortune.  We want low interest rates.  We want low taxes.  We want a strong, powerful military, and we’re going to have that. We did it once.  We did it in 2017.  We rebuilt our entire military.  It was given away, a lot of it.  Can you believe it? Given away — so foolishly given away, but we’ll have it back again very, very soon.And we’ll be making some announcements.  You’re going to be so thrilled. But we love you all.  We’re going to be — you know, I’d like to say we are a great nation.  We will soon be the greatest we’ve ever been, and that won’t take long. So, I want to thank you all for being here tonight, special people, and we’ll see you soon.  Just watch what happens.  Going to be big progress.  (Applause.)Thank you, everybody.  Thank you very much.  Thank you.  (Applause.)(The Village People perform “Y.M.C.A.”)MR. WILLIS:  Well, all right.  President Trump, Vice President Vance.  Thank you, sir.THE PRESIDENT:  Ladies and gentlemen, I just want to tell you, they’ve done something that’s never been done before.  So, it was, like, about 30 years ago — and I’m trying to be nice — (laughter) — and they did well, but I’m not sure they hit number one.  But you know what?  They hit number one for the last three weeks, and they are beating every other record — recording.  (Applause.)  They’re the number one show in town, and I want to just congratulate you.You’ve been with this song a long time, right?MR. WILLIS:  Yes.  I wrote the lyrics to it (inaudible).THE PRESIDENT:  You did?MR. WILLIS:  Yes, sir.THE PRESIDENT:  Well, you’re a talented guy.MR. WILLIS:  Thank you, sir.THE PRESIDENT:  Number one, we love it.  And you’re number one too.  Thank you, everybody.  And our country is number one, most importantly.  (Applause.)  Thank you very much.     Congratulations.MR. WILLIS:  Thank you.THE PRESIDENT:  It’s a fantastic job.Thank you.  (Applause.)                              END                    11:38 P.M. EST\n",
  "summary": "### Summary\n\nPresident Donald J. Trump, alongside Vice President JD Vance, delivered remarks at the Liberty Ball held at the Walter E. Washington Convention Center in Washington, D.C., on January 22, 2025. This event occurred following his inauguration as the 47th President of the United States. During his speech, President Trump expressed gratitude toward his supporters, emphasizing their role in making the election successful. He conveyed a message of unity and discussed plans to restore the country’s greatness by focusing on education, strong military presence, and economic stability.\n\nVice President Vance introduced President Trump, praising him as an effective leader. Both leaders touched on themes of national strength, political transparency, and resource management, specifically highlighting the United States' richness in 'liquid gold'—a reference to oil resources. The event included enthusiastic messages for turning America around and addressing contemporary issues such as gender policies in sports. Some comedic elements were interspersed in the speech, and the event concluded with a performance by The Village People, celebrating national unity with the song \"Y.M.C.A.\"",
  "eli5": "President Trump and Vice President Vance gave a talk at a big party in Washington, D.C., saying they want to make America great by working together and fixing things. They had fun and even danced to a song!",
  "keywords": [
    "President Trump",
    "Vice President Vance",
    "Liberty Ball",
    "2025 Inauguration",
    "Washington D.C.",
    "U.S. Presidency",
    "National Policies",
    "Economic Plans",
    "Military Strength",
    "Gender Policies"
  ],
  "issues": [
    "Potential lack of clarity on specific policy details",
    "Statements regarding gender policies may be divisive",
    "No citations for claims about resource management"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}