{
  "title": "Remarks by President Trump During Tour of Hurricane Helene Disaster Site – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump During Tour of Hurricane Helene Disaster Site – The White House",
  "og:description": "REMARKS BY PRESIDENT TRUMP DURING TOUR OF HURRICANE HELENE DISASTER SITE Private Residence Asheville, North Carolina (January 24, 2025) 12:39 P.M.",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-during-tour-of-hurricane-helene-disaster-site/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-24T17:54:00+00:00",
  "article:modified_time": "2025-01-27T17:54:21+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMP DURING TOUR OF HURRICANE HELENE DISASTER SITE\t\t\t\t\n\nJanuary 24, 2025\n\nREMARKS BY PRESIDENT TRUMP\n\nDURING TOUR OF HURRICANE HELENE DISASTER SITE\n\nPrivate Residence\n\nAsheville, North Carolina\n\n(January 24, 2025)\n\n12:39 P.M. EST\n\n     THE PRESIDENT:  Thank you very much, Franklin.  Thank you.  A good man.  He’s done a great job, a fantastic job. \n\nAnd we’ve come to North Carolina with a simple message for all the people of this region who were hit so hard by Hurricane Helene.  And that message is very simple: You are not forgotten any longer.  You were treated very badly by the previous administration.  And I’m here after a few days of the administration. \n\nWe’re going to California, Los Angeles.  They got hit hard, as you know.  A lot of that could have been prevented, I think, if they had water, which they had plenty of, but they didn’t use it. \n\nBut I’m going there, but — and it was set up to go there, and I said, “Well, wait a minute, what about North Carolina?”\n\nThey said, “Well, what.” I said, “I have to stop there first.  I’m stopping in North Carolina.” \n\nSo, we made the stop, and I feel very good.  You’re represented by some great people.  Great, great congressmen are with us, and we’re going to get involved with them. \n\nAnd Michael Whatley is here, who is the head of the Republican Party.  He worked with Lara Trump to take us through to a tremendous victory, one of the — as the media says, one of the most consequential presidential elections ever — they say in 129 years, whatever that may mean. \n\nBut whatever it is, it was a great election we had, and we won your state.  All three times, we won your state.  And all three primaries, we won your state.  So, we won it six times, I guess, Mr. Congressman, huh? \n\nAnd it’s a great place.  And I wanted to come here and before I went anywhere, frankly.\n\nIn the campaign, I promised that I’d come back to western North Carolina to help the people of the state.  And today, here I am to deliver on that promise.  And we have a lot of things in mind, and we’re getting the Army Corps of Engineers all set.  You need your riverbanks fixed.  You need a lot of roads fixed.  And we’re going to get it done in rapid time.\n\nAnd I’ve asked Susie Wiles and all of my people to start calling up and get the Corps ready, and they’re going to get ready to go.  I don’t know what it is — I don’t know what took so long for the other administration. \n\nBut remember, I wasn’t here for the first four months or three months, whatever it may be.  See, we can only start as of, essentially, one or two days ago.  And we’ve made a lot of progress over the last couple of days, Michael.\n\nI understand we’re going to get you the resources you need and the support that you deserve, and we’ll be at your side through every step of the rebuilding.  And no American is going to be left behind.  The people that I just met are so great, and the people that own that house is going to be very beautiful in a little while.  And who knows, if Franklin decides, maybe he’ll rip it down and build them a new one, because sometimes he can do that just as easily.  But we’re going to take care of the people.\n\nI want to thank our great first lady for coming today.  She really wanted to be here.  She said, “No, I want to go.”  And, you know, she sees what happened and she felt very badly, and she wanted to go.  And we’re then going out together to Los Angeles, but she wanted to be in North Carolina.  She saw what happened.  She has a — she has a feeling like I do for North Carolina.\n\nSo, thanks, as well, to a great gentleman, Franklin Graham.  And his father, Billy Graham — I used to go with my father to Yankee Stadium and places to watch his father preach.  And he was some preacher.  Where is he — he was some — you got good stock.  You come from the ultimate genes, I can tell you.  But he was really something.\n\nAnd Franklin, though, has done so much, and his father is looking down on him right now, I guarantee you.  For a long time, he’s been looking down on Franklin, saying, “I’m very proud of you, son.”  He really is, because what Franklin has done with Samaritan’s Purse is incredible.  They told me just yesterday that Samaritan’s Purse has been great.\n\nBut the FEMA people sort of left you high and dry, but we’re going to change that around.  We’re not happy with FEMA.\n\nAs well as all of the representatives — you have great representatives here.  Chuck Edwards, who’s here someplace.  Where is Chuck?\n\nPARTICIPANT:  Right here.\n\nTHE PRESIDENT:  Where is Chuck?  Chuck?\n\nTim Moore.  Tim — thank you, Tim.  Great job too, both of you guys.\n\nVirginia Foxx, a power — she’s a power, that one.  Don’t — don’t ever have her as your enemy.  It’s not good.  (Laughter.)  It’s not healthy.\n\nPat Harrigan.  Good job, Pat. \n\nAddison McDowell.  These guys were just here, just put in, and they’re doing a fantastic job.  Addison, thank you very much.  Great.\n\nMark Harris.  Thank you, Mark.  Thank you, Mark.\n\nBrad Knott.  Thank you, Brad.\n\nGreg Murphy, a fantastic guy — my friend for a long time now, right?\n\nREPRESENTATIVE MURPHY:  Yes, sir.\n\nTHE PRESIDENT:  And the RNC chairman, Michael Whatley, who really, as I said, brought us to a great victory with Lara the chairman of the party, the whole Republican — I took Michael Whatley from North Carolina, because he did the best job, and put him in charge of everything.  And the job they did together was incredible.\n\nLast September, Hurricane Helene became one of the deadliest natural disasters in modern American history.  Rainfall rose to far more than 30 inches, which is lethal, unleashing unprecedented devastation throughout western North Carolina and many other states, as you know, but you got hit the hardest.\n\nThe highest responsibility and deepest obligation of the American government is to protect its people, and that’s never truer than in times of emergency like this.  Unfortunately, our government failed you, but it wasn’t the Trump government.  It was a government run by Biden.  What a terrible situation.  But our government failed the people of North Carolina in this horrible crisis. \n\nFor two months, Asheville lacked running water.  And even today, some North Carolinians can’t take a hot-water shower.  They can’t drink water.  They don’t know where to get it.  They have to — it’s delivered to them by somewhere.  They just go out and somehow find some.\n\nIt’s been four months since the storm made ~~landfill~~ [landfall], and still 180 roads remain closed and in ruins.  Earlier this month, the Biden administration kicked 2,000 displaced North Carolinians out of their temporary housing into freezing, 20-degree weather — I don’t know how they did that one, because it was cold — even while your government provided shelter and housing for illegal aliens from all over the world.\n\nBut under the Trump administration, the days of betrayal and neglect are over.  They are over. \n\nAs I said in my Inaugural Address, we restore the integrity, competency, and loyalty of the American government.  And I think I said most of it in the Inaugural Address.  We said a lot of things, but one of the groups of people I was thinking about is you in North Carolina.  A lot of that was in reference to you and what you’ve had to suffer.\n\nI’m pleased to announce that under our leadership, the federal government will be surging housing solutions to the state that go beyond mere temporary hotel stays that ended up being very short term.  The government wouldn’t do it any longer, which is ridiculous. \n\nWe’ll marshal all available resources that bring back potable water and make your water and infrastructure dramatically more reliable very quickly. \n\nAnd today, I’ll also be signing an executive order slashing all red tape and bureaucratic barriers and permits to ensure the rapid reconstruction of the roads here in western North Carolina.  We’re going to go through a permitting process that’s called “No permitting.  Just get it done.”  That’s the way they built them many years ago, I guarantee you that.  Right? \n\nWe will get them back very quickly.  And we’ll begin the work of funderv- — fundamentally changing, terminating, or overhauling FEMA.  FEMA has been a disaster, no matter where they are.\n\nWe’re honored to be joined today, very quickly, by several families affected by the vicious storm.  I’d like to ask each of them to share their story.  Chris and Kim West, you can come forward.  Ramona Nix, Jackie Mitchell, and Thomas Gary Bright, and finally, the Wright family.  And come on up and maybe say a few words.  Please.  Thank you very much.\n\nHello.\n\nMS. WEST:  Hi.\n\nTHE PRESIDENT:  Come on in here.\n\nMS. WEST:  (Laughs.)  Whenever it started, we started moving our vehicles to the top of the road.  And by the time we got the vehicles moved, the water had already hit our ankles in the house.  And so, I grabbed my purse and my little pug dog, and my husband grabbed the dog food and put it in a trash bag.  And by the time we got out into the driveway, it was already waist deep, and there was sticks and that kind of thing.\n\nI didn’t think I was going to make it, but we did make it out, and we made it to the top of the road.  And we were kind of stuck there for hours because we couldn’t get out any other ways, because it was flooded all the way around.  It took us hours, and we sat there. \n\nAnd finally, it receded enough to where we could actually get out.  It was probably, like, close to midnight.  And it started like, 5, 6 o’clock in the morning.\n\nWe just lost everything that we had.  Didn’t even have a brush for, like, three days.  So —\n\nTHE PRESIDENT:  Thank you.  Come on over.\n\nMS. WEST:  Thank you. \n\nMR. WEST:  That —\n\nTHE PRESIDENT:  Okay. \n\nWould you like to say something with that beautiful baby?\n\nMR. WRIGHT:  Say, “hey.”\n\nYeah.  So, when the hurricane storms hit North Carolina, hit our home, my daughter and my wife and I were actually out of town.  But unfortunately, my dad, who was still home, and my mother was staying at our house with our — with our animals. \n\nAnd my — the waters got so high that it actually lifted — between that and the tornado that came through — or microburst is what they’ve been calling them — and lifted his home and the house that I grew up in and crashed it into our barn.  It took away his business.  It took away all of our tools and tractors and everything needed to keep the farm going. \n\nAnd my mother was trapped in the house, and there was no way to escape because the water got so high.  The only thing she could do was ride it out and wait until the waters came down.\n\nSo, we’ve been doing a little bit of battling with our insurance and FEMA.  We did have proper insurance, with flood insurance and homeowner’s insurance, but since we had proper insurance, FEMA has not been able to assist us with a whole lot of things. \n\nAnd, again, we’ve been having some issues with trying to get some payout for our insurance in a timely manner.  We had to do mold mitigation on our home, which is extremely expensive, before the structural engineer even came out in order to get our flood payout.  And to me, that was not really acceptable.\n\nTHE PRESIDENT:  Has the insurance company been responsive, or not really?\n\nMR. WRIGHT:  Not — not so much.  You know, again —\n\nTHE PRESIDENT:  Are they going to give you they have to give you?  Huh?\n\nMR. WRIGHT:  I’m — I’m hoping so.\n\nTHE PRESIDENT:  (Inaudible.)\n\nMR. WRIGHT:  And we might need — I mean, we need some assistance with that.  We reached out to an attorney.\n\nTHE PRESIDENT:  What’s the name of the insurance company?\n\nMR. WRIGHT:  North Carolina Farm Bureau.\n\nTHE PRESIDENT:  You’ve got a mortgage, right?\n\nMR. WRIGHT:  Yep. \n\nTHE PRESIDENT:  That’s terrible.\n\nMR. WRIGHT:  That’s what we’re after here.  So —\n\nTHE PRESIDENT:  Are a lot of people having that problem too with the insurance companies, general?  Different insurance companies?  And they’re all difficult, or just the one particular one? \n\nMR. WRIGHT:  I’ve heard different stories from others, and a lot of folks are —\n\nTHE PRESIDENT:  Have you heard some were responsive, that some were good?\n\nMR. WRIGHT:  I’ve heard some — some good instances of even Farm Bureau themselves.  But in my case, you know, they’d sent out a third-party adjuster immediately.  Well, they wound up firing that third-party adjuster group.  He gave us a quote for a much higher estimate than what we received.\n\nTHE PRESIDENT:  And he got fired?\n\nMR. WRIGHT:  And then he got let go.  Yeah, he got fired.  So, then they brought in another third-party adjuster to come in and lowball us. \n\nWe’ve not received any kind of — so, the flood insurance is our primary insurance.  And so, there was roof leaks in the home that the inspectors found — the adjusters.  Well, that contributed to us losing some of our personal property, as it come in the third story, where there’s no — or second-story living space, where the flood wa- — well above the flood waters.  So, they’ve neglected us for —\n\nTHE PRESIDENT:  Was your mother saved?\n\nMR. WRIGHT:  Yes, yes, she was saved. \n\nTHE PRESIDENT:  (Inaudible.)\n\nMR. WRIGHT:  She’s right here.\n\nTHE PRESIDENT:  Oh, good.  Okay.  You made it.\n\nMR. WRIGHT:  So, we — yeah, we made it.\n\nTHE PRESIDENT:  That was not exciting, right?\n\nMR. WRIGHT:  That’s right.\n\nTHE PRESIDENT:  How scared were you?\n\nMS. WRIGHT:  Very.\n\nTHE PRESIDENT:  Did you think you were going to make it?\n\nMS. WRIGHT:  No.\n\nTHE PRESIDENT:  You didn’t think so?\n\nMS. WRIGHT:  Nope.  I just started praying.\n\nTHE PRESIDENT:  So, you were sort of on a boat?  Your house became a boat, huh?\n\nMS. WRIGHT:  (Laughs.)\n\nMR. WRIGHT:  It’s a big pontoon.\n\nTHE PRESIDENT:  Wow.  That’s some story. \n\nWould you like to say something?\n\nMR. WRIGHT:  It was a beach house on — on the steps.\n\nTHE PRESIDENT:  I’ll bet this guy would like to say something, I can tell.\n\nMR. WRIGHT:  I was next door to the house, and my son was out of town.  So, when he came in to Charlotte — to my sister’s, he called about 2:00 in the morning, because at midnight, the water was still in the stream.\n\nTHE PRESIDENT:  Right.  (Inaudible.)\n\nMR. WRIGHT:  In — within the banks.  So, when he called, the water was coming up.  So, I started moving vehicles up to about 5:30 in the morning.  And she was in the house, and I pulled up to the steps, and I said, “Hop on the fender, and I’ll get you out.”  Well, it — he built a beach house on stilts —\n\nTHE PRESIDENT:  Right.\n\nMR. WRIGHT:  — five times higher than the floodplain. \n\nAnd she said, “Well, he said I’d be okay.”\n\nTHE PRESIDENT:  Right. \n\nMR. WRIGHT:  “So, I’m staying with the dogs.”\n\nTHE PRESIDENT:  Right.\n\nMR. WRIGHT:  So, I went to higher ground with some vehicles, hers included, and the water covered everything.  But I’d already seen it coming around both sides of my place, so I got my blind and deaf dog and a bag of valuables and took up off the side of the hill behind my house.  And then was heading to the cemetery back there because I knew it was open, because there was trees falling —\n\nTHE PRESIDENT:  Right.\n\nMR. WRIGHT:  — and right uprooting.  It was raining.  I mean, it was —\n\nTHE PRESIDENT:  You never saw anything like that before?\n\nMR. WRIGHT:  No, no.  I’ve been through floods —\n\nTHE PRESIDENT:  There’s never been anything like that before.\n\nMR. WRIGHT:  — all my life around here.  Never, no.\n\nTHE PRESIDENT:  Never been anything like it.\n\nMR. WRIGHT:  Mm-hmm.  Mm-hmm.\n\nTHE PRESIDENT:  But you’ve okay, right? \n\nMR. WRIGHT:  Yep. \n\nTHE PRESIDENT:  All right.  Come here.\n\nMR. WRIGHT:  House is destroyed. \n\nTHE PRESIDENT:  Yeah, well, we’re going to help you out there.  We’re going to help you out. \n\nMR. WRIGHT:  Appreciate you.\n\nTHE PRESIDENT:  That’s what we’re here for. \n\nMR. WRIGHT:  Thanks for being here.\n\nTHE PRESIDENT:  Anybody else?  You guys okay?  Please.  Please.\n\nMR. BRIGHT:  Our day that morning began — I’m a little taller — with some trees falling into our house, which our house is — goes back four generations, 80 years, and never came close to flooding.  And we woke up with trees about 4:30 or 5:00 in the morning. \n\nAnd our house sits three tenths of a mile back off the road.  And the water — you know, we’ve had flooding and such in the lake, but nothing like we saw.  And like most everybody else, we moved five vehicles as far up — lawnmowers and everything else.  And the water started coming in the house.\n\nAnd when it got up to about ankle high, we have a loft.  I got her up in that and tried to gather what you might want, which was totally random.  And when it made it to the loft and started getting up to about our hips, I built a little makeshift ladder, and we got out on our roof.  And we spent four hours on the roof.  I had a little baggie.  I — I di- — I did notes on my cell phone to my two kids and my two grandkids and something to identify me, in case we were lost in it.\n\nTHE PRESIDENT:  Did you think you were going to make it?\n\nMR. BRIGHT:  No.  We — we’re —\n\nTHE PRESIDENT:  Oh, you didn’t think so?\n\nMR. BRIGHT:  Yeah, we didn’t think we were going to make it at all.  I mean, our house was 25 feet underwater.  And —\n\nTHE PRESIDENT:  So, you didn’t think you were going to live?\n\nMR. BRIGHT:  No, we were watching houses, trailers, bodies coming by us.  And we live in the Azalea Road area of — in East Asheville.  Oteen.\n\nMS. MITCHELL:  We watched our garage lift up and float away.\n\nMR. BRIGHT:  Yeah, we watched our garage float by. \n\nTHE PRESIDENT:  It just lift up?\n\nMR. BRIGHT:  Yeah. \n\nBut, you know, we — we got to a point where it crested about four feet up on the roof.  We took about three or four hours for it so it could kind of do everything in reverse and got out in the mud to higher ground.  And I got out — higher ground, up toward the Subway and got over to her daughter’s house, where — when she saw that I didn’t have her, she lost it.  And I was like, “She’s okay.  She’s alive.”  And we tried to make our way back in there and gather things best we could. \n\nBut, you know, found a body right away.  We had — there was about eight bodies in our area that first two weeks, located.  And we were lucky we weren’t one of them and — and blessed. \n\nBut like other people, no insurance on flood insurance, so we — we had to depend on FEMA.  They did what they could do.  And, of course, it’s not enough.\n\n     THE PRESIDENT:  Yeah, no, I know.  (Inaudible.)\n\n     MR. BRIGHT:  Yeah.  Yeah.  Yeah.\n\n     THE PRESIDENT:  (Inaudible.)\n\n     MR. BRIGHT:  Yeah, no, it’s crazy.\n\n     But, yeah, again, we’re thankful to be alive, but it’s a long haul.\n\nTHE PRESIDENT:  So, what are you doing now?\n\nMR. BRIGHT:  Staying in a camper.  I’ve never been — if you all have noticed, I’m a big guy.  I don’t sleep in campers very — (laughter) — very well.  And the — the first night we spent in the camper — very grateful with the Asheville Dream Center coming through with one and —\n\nTHE PRESIDENT:  Do you still have the land?\n\nMR. BRIGHT:  Oh, yeah.  It’s — it’s family land.  Yeah, the land, it looks like a beach now; it’s sand. \n\n     MS. MITCHELL:  Yeah.\n\n     MR. BRIGHT:  But —\n\nTHE PRESIDENT:  Can it be built on?\n\nMR. BRIGHT:  Yes.\n\nTHE PRESIDENT:  Do you intend to do that?\n\nMR. BRIGHT:  Yes.\n\nTHE PRESIDENT:  You want to build again?\n\nMR. BRIGHT:  Yeah, Samaritan’s Purse — we’re working with them.  We’re working with people.  We — you know, it’s — it’s 80 years, four generations.\n\nTHE PRESIDENT:  But the house is totally gone?\n\nMR. BRIGHT:  No, the house is there.  It’s down to —\n\nMS. MITCHELL:  They — they gutted it to just the rafters.\n\nMR. BRIGHT:  Yeah, they came in and mudded it, but everything in it was completely destroyed. \n\nBut, yeah, it’s — it’s tough.  I think we’re at a point in Asheville where peoples forgot about Asheville and —\n\nTHE PRESIDENT:  (Inaudible.)\n\nMR. BRIGHT:  It’s — it’s stag- — everything is stopped.\n\nTHE PRESIDENT:  (Inaudible.)\n\nMR. BRIGHT:  Yeah.  Yeah.  Thank you, sir.  Appreciate that. \n\nTHE PRESIDENT:  We’re going to take care of you.\n\nMR. BRIGHT:  Thank you, Jackie.\n\nMS. MITCHELL:  Thank you. \n\nTHE PRESIDENT:  Thank you. \n\nMS. MITCHELL:  Thank you.  Stay well.\n\nTHE PRESIDENT:  Thank you.  Please\n\nMS. NIX:  I’m Pastor Nix.  Our church is right down the road.  We had only purchased in May, and it’s a big church.  We’re a small congregation.  And I had people say, “What are you going to do with this big building?”  And I said, “Only God knows.”  And we had our dedication, and the storm came the next week.\n\nAnd the outpouring of people — my son brought the first load of supplies.  And from there, I stayed there for about three months.  I slept on the floor for about three weeks because the need was so great.  The people were so devastated.\n\nAnd I said, “I want to be here for them.”  And they were coming in just day and night, so there’s really no need for me to go home. \n\nBut we had people from Kentucky, Tennessee, Texas, Indiana, Oklahoma — people from all over.  We have not received any help — like, from the government — anything.  But I said, “Lord, if you want us to do that” —\n\nTHE PRESIDENT:  (Inaudible) helped you?\n\nMS. NIX:  People.\n\nTHE PRESIDENT:  So, they came from all over the —\n\nMS. NIX:  All over the states.\n\nMR. BRIGHT:  (Inaudible) groups, that’s what — that’s what did it. \n\nTHE PRESIDENT:  But FEMA — FEMA did nothing, right?\n\nMS. NIX:  No.\n\nMR. BRIGHT:  It was the — it was the — the locals.\n\nTHE PRESIDENT:  FEMA is a waste of time and money.\n\nMS. NIX:  The locals and the people that — that knew us. \n\nAnd before the week was over, our church was so packed with supplies, we couldn’t even — we couldn’t even walk.  Even in our sanctuary, it was up to the platform —\n\nTHE PRESIDENT:  That’s great.\n\nMS. NIX:  — of things, and in our halls and in our rooms.  And we’re just now beginning to get a little straightened out. \n\nBut somebody said, “How long are you going to be here?”  I said, “I’m going to be here through the winter and even on, if possible,” because when you meet people that’s been through this struggle — I had a little lady come up, and I said, “Can we do anything special for you?”  And she said, “I don’t want to be selfish,” but said, “Could I have a cup of coffee?”  And I handed her that coffee, and she stood there, and tears just poured. \n\nShe said, “You don’t realize how — how important the — the little things.”  It’s not the big things in life that we have, but it’s the little things and — and knowing that God is our source.  I don’t look to man.  I don’t have to have a lot of things.  I — I had trees — about 20 trees down in my yard, but that didn’t really matter.  It doesn’t matter, because the needs of the people is what — is what I want to be there for. \n\nAnd God is good.\n\nTHE PRESIDENT:  He’s very good.\n\nMS. NIX:  He’s very good.\n\nAnd my daughter — now, she — her house is really in bad shape.  And I’ll let her tell you about that. \n\nTHE PRESIDENT:  Okay.\n\nMS. NIX:  But thank you, President. \n\nTHE PRESIDENT:  Thank you very much.\n\nMS. NIX:  This is our president. \n\nTHE PRESIDENT:  (Laughs.)\n\nMS. NIX:  We appreciate you so much.\n\nTHE FIRST LADY:  Thank you.  Thank you all.  Thank you.  Thank for all what you do.\n\nMS. NIX-ROPER:  I live out in the Fairview area of North Carolina and the — near the Bat Cave, Lake Lure area, and our area was hit — it was hit really hard.  I — I was home alone, and my husband had stayed in town because we take care of a little lady that’s 98 years old, and she lives out in the woods by herself.  And I said, “Just stay with her and make sure that she’s okay.” \n\nAnd I got up the next morning, and my first thought was, “I want to go see what our road and bridge looks like.” \n\nSo, as I was making it down to the road and the bridge, there was no road and bridge.  And so, you know, here we are.  We’re, like, in a little island.  You know, we can’t access the main road or anything. \n\nAnd then the fire department came by the next day and said that they were evacuating me and my neighbor because a landslide was going to come, and they told me to get my stuff and get ready. \n\nAnd so, while I was getting my stuff and getting ready, there was a knock at the door.  So, I thought it was the fireman.  And I went to the door, and there stood my 21-year-old son — his name is Nathan — and he had drove as far as he could to get to me.  But he hiked five miles, and it took him a really long time.  And he got there, and he said — he said, “Mom, grab a bag.  We got to go.”  And I said, “Son, there’s no way I can — I can hike out of here.”  And he’s like, “No.”  He said, “We got to go.”\n\nSo, we — we started hiking out, and I — and I seen one of my neighbors who — she had no clothes on.  Her — her — she was — her skin was — was, like, chunked up.  It was just — she was blue.  She had been — she had been in the — in the waters.  And where she had went or — or — I don’t know, but it — horrific, is just all I can say. \n\nBut then, as — as me and my son hiked on out, we went through where this — this place — we call it Craigtown — but there were, like, a lot of family members there that passed away — like 11 of them.  And — and there — there were people out everywhere looking for their loved ones.  And there were — there were dead bodies, you know?  My son’s like, “Mom, you’re going to see things you don’t want to see.” \n\nAnd so, anyway, we got through all that, but I stayed at our church in our sound booth.  My husband and I, we just slept up in the sound booth for a couple of months because we didn’t have power or anything for about two months out there.\n\nAnd then we — we have went back.  I’ve been fighting with FEMA since day one. \n\nOur community — there’s, like, 32 homes.  We don’t have a road and a bridge.  We’re driving through our neighbors’ property.  You know, I went to EMS, and I said, “Look, my concern is, if we have a fire or we have an emergency out here, you’re not going to get to us.  You can’t get those big trucks up here.” \n\nAnd — and I’ve called and called and called FEMA.  And, you know, I said it’s — this happened on September 27th.  That’s four months ago.  Well, for us, today is still September 27th.  You know, we haven’t had help. \n\nAnd so, when I talk to FEMA, I’m explaining the road and the bridge, and they send me a letter that tells me to — to basically fix it and send in my receipts, and they’ll refund me some money.  I’m looking at a road and bridge that, honestly, the bridge itself is probably going to be $300,000, and the road could be close to that also, because we have to have — the community has to have big boulders brought in.  We’re not a rich community.  We can’t fix it ourself. \n\nYou know, it’s just — and as far as, like, house repairs, I’m still pending.  I can’t get money from FEMA until I fix the road and bridge and fen- — and send in my — my proof that it’s fixed and everything.  It’s — it’s just — it’s been a nightmare.  And I totally feel like — that we have been forgotten. \n\nIf it had not been for — for our fellow American citizens who stepped up to help us, I don’t know what we would have done.  I have — I have five neighbors around me who completely lost everything.  You know, I have damage to my house and — and I feel — I don’t feel entitled.  I’m embarrassed to even say I need help, because, you know — and sometimes there’s even that — that survivors’ guilt, is what they’re calling it.  But you feel guilty to even be alive sometimes, you know, when you look around and you see your neighbors that are gone.\n\nAnd it’s just, you know — we — we need help.  I wrote a letter that — to send to Congress.  You know, “I don’t understand what’s going on.  If we can’t get FEMA help, then will you guys help us?  Will you step up and be our fellow citizen?  Will you step up and be our neighbor and send us something.  Help us.  Help us get our community back.”\n\nIt’s — I could go on.  It’s just a — I don’t know, it’s just heartbreaking. \n\nI appreciate you.\n\nTHE PRESIDENT:  Thank you.\n\nA good daughter you have, huh?  A good daughter.  Take care of mom.  And your son must be great.\n\nMS. NIX-ROPER:  My son is great.\n\nTHE PRESIDENT:  No, he sounds like a real leader and smart.\n\nMS. NIX-ROPER:  He really is.  Th- — to hike in —\n\nTHE PRESIDENT:  So, how would you have been if he didn’t come and get you?\n\nMS. NIX-ROPER:  I don’t know.  I’d — I’d just been — would have been there until — because the only thing we could do — there were no way to get out there.  The only thing we could do is just hike up to the church, the first church that was up there — about three miles to — to get, you know, maybe what we needed —\n\nTHE PRESIDENT:  You tell him he’s just —\n\nMS. NIX-ROPER:  — or some — I don’t know.\n\nTHE PRESIDENT:  Tell him he’s a real leader.\n\nMS. NIX-ROPER:  He is.  Thank you.\n\nTHE PRESIDENT:  Sounds good.\n\nWell, again, thank you very much, everybody. \n\nSo, we’re going to be here.  We’re going to be working with our congressmen and woman, and they’re going to do a job.  And Michael Whatley is going to be very much in charge, and you’ll get it done. \n\nAnd FEMA is ready to rock.  They haven’t done the job, because they weren’t really told to do the job by Biden.  I guess Biden was thinking about other things, wasn’t he?  But they weren’t told. \n\nWhat they did to — what the past administration did to North Carolina is a disgrace. \n\nSo, I just want to wish you all well.  I was here right after the event, and I couldn’t believe it.  I have never seen anything like it.  I’ve seen a lot of bad things, but I’ve never seen anything like it. \n\nAnd it’s an honor to meet the people behind me, and it’s an honor to be with our congressional delegation and some of the other politicians in the area.  And it’s an honor to have Michael Whatley at my side, because maybe we wouldn’t be standing here as president if he wasn’t. \n\nHim and Lara — Lara Trump — were unbelievable as the head of the Republican Party.  So, he happens to come from a place called North Carolina.  So, I said, “Michael, fix it.”  (Laughs.)  So, good luck.  Good luck.\n\nAnd we’ll supply what you need.  You know that.  Okay?  Thank you. \n\nThank you all very much.  Thank you very much.\n\nQ    Mr. President, what kind of role will Mr. Whatley have?\n\nQ    Mr. President, I’m hearing all these heartbreaking stories and how there’s been so many local groups —\n\nTHE PRESIDENT:  Yeah.\n\nQ    — who have stepped up to —\n\nTHE PRESIDENT:  Yeah.\n\nQ    — assist these families.\n\nTHE PRESIDENT:  That’s one of the things you hear.\n\nQ    Is there any talk on having money — instead of going to FEMA and going through the bureaucracy — to go through them?\n\nTHE PRESIDENT:  Yeah, that’s what I want to do.  We want to bring it locally so that a state takes care of its problem, and then they can bring it down to a local level, like Samaritan’s Purse and Franklin, because that’s, you know, one of the better examples.  But you had numbers of people that did a great job.  You have groups that did a great job and organizations.\n\nThe one that didn’t do a good job was the government.  They did a bad job.  They did in many ways, they did no job.  They weren’t even available. \n\nSo, good question.  The answer is: We go local. I think it will work much better. \n\nFEMA is a very expensive organization that really doesn’t work out very well.  It hasn’t.  This is not the only example. \n\nSo, if it was up to me right now, I’d end it right now, and I’d just let the state take care of the problem.  I mean, you’re going to always have problems.  Let the state — if it’s Florida, it’s a hurricane, let Florida take care of it.  They don’t need FEMA to come in. \n\nYeah.\n\nQ    What kind of role do you envision for Mr. Whatley?  Is it within FEMA, outside of FEMA?\n\nTHE PRESIDENT:  Yeah, I envision a very important role for him.  It’s any role he wants.  He’s a very capable guy.  Michael Whatley, a very capable guy.  And he’s friends and works with these guys.  Keeps them elected, right?  They have to do a good job.  Otherwise, no matter how good Michael is, not going to work.  But they’ve done an amazing job.  They’ve been great.\n\nYou’re lucky.  You have great congressmen here and — and -woman, by the way — a great woman, very powerful woman.  And they’re going to do a great job.  They’ll do it together.  They’ll work together, and we’ll supply what they need as they need it.  We’ll coordinate that.\n\nAnd we will immediately get the Army Corps, Michael, because you need roads built.  You know, we’re talking about the bridge, we’re talking about roads and things, so we’ve got to get them built. \n\nAll right?  Okay? \n\nThank you all very much.  Thank you very much. \n\nEND                  1:10 P.M. EST\n",
  "summary": "President Trump visited Asheville, North Carolina, on January 24, 2025, to address the aftermath of Hurricane Helene. He expressed his commitment to aiding affected residents who felt neglected by previous administrations. Trump criticized the Biden administration’s response to the disaster and pledged swift action from the federal government, including the involvement of the Army Corps of Engineers, to rebuild infrastructure such as roads and riverbanks.\n\nDuring his visit, President Trump met with local residents and heard firsthand accounts of their experiences with the hurricane. Many shared stories of loss and frustration with insurance companies and FEMA. He reassured them of his administration's commitment to providing necessary support and resources. Trump announced plans to streamline bureaucratic processes to expedite recovery efforts and proposed a local approach to disaster management, bypassing FEMA in favor of direct state involvement.\n\nTrump praised the efforts of organizations like Samaritan's Purse for their effective on-the-ground response. He emphasized the importance of local community help over federal assistance, suggesting that states manage their own disaster responses. The President underscored this approach as more effective, highlighting that the federal government would still offer support to ensure rapid recovery.",
  "eli5": "President Trump visited people in North Carolina who were hit by a big storm. He promised to help them rebuild their homes and roads faster, without waiting for lots of paperwork. He thinks local groups can help better than the big government.",
  "keywords": [
    "President Trump",
    "Hurricane Helene",
    "Asheville",
    "North Carolina",
    "disaster response",
    "FEMA",
    "Army Corps of Engineers",
    "Samaritan's Purse"
  ],
  "issues": [
    "Frustration with FEMA's response",
    "Insurance company delays",
    "Streamlining bureaucratic processes for disaster recovery",
    "Need for more effective disaster management"
  ],
  "citations": [],
  "document_type": "Press Release"
}