{
  "title": "Remarks by President Trump on Investment Announcement – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump on Investment Announcement",
  "og:description": "Roosevelt Room 2:38 P.M. EST     THE PRESIDENT:  Hello, everybody.  Thank you very much.      Thank you",
  "og:url": "https://www.whitehouse.gov/remarks/2025/03/remarks-by-president-trump-on-investment-announcement/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-04T01:25:32+00:00",
  "article:modified_time": "2025-03-04T01:25:33+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMPON INVESTMENT ANNOUNCEMENT\t\t\t\t\n\nMarch 3, 2025\n\nRoosevelt Room\n\n2:38 P.M. EST     THE PRESIDENT:  Hello, everybody.  Thank you very much.\n\n     Thank you very much.  This is a very big day for a lot of reasons, but this gentleman is a very unique man.  I think I can say, in the world of chips, certainly, but in the world pretty much of business, nobody has done what he’s done.  For those of you that are into that world, you would say, “Wow, he’s a legend.”  But he is a legend.  And it’s an honor to be with you.  Very great honor.  Thank you very much.\n\n     MR. WEI:  Thank you, Mr. President.\n\n     THE PRESIDENT:  Thank you very much.\n\n     Welcoming, from TSMC — which is the biggest there is, at a level that you can’t even calculate, frankly — C.C. Wei, to the White House for a very historic announcement.  This is a tremendous thing for our country and, hopefully, for his company. \n\n     We’re also pleased to be joined by Commerce Secretary Howard Lutnick and White House AI and crypto czar, David Sacks, another two very highly respected people.  It’s great to have you guys involved.  And, David, thank you very much for coming on.\n\n     David is sort of the king of intellect in that world.  We have some good people.     Today, Taiwan Semiconductor is announcing that they will be investing at least $100 billion dollars in new capital in the United States over the next short period of time to build state-of-the-art semiconductor manufacturing facilities.  I think, mostly, it’s going to be in Arizona, which is what I understand, which is a great state.  I like it because I won it.  But I won most of them — (laughs) — actually.  So — but I did.  We won it, and we won it big.\n\n     The most powerful AI chips in the world will be made right here in America, and it’ll be a big percentage of the chips made by his company.  But, as you know, they’re based mostly in Taiwan.  And they’re far and away the biggest.  There’s nobody even close. \n\n     This $100 billion in new investment will go into building five cutting-edge fabrication facilities in the great state that we just discussed, Arizona, and will create thousands of jobs — many thousands of jobs, and they’re high-paying jobs.     In total, today’s announcement brings Taiwan Semiconductor investments to about $165 billion — they’ve started already — among the largest new foreign direct investments in United States.\n\n     Apple, as you know, made a big announcement last week of $500 billion, and we have some others that have announced.      We have many that want to announce.  But I don’t have time to do all of these announcements, I tell you.  But, for you, I’m doing the announcement.\n\n     MR. WEI:  Thank you.\n\n     THE PRESIDENT:  This will create hundreds of billions of dollars in economic activity and boost America’s dominance in artificial intelligence and beyond. \n\n     Semiconductors are the backbone of the 21st century economy — and, really, without the semiconductors, there is no economy — powering everything from AI to automobiles to advanced manufacturing.  And we must be able to build the chips and semiconductors that we need right here, in American factories, with American skill and American labor.  And that’s exactly what we’re doing.\n\n     As you know, Taiwan pretty much has a monopoly on that market.  And I think “pretty much” is not a term that’s even appropriate.  They do have a monopoly.  And this is a tremendous move by the most powerful company in the world. \n\n     It’s a matter of economic security.  It’s also a matter of national security for us.  And, at the same time, Mr. Wei will be able to diversify and have his tremendous presence in another place and a very safe place.  And I want to thank Taiwan Semiconductor for doing the announcement.  \n\n     And I’d like to ask Mr. Wei to say a few words, if you might.\n\n     And I’d also like to ask Howard and David — you can say a couple of words.  But maybe you should go first because, right now, he’s the most important man in the room.  I’m sorry, fellas.\n\n     Please.\n\n     Thank you very much.  Thank you.  Great honor.  \n\n     MR. WEI:  Thank you, Mr. President.\n\n     THE PRESIDENT:  Thank you.\n\n     MR. WEI:  I’m a — I’m a little bit nervous, so I have to pull out my piece of paper.\n\n     Mr. President, Secretary Lutnick — and, David, I didn’t know that — your title, but — okay.\n\n     First, I want to thank — say thank you to Mr. President to give me this opportunity to announce our big project in the U.S. TSMC is the world’s largest chip manufacturing, founded by Dr. Morris Chang in 1987.  It’s now at the forefront of semiconductor technology, supporting AI advancement and industry growth. \n\n     In fact, I would like to wind back the time that in 2020 we have to thank President Trump’s vision and his support.  So, TSMC start the journey of establishing the advanced chip manufacturing in Arizona.  And now, let me proudly say, now the vision become reality.  \n\n     In Phoenix, Arizona, with 3,000 employees, we are producing the most advanced chip made on U.S. soil with the success of our first fab. \n\n     So, we are now very happy to announce we are going to invest additional 100 billion U.S. dollar in addition to our current 65-billion-U.S.-dollars investment in Arizona.  We are going to build three more new fab — be- — after we promised the three fabs already, and another two very advanced packaging fab, and, most important, an R&amp;D center, also in Arizona. \n\n     For this, all the investment — $165 billion — is going to create thousand of the high-paid job, as the president just announced.  And we are, most important — actually, we are going to produce many AI chips.  We are going to produce many chips to support AI’s progress and to support the smartphone’s progress. And, again, with that, I want to thank President Trump again for his support.  In addition, I also want to thank my customers in the U.S., such as Apple, Nvidia, AMD, Qualcomm, Broadcom.  They all support TSMC’s manufacturing in the U.S.  Without their support, we probably cannot make it true. So, again, I want to thank them.  Also, I’d like to thank the TSMC’s employee.  Without their effort, we just cannot make it today. That’s all I want to say.  And thank you. THE PRESIDENT:  Thank you.  That’s great.  (Applause.)  Thank you very much. Howard, please.  David.SECRETARY LUTNICK:  Sure.THE PRESIDENT:  Thank you. SECRETARY LUTNICK:  So, I’m thrilled to be here today, because President Trump has made it a fundamental objective to bring semiconductor chip manufacturing home to America. Under the Biden administration, TSMC received a $6 billion grant, and that encouraged them to build $65 billion.  So, America gave TSMC 10 percent of the money to build here.  And now you’re seeing the power of Donald Trump’s presidency, because TSMC, the greatest manufacturer of chips in the world, is coming to America with $100 billion investment.  And, of course, that is backed by the fact that they can come here because they can avoid paying tariffs. So, the idea is: Come to America.  Build greatness in America.  Build for the American customers — the Apple, Nvidia, that whole list that Chairman Wei gave — in order to bring production to America. So, we’re really, really excited.  This continues the most incredible path you’ve ever seen, in these first weeks and months of the Trump administration, of incredible manufacturing coming to America.  The keys that the president has called out are coming here.  They’re coming here in huge size because they want to be in the greatest market in the world, and they want to avoid the tariffs that, if they’re not here, they’d have to suffer. So, I want to congratulate C.C. Wei for bringing in this incredible $100 billion investment, but it’s on the shoulders of our president, Donald Trump, which is why he’s coming. So, thank you.  THE PRESIDENT:  Thank you.David.  MR. SACKS:  Thank you, sir.  Well, the products that TSMC makes are literally the most important products in the world.  I mean, these advanced chips power everything.  They power AI.  They power your phone.  They power your cars.  And without them, the whole modern economy would stop, but they’re not made in the United States. So, for TSMC to move here is a huge, huge development, and we owe that to President Trump’s leadership on the economy and Secretary Lutnick as well.  And, C.C., thank you for — for coming here. Thank you.  Yeah.THE PRESIDENT:  Thank you, David. So, thank you very much.  A big percentage of chips with this investment will be made now — a big percentage.  Worldwide, we had very little.  Almost none.  We used to have a lot with Intel.  But we had very little.  And we’ll be at close to 40 percent of the market with this transaction and a couple of others that we’re doing.  That’s a tremendous leap — like, a leap that nobody would have really said was possible. So, I just want to thank you all for being here.  If you want a couple of questions.(Cross-talk.)Q    On the — THE PRESIDENT:  Ideally on this subject. Yes, please. Q    — specific number of jobs it will create.   He said thousands —THE PRESIDENT:  They — yeah.Q    — but do you have a better —THE PRESIDENT:  They — you’re probably talking about 25,000 jobs.  But it’ll get bigger and bigger with time.  Knowing this gentleman, it’ll get bigger and bigger.  There’ll be no stopping him.  (Laughs.)Q    Mr. President, what more —THE PRESIDENT:  Yeah.  Brian, go ahead.Q    Right.  In addition to the jobs, you talked about national security, and that’s one thing I think a lot of Americans —THE PRESIDENT:  Yeah. Q    — at home don’t understand.  Explain the national security aspect of this. THE PRESIDENT:  Well, without the chips and semiconductors, nothing runs today.  You can’t buy a car without them.  You can’t get a radio, a television, nothing — you can’t get anything.  And we thought it was very important — obviously, business was, but we thought even to terms of national security, to have this large percentage of the chips, semiconductors, and other things that they make — the most important product, and not a product that you can really copy.  It takes years and years.  You’re on the needle of a pin is total genius.  I mean, they can put things — I mean, something the size of the needle, the point of a pin, they put information that is just not even believable. So, if you would — (Cross-talk.) If you would see this, it’s just really something. Yes, Brian. Q    Can I — one — one more aspect to that.  Honda —THE PRESIDENT:  Yeah. Q    — announced they’re coming to Indiana because of the tariffs.  Once again —THE PRESIDENT:  That’s right.Q    — you’re bringing additional jobs in manufacturing.  Do you want to comment on that as well?THE PRESIDENT:  Well, Honda is coming, and I told you about Apple, that they’re going to be starting to build massively here — $500 billion.  And we have many other companies.  It’s going to be announced, but we had many that have already announced.  And no, it’s going to be great.  It’s looking — it’s looking really strong.  I don’t think this country has ever seen anything like we’re seeing right now. Now, the tariffs, as you know, it will start a week earlier than the reciprocal, which is going to be on — a couple of weeks earlier.  Reciprocal tariffs start on April 2nd.  And I wanted to make it April 1st, but I didn’t want to do — I didn’t want to go April Fool’s Day — (laughter) — because that cost me — that costs a lot of money, but — that one day.  So, we’re going April 2nd.But very importantly, tomorrow, tariffs — 25 percent on Canada and 25 percent on Mexico, and that’ll start.  So, they’re going to have to have a tariff.  So, what they’ll have to do is build their car plants, frankly, and other things in the United States — in which case, they have no tariffs.  In other words, you build — and this is exactly what Mr. Wei is doing by building here.  Otherwise, they’ll build — if they did them in Taiwan to send them here, they’ll have 25 percent or 30 percent or 50 percent or whatever the number may be someday.  It’ll go only up.  But by doing it here, he has no tariffs, so he’s way ahead of the game. And I would just say this to people in Canada or Mexico, if they’re going to build car plants, the people that are doing them are much better off building here, because we have the market.  We’re the market where they sell the most.  And so, I think it’s going to be very exciting.  Very exciting for the automobile companies.  Very exciting for — I can think of any — as an example, North Carolina, they had the great — I used to go there to buy furniture for hotels, and it’s been wiped out.  That business all went to other countries, and now it’s all going to come back into North Carolina — the furniture manufacturing business.Please.  Q    Mr. President —Q    Is the Ukraine minerals deal now dead, or can it be revived?  What — what’s your —THE PRESIDENT:  Well, I’ll let you know.  We’re making a speech — you probably heard about it — tomorrow night, so I’ll let you know tomorrow night. But, no, I don’t think so.  I think it’s — look, it’s a great deal for us, because, you know, Biden very, very, foolishly — stupidly, frankly — gave $300 billion and — $350 billion, more accurately — to a country to fight and to try and do things.  And you know what happened?  We get nothing.  We get nothing — just gave it. We could have rebuilt our entire U.S. Navy with $350 billion.  Think of it.  Three hundred and fifty billion, we could have rebuilt our U.S. Navy.So, he gave it away as fast as the money could be gone.  And what we’re doing is getting that all back and a lot more than that.  And what we need — it’s very important for this business that we’re talking about here, with chips and semiconductors and everything else — we need rare earths.  And the deal we have is we have the finest rare earths that you can. Q    Sir, on Ukraine.  Sir, on Ukraine.\n\n     Q    Are you going to press back —Q    Thank you, Mr. President.  What do you need to see from President Zelenskyy to restart these negotiations?THE PRESIDENT:  Well, I just think he should be more appreciative, because this country has stuck with them through thick and thin.  We’ve given them much more than Europe, and Europe should have given more than us, because, as you know, that’s right there.  That’s the border. This country really was like the fence on the border.  It was very important to Europe.  And I’m not knocking Europe, I’m saying they’re just — they were a lot smarter than Joe Biden, because Joe Biden didn’t have a clue.  He just gave money hand over a fist, and they should have been able to equalize with us. In other words, if we gave a dollar, they should have given.  Well, we gave $350 billion.  They probably gave 100, but on top of it all, they get their money back, because they are doing it in the form of a loan, and it’s a secured loan.  So, when I saw that, which I’ve known about for a little while, I said, “It’s time for us to be smart.”  At the same time, it’s great for them, because they get us in the country taking the rare earth, which is going to fuel this big engine, and especially the engine that we’ve, in a very short time, created.  And we get something, and we’re in the — we’re there.  We have a presence there. With all of that being said, I want one thing to happen: I want all of those young people to stop being killed.  They’re being killed by the thousands every single week.  Last week, 2,700 were killed.  Twenty-seven hundred young — in this case, just about, all young boys from Ukraine and from Russia.  And that’s not young people from the United States, but it’s on a human basis. I want to see it stop.  The money is one thing, but the death.  And they’re losing thousands of soldiers a week, and that’s not including the people that get killed every time a town goes down or a missile goes into a town.(Cross-talk.)We — and — and I want to see it stop. Yes.  Q    Mr. President, are you considering canceling military aid to Ukraine?  And can we get a reaction to what the Kremlin just said, that your administration is bringing U.S. worldview in alignment with Moscow’s?  THE PRESIDENT:  So, this is a deal that should have never happened.  This is a deal that would have never happened, and it didn’t happen — for four years, it didn’t happen.  It was never even close to happening.  If I were president, would not have happened.  And October 7th would have — would not have happened in Israel.  And inflation wouldn’t have happened. And Afghanistan, disastrous — the way they withdrew — not the fact that they withdrew but the way they withdrew — would have never happened.  And we would have had Bagram right now instead of China having it.  It was one hour away from where China makes their nuclear weapons.  We would have kept Bagram — one of the biggest air bases in the world. All of these things happened, and it’s a shame.  But it is what it is, and now we’re here.  I want to see it end fast.  I don’t want to see this go on for years and years.Now, President Zelenskyy supposedly made a statement today in AP — I’m not a big fan of AP, so maybe it was an incorrect statement — but he said he thinks the war is going to go on for a long time, and he better not be right about that.  That’s all I’ll say.Q    Mr. President, is there any —\n\n     Q    Could this project — could this minimize the impact of the U.S. with chips should China decide to isolate Taiwan or China decide to take Taiwan? THE PRESIDENT:  Well, it’s a very interesting point.  It’s a great question, actually.  But this would certainly — I can’t say “minimize.”  That would be a catastrophic event, obviously.  But it will at least give us a position where we have — in this very, very important business, we would have a very big part of it in the United States.  So, it would have a big impact if something should happen with Taiwan.Q    And with Russia sanctions, are you looking at relieving Russian sanctions if there is a peace deal?THE PRESIDENT:  Well, we’re going to make deals with everybody to get this war, including Europe and European nations.  And they’ve acted very well.  You know, they’re good people.  I know; most of them are friends of mine — the heads of state, the heads of the various countries, prime ministers from the different — I got four prime ministers and five presidents called me over the last two days, and they want to work it out.  They want to get it worked out.  And I think they’re also — you know, they’re talking money, but the money is less important than the deaths.  We’re talking thousands of young people a week.  And people would say why do I care about Ukraine, young people; why do I care about — and not all young, but they’re pretty young.  You know, Ukraine is running a little bit low, and they’re getting older.  They’re recruiting older people.  It’s a very, very sad thing that’s happening over there, and we want to get it finished.  We want to stop the death. (Cross-talk.)Q    Mr. President, on the tariffs.  Is there any room left for Canada and Mexico to make a deal before midnight?  And should we expect those Chinese tariffs, the extra 10 percent to take effect tomorrow?THE PRESIDENT:  No room left for Mexico or for Canada.  No, the tariffs, you know, they’re all set.  They go into effect tomorrow.Q    Mr. President, just a follow-up on my colleague’s question.  Hearing —THE PRESIDENT:  And just so you understand, vast amounts of fentanyl have poured into our country from Mexico and, as you know, also from China, where it goes to Mexico and goes to Canada.  And China also had an additional 10, so it’s 10 plus 10.  And it comes in from Canada, and it comes in from Mexico, and that’s a very important thing to say.Yeah, please.  Go ahead.Q    Have you decided if you’re going to suspend military aid to Ukraine?  Have you made that decision?THE PRESIDENT:  Well, I haven’t even talked about that right now.  I mean, right now, we’ll see what happens.  A lot of things are happening right now, as we speak — I mean, literally as we speak.  I could give you an answer and go back to my office — the beautiful Oval Office.  I could go back into the Oval Office and find out that the answer is obsolete.     It’s like his business.  It’s obsolete.  You come up with a new chip, and it’s obsolete about two minutes later, right?  But that’s what’s good about his business.  That’s why he’s the only one that’s successful in it.  But —      Q    And on tariffs, sir.     Q    Mr. President, just to follow up my colleague’s question from Russia is saying that your foreign policy is largely in line with their vision.  Should that be concerning to Americans? THE PRESIDENT:  Said what?Q    Should that be concerning to Americans?THE PRESIDENT:  Read the statement.Q    That Russia — Russia says that your administration’s foreign policy is, quote, “largely in line” with their vision.THE PRESIDENT:  Well, I tell you what, I think it takes two to tango, and you’re going to have to make a deal with Russia, and you’re going to have to make a deal with Ukraine.  You’re going to have to have the ascent, and you’re going to have to have the consent from the European nations, because I think that’s important, and from us. I think everybody has to get into a room, so to speak, and we have to make a deal.  And the deal could be made very fast.  It should not be that hard a deal to make.  It could be made very fast. Now, maybe somebody doesn’t want to make a deal, and if somebody doesn’t want to make a deal, I think that person won’t be around very long.  That person will not be listened to very long.  Because I believe that Russia wants to make a deal.  I believe, certainly, the people of Ukraine want to make a deal.  They’ve suffered more than anybody else.  We talk about suffering — they’ve suffered.But if you think about it, under President Bush, they got Georgia, right?  Russia got Georgia.  Under President Obama, they got a nice, big submarine base, a nice big chunk of land where they have their submarines.  You know that, right?  Crimea.  Under President Trump, they got nothing.  And under President O-Biden, they tried to get the whole thing.  They tried to get the whole big Ukraine, the whole thing.  If I didn’t get in here, they would’ve gotten the whole thing.  So, I can only say — you can go back to Bush, you go back to Obama, and go back to Biden — they took a lot.  The only one they didn’t get — you know what I gave them?  I gave them anti-tank missiles.  That’s what I gave them.  I gave them sanctions on Russia — on Russia.  I gave them Javelins.  You know the Javelins?  You know when they took out all those tanks?You know, the tanks were heading to Kyiv by the hundreds, and they were unstoppable, and I gave them Javelins. So, you know, I really — Putin is the one that will tell you this has not been so good for them.  The fact is that I just want fairness.  I want fairness. But think of it.  I gave Russia nothing except grief.  I gave them nothing.  I gave them sanctions and Javelins.  That’s what I gave them. Obama gave them sheets.  And you heard that statement before.  It’s a very famous — Trump gave them Javelins, and Obama gave them sheets.  And then they say how close I am to Russia. Let me tell you, we have to make a deal, because there are a lot of people being killed that shouldn’t be killed.  But remember, Trump gave them nothing, and the other presidents gave them a lot.  They gave them everything.Q    Mr. President, on trade.  You met with president — Argentine President Javier Milei at CPAC.  He wants to sign a free trade agreement —THE PRESIDENT:  Right. Q    — with the United States.  Is that something that you would consider, even with Argentina, or any other country?THE PRESIDENT:  I’ll consider anything.  And Argentina — I think he’s great, by the way.  I think he’s a great leader.  He’s doing a great job.  He’s doing a fantastic job.  Brought it back from oblivion. Yeah, we’ll look at things.  We’re looking at the UK with things.  It doesn’t have to be tariffs.  But tariffs are easy, they’re fast, they’re efficient, and they bring fairness. For instance, when people kill their dollar, their equivalent of the dollar, whatever — whether it’s the yuan or the yen in Japan or the yuan in China — when they drop them down, that gives us — that puts us at a very unfair disadvantage.  So, all I have to do is say, “Howard, we’re going to have to raise the tariffs a little bit.”Because I’ve called President Xi, I’ve called the leaders of Japan to say, “You can’t continue to reduce and break down your currency.  You can’t do it, because it’s unfair to us.”  It’s very hard for us to make tractors — Caterpillar — here, when Japan, China, and other places are killing their currency, meaning driving it down. So, all of these things add up, and the way you solve it very easily is with tariffs.  Because when they do that, instead of having to make phone calls every day, like I used to do with certain leaders — President Xi, a little bit — a lot of phone calls talking about the fact that they’re lowering their yuan.  They’re lowering it down.  And that makes it very, very hard for us. So, this way, I just say, “Look, let them do that, and we make up for it with the tariffs.”  But —Q    Will you be speaking with Mexican President Claudia Sheinbaum about tariffs today? THE PRESIDENT:  Yeah, sure, I will.  I have a lot of respect for her.  I have a lot of respect for her. (Cross-talk.) Q    After the 10 percent tariff take ef- —THE PRESIDENT:  Yeah. Q    — takes effect, it’ll be 20 percent on China now.  How high are you willing to go against China?\n\nTHE PRESIDENT:  Well, I can’t say.  It depends on what they do with their currency.  It depends on what they do in terms of a retaliation with some kind of an economic retaliation, which I don’t think they’re going to retaliate too much.  Hey, look, the United States has been taken advantage of for 40 years.  The United States has been a laughing stock for years and years.  That’s why this gentleman has built in Taiwan, instead of building here.  It would have been better if he built here.  If we had a president that knew what they were doing — and we had a lot of them very bad on trade.  Look, I’m a huge fan of Ronald Reagan, but he was bad on trade.  Very bad on trade.  He allowed a lot of people, a lot of businesses, to be taken.  So, I say that with due respect, because I — he was so great on other things, but he was bad on trade. We are setting records right now — records like nobody has ever seen before.  When you have companies like this coming in and almost 40 percent of their company, in one signature, is going to be devoted to what he does, which is one of the most important — important businesses in the world, that’s an unbelievable thing.  When Apple now is going to start building all of their plants here, all because of what we’ve done in terms of — it’s not because he likes me or they like me.  They don’t probably like me at all.  I don’t know.  I think he likes me a little bit, at least.  (Laughter.)MR. WEI:  No, I like you.THE PRESIDENT:  But you know what?  It’s the incentive we’ve created or the negative incentive.  I mean, it’s going to be very costly for people to take advantage of this country.  They can’t come in and steal our money and steal our jobs and take our factories and take our businesses and expect not to be punished, and they’re being punished by tariffs. \n\nIt’s a very powerful weapon that politicians haven’t used because they were either dishonest, stupid, or paid off in some other form.  And now we’re using them.Q    Have you spoken with President Xi?Q    Agriculture — THE PRESIDENT:  Say it. Q    Have you spoken with President Xi about this this term?THE PRESIDENT:  I don’t want to tell you that. Q    On those incentives, sir.THE PRESIDENT:  Thank you very much, everybody. (Cross-talk.) Thank you.  Thank you very much.\n\n                             END                3:07 P.M. EST\n",
  "summary": "On March 3, 2025, President Trump announced a significant investment from Taiwan Semiconductor Manufacturing Company (TSMC) in the United States during a press conference in the Roosevelt Room at the White House. TSMC, led by C.C. Wei, plans to invest a minimum of $100 billion to build semiconductor manufacturing facilities in Arizona, creating thousands of high-paying jobs. This investment aims to boost the production of advanced AI chips in the U.S., enhancing national security and economic dominance in semiconductor manufacturing.\n\nThe announcement included remarks from Commerce Secretary Howard Lutnick and White House AI and crypto czar David Sacks, who both lauded the investment as a testament to President Trump's economic policies. The TSMC investment will significantly increase the percentage of semiconductor manufacturing within the U.S., addressing concerns over national security due to Taiwan's monopoly on chip manufacturing. The press conference also discussed broader economic impacts, including tariffs and trade relations with countries like Canada, Mexico, and China.\n\nIn addition to the TSMC announcement, President Trump highlighted other significant investments, such as Apple's $500 billion commitment to U.S. manufacturing. He emphasized the importance of having a domestic supply of semiconductors for both economic and national security, and reiterated his administration's focus on bolstering domestic manufacturing through various incentives and tariffs.",
  "eli5": "TSMC, a big chip-making company, is going to spend $100 billion to build factories in Arizona. This will help America make more important parts for our computers and phones right here in the U.S. and create lots of new jobs.",
  "keywords": [
    "TSMC",
    "semiconductor",
    "investment",
    "Trump",
    "Arizona",
    "national security",
    "trade",
    "economic policy",
    "AI",
    "manufacturing"
  ],
  "issues": [
    "The impact of tariffs on the global trade economy.",
    "Potential geopolitical concerns with Taiwan's semiconductor industry.",
    "Implications of U.S.-China trade relations.",
    "Limitations on foreign investment incentives."
  ],
  "citations": [],
  "document_type": "Press Release"
}