{
  "title": "Remarks by President Trump at Republican Governors Association Meeting – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump at Republican Governors Association Meeting",
  "og:description": "The National Building Museum Washington, D.C. (February 20, 2025) 7:37 P.M. EST      THE PRESIDENT:  Well, thank you very",
  "og:url": "https://www.whitehouse.gov/remarks/2025/02/remarks-by-president-trump-at-republican-governors-association-meeting/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-20T19:02:01+00:00",
  "article:modified_time": "2025-02-24T19:03:59+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tREMARKS BY PRESIDENT TRUMP AT REPUBLICAN GOVERNORS ASSOCIATION MEETING\t\t\t\t\n\nFebruary 20, 2025\n\nThe National Building Museum\n\nWashington, D.C.\n\n(February 20, 2025)\n\n7:37 P.M. EST\n\n     THE PRESIDENT:  Well, thank you very much.  (Applause.)  That’s such a great song.  It’s hard to cut it off, isn’t it?  You know? \n\n     I want to get you home for the hockey game, I guess.  And we’ll get this done real quick — quickly.  And I want to thank you all.  We have so many great friends here.  A lot of great governors, a lot of talent.  I’m thrilled to be with the Republican governors, and they have done an amazing job, and I look forward to working with each and every one of you as we complete the mission of saving America — they left us a real mess, didn’t they, huh? — and making our country great again.  We’re going to do it.  We’ve made a lot of progress.\n\n     We’re given credit for having the best four weeks that anybody has ever had as an opening, so — (applause).  Now, a few hundred more weeks like this and we’re going to be in great shape. \n\nBut we’ve had a lot of fun doing it too.  It’s a pleasure to do it.  We just ripped down whatever they’ve done.  It’s almost like I want to just do one executive order: Anything he signed is now terminated.  (Laughter and applause.)  It’s easier than, you know, point after point after point.  I sign and sign.  Just do one: Everything he signed is no good.  Because that’s really what, basically, it’s all about.\n\nI especially want to thank the chairman of the Republican Governors Association, Brian Kemp, who is fantastic.  (Applause.)  He was fantastic.  We won Georgia by a lot.  Where is Brian?  We won Georgia by a lot.  Where are you, Brian?  There you are.  And we did a great job together, and I appreciate it.  We won’t forget it.  Thank you, Brian.\n\nAs well as Vice Chairman Greg Gianforte, a friend of mine who has done a fantastic job as governor — (applause) — for organizing this beautiful evening.\n\nIn addition to — hi, Greg.  How you doing?  Good?  You look good.  (Laughs.)  You look good.\n\nIn addition to our fantastic governors, we also have Secretaries Doug Burgum and Chris Wright.  They are very important.  (Applause.)  Where are they?  Where are they?  Doug, you were great on television.  Chris.  These two guys are going to do it.  I tell you, if they get the energy bumping, we’ll get that energy price down, and everything is going to follow.  Everything is going to follow, and we’re going to work very, very hard.\n\nHere’s a gentleman from Virginia that I recognize that we’ve become — (applause) — we almost won that, didn’t we, huh?  We almost won it.  We were just a little bit shy, but I want to thank you for the help.  We did a great job together.\n\nBut another man that’s with us is really unbelievable, and you’re going to be working him very closely: RNC Chairman Michael Whatley.  (Applause.)  And Michael worked with Lara, and the team of him and Lara were pretty unbeatable, I would say.  She was great and had the victory, and she’s solid. \n\nThere was no nepotism either.  Nobody said, “Oh, gee.”  They said, “How did you get her?”  And I said to Michael, “So, who would you like to work with?”  “Well, how about Lara again?”  But Lara came — right after we won, she said, “Now, Dad, I want to go home to my family.”  (Laughs.)  She did a great job, and she just wanted to go back home to the family.\n\nBut what a team that was.  We beat them left and right.  They tried to cheat, but they — (laughs) how many lawyers did you have?  Like, 2,000 lawyers or some crazy number, right?\n\nPARTICIPANT:  Six thousand five hundred.\n\nTHE PRESIDENT:  Six thousand five hundred lawyers.  I would say that’s a lot.  And the reason I picked him is because, with North Carolina, in 2020 — we did so great in 2020.  But the one that just held steady was him with the 601 lawyers at that time.  And I remembered that.  And I said, “That’s the guy, because we’re going to win.”  But we have to keep them from being really bad, being naughty.  They tried. \n\nBut, you know, we had an expression: We got to make it too big to rig.  And that’s what we did.  Too big to rig.  (Applause.)  And it was a great night.\n\nAnd, Michael, thank you.  Great — just a fantastic job.  You’ll be working with these ladies and gentlemen on just keeping — keeping everything, including keeping governor’s seats, I assume.  You’re going to work with them on governor’s seats too, right?\n\nBut there’s no better man than Michael.  Thank you, Michael.  Great job.  Appreciate it.  (Applause.) \n\nAnd we’re gathered tonight at a really exciting time in our nation.  I think it’s going to be a very exciting time.  We have tremendous potential.  I have been called by every company — Brian just told me about a big one that’s going to be moving in in a very big way.  But I have been called by so many big companies that they want to beat the tariffs, and there’s only one way to beat the tariffs.\n\nTariffs, one of the most beautiful words I’ve ever heard.  In fact, I went around saying it’s my favorite word in the dictionary, and I got killed by the fake news media.  They said, “What about God?  What about religion?  What about love?”  I said, “All right.  I give up.  It’s my fourth favorite word.”  (Laughter.)  So, now I say God, religion, love, and then tariffs, number four.  (Laughter and applause.)  And now I’m okay.  I can get away with that.  I couldn’t get away with making it number one, but it’s close.  (Laughter.)\n\nThe American people gave Republicans a historic mandate in November — you remember that, November 5th — what a day that was, huh?  (Applause.)  No — there was no games.  November 5th, 2024, will go down as one of the most important days in the history of our country.  I believe that.\n\nWe won the House.  We won the Senate.  We won the White House.  And, in the presidential race, we won all seven swing states by a lot, and the popular vote by millions and millions of votes for the first time of any Republican in decades.  It’s hard for us to win the popular vote, but it’s not going to be anymore, because we’re a much different Republican Party right now.\n\nWe’re really — nobody can believe what’s happened to this party.  It’s become a big party, really big and powerful party.\n\nWe won 85 percent of all counties in America.  Think of that.  Eighty-five percent.  Have you seen the map?  It’s all red.  There’s a little blue on the outside here and — the outside.  The whole thing is, like, red. \n\nThey won 525 counties compared to us — 2,600 counties.  Think of that.  I don’t know why we only won by millions of votes.  We should have won by a lot more than that.  Maybe it’s because they cheated.  Who knows?\n\nAnd incredibly, all 50 states shifted toward the Republican Party.  That’s never happened before.  It’s the first time ever in history that that’s happened.  All 50 states shifted toward the Republicans — and significantly, in many cases.\n\nMost importantly for this room, we’re pleased to welcome eight new Republican governors.  Could you stand up please?  (Applause.)  Just stand up.  Look at these people.  Oh, I know them.  I know the men.  Good.  Great.  I know every one of them.  (Applause.) \n\nMike Braun of Indiana.  Mike Kehoe of Missouri.  Kelly Ayotte of New Hampshire.  Larry Rhoden — that’s great — Larry Rhoden of South Dakota.  Kelly Armstrong of North Dakota.  Patrick Morrisey of West Virginia.  Jenniffer González-Colón of Puerto Rico.  Nikolao Pula of American Samoa.  (Applause.)\n\nAnd I want to congratulate you all.  You had great races.  You won, generally, pretty easily.  We’re going to win a lot of races. \n\nYou know, in presidential races, they say when you win the presidency, usually the midterms don’t go well.  I think we’re going to do great.  I think we’re going to really increase our margins by a lot. \n\nThat’s why I went to Michael.  I said, “You got to stay.  You can’t go anywhere, Michael.”\n\nBut I can tell you that I did something very different.  Our win was so big and so conclusive presidentially — and we had great help from donors.  We have a lot of great donors in the room tonight, but —\n\nThis is a nice room, by the way.  It’s a very nice place.\n\nBut we did something differently.  I said that — to my people that do the fundraising, I said, “Listen, everyone is so happy.”  Usually, you wait two or three years to go back to the donors.  You know, you let it rest.  You let their wallets cool off a little bit.  But I did it the next morning after we won. (laughter).\n\nI said to Meredith, who may or may not be here — I don’t think she is.  Maybe she is.  She’s great and — but I said to a whole staff of people — I said, “Call everybody and see if they’ll double up.”\n\nNow, we raised a billion six.  They raised $2.7 billion, and they’re running short.  They can’t raise the final 28.  You know, when you lose, it’s very hard to raise money.  But when you win, it’s not so hard. \n\nI said, “See what you can do.  Call everybody and say, ‘Thank you very much.  We appreciate it.  Would you like to make a contribution?’”  (Laughs.)\n\nSo, this was not a good situation, but they fully understood.  They were so happy, they didn’t care. \n\nAnd, Michael, we raised $608 million in three weeks.  Can you believe that?  Six — so we’ve got that money, and I got to spend it somewhere.  And they tell me I’m not allowed to run.  I’m not sure.  Is that true?  I’m not sure.  (Laughter.)\n\nSo, if I can’t spend it on me, I guess that means I’m going to be spending it on some of my friends, right?  A lot of my friends who are going to be running.  (Applause.)\n\nBut think of that.  We raised $608 million.  Isn’t that great?  And I think I’ll keep going.  I’ll just keep bugging them, bugging them, build it up.  But it’s going to be great. \n\nI think we’re going to do fantastically.  I think the midterms are going to be a big surprise.  And it just seems — I don’t know what it is.  You go back to the last, I think, eight elections in a row, the midterms haven’t been great for the person that wins the presidency.  And I think, so far, we’re very popular. \n\nI had an approval rating today of 71 and another one of 69.  (Applause.)  I have not heard of those numbers before. \n\nSo, we’re going to fight very hard, because the better I do, the better you do.  It makes your races a lot easier if we do well, and we’re going to keep doing well.\n\nWith the help of everyone here tonight, the golden age of America has officially begun and the golden age of — just this whole thing — the red states — it’s going to be leading the way to making our country richer and safer and stronger than ever before. \n\nThe red states are going to do good.  And the blue states — I don’t know — maybe they’ll totally disappear off that map.\n\nYou know, they don’t learn, because — you know, like men in women’s sports.  I say we’ve become the party of common sense.  Men in women’s sports is not a winner for them.  But I saw somebody fighting like hell for the fact that a man should partake in women’s sports — a Democrat, a radical left lunatic.  And they’re still going at it.\n\nAnd we shouldn’t really fight them too hard until just about a week or two before the election.  Just let them go.  Don’t convince them not to. \n\nYou know, I’m always saying, “They haven’t learned.”  I don’t want to say that.  Don’t say that.  Let them keep going.  And then about a week before the election, just blast the hell out of them.  (Laughter and applause.)\n\nIt’s like in a race.  You know, you hang in there, and then you just go.  Because there’s no way — open borders with prisoners coming in.  Jails.  Some of the worst murderers in the world. \n\nWe had — one guy killed five people — separately killed five different people.  This is not going to be a great person for our county.\n\nBut we had 11,088 murderers right now.  Some of them have been already brought back.  And you know, when you think about it, transgender everything.  Everybody should be transgender.  These are not things that play very well.  I would say they’re 7 percent issues for them, and they’re over 90 percent for us.  But they keep going. \n\nSo, don’t tell them they’re wrong.  It’s too long.  Two years or four years.  It’s too long.  Let them continue to go and say, “I think it’s a brilliant idea to have open borders, to allow prisons and mental institution people to pour in from all over the world.”  Everywhere.  They came from everywhere. \n\nBut about a week before that election, go crazy.  Just save up your money and explain we can’t live like this.  And they understand it. \n\nEvery day of my administration will be fighting to help your state succeed and prosper.  And together, we’re going to bring back the American dream — something nobody talks about anymore. \n\nIn our last four weeks, our new administration has accomplished more than most administrations do in four years, and the last administration was a negative.  I mean, it was accomplishment — I would say negative 50 percent.  There wasn’t any accomplishment.  There was de-accomplishment. \n\nOn day one, I declared a national emergency on our southern border.  I sent our military to the border to secure the sovereign territory of the United States of America.  We ended catch and release.  We began the largest deportation operation in American history, larger even than that of President Dwight D. Eisenhower.  You know, he was sort of a moderate guy, but he was very strong on the fact he didn’t want people pouring into our country from all over the world.  He was very tough.  He had the record. \n\nWe now have the record.  It’s not a record I’m really proud of.  You don’t like to do that, but we have no choice.  We can’t let it — I mean, they let criminals — many, many criminals — hundreds of thousands, probably millions of criminals.  Twenty-one million people, I believe, is the number.  And of that, millions of people are hard, stone-cold criminals. \n\nIn the past four weeks, illegal border crossings have plummeted by nearly 100 percent, and the tiny number of illegals that do make it across are being apprehended and sent right back to their home, where they belong.  All countries are taking the illegal aliens back — every single one, even though they said, and strongly, “We’re never taking them back.  Don’t even try.”  They said that during the Biden administration.  It didn’t work. \n\nThey’re taking them back.  They have no choice.  They’re taking them back.  They know we’re not playing games.  (Applause.)\n\nYou remember Venezuela saying it: “We’re not taking them back.  Don’t even waste your time.”  They said that to Biden.  He said, “Well, they have us over a barrel.”  They don’t have us over a barrel. \n\nHow about BRICS?  You know, the BRICS states?  There are, like, six of them, and they were trying to destroy our dollar.  They were going to say — you know, they wanted to create a new currency.  They probably wanted to use the yuan, China.  They wanted to use the yuan.  And Biden said, “Well, this is a tough situation.  There’s not much we can do about that.  We can’t help that.”  I said, “Oh, we can help it.”\n\nSo, when I came in, the first thing I said is: Any BRICS state that even mentions the destruction of the dollar will be charged a 150 percent tariff.  And we don’t want your goods.  We don’t want to partake.  (Applause.)  And the BRICS states just broke up.  I don’t know what the hell happened to them.  We haven’t heard from the BRICS states lately.\n\nBut he said that wasn’t much we could do about it.  There was a lot.  It took once — literally.  They said, “Sir, what about the BRICS states?  They’re going to take over the dollar, the sanctity of the dollar.  They’re going to create a new currency to rule the world.”  I said, “No, they’re not.”  They said, “Yes, they are, sir.  They said it.”  I said, “No, they’re not.  Tell them 150 percent tariff, plus we’re not going to do business with them, and that includes China.”\n\nAnd all of a sudden, they went to the BRICS states, and they said, “Could I ask you, how do you feel about the” — “I have no comment on this.  I don’t know what you’re even talking about.”  It was an amazing turnaround. \n\nNo, we’re not playing games. \n\nJust this week, I officially designated the drug cartels as foreign terrorist organizations, including Tren de Aragua and MS-13, which gives us great power.  (Applause.)\n\nAnd to facilitate the rapid deportation of the worst criminals that we have anywhere in the world, we’ve also opened the full capacity of the detention facility at Guantanamo Bay.  You know, people don’t realize that thing was built — you know, we hear about a few prisoners, and they do have maximum security, but it holds — actually, it was built for thousands and thousands of people, and we’re using that prior to bringing back to their country. \n\nWe use it for the bad ones, the really bad ones.  And in some cases, they’re so bad, we don’t want them to go back to the country.  We want to watch them, because they’ll be able — if they do sneak in, we don’t want that.  We don’t want them anywhere near our country. \n\nIn addition, we’re waging war on Joe Biden’s inflation disaster, the worst inflation probably in our history.  They say 48 years, which isn’t bad, but probably in our history.  And to bring down the price of energy, I declared a national energy emergency.  It’s going to be an emergency.  (Applause.)  And you know what our — what we say and what Doug is going to do — Doug, you are so important, you and Chris. \n\nYou know, Chris is known — and I got this from Doug — as the best energy guy in the entire country.  And people were shocked that he wanted to do this.  He gave up something tremendous.  He was the biggest guy.  There was nobody bigger, nobody better than Chris Wright.  (Applause.)\n\nIs Chris Wright here?  Is he here?  Where is he?  This guy is — and this is from Doug. I said, “Doug, I want to make you the Energy czar.”  And he said, “Sir, there’s one man that blows me away.”  Right, Doug?  He said, “His name is Chris Wright.  He’s much better.”  I said, “I want to see this man,” and I met him.  And I just agreed immediately that he was far superior to Doug.  I’m only kidding.  (Laughter.)\n\nSo, what I did — we have a weird deal.  You know, we have the Department of Energy and the Department of the Interior, and Interior has all of the energy.  And Doug has none of the energy, but he’s got — Chris has none of the energy, but he got a hell of a good title.  But we want the guy with the energy to be able to drill, so we sort of merged them.  And they’re friends and everything else, and they’ve got a thing going on.  I think it’s going to set records like nobody’s ever seen before. \n\nSo, we have the man that controls the energy, we have the man that drills the energy, and now we’ve put them together, and you’re going to see some action.  (Applause.)  You’re going to see something come way down. \n\nSo, thank you.  And thank you, Doug.  You were really a terrific — he was a great governor, by the way.  A couple of you may know him slightly.  But he was a great governor.  Did a fantastic job. \n\nYou know, he made a lot of money in the technology business.  Sold to Microsoft for a lot of money.  I won’t tell you how much.  I don’t want to embarrass him.  Some people would say it’s a lot.  Some people would say it wasn’t that much, right?  (Laughter.)  But, you know, when you get close to a billion dollars, that’s pretty good. \n\nAnd he didn’t know much about energy.  When he became governor, he became one of the great experts of energy anywhere.  We did unbelievable — really, an unbelievable job with the state.  He did like me: He did well in business, and then he said, “Let’s run for politics.”  And he did, and they love him in the state.  But he was term-limited, and I watched him running.  It was running against me, but I still liked him.  (Laughter.)  And I said, “That guy’s got real talent,” and he was one of the first people I called. \n\nSo, you’re doing a great job, and thank you for giving us — for leading us to Chris.  (Applause.)  I’ll give you a bigger thank you in two years if Chris is as good as you say.  Okay?  (Laughter.)  But I know he’s going to be. \n\nThanks a lot, Chris.  Good.  Go out there. \n\nIf we can bring energy down, everything’s coming down.  You know, the eggs are coming down, and the bacon is coming down.  Everything is coming down.  And that’s the biggest thing, the energy.  So, those two guys are very important.\n\nTo cut through the red tape, I’ve established a National Energy Dominance Council chaired by your former colleague, Secretary Burgum.  He’s going to do a fantastic job.  We’re putting incredible people on it. \n\nI withdrew from the one-sided and very expensive Paris Climate Accord.  It’s a one-way street.  (Applause.)  You know, under that accord, we pay $1 trillion.  Think of it.  We pay a trillion dollars.  They pay nothing.  China doesn’t pay anything.  India doesn’t pay anything.  Russia doesn’t pay.  We just pay everybody. \n\nIt’s like a health organization, and every one of the — every deal is no good, but we’re changing it.  We terminated health — you know, on the world health, we paid a hundred — we paid $500 million a year, and China paid $39 million a year.  I said, “That doesn’t sound good.”  They have 1.4 billion people, and we have — nobody knows what the hell our number is, because so many people pour into our country.  We used to say, like, 325.  I have no idea.  We’ll figure it out eventually.  But let’s put it this way: It should be substantially less than 1.4. \n\nBut we have — let’s say we have 325 million.  They have 1.4.  We’re paying $500 million.  And these aren’t — I mean, relative to government, these aren’t huge numbers, but this is an example of what happens when you have bad government, when you have incompetent people. \n\nSo, I would explain this, and they called me, and they said, “We’ll let you in for the same $39 million.”  I said, “Well, we should be much less than 39.  We should be” — but I didn’t even want to do that, because I’m not going to talk — I said, “I’ll think about it.”  And it was very public.  And when Biden came in, he agreed to go back in to the World Health for $500 million.  He could have gotten — I mean, it’s a lot of money.  You could have gotten it for $39 million, Joe.  That’s why you’re not president any longer, I guess.  (Laughter and applause.) \n\nNo, he could have had it for 39.  They were standing there, “We’re going to” — it was very public.  But he went in — he took the $500 million instead, because he never laid in bed at night, sweating, tossing and turning, like half of these governors — not all of them, probably, but half of them.  They’re sweating, “How are we going to do a great job?”  He never did that. \n\nBut that’s just a case study in, you know, how not to run.  Because, you know, if we — if we had people at that level that would have negotiated — I bought a plane.  It’s really two planes.  Air Force One.  Now, if Boeing would build a damn thing, it would be nice too.  We don’t build like we used to.  We don’t build too fast.  I gave the order out about six years ago.  They’re still waiting.  Getting a little tired of it. \n\nI gave a fixed-price deal, but it was $5.7 billion.  I negotiated with Boeing.  It took about two months, and I got the 5.7 down to $4 billion.  Actually, one penny less than 4.  I said, “It has to have a three on it.”  And he said, “You want from 5.7 to 3?”  And I said, “Yeah, three on it, meaning it has to start with a three.”  And after about two months of saying, “No, no, no, no, it has to have a three.  It has to have a three,” he called up.  He said, “Sir, 3 bil-“ — what I want, and this is what happened: $3,999,999,999.99.  One penny less.  (Laughter.)  I said, “You have a deal.”  But we saved $1.7 billion just by negotiating. \n\nAnd in all fairness, mostly, you can do that.  And some of you do do it.  Some of you do.  You know, you have surplus states.  You have incredible states, and you have to do that, because every time somebody sends you a bill, they expect to be negotiated.  And in the past administration — and sometimes, I guess, in this, it happens, because people don’t care. \n\nYou know, Elon talks about caring.  Caring is very important.  And they have to care.  If they care, they say, “No, no, I’ll pay you” — they’ll send you a bill for $10,000, and you say, “Nope, I’ll give you five.”  And they’ll say, “No way, no way, no way,” and you’ll end up paying six or seven or something.  But all you have to do is care a little bit and try and get it down. \n\nAnd literally, every contract.  I think, there’s not a contract that’s sent in government that I couldn’t — and that many of you couldn’t cut and cut very substantially.  And boy, what a difference it would make for the government. \n\nI terminated the Green New Scam, one of the great scams in the history of our country.  I canceled Joe Biden’s insane electric vehicle mandate, saving our auto industry from destruction.  (Applause.)  That was an easy one.  And all of this helps to combat inflation and bring down costs. \n\nWe’re bringing down costs way down.  We’re going to bring up jobs like you haven’t seen because the companies pouring in.  And we’re going to have announcements over the next three, four weeks that you’re not going to believe from some of the biggest companies in the world.  And the numbers are staggering: hundreds of billions of dollars of investment, hundreds and hundreds — trillions of dollars, when you add it up. \n\nTo slash hundreds of billions of dollars in waste and fraud, we’re talking about also — and abuse — I’ve created, as you possibly have read just a little bit, the Department of Government Efficiency.  (Applause.) And here are just some of the things that we’ve paid, and we’ve stopped, and we’ve gotten the money back.      $520 million for a consultant to do ESG — that’s environmental, social, and governance investments — in Africa — $525 million. \n\n$25 million to promote biodiversity, conservation, and social responsibility behavior in Colombia. \n\n$40 million to improve the social and economic inclusion of sedentary migrants.  Nobody even knows what the hell it means.  (Laughter.) \n\n$42 million for social and behavioral change in Uganda. \n\n$10 million for Mozambique medical male circumcision.  We’re doing circumcisions in Mozambique to the tune of approximately $12 million. \n\n$14 million for improving public procurement in Serbia.\n\n$486 million to the Consortium for Elections and Political Process Strengthening, including $22 million for inclusive and participatory political process in Moldova and $21 million for voter turnout in India.  Why are we caring about India turnout?  We got enough problems.  We want our own turnout, don’t we?  Can you imagine, all that money going to India?  I wonder what they think when they get it. \n\nNow, it’s a kickback scheme.  You know, it’s not like they get it and they spend — they kick it back to the people that send it, I would say, in many cases — many of these cases.  Anytime you have no idea what we’re talking about, that means there’s a kickback, because nobody has any idea what’s going on here. \n\n$29 million to strengthen the political landscape in Bangladesh.  Nobody knows what they mean by “political landscape.”  What does that mean?\n\n$20 million for fiscal federalism and $19 million for biodiversity in Nepal. \n\n$47 million for improving learning outcomes in Asia.  What the hell do I care about?  We got a lot.  We got enough problems.\n\nAnd all of this is terminated.  We terminated this stuff, and we’re on the track.  And, by the way, so many others I could have — I could — I could read all night long.  But so many were so terrible, and some — some were actually disgusting.  And I know you’re eating your dinner, so I didn’t want to do that.  (Laughter.)\n\nBut we’re draining the swamp.  And, you know, one of them was $100 million for condoms for Hamas.  You heard about that.  Fifty and fifty.  It’s $50 million, and then they decided they needed more condoms, so they sent another $50 million.  So, it’s $100 million — condoms for Hamas. \n\nBut now that’s the good stuff.  Here’s even worse: Social Security.  As you know, generally speaking, people don’t live to be over 100 years old.  We all will, I think — 120, 130, hopefully.  But, you know, you hate — when you get near that number, it’s like, “Let’s hope we can live to length like this.”   But here’s what we’re finding and what we found, and these were all found by these computer geniuses. \n\nI asked Elon, “What trait do these have?”  You know, they started off with 12 guys, then they had 30 guys, then they had 57 guys.  Now they have over 100 guys.  And he attracts very young people with high IQs.  You know?  Some people attract very beautiful people.  I think I like them better, actually.  (Laughter.)  But he attracts young people that are brilliant, and they love the country too. \n\nBut I said, “What trait do they really have?”  And the trait that they really have was that they’re extraordinary with computers.  They can take them — he said, “They make love to their computer.”  I said, “I don’t want to hear about that.  Doesn’t sound too” — (laughter).  He said, “They can take apart the most complex computer instruments and — and literally put them back blindfolded.”  \n\nSo, when they go into some guy that’s ripping off the country by doing some of the things you’ve just heard or what you’re going to hear, they can’t be bullshitted.  You know?  They can’t say, “Oh, gee, there was a mistake.  There was a big mistake.” \n\nAnd we’re finding hundreds of billions of dollars’ worth of fraud, waste, and abuse.  But I think fraud will be the number one as we see. \n\nBut listen to this.  On the program, there are 4.7 million Social Security members who go and live from 100 to 109.  Well, I’ll tell you, I know some people that are close to 100.  I know one or two that got over that mark.  But you get — you don’t have millions. \n\n3.6 million people from age 110 to age 119.  3.47 million people from age 120 to 129.  In other words, 120 to 129 years old, millions of people — millions.  3.9 million people from age 130 to 139, which is pretty amazing, because the longest-living person ever on record — and they’re not sure it was correct — was a woman from a very faraway place lived to 127 years old.  She was a healthy specimen.  (Laughter.)  But she lived to 127.\n\n3.5 million people from age 140 to 149.  So, we have 140-year-old people, plus.  Millions of them.  1.3 million people live to over 150 years of age — 150 to 159, to be exact.  Over 130,000 people over the age of 160 years old, including 1,039 people between the ages of 220 to 229.  (Laughter.)      And we’re going to be investigating this fraud.  The — actually, we had one person at — who was 361 years old.  (Laughter.)  And what we’re doing now is we’re finding how many of these people were paid.  So, we have millions of people — could be well over 100 million people on our Social Security rolls. \n\nSo, the good news is, when we take them off, whether they were paid or not, it looks like our Social Security could be really solid.  It could be a lot better than we thought, if you think about it.  (Applause.)\n\nAnd I’m going to do something — I’m actually going on this one.  You know, all my life I’ve heard about Fort Knox.  That’s where the gold is kept, right?  I heard, “Fort Knox.  Oh, ho, ho.”  But, you know, we’re getting a little bit shaky.  We’re getting the yips on this stuff.  Like, I want to find out. \n\nSo, we’re going to open up the doors.  I’m going to see if we have gold there.  We want to find out: Did anybody steal the gold in Fort Knox?  It’s a pretty amazing place.\n\nBut I’m going to actually go.  We’re going to open the doors.  We’re going to inspect Fort Knox.  We want to make sure that we actually have, you know, 400 tons of gold or whatever the hell it is.  (Applause.)  It’s a lot of gold.  I don’t want to open it and the cupboards are bare.  Could happen.\n\nIf you look at some of the things — oh, by the way, wait until we go into the Education Department.  We haven’t even done that.  So, we — we could find as much as $1.5 trillion worth of waste, fraud, and abuse.  If we do that, we can balance budgets.  We can do a lot of other things, especially when you couple it with the massive amounts of tariffs that are coming in.     Already, you know, just with what we are charging — I won’t mention the country because I don’t want to anger people that like me, and I like them very much.  But we’re finding at least $60 billion a year in one country alone.  And I haven’t even started, it’s just a very small portion that I’ve, you know, attached to them. \n\nSo, I got a call from Congress.  They said, “You know, a lot of money is coming in from these tariffs,” and they’re starting to change their whole thing. \n\nSo, if you can add the tariffs — and this is numbers that — I don’t want to say it, because then they’ll say, “He didn’t produce.”  But you could wipe out your income tax.  You could maybe not even have an income tax system when this thing works out.  (Applause.)  Because in the old days, that’s what happened. \n\nYou know, our country was the richest ever from 1870 to 1913.  That’s when we were actually the richest, and we were a full tariff country.\n\nMcKinley — and I just — by the way, I just renamed Mount McKinley “Mount McKinley.”  I hope you’re happy about that.  (Applause.)  But McKinley was a president.  He was a tariff guy, and he believed that countries should not be allowed to come in and plunder.  He would see — he had beautiful language on tariffs.  Plunder our wealth, plunder our jobs, steal our companies, and take without paying a very fair price. \n\nAnd he said — and that price should be more than fair.  It should be high, because what they do is they hurt our country.  And we became very rich.  He was assassinated.  And, as you know, Roosevelt took over — Teddy.  And he spent money on parks and on dams and on everything.  I mean, you know — but he really spent a lot of the money — McKinley never got the credit — but he spent a lot of the money that McKinley made.\n\nBut it was the richest we ever were in the 1800s, early 1900s.  And then, in 1913, we went to the income tax system.  And to be honest, we did fine, but we were never like we were.  They formed the tariff commission of 1887, and it was a commission of people like you.  Blue bloods.  Are you blue bloods?  There are a couple in — about three of them over here.  But blue bloods. \n\nBut it was a commission, and it was set up for the sole purpose of — we have so much money.  This is in the United States.  We don’t know — we had no debt.  We had no nothing.  We had massive amounts of money.  The commission was set up to determine where we should spend our money.  Where do we spend it?  Got so much. \n\nCan you imagine?  Wouldn’t that be nice?  Now look at what they’re doing.  But this is money we have to borrow where they’re doing it.  But we’re going to find out that this money went to people and it got kicked back.  You’re going to find out a lot of that.  But we’ll catch it all. \n\nWe’ve launched the largest deregulation campaign in our country’s history.  (Applause.)   For every 1 new regulation, I’ve directed that 10 old regulations must be eliminated. \n\nAnd I will say, in my first term, we did more deregulation than any president in history, by far.  Not even close.\n\nWith Republicans in Congress, we’re also racing to pass the largest tax cuts in American history.  We’re looking to — we brought it down from 41 percent — much higher, if you add the state things — but 41 percent to 21 percent, which people said was impossible.  And now I’m trying to bring it down to 15 percent.\n\nSo, it’ll go from 21 to 15, but only if you make your product in the United States of America.  Otherwise, you pay 21 percent.  (Applause.)  That would be great.\n\nTo protect American auto workers, which — who, by the way, they’re going to be one of the biggest beneficiaries of what we’re doing with tariffs — because they just stopped two big auto plants in the middle of construction from being built in Mexico because they see — when I got elected, they saw, “Oh, this is going to be a problem for us.”  Because we have big tariffs going on, and we have tariffs going on autos.\n\nAnd they don’t have to pay any tariffs.  There is no tariff.  All you have to do is build your plant in the United States.  They were building plants in Mexico, right opposite the border.  They’re making them in Mexico.  They’re selling them into the United States with virtually no tax.  And they’re killing all our — Detroit — all these places are being killed.  Now it’s the exact opposite. \n\nAnd by the way, Canada was a big participant in that too.  And I think Canada — you know, they’re going to have to pay tariffs on automobiles, lumber, and oil and gas, et cetera, et cetera.  And they get 95 percent of their product from the United States.  I think they have to become the 51st state. \n\nAnd you heard the people booing the national anthem, but I think, ultimately, they’ll be praising the national anthem.  We’ll have to work out some deal — because I do like the “O Canada.”  Right?  It’s a beautiful thing.  I think we’re going to have to keep it for the 51st state. \n\nI call him Governor Trudeau.  I said, “Governor Trudeau is doing a wonderful job.”  I think it’s actually cost him his election, if you want to know the truth.\n\nBut we’re going to — we’re going to see about that.  We’re looking at Greenland, and we have to take back the Panama Canal, because that wasn’t the deal.  (Applause.) \n\nWe gave the Panama Canal to Panama.  It was the most expensive thing ever built in our country.  It would be the equivalent of $2 trillion today.  We spent massive amounts.  We lost 38,000 lives from the mosquito and snakes.  A lot of bad snake bites, but mostly the mosquitoes.  They — malaria — they killed 38,000 of our people. \n\nThey paid laborers five times what they were getting in the United States to go, knowing that there was a good chance they were going to die.  Twenty percent of them died. \n\nAnd Jimmy Carter, may he rest in peace — the late, great Jimmy Carter — gave it away for $1. \n\nIt’s also the most profitable thing ever built.  You know, it’s — what you hear about casinos and you hear about all this stuff — they’re peanuts compared to this.  It’s very — it’s the most profitable thing ever built. \n\nThere’s never been anything — I mean, you have ships lined up.  And by the way, when they gave it away — they gave it away like a bunch of dummies for $1.  The day after they took over, they raised the price per ship by four times.  That wasn’t high enough.  There was no — no problem.  They raised it again twice.  And they’re getting almost a million dollars a ship. \n\nAnd their product is water.  It’s Pacific and Atlantic, where they meet.  And one is about 18 feet higher than the other, which a lot of people don’t know.  Actually, it’s one of the great marvels of the world. \n\nWell, we built it.  And we’re not going to let — because China has essentially taken it over.  We’re not going to let that happen.  China knows it, and so does Panama. \n\nTo protect American workers and bring billions of dollars into our treasury, we’re in the process of imposing reciprocal tariffs on any nation that tries to cheat us or steal our jobs. \n\nSo, India, as an example, has very, very high tariffs, and I was going to impose a flat tariff, but that wouldn’t really do the trick, because some of the countries have really high tariffs. \n\nSo, it really works out much better.  Nobody can even fight it.  Whatever they charge us, we charge them.  So, if they’re at 25 percent, we are 25.  If they’re at 75, we’re at —\n\nWhatever they charge us — and it was very interesting.  The European Union — you know, we were at 2.5 percent for cars.  European Union was much higher.  They just reduced their tariffs on cars to 2.5 to be reciprocal with ours.  So, that’s just an early sign.  But I think that’s going to happen. \n\nAnd then some will — some will want to fight us a little bit, but it doesn’t matter.  They’re reciprocal.  And even the press says, “Oh, I see.”  Well, they don’t fight us. \n\nYou know, if I put a flat tariff on, like, 25, 30 percent, even if it was lower than we would have gotten, if we put a flat tariff on, the press would have gone crazy.  “We — that’s terrible.”  Even if somebody was paying, like, five times more, charging us five times more.\n\nWhen you say reciprocal — I said it the other day to the failing New York Times.  I said, “Listen, whatever they charge us, we charge them.”  They go, “Well, that sounds fair.”  It truly does, doesn’t it?  (Laughter.)\n\nSo, it’s a reciprocal tariff.  Whatever they charge us.\n\nI’ve ended Joe Biden’s weaponization of our government and removed his handpicked radical-left, Marxist prosecutors from the Department of Justice.  (Applause.)  We have a great attorney general: Pam.\n\nI immediately halted all government censorship and brought back free speech in America.  I signed an executive order to end all of the lawless diversity, equity, and inclusion policies across the entire federal government and private sector.  (Applause.)\n\nDo you see how much it costs?  One company said they’re going out of that business and they’re going to write off $229 million.  The — how do you spend that much money to convince people that they should have transgender operations and various and sundry other things that we don’t like to talk about? \n\nIt’s crazy the amount of money that was — it was almost like a — just a mind-blower what they were doing.  It was terrible and all over. \n\nAnd by the way, our military is now free of that.  Anybody that even tries it, they’re gone.  I signed really historic orders to get critical race theory and transgender ideology out of the schools and out of our military.  It’s all going out.  It’s no longer.  (Applause.)\n\nAnd I heard men are still playing in Maine.  Is anybody here from Maine?  Ah.  Who is that?  Is that the governor?  (Laughs.)  That’s — well, I hate to tell you this, but we’re not going to give them any federal money.  They are still saying we want men to play in women’s sports, and I cannot believe that they’re doing that.  They are — (inaudible) find out who that guy is that raised his hand.  Maybe he’s just kidding.  (Laughter.)\n\nBut — so, we’re not going to give them any federal funding — none whatsoever — until they clean that up.      And the other one, we has — have a fight with one news organization: AP, a radical-left organization.  Treats us all very badly.  And they refuse to acknowledge that the Gulf — former — of Mexico is now called the Gulf of America.  (Applause.) \n\nSo, we just hold them — we’re holding them — we’re holding them out of our — any news conferences.  Now, I’m sure they’ll get sued, and maybe they’ll win.  It doesn’t matter.  It’s just something that we feel strongly about.\n\nNo, and I said we changed Mount McKinley.  Nobody is fighting that.  You’re allowed to do it — what we’re allowed to do.  And most of the shoreline is — you know, 85 percent of it is on our soil, but I thought it would be appropriate. \n\nI never understood, quite, the Gulf of Mexico when it really covers us far more.  And I think Doug is a big believer in what we did — the Gulf of America. \n\nSo, we’re having a little dispute, but only one.  But Google Maps has already changed.  Almost everybody has already changed.  It’s called the Gulf of America.  (Applause.)\n\nAnd earlier this month, I signed an order banning men from women’s sports.  (Applause.)  And that’s why, when somebody wants to do that — when somebody wants to do that — and even the NCAA has already complied.  And they have sent us a letter.  They have fully complied with that. \n\nI also proudly banned the use of puberty blockers, hormone injections — you believe this? — and other chemical and surgical mutilations of all minor youth.  Do you believe you have to say that?  I mean, it’s terrible. \n\nWho would believe that we were talking about even these things.  Men playing in — 10 years ago, 15 years ago, can you imagine?  People would say, “Is he crazy, talking about this?”\n\nAnd they’re still fighting us, but let them fight.  As I said, we’re going to make universal school choice a very big, strong thing.  School choice.  (Applause.)  And we’re working very, very hard to send these schools and education back to the states where they can be properly run.  (Applause.)  In other words, this really affects the people in this room. \n\nBut you’re going to be running your schools, and who can do worse?  Look, they rate them in the top 40.  So, we just came out with one that we were number 40, but we were number 1 in cost per pupil. \n\nAnd, I mean, I know a lot of the governors in this room.  You run a great state, and you’ll do great with education at a much lower price — we’re going to give you whatever you need — but at a much lower price.\n\nWe have people in Washington, D.C., that, in all fairness, in many cases, don’t give a damn about your pupils or your students or your states.  And they’re running everything, and they’re running it into the ground.  \n\nSo, it came out we’re last in education but first in cost per pupil.  Norway; Denmark; Sweden; I have to tell you, China; and a few others are always in the top five.  And I really believe that 35 or 36 states and all of you are here — almost all of you here representing those states, I think you’re going to have education that’s every bit as good as Norway and Denmark and Sweden and all of them. \n\nAnd then we’ll have some laggards.  And you know who the laggards are going to be.  You just have to look at everything else. \n\nBut in everything we do, we’re putting America first, because the Republican Party is now known as the party of common sense.  It’s the party of common sense.  Very important.  I think it’s a very important phrase for you to use.  It’s all about common sense.  We’re conservative, and, you know, we’re a lot of things, but most important thing is we have to use common sense. \n\nThanks in part to the hard work of the people in this room, we’re forging a new political majority that is shattering and replacing Franklin Roosevelt’s New Deal coalition, which dominated American politics for nearly 100 years. \n\nUnder our leadership, the Republican Party has become the proud voice of hardworking citizens of every race, religion, color, and creed.  We are a much bigger, much more powerful party.  Now is the time for us all to press forward, think big, be bold, and deliver the once-in-a-lifetime reforms our citizens need and really deserve. \n\nThey’ve gone through hell for four years.  Some of them don’t even know it.  They’ve just been led down a path.  They don’t even know what they’ve gone through. \n\nAs one team, we can make our borders stronger, our communities safer, our schools better, our families happier, our citizens wealthier, and our country freer, freer, freer and more exceptional than ever before. \n\nWe will work together, and we will absolutely, without question, make America great again. \n\nGod bless you all.  And do a great job.  And go home and watch the hockey game.  It should be interesting.  (Applause.)\n\nThank you all very much.  Thank you very much.  Thank you.  (Applause.)\n\nThank you.  Thank you, Brian.  Thank you.  Thank you. (Applause.)     Thanks.\n\n                              END                    8:25 P.M. EST\n",
  "summary": "On February 20, 2025, President Trump addressed the Republican Governors Association meeting at the National Building Museum in Washington, D.C., highlighting the achievements and future plans of his administration. He praised the accomplishments of the Republican governors and discussed various policy initiatives, including the designation of drug cartels as terrorist organizations, reforms in energy policy, and significant deregulation efforts. Trump emphasized the administration's focus on immigration control, economic growth through tariffs, and a renewed commitment to conservative values.\n\nPresident Trump also expressed his intention to conduct audits on various government programs to eliminate fraud and abuse, citing examples of extravagant and wasteful spending discovered under previous administrations. He mentioned several proposed legislative actions, such as significant tax cuts, tariffs on imported goods to protect American workers, and the reallocation of educational control to state governments. The meeting also served as a platform to celebrate Republican electoral successes and outline strategies for future political campaigns.\n\nDuring the address, Trump reiterated his commitment to foundational American ideals, such as free speech and the traditional values of the Republican Party. The speech was punctuated with anecdotes and references to policies from his previous administration, illustrating his continued dedication to reshaping American domestic and foreign policies in favor of economic nationalism and conservative principles.",
  "eli5": "President Trump spoke to a group of important Republican leaders about making America better. He talked about new plans to keep the country safe, make jobs, and save money by stopping waste. He wants to make sure everyone follows the rules and believes America can be strong again if everyone works together.",
  "keywords": [
    "Republican Governors Association",
    "Trump administration",
    "immigration",
    "tariffs",
    "energy policy",
    "deregulation",
    "tax cuts",
    "economic growth",
    "conservative values"
  ],
  "issues": [
    "Verification of claims regarding Social Security fraud",
    "Feasibility of tariff policies on economic balance",
    "Impact of immigration policy decisions",
    "Potential bias in depiction of previous administration"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}