{
  "title": "Remarks by President Trump and Vice President Vance at Starlight Ball – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump and Vice President Vance at Starlight Ball – The White House",
  "og:description": "Union StationWashington, D.C.   12:17 A.M. EST      THE VICE PRESIDENT:  How we doing?  (Applause.)  Isn't it a",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-and-vice-president-vance-at-starlight-ball/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T18:35:03+00:00",
  "article:modified_time": "2025-01-23T18:36:30+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tRemarks by President Trump and Vice President Vance at Starlight Ball\t\t\t\t\n\nJanuary 21, 2025\n\nUnion StationWashington, D.C.\n\n12:17 A.M. EST     THE VICE PRESIDENT:  How we doing?  (Applause.)  Isn’t it a great day to make the 45th president of the United States the 47th president of the United States?  (Applause.)Just say, first of all, thank you to all of you for your support, for your kindness, for your friendship, for believing enough in this country to fight for it and make Donald J. Trump the president America needs at this moment in time.  (Applause.)We love you, and we’re grateful to you. And, second, I want to thank the president for his trust that he’s placed in me but, most importantly, for the willingness to sacrifice, to serve, to fight through all — let’s be honest and call it what it is — fight through all of the lies and the bullshit to serve the American people.  (Applause.)So, I want to introduce the 45th and 47th president of the United States.  And we are lucky to have him.God bless you all.  (Applause.)THE PRESIDENT:  Well, thank you very much, JD.  And it’s great to have you all.  And, by the way, JD is doing a great job.  You know that.  We picked — we picked the right person.  (Applause.)But I especially want to thank the people in this room.  You know, many of you are donors.  Some of you are large donors.  You believed in us very early.  Some of you believed in us from 2015.  (Applause.)  But you believed in us — there’s a lot of people out there. And — and 2016 was a great year.  And then we did much better in 2020, much — we got 10 or 12 million more votes.  And I don’t know what happened, but I knew — I said, “We’re doing this again.  We’re going to make it too big to rig.”  And that’s what happened.We had the best numbers anyone has ever seen in the history of the Republican Party, actually.  Got the biggest vote in the history of the Republican Party and I guess in most of the history of the Democrat Party too, because we won in a landslide.  We won the seven swing states, and we won the popular vote.  It’s nice to be popular.  It’s very nice to be popular.  (Applause.)  And we won it — we won it by millions of votes.So, I just want to thank everybody, because this really is a very special room.  And this is the one we chose to come to last.  That’s supposed to be a good thing, and it is a good thing, because we have so many friends in the crowd but, really, friends that supported us.We had a — an incredible day today at the inauguration, and I’ve gotten good reviews on the speech.  You know, they made me take some of the rather difficult things — Melania said to me, “You know, you could do without a couple of those paragraphs.”  (Laughter.)  And we listened, and we listened to some others.We have some tremendous professionals.  Susie Wiles is doing a fantastic job.  (Applause.)  (Inaudible.)And we had great people — great people on the campaign.  The campaign was so beautiful.  That last 120 days, I didn’t sleep one night.  I mean, literally, we just kept going, going, going — no days off, no vacation days.  And we kept hearing the other side was going to take a couple of days off during the week. I remember there were 14 days, then 17 days, and I heard that our opponent was going to take about 5 days off.  I said, “How do you do that when you’re going for the big one?”  (Laughter.) But we worked very hard.  And I really think we outworked them, but we also out-thought them.  Work is wonderful, but you have to be able to think. And now we have the job of bringing our country back because we have the embarrassment of having other countries dumping prisoners and mental institution patients into our country with a stupid open border. As you know, the border was closed at exactly 1:05 in the afternoon today.  (Applause.)  And I don’t mean closed; I mean really closed.  It’s closed.And we’re going to — we have no choice.  It’s not that I want to do this.  Dwight Eisenhower, a very moderate president, has the record.  He just couldn’t stand when people poured into the country.  He has the record for getting people out that shouldn’t be here.  And, you know, we’re going to far exceed that — not that I want to brag about it, because I hate having to do it. They should have never done this to our country.  They should have never let this happen.  You know that this is happening with countries all over the world, and you know their crime rates are going down by 10 and 15 and 20 percent every six months?  Venezuela, their crime rate is down by 74.2 percent because they took their street criminals, their prisoners, and their mental patients, and they brought them into the United States of America.  Who the hell can think that’s a good thing?  But we’re getting them out, and we’re strengthening everything we have. We have something that nobody else has.  We have more liquid gold under our feet than any other country in the world.  (Applause.)  And if you don’t mind — now, if you do mind, I will not do it — if you don’t mind, we’re going to use it.  We’re going to use it.And — and through a system of good deals and renegotiating all of these terrible deals — we made some good — really good ones in 2016, but some of the best ones we made were terminated by this Biden administration and gave them back everything they wanted, these other countries, even if they’re allies. And we have some allies from countries right in this room — big, big people in countries.  So, I hate to embarrass them, but some of our allies are really — they treat us worse than the enemies on trade.  We’re not going to let that happen. So, we’re going to do things that really started three months ago.  We won the election, and that was a big, big — November 5th, that was a big day.  And I want to make that the most consequential election in the history of our country.  It’s going to be the most consequential.We’re going to turn it around very fast.  It’s a big, big ship, but we’re turning it as fast as a big ship can be turned.  And we’re going to make America great again.  (Applause.)And I just want to thank everybody in — in this large room, because it’s packed.  And the beautiful thing is we have two other rooms that are massive, and you couldn’t get in.  No matter what you did, you couldn’t get in.  And it’s just a great tribute to everybody here and to the people on stage.My family has been so great.  Everyone in this — on this floor.Did — has anybody ever heard of Eric Trump?  (Applause.)  He’s got more subpoenas than anybody in the history of the United States.  (Laughter.)  They were after their political opponent.  How did that work out?  Not so good.They got us a lot of votes.  Can you believe it?  That’s the first time that’s ever happened, actually. But I just want to thank everybody very much, and I want to thank our first lady.  People love our first lady.  (Applause.)  And she’s done a fantastic job.And we’re going to have a tremendous four years, and hopefully it’s going to go long beyond four years.  We have some tremendous talent, including this guy right here.  Hopefully, it’s going to go long beyond four years. So, again, I want to thank you for your confidence.  I want to especially thank those people — JD — that were here in 2015 before I really started.  And there’s a lot of them in the room, and they just stuck.  And they said, “We got to do it again, sir.  We got to do it again.”  And we did it again, and we won in record fashion.  So, it was a landslide.  It was a mandate like nobody has had before. So, thank you all very much.  We love you all.  And we’re going to do a real job for you.  Thank you.  Thank you very much, everybody.  (Applause.)                         END                    12:24 A.M. EST\n",
  "summary": "On January 21, 2025, at Union Station in Washington D.C., President Donald Trump and Vice President JD Vance addressed supporters at the Starlight Ball following Trump's inauguration as the 47th President of the United States. The event featured both leaders expressing gratitude towards their supporters, with a focus on the electoral victory, past achievements, and future plans for the administration. Trump highlighted the support he received over the years and detailed strategies for dealing with immigration, the economy, and international relations.\n\nVice President Vance emphasized Trump's return to the presidency and acknowledged the challenges they faced during the election campaign. President Trump discussed policy measures like closing the U.S. border and capitalizing on the country's natural resources. He also spoke about renegotiating international trade deals and addressing what he described as past administrative failures. The event culminated in expressions of appreciation towards long-time supporters and emphasized the administration's commitment to delivering results over the next four years.",
  "eli5": "President Trump and Vice President Vance gave speeches at a big party to celebrate Trump becoming president again. They thanked people for helping them win. They talked about their plans to protect the country and make it better by working hard and fixing problems.",
  "keywords": [
    "President Trump",
    "Vice President JD Vance",
    "Inauguration",
    "2025",
    "Starlight Ball",
    "Washington D.C.",
    "Immigration",
    "Economy",
    "International Relations",
    "Supporters"
  ],
  "issues": [
    "Potential bias in representation of electoral victory",
    "Accuracy of claims regarding immigration policy impacts",
    "Verification of crime rate claims in other countries",
    "Details on international trade deal strategies"
  ],
  "citations": [],
  "document_type": "Press Release"
}