{
  "title": "Remarks by President Trump at Executive Order Signing – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump at Executive Order Signing",
  "og:description": "REMARKS BY PRESIDENT TRUMP AT EXECUTIVE ORDER SIGNING Oval Office (January 23, 2025) 3:10 P.M. EST      THE PRESIDENT:  Hello,",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-at-executive-order-signing/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T22:42:00+00:00",
  "article:modified_time": "2025-01-27T15:30:28+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tremarks by President Trump at Executive Order Signing\t\t\t\t\n\nJanuary 23, 2025\n\nREMARKS BY PRESIDENT TRUMP\n\nAT EXECUTIVE ORDER SIGNING\n\nOval Office\n\n(January 23, 2025)\n\n3:10 P.M. EST\n\n     THE PRESIDENT:  Hello, everybody.\n\n     Q    Hello, sir.\n\n     THE PRESIDENT:  You all set?  Okay.  Very good.\n\n     I’m going to sign some executive orders.  They were very important in just about every case.  And we’ll go through the first one, please. \n\n     MR. SCHARF:  Sure.  Do you want to —\n\n     MR. SACKS:  Yeah.  Mr. President, this is an executive order on crypto.  We’re going to be —\n\n     MR. SCHARF:  That’s AI.  Sorry.\n\n     MR. SACKS:  Oh, sorry.  We’re doing AI first.  Sorry.\n\n     MR. SCHARF:  Yeah, AI.\n\n     MR. SACKS:  Sir, this is an executive order on AI.  We’re forming — we’re — we’re basically announcing the administration’s policy to make America the — the world capital in artificial intelligence and to dominate and to lead the world in AI. \n\n     THE PRESIDENT:  Do you want to say your name — your full name and serial number?\n\n     MR. SACKS:  Yeah, David Sacks, AI and crypto czar.\n\n     THE PRESIDENT:  David is one of the greatest in the world at AI — most respected, probably, there is. \n\n     (The executive order is signed.)\n\n     So, that should take us to the forefront, right?\n\n     MR. SACKS:  Absolutely.  We got to win. \n\n     THE PRESIDENT:  Okay.      Thank you. \n\n     MR. SCHARF:  Thank you, sir.\n\n     THE PRESIDENT:  And this, David, is?\n\n     MR. SCHARF:  Crypto.\n\n     MR. SACKS:  Yeah, this is the crypto EO.  We’re going to be forming a internal working group to make crypto — to make America the world capital on crypto under your leadership.\n\n     THE PRESIDENT:  Which is really going up, right? \n\n     MR. SACKS:  Absolutely.\n\n     (The executive order is signed.)\n\n     THE PRESIDENT:  All right, David.  That’s for you.  (The president gives Mr. Sacks the signing pen.)  Thanks.\n\n     MR. SACKS:  Thank you, sir.\n\n     THE PRESIDENT:  You find them exciting?  They might not be exciting, but we’re going to make a lot of money for the country.  Okay?\n\n     MR. SACKS:  Thank you, sir.\n\n     THE PRESIDENT:  And so is David.  You have to check him out.  There is nobody like this guy.  They said, “How did you get David Sacks?  How did you do that?”  And he’s — he’s doing it for the country more than anything else.  So, we appreciate it, David.  Thank you very much.\n\n     MR. SACKS:  Thank you, sir.\n\n     MR. SCHARF:  This is an executive order establishing a presidential commission — an advisory commission on science and technology.\n\n     THE PRESIDENT:  Good.\n\n     (The executive order is signed.)\n\n     Do you want to explain that a little bit?\n\n     MR. SCHARF:  The basic idea is to get together top people from government to private-sector technology industry, as well as educational institutions, to make sure that America maintains its leadership position with respect to science and technology development in the years ahead.\n\n     THE PRESIDENT:  Good.  That’s great.\n\n     MR. SCHARF:  Next, sir, we have a presidential memorandum encouraging departments and agencies in your government, including the Department of the Interior, to promote federal recognition of the Lumbee Tribe of —\n\n     THE PRESIDENT:  Ohh.\n\n     MR. SCHARF:  — North Carolina.\n\n     THE PRESIDENT:  I love the Lumbee Tribe.  So, this is their first big step, right?\n\n     MR. SCHARF:  This would be a huge step for them, sir.\n\n     THE PRESIDENT:  Yeah.  They were with me all the way.  They were great — North Carolina Lumbee Tribe.\n\n     (The presidential memorandum is signed.)\n\n     And we’ll send — you’ll send them a copy of that?\n\n     MR. SCHARF:  Yes, sir.\n\n     THE PRESIDENT:  They were great. \n\n     Okay?\n\n     MR. SCHARF:  And, if you’d like, I could get them that pen, sir, as well.\n\n     THE PRESIDENT:  Yeah, let’s do that.  (The president gives Mr. Scharf the signing pen.)\n\n     MR. SCHARF:  Next, we have a set of pardons for peaceful pro-life protestors who were prosecuted by the Biden administration for exercising their First Amendment rights.\n\n     THE PRESIDENT:  Do you know how many?\n\n     MR. SCHARF:  I believe it’s 23, sir.\n\n     THE PRESIDENT:  Twenty-three people that were prosecuted.  They should not have been prosecuted.  Man- of — many of them are — are elderly people.  They should not have been prosecuted.  This is a great honor to sign this.\n\n     (The proclamation is signed.)\n\n     They’ll be very happy.\n\n     MR. SCHARF:  Thank you, sir.\n\n     THE PRESIDENT:  So, they’re all in prison now?\n\n     MR. SCHARF:  Some are.  Some are — are out of custody. \n\n     THE PRESIDENT:  It’s ridiculous.\n\n     Okay?\n\n     MR. SCHARF:  Lastly, sir, we have an executive order ordering the declassification of files relating to the assassinations of President John F. Kennedy, Senator Robert F. Kennedy, and the Reverend Dr. Martin Luther King, Jr.\n\n     THE PRESIDENT:  That’s a big one, huh?  A lot of people are waiting for this for a long — for years — \n\n     MR. SCHARF:  Yes, sir.\n\n     THE PRESIDENT:  — for decades.  And everything will be revealed.\n\n     (The executive order is signed.)\n\n     Okay.  Give that to RFK, Jr.  (The president gives Mr. Scharf the signing pen.)\n\n     MR. SCHARF:  Yes, sir.\n\n     THE PRESIDENT:  Okay.      Okay.  Thank you very much.\n\n     (Cross-talk.)\n\n     Q    Mr. President — Mr. President, a U.S. judge temporarily blocked the birthright citizenship order.  Do you have any reaction to —\n\nTHE PRESIDENT:  No.  Obviously, we’ll appeal it.  They put it before a certain judge — in Seattle, I guess, right?  And\n\nthere’s no surprises with that judge. \n\nQ    Mr. President, Senators Collins and Murkowski have now said they will vote against Pete Hegseth.  Are you worried about his confirmation, and your reaction?\n\nTHE PRESIDENT:  No.  And no surprises there.  It’s too bad.  You know, it’s the way — the way it is.  Too bad. \n\nQ    And when would you adjourn Congress to make recess appointments, Mr. President?\n\nTHE PRESIDENT:  Well, I’d take a look at that.  I’d listen to John Thune.  He’s doing a fantastic job.  We’re moving along.  The Democrats are trying to delay government, as they always do.  They can’t help themselves.  Even John Ratcliffe, who’s very, very strong, very popular and liked by the Democrats — I guess, he gets a lot of Democrat votes — that’s taking a long time, and it shouldn’t be taking a long time. \n\nThey — they’re maxing everything out so they can delay everything as much as possible.\n\nQ    Does Senator Thune support an effort to use recess appointments if you choose to do that?\n\nTHE PRESIDENT:  I’d be willing to use recess appointments.  It’s up to John.  We’ll see.  John Thune is a great guy, great senator, knows his stuff inside out and backwards.  But I would use recess appointments if he wants to do that.  Absolutely.\n\n     (Cross-talk.)\n\nThe Democrats are just delaying.  They always delay.\n\nQ    Mr. President, you spoke with the Saudi crown prince yesterday.\n\nTHE PRESIDENT:  Who?\n\nQ    The Saudi crown prince.\n\nTHE PRESIDENT:  Yes.\n\nQ    How was the — the call?\n\nTHE PRESIDENT:  Great.  It was great.\n\nQ    And they said $600 million — billion dollar they can invest?\n\nTHE PRESIDENT:  Six hundred.  I’ll ask them for a trillion. \n\nQ    You said you’re going to ask them for a trillion.  Will Saudi Arabia be the first foreign country you will visit, since they’re investing that much money?\n\nTHE PRESIDENT:  Well, if they do that, I would, yeah.\n\nQ    You would?\n\nTHE PRESIDENT:  I would be glad to do that.  I did it, as you know, four years ago.  We did $450 billion — meaning the money all goes to American companies — and they purchased jets and they purchased computers and everything else.  And we did $450 billion, and I guess we’re at $600, $650.\n\n(Cross-talk.)\n\nAnd I’ll see if I can talk them into a trillion.\n\nQ    And on the Middle East again.  You showed great confidence in Steve Witkoff.  Why you said that you doubt that the ceasefire in Gaza will — will hold since you appraised his efforts?\n\nTHE PRESIDENT:  Well, no, I think he’s great.  But it’s a very tricky place.  It’s very tricky.  And we’ll see.  And if it — if something does happen, they will not be happy. \n\nQ    Sir, follow-up on that one.  In terms of Steve Witkoff, are you going to put him in charge of — of Iran strategy?  And do you want him talking directly with the Iranians?\n\nTHE PRESIDENT:  No, but he — he certainly is somebody I would use.  He’s done a fantastic job.  He’s a great negotiator.  He’s a very good person, great — a very popular person.  Gets along with people.  I have great negotiators.  They — they have no personality whatsoever, and then I have some that do. \n\nSteve has a wonderful way about him and people like him.  And even in this case, both sides like him, and he was able to make a deal.  That deal would have never been made without Steve. \n\nThe Biden people couldn’t make the deal.  They were working on it for a year and a half.  They couldn’t make a deal.  We got it done prior to the inauguration.  We said it has to be before the inauguration. \n\nI mean, the deal should hold, but if it doesn’t hold, there’ll be a lot of problems.\n\n(Cross-talk.)\n\nQ    Related to your AI EO.  Just hours after you made that big Stargate announcement, Elon Musk tweeted that they don’t actually have the money.  Is that true?\n\nTHE PRESIDENT:  I don’t know if they do, but, you know, they’re putting up the money.  The government is not putting up anything.  They’re putting up money.  They’re very rich people, so I hope they do. \n\nAnd, I mean, Elon doesn’t like one of those people.  So, (inaudible).\n\n(Cross-talk.)\n\nQ    Are you worried that AI is going to replace many American jobs? \n\nTHE PRESIDENT:  No.\n\nQ    Does that worry you?\n\nTHE PRESIDENT:  No, no.  It’s going to create tremendous numbers of jobs.  It’s going to also create a lot of benefits, medically, for cancer research and other things.  It’s going to have a huge positive impact.\n\nAnd, you know, we want to be ahead of China.  We’re, right now, way ahead of China.\n\nDavid Sacks is one of the all-time experts.  You know, that — people are amazed that he — you just met him.  I don’t know if he’s still here.\n\nMR. SACKS:  (Inaudible.)\n\nTHE PRESIDENT:  There he is.\n\nBut — but one of the most respected people in that world.  It’s a world.  That’s a whole different world. \n\nAnd we’re ahead of China now because of what I’m doing, and I think it’s going to be very successful. \n\n(Cross-talk.)\n\nQ    On NATO spending, please.  You just asked the Davos forum again that NATO countries should spend 5 percent of GDP on defense.\n\nTHE PRESIDENT:  Yeah.\n\nQ    The United States don’t spend 5 percent.\n\nTHE PRESIDENT:  Well, I — I don’t think so, no.\n\nQ    Do you think it should also apply to the United States?\n\nTHE PRESIDENT:  We’re protecting them, you know?  They’re not protecting us.  We’re protecting them.  So, I don’t think we should be spending — I’m not sure we should be spending anything, but we should certainly be helping them.  But they should — they should up their 2 percent to 5 percent, yeah.\n\nQ    Mr. President — Mr. President, you said earlier during your speech at Davos that you would like to see interest rates come down.\n\nTHE PRESIDENT:  Yeah.\n\nQ    How much would you like to see them come down?\n\nTHE PRESIDENT:  A lot.\n\nQ    And will you talk with Powell?\n\nTHE PRESIDENT:  I’d like to see them come down a lot, and oil prices will come down.  And when oil prices come down, everything is going to be cheaper for the American people — and actually for the world — but for the American people.  So, I’d like to see oil prices come down.\n\nAnd when the energy comes down, that’s going to knock out a lot of the inflation.  That’s going to automatically bring the interest rates down. \n\nQ    Are you worried that it’s too much going on at once if you’re —\n\nQ    Mr. President, you said that you would demand —\n\nQ    Are you worried that there’s too much going on at once if you’re trying to bring interest rates down and —\n\nTHE PRESIDENT:  No, no.\n\nQ    — get the economy back going?\n\nTHE PRESIDENT:  No.  It just works that way.  I mean, it just economically works that way.  When the oil comes down, it’ll bring down prices, then you won’t have inflation, and then the interest rates will come down.  (Inaudible.)\n\n(Cross-talk.)\n\nQ    You said that you would demand that the interest rates come down. \n\nTHE PRESIDENT:  Well, I would put in —\n\nQ    Do you expect —\n\nTHE PRESIDENT:  I would put in a strong statement.\n\nQ    Do you expect the Fed to listen to you?\n\nTHE PRESIDENT:  Yeah. \n\nQ    Are you going to talk to Powell about this and — bringing the rates down?\n\nTHE PRESIDENT:  At — at the right time, I would.\n\nQ    Sir, do you plan to meet with any of the people you pardoned that were — participated in the January 6th, 2021, attack — do you plan to meet with any of them or meet with them at the White House?\n\nTHE PRESIDENT:  I don’t know.  I’m sure that they probably would like to.  I did — I did them something important.  But what they did is they were protesting a crooked election.  And, you know, I mean, people understand that also.  And they were treated very badly.  Nobody’s been treated like that. \n\nSo, I’d be open to it, certainly.  I — I don’t know of anything like that, but I think they — they’re going to — meeting some of the congresspeople — congressmen, -women —\n\nQ    Have you spoken to them?\n\nTHE PRESIDENT:  — who want to — want to meet.  But I’d certainly be open to it. \n\nQ    Have you spoken to them since you issued the pardons?\n\nTHE PRESIDENT:  I haven’t spoken to any of them yet, but I know they’re very happy. \n\n(Cross-talk.)\n\nI gave them — I gave them their life back.  Their life was taken away from them unnecessarily and unfairly.  I gave them their life back.  So, I can imagine they probably would like to.\n\nQ    What did you mean when you said that Biden took bad advice in not pardoning himself yesterday? \n\nTHE PRESIDENT:  Well, he did.  I think he did, because he — he pardoned all these people that are crooked as hell.  Look, the congressmen, they’re crooked.  What they did is they destroyed evidence.  When you destroy evidence, especially criminally like that — they did it criminally. \n\nAnd the reason they destroyed the evidence is because it proved that I was right.  They didn’t destroy evidence for no reason.  They destroyed it because they found many documents saying that I offered 10,000 soldiers.  If they had 500 soldiers or National Guard, there would have been no problem.  If they had 200, that would have been — I offered 10,000, if they needed them — there would have been no problem. \n\nThat’s been now totally disproven.  And it’s also been disproven by Nancy Pelosi’s daughter, who has her on tape saying it was her fault, that she has full responsibility for this. \n\nBut — and they have all that stuff.  They destroyed everything, and they go through a year and a half, two years of nonsense, they come up with tremendous evidence, and they destroyed evidence.\n\nAnd Schiff knew about it.  That’s why he’s on there.  He knew all about the destruction of evidence.  A lot of people said he’s the one that got them to do it.  And he’s a crooked guy — you know? — totally crooked politician.  And so, he’s pardoned, and some other people are pardoned. \n\nAnd these are crooked politicians, every one of them.  Bennie ~~Johnson~~ [Thompson], what he did is incredible.  I mean, he was the leader of the committee, and he did it.  Cheney, Crying Adam Kinzinger, all of them — they destroyed evidence and deleted everything. \n\nThere’s nothing with — there’s no evidence now.  They’re crooked politicians, and they should be punished.  You know, that’s — even in a civil trial, you go to jail for a thing like that.  They destroyed every document, from what I understand — every document — because it proved that I was totally innocent. \n\nQ    Do you plan to send up to 10,000 troops to the southern border, sir?\n\nTHE PRESIDENT:  Yeah.  Oh, southern border?\n\nQ    Yes, the border. \n\nTHE PRESIDENT:  When you say “southern border” — when I said “10,000 troops,” I was referring to the Capitol. \n\nQ    Oh, I see.  A- — and when does that —\n\nTHE PRESIDENT:  No, no, you got it wrong.  I was referring — \n\nQ    When do you plan —\n\nTHE PRESIDENT:  — to the Cap- — \n\nQ    When do you plan to do that?\n\nTHE PRESIDENT:  I offered 10,000 troops to the Capitol before January 6th.\n\nQ    And as for the 1,500 at the southern border, sir, to clarify, what exactly do you want them to be doing right now?\n\nTHE PRESIDENT:  Making sure that the border is safe and secure and that criminals don’t come into our country.\n\nQ    Mr. President, do you think that sanctions on Russia will force President Putin to negotiate?\n\nTHE PRESIDENT:  I don’t know, but I think he should make a deal. \n\nQ    Mr. President, does it bother you that Elon Musk criticized a deal that you made publicly, that he said — that he tweeted that?\n\nTHE PRESIDENT:  No, it doesn’t.  He hates one of the people in the deal.  So — \n\nQ    Have you spoken to him since then?\n\nTHE PRESIDENT:  No, no.  I’ve — well, I’ve spoken Elon but —\n\nQ    Not about that? \n\nTHE PRESIDENT:  I’ve spoken to all of them, actually.\n\nNo, no.  The people in the deal are very, very smart people.  But Elon, one of the people he happens to hate.  But I have certain hatreds of people too —\n\nQ    Sir —\n\nTHE PRESIDENT:  — you know?\n\nQ    Sir, on China.  What do you think Xi Jinping can do on the Ukraine-Russia war? \n\nTHE PRESIDENT:  Which one?\n\nQ    Ukraine-Rus- — -Russia war.  What can Xi Jinping do about that?\n\nTHE PRESIDENT:  China?\n\nQ    Yeah.\n\nTHE PRESIDENT:  They have a lot of power over Russia.  They supply energy to Russia, and Russia supplies energy to them.  They supply other things to — you know, it — it’s really a very big trade.  It’s a very big trading partner.  But Russia supplies a lot of energy to China, China pays them a lot of money for that, and I think they have a lot of power over Russia.  So, I think Russia should want to make a deal. \n\nMaybe they want to make a deal.  I think, from what I hear, Putin would like to see me, and we’ll meet as soon as we can.  I’d — I’d meet immediately.  Every day we don’t meet, soldiers are being killed in a battlefield, and that battl- — battlefield is like no battlefield since World War II.  That’s a —\n\nQ    You said that U- — Ukraine wants to —\n\nTHE PRESIDENT:  And I have — I have pictures that you don’t want to see.  Soldiers are being killed on a daily basis at numbers that we haven’t seen in decades.  And it would be nice to end that war.  It’s a ridiculous war. \n\nQ    You said that Ukraine is ready to make a deal.  Did President Zelenskyy tell you that at — personally?\n\nTHE PRESIDENT:  Yeah, sure.  He’s ready to negotiate a deal.  He’d like to stop.  He’s a — he’s somebody that lost a lot of soldiers, and so did Russia — lost a lot.  I mean, Russia lost more soldiers.  They lost 800,000 soldiers.  Would you say that’s a lot?  I’d say it’s a lot.\n\n(Cross-talk.)\n\nQ    Mr. President, you said that you wanted to make Dr. King’s dream a reality.  What’s your response to his children and civil rights leaders who say that your DEI orders are a contradiction of his dream and could further drive racial disparities?\n\nTHE PRESIDENT:  Well, I haven’t heard that. \n\nQ    Mr. President, you put the Houthis back on the terror list.  How do you see the war in Yemen end now?\n\nTHE PRESIDENT:  Well, we’ll see what happens, but they can’t shoot down our ships — the Houthis.\n\nQ    Yes.\n\nTHE PRESIDENT:  And that — you can’t shoot down our ships or any ships, and that’s what they’ve been doing.  So, they’re on the terror list, and —\n\nQ    Mr. President —\n\nTHE PRESIDENT:  — that’s not good for them.\n\nQ    Mr. President —\n\nQ    Sir, why did you revoke security protections for former Secretary of State Mi- — Mike Pompeo and — and Brian Hook?\n\nTHE PRESIDENT:  Well, the same reason I do — when you, you know, have protection, you can’t have it for the rest of your life.  Do you want to have a large detail of people guarding people for the rest of their lives?  I mean, there’s risks to everything. \n\nQ    Do you think a former presidents should (inaudible) —\n\nQ    Sir, would you support striking Iran’s nuclear facilities?\n\nTHE PRESIDENT:  Say it? \n\nQ    Would you support Israel, for example, striking Iran’s nuclear facilities?  Or do you — \n\nTHE PRESIDENT:  Well, I’m not going to answer that.\n\nQ    — believe in diplomacy?\n\nTHE PRESIDENT:  Obviously, I’m not going to answer that question.  We’ll have to see.  I — I’m going to be meeting with various people over the next couple of days, and we’ll see.  But hopefully that can be worked out without having to worry about it.  It would be nice — it would really be nice if that could be worked out without having to go that further step. \n\nQ    And who are you going to meet with, if I — if I may ask?\n\nTHE PRESIDENT:  Well, I’d rather not say that, but very high-level people.  But hopefully that could be worked out. \n\nYou know, look, Iran, hopefully, will be — make a deal.  And if they don’t make a deal, I guess that’s okay too.\n\nQ    And, Mr. President, just to follow up, you said you think the Fed should listen to you.  Can you elaborate on why you think it should?\n\nTHE PRESIDENT:  With regard to interest rates?\n\nQ    Correct, yes.\n\nTHE PRESIDENT:  Because I think I know interest rates much better than they do, and I think I know it certainly much better than the one who’s primarily in charge of making that decision. \n\nBut, no, I’m guided by them very much, but if I disagree, I will let it be known.\n\nQ    Mr. President —\n\nQ    Sir, your tariffs planned for China and Mexico are much tougher — or the ones for Canada and Mexico are much tougher than the one for China.  Why is it softer for China?\n\nTHE PRESIDENT:  Well, China is already paying a lot of tariffs because of me, and when you add them up, I would say, you know, they’re paying a lot.  They paid hundreds of billions of dollars.  They never paid 10 cents until I came along.  When I came along, they pay hundreds of — they’ve paid hundreds of billions of dollars.  Never paid anything.  And so, they’ve already started at a higher base.\n\nQ    Is February 1st —\n\nQ    Sir, about the border —\n\nQ    — the date for Chinese tariffs as well, sir?  February 1?  Or was that just Mexico and Canada?\n\nTHE PRESIDENT:  It’s Mexico and Canada.  But we’ll — we’re talking about China too.  Look, China is sending us tremendous amounts of bad drugs: fentanyl — really bad stuff.  Most of it comes through Mexico.  And we’re losing, I s- — I think, 300,000 lives a year because of that.  People say 150, 100, 120.  I think 300,000 lives a year.  Those are old numbers.  The other — the lower number is a low number.  And we can’t have that.  They’ve got to stop sending it. \n\nI had a deal with President Xi, but it was a deal that wasn’t followed up by Biden, of course, where they were going to issue the death penalty to people that make fentanyl, and that would have stopped it.  But we’ll have to stop it with tariffs. \n\nOkay?  Thank you very much, everybody. \n\nQ    So, is China (inaudible) —\n\n(Cross-talk.) \n\nTHE PRESIDENT:  Thank you.  Thank you.  Thank you very much.  Appreciate it. \n\nQ    Thank you, Mr. President.\n\nTHE PRESIDENT:  Thank you. \n\n                         END                    3:30 P.M. EST\n",
  "summary": "President Trump, on January 23, 2025, signed multiple executive orders and other proclamations in the Oval Office. These orders included initiatives to establish the United States as a global leader in artificial intelligence and cryptocurrency. The session also involved the formation of an advisory commission on science and technology to ensure America's leadership in innovation. Furthermore, President Trump signed a presidential memorandum recognizing the Lumbee Tribe of North Carolina and issued pardons for 23 pro-life protestors prosecuted during the Biden administration.\n\nPresident Trump also addressed foreign policy and national security matters. He signed an order for the declassification of files related to the assassinations of key historical figures, and discussed current geopolitical issues, including the situations in the Middle East with Steve Witkoff's negotiations and Chinese tariffs. There was significant attention on domestic economic strategies such as AI and NATO spending, as well as addressing the judicial challenges against his birthright citizenship order.\n\nFurther discussions during the signing covered the relationship with Saudi Arabia, where Trump mentioned potential investments, and his interest in seeing interest rates reduced. He briefly discussed his stance on tariffs with China and other nations to address the opioid crisis. The comprehensive session encompassed economic, legal, and foreign policy initiatives under his administration.",
  "eli5": "President Trump signed important papers about making America the best at computers and money stuff, said sorry to some people who got in trouble for protesting, and talked about how he wants things to be better with other countries.",
  "keywords": [
    "Trump",
    "Executive Orders",
    "AI",
    "Cryptocurrency",
    "Lumbee Tribe",
    "Pardons",
    "Declassification",
    "Foreign Policy",
    "Interest Rates"
  ],
  "issues": [
    "Legal challenges to birthright citizenship order",
    "Reaction to AI potentially affecting jobs",
    "Impact of tariffs on international relations",
    "Concerns over pardoning decisions",
    "Effectiveness of declassification on public trust"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}