{
  "title": "Remarks by President Trump and Prime Minister Narendra Modi of the Republic of India in Joint Press Conference – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks by President Trump and Prime Minister Narendra Modi of the Republic of India in Joint Press Conference",
  "og:description": "THE WHITE HOUSE Office of Communications ________________________________________________________________ REMARKS BY PRESIDENT TRUMP AND PRIME MINISTER",
  "og:url": "https://www.whitehouse.gov/remarks/2025/02/remarks-by-president-trump-and-prime-minister-narendra-modi-of-the-republic-of-india-in-joint-press-conference/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-13T15:20:34+00:00",
  "article:modified_time": "2025-02-15T15:21:38+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\t REMARKS BY PRESIDENT TRUMP AND PRIME MINISTER NARENDRA MODI OF THE REPUBLIC OF INDIA IN JOINT PRESS CONFERENCE\t\t\t\t\n\nFebruary 13, 2025\n\nTHE WHITE HOUSE\n\nOffice of Communications\n\n________________________________________________________________\n\nREMARKS BY PRESIDENT TRUMP AND PRIME MINISTER NARENDRA MODI OF THE REPUBLIC OF INDIA IN JOINT PRESS CONFERENCE\n\nEast Room(February 13, 2025)\n\n     6:04 P.M. EST\n\n     PRESIDENT TRUMP:  Thank you very much.  Thank you very much.  Please.  Great honor.\n\n     I’m thrilled to welcome the Prime Minister of India, my friend, Narendra Modi back to the White House.  We spent a lot of time here and a lot of time in India, and he’s a very special man. \n\n     Prime Minister, it is a pleasure to extend to you the same hospitality that you showed Melania and myself when we traveled to your beautiful country five years ago.  It’s hard to believe so long ago, and it seemed like yesterday.  It was beautiful.  We opened the cricket stadium — 129,000 seats, I think the largest stadium in the world, and it was an incredible period of time. \n\n     There is truly a special bond between the United States and India and the world’s oldest democracy and the world’s largest democracy and, I believe, the world’s largest country, in terms of the numbers of people.  And today, the prime minister and I are announcing a framework to strengthen those ties even further economically, and the U.S.-India compact for the 21st century is a historic initiative that will deepen every aspect of our partnership and our friendship. \n\n     Starting this year, we’ll be increasing military sales to India by many billions of dollars.  We’re also paving the way to ultimately provide India with the F-35 stealth fighters. \n\n     In 2017, my administration revived and reinvigorated the Quad security partnership.  In our meeting today, the prime minister and I reaffirmed that strong cooperation among the United States, India, Australia, and Japan, and it’s crucial really to maintaining peace and prosperity, tranquility even, in the Indo-Pacific. \n\n     In addition, the United States and India will be working together like never before to confront the threat of radical Islamic terrorism, a threat all over the world actually.\n\n     Today, I’m pleased to announce that my administration has approved the extradition of one of the plotters and one of the very evil people of the world and having to do with the horrific 2008 Mumbai terrorist attack to face justice in India.  So, he’s going to be going back to India to face justice. \n\n     As we deepen our defense partnership, we’ll also strengthen our economic ties and bring greater fairness and reciprocity to our trading relationship.\n\n     As a signal of good faith, Prime Minister Modi recently announced the reductions to India’s unfair, very strong tariffs that limit U.S. access into the Indian market very strongly.  And really, it’s big problem, I must say.  India imposes a 30 to 40 to 60 and even 70 percent tariff on so many of the goods and, in some cases, far more than that. \n\n     As an example, a 70 percent tariff on U.S. cars going into India, which makes it pretty much impossible to sell those cars. \n\n     Today, the U.S. trade deficit with India is almost $100 billion, and Prime Minister Modi and I have agreed that we’ll begin negotiations to address the long-running disparities that should have been taken care of over the last four years — but they didn’t do that — in the U.S.-India trading relationship, with the goal of signing an agreement.  And we want — really, we want a certain level playing field, which we really think we’re entitled to, and he does also, in fairness, so we’re going to work on that very hard.  And we can make up the difference very easily with the deficit with the sale of oil and gas and LNG, of which we have more than anybody in the world. \n\n     The prime minister and I also reached an important agreement on energy that will restore the United States as a leading supplier of oil and gas to India.  It will be, hopefully, their number-one supplier in the groundbreaking development for U.S. nuclear industry.  India is also reforming its laws to welcome U.S. nuclear technology, which is at the highest level, into the Indian market.  This will bring safe, clean, and affordable electricity to millions of Indians and tens of billions of dollars to the U.S.-civilian nuclear industry in India.\n\n     And under the framework we are announcing today, the United States and India are also joining forces to ensure that artificial intelligence and other advanced technologies are developed by the two of the most — really, two of the most advanced nations, intellectually and otherwise technologically, anywhere in the world.  There’s nobody very much closer.  We have an incredible relationship there.  And this is where it seems to be heading. \n\n     And artificial intelligence — complex — a very complex subject, but it seems to be where people want to be and they want to go, and we’re leading right now by a lot, but other people will try to catch us.  I don’t know if they’re going to be able to.  We’re going to make it available.  We’re going to make tremendous amounts of electricity available, and we’re going to let the people that are buying the electricity make their own electric plants — electric generation plants, and we’ve never done this in our country, but we’re going to get it done very quickly. \n\n     Lee Zeldin and his group are going to get the approvals in very rapid form.  And we’re calling it a “national emergency,” and that’s exactly what it is.  So, we’re going to be — we’re going to remain at the top of the AI or artificial intelligence, I think, for a long time to come, and we’re going to be working very closely with India and other countries on that.  But right now, we’re the leader by quite a bit. \n\n     Finally, we agreed to work together to help build one of the greatest trade routes in all of history.  It will run from India to Israel to Italy and onward to the United States, connecting our partners by ports, railways, and undersea cables — many, many undersea cables.  It’s a big development.  It’s a lot of money going to be spent, and we’ve already spent some, but we’re going to be spending a lot more in order to stay advanced and stay the leader. \n\n     I’m pleased to report that with today’s announcements, the friendship between the United States and India is the strongest I believe it’s ever been.  I think our relationship is the best it’s ever been between two leaders of the two countries, and it’s an honor to say that. \n\n     I’d like to now invite the prime minister to say a few words, and then we’ll take some questions.  And we appreciate you all being here.  Thank you very much.  Thank you very much.  (Applause.) \n\n     PRIME MINISTER MODI:  (As interpreted.)  Your Excellency President Trump, delegates of both countries, friends from the media: *Namashkar*.\n\n     I would like to first of all express my heartfelt gratitude to my dear friend President Trump for the grand welcome and hospitality accorded to me.  President Trump’s leadership has been instrumental in nurturing India-U.S. ties and making them vibrant. \n\n     I could feel today the same enthusiasm, the same — the same enthusiasm, the same energy, the same commitment that we had worked with during our first term. \n\n     Our discussions today highlighted our pride in our accomplishments during his first term, the deep mutual trust that we share, and also the resolve to attain new goals.  We also agreed that the partnership and cooperation between India and the U.S. can shape a better world. \n\n     Friends, the people of America are aware of President Trump’s motto, “Make America Great Again,” or “MAGA.”  The people are well aware of it.  The people of India too are focusing on both heritage and development as they move forward at a fast pace and with a firm resolve to ensure a developed India by 2047.  If I were to say this, borrowing an expression from America, our vision for a developed India is to “Make India Great Again,” or “MIGA.” \n\n     When America and India work together, that is when MAGA — when it’s MAGA plus MIGA, it becomes mega — a mega partnership for prosperity.  (Applause.)  And it is this mega spirit that gives new scale and scope to our objectives. \n\n     Friends, today, we have also set ourselves the target of more than doubling our bilateral trade to attain $500 billion by 2030.  Our teams will work on concluding very soon a mutually beneficial trade agreement. \n\n     In order to ensure India’s energy security, we will focus on trade in oil and gas.  Investment in energy infrastructure will also increase.  In the area of nuclear energy, we also discussed increasing cooperation on small modular reactors.\n\n     Friends, America plays an important role in India’s defense preparedness.  As strategic and trusted partners, we are moving forward actively towards joint development, joint production, and transfer of technology. \n\n     In the times to come as well, new technologies and equipment will enhance our capacities.      We have decided to launch the autonomous systems industry alliance and a defense cooperation framework for the next decade will be prepared.  Defense interoperability, logistics, repair, and maintenance will also be its key components. \n\n     Friends, the 21st century is a technology-driven century.  Close cooperation in the area of technology between countries that believe in democratic values can give new direction, strength, and opportunities to the entire humanity.  India and the U.S. will jointly work in areas of artificial intelligence, semiconductors, quantum, biotechnology, and several other technologies. \n\n     Today, we also agreed on TRUST, which stands for Transforming Relationships Utilizing Strategic Technology.  Under this, our focus will be on establishing strong supply chains for critical minerals, advanced materials, and pharmaceuticals. \n\n     We have also decided to launch a recovery and processing initiative for strategic minerals like lithium and rare earths. \n\n     We have had close cooperation with the U.S. in the area of space.  The NISAR satellite developed with mutual cooperation between Israel and NASA will soon be flying into space on an Indian launch vehicle. \n\n     Friends, partnership between India and the U.S. strengthens democracy and strengthens democratic values and systems.  We will work together to enhance peace, stability, and prosperity in the Indo-Pacific.  The Quad will play a special role in this.  During the Quad summit scheduled to be held in India this year, we will expand cooperation in new areas with our partner countries.  Under the IMEEC and I2U2, we will work together for the development of economic corridors.\n\n     And in the area of connectivity, India and U.S. will stand strongly together in the fight against terrorism.  We agree that in order to eliminate cross-border terrorism, we need concrete actions, and I’m very grateful to President Trump that he — in 2008, somebody who carried out genocide in India, that criminal is now going to be handed over to India, and I’m grateful to President Trump for this, and appropriate action will be taken in the courts in India. \n\n     Friends, the Indian community living in the U.S. is an important link in our relations.  In order to further deepen our people-to-people ties, India will soon open new consulates in Los Angeles and Boston.  These will be new consulates. \n\n     We have invited American universities and educational institutes to open their offshore campuses in India. \n\n     President Trump, I am grateful to you for your friendship and strong commitment towards India.  The people of India still fondly remember your visit in 2020 and hope that President Trump will come and visit them again.  On behalf of 1.4 billion Indians, I invite you to visit India. \n\n     Thank you.  Thank you very much.  (Applause.)\n\n     PRESIDENT TRUMP:  Thank you.  Thank you very much.  Great job.\n\n     PRIME MINISTER MODI:  Thank you.  Thank you. \n\n     PRESIDENT TRUMP:  Beautiful.\n\n     Okay, thank you very much.  That was excellent. \n\n     We’ll do a few questions, please. \n\n     Q    Mr. President —\n\n     PRESIDENT TRUMP:  Please, go ahead.  Please, go ahead.  Yeah.  Yeah, blue shirt.\n\n     Q    Me?\n\n     Q    Thank you, Mr. President.  People in India will naturally welcome your decision to extradite Tahawwur Rana to India back home.  In that context, I would like to ask you a question about — in last few years, we have seen several groups in the U.S. been raising anti-India voice, calling about separation — terrorism activities in India.  Do you think that should continue here in the U.S. as well?\n\n     PRESIDENT TRUMP:  You’re going to have to go louder.\n\n     Q    Mr. President, people in India would be welcoming your decision to extradite Tahawwur Rana to India —\n\n     PRESIDENT TRUMP:  Yeah, I can’t understand —\n\n     Q    Okay.\n\n     PRESIDENT TRUMP:  — a word he’s saying.  It’s not the — it’s the accent.  It’s a little bit tough for me. \n\n     Q    But can I try again?\n\n     PRESIDENT TRUMP:  How about — how about you.  Please.  Go ahead, back there.  \n\n     Q    Thank you.  Thank you very much. \n\n     Q    Mr. President, thank you.  First, I want to ask the prime minister a question.  You and the president — you both spoke about combating ISIS.  You — you both sounded very exciting about this — excited about this partnership upcoming, and I — I was curious, how much more confident are you with President Trump leading this country that there will be peace through strength and you will have a suc- — successful partnership with the United States, versus with Biden’s incompetence and weakness over the last four years?\n\n     PRESIDENT TRUMP:  (Laughs.)  (Laughter.)  That’s your question, but I’ll answer it.  I agree with you.  (Laughter.)  Yeah, gross incompetence. \n\n     We’re going to have a fantastic relationship.  And it has been like the whole world has been set back over the last four years by the weakness of the United States, the weak leadership of the United States, but I think we’ve taken care of it in just three weeks.  It seems to me that even some of the media that we wouldn’t prefer has been writing that this is a much different country right now, that the world has a light over it — not only our country, but the whole world. \n\n     The prime minister told me that before too.  Even over India, the world has a light.  They need the United States to be strong and powerful but good, and I think that’s happened.  And I think it’s happened in a very short period of time.\n\n     But I will tell you, we’re going to have a fantastic relationship, and it will make both countries much stronger.\n\n     (Cross-talk.)\n\n     All right?      Yes, go ahead, please. \n\n     Q    Geeta Mohan from India today, sir.  I’ll just take my colleague Lalit Jha’s question forward, because you couldn’t underst- —\n\n     PRESIDENT TRUMP:  Okay.  Fine. \n\n     Q    The question is about the fact that you’ve decided to extradite Tahawwur Rana.  Thank you so much.  India has been waiting to — to have him back in India to bring him to justice. \n\n     But there are many other elements in the United States of America, particularly Khalistani separates who’ve been working against Indian interests.  How is the United States of America going to cooperate on that front with India?  There are — there have been allegations that have been leveled against Indian agencies by the Biden administration.  Are you going to relook that with Tulsi Gabbard as DNI now?\n\n     PRESIDENT TRUMP:  Well, I don’t think India had a very good relationship with the Biden administration.  Biden — they wouldn’t sell them oil and gas, which is rather hard to believe, because, you know, it’s a good thing to do.  And a lot of things happened that weren’t very appropriate, I thought, between India and the administration — the Biden administration. \n\n     But as you said, we’re giving a very violent man — it seems to me — I mean, I don’t know that he’s been convicted yet or will be, but let’s assume he’s a pretty violent person — we’re giving him back to India immediately.  And there are more to follow, because we have quite a few requests. \n\n     So, we work with India on crime, and we want to make it good for India, and it’s very important.  So, that kind of a relationship is very important to us. \n\n     Okay?\n\n     (Cross-talk.)\n\n     Go ahead, please.\n\n     Q    Thank you.\n\n     PRESIDENT TRUMP:  Go ahead.\n\n     Q    Thank you.  Mr. President, you’ve repeatedly called India a big abuser of trade and said it is really difficult to do business in India because of tariffs.  You announced reciprocal tariffs today.  I am hoping you can speak about what kind of reciprocal tariffs India can expect.  Are you willing to make any concessions, and how can India head off these tariffs?\n\n     I also have one for the prime minister.\n\n     PRESIDENT TRUMP:  Sure. \n\n     Well, India has been, to us, just about the highest tariffed nation anywhere in the world.  They’ve been very strong on tariffs, and I don’t blame them, necessarily, but it’s a different way of doing business.  It’s very hard to sell into India because they have trade barriers, very strong tariffs. \n\n     We are right now a reciprocal nation.  We are going to — if it’s India or if it’s somebody else with low tariffs, we’re going to have the same.  We’re going to have whatever India charges, we’re charging them.  Whatever another country charges, we’re charging them.  So, it’s called reciprocal, which I think is a very fair way.  We didn’t have that. \n\n     I was going to do that in my other term, and we had the greatest economy ever in the world.  There’s never been an economy like we had, and then we got hit with COVID.  We had a focus on that, and I wasn’t really in the mood to be putting it on Italy and Spain and France and India, frankly, and a lot of other countries, because the world was very troubled until we got rid of that nightmare. \n\n     But we had the strongest economy anywhere in the world during that fairly long period of time during my first term, as you know, and we didn’t do the tariffs.  We would have done the reciprocal tariffs, but we decided — and I decided, I think, on a human basis — on a humane basis not to do them because of the fact that there was such suffering all over the world.  The last thing we needed to talk about is trade problems. \n\n     But now we’re doing — we see a tremendous future for our country.  But we felt that now it’s finally time, after 45 or 50 years of abuse, that we will do — and this isn’t India, this is among a lot of nations. \n\n     The European Union is very difficult for us — very, very difficult.  They tax our companies at levels that nobody’s ever seen before.  They take advantage of a lot of things.  So, we’re not happy about that. \n\n     China, of course, is terrible, and we’ve never taken in 10 cents until I was president.  We’ve taken in hundreds of billions of dollars from China since I’ve been president — in first term and now — and we have to do that just as a mechanism of fairness, and that’s what I’ve done. \n\n     And so, we are being reciprocal with India.  Whatever India charges, we charge them.  So, frankly, it no longer matters to us that much what they charge, because whatever they charge — I had discussions with India in the first term about the fact that their tariffs were very high, and I was unable to get a concession.  So, we’re just going to do it the easy way, and we’re just going to say, “Whatever you charge, we charge.”  And I think that’s fair for the people of the United States, and I think it’s actually fair for India. \n\n     Okay?\n\n     Q    Are you willing to make any concessions, sir?  Are you willing to make any concessions, sir?  Any concessions?\n\n     PRESIDENT TRUMP:  Go ahead, please.  Ask to the prime minister, please. \n\n     Q    A question for the prime minister, please.\n\n     PRESIDENT TRUMP:  Ask to the prime minister, please.\n\nQ    Yes, sorry.  Yoshita Singh with Press Trust of India.  Prime Minist- — thank you, Mr. President.\n\nPrime Minister, the U.S. is giving a lot of push to curb illegal immigration, and India has been cooperating on this issue.  How does India see this issue in the larger context?  Thank you. \n\nPRIME MINISTER MODI:  (As interpreted.)  I don’t think this is a question that is about India only, but, even globally, you can talk about this issue.  And we are of the opinion that anybody who enters another country illegally, they — they have absolutely no right to be in that country. \n\nAnd as far as India and the U.S. is concerned, we have always been of the same opinion, and that is that any verified Indian who is in the U.S. illegally, we are fully prepared to take them back to India.  However, it doesn’t stop there. \n\nThese are children of very ordinary families, and they are lured by big dreams and big promises.  A lot of them are brought in without them knowing about why they are going to a country.  And, in fact, they are connected with a human trafficking system, and we have to make sure that we fight against this system. \n\nAs far as the U.S. and India is concerned, I think what we should do is make efforts to make sure that we uproot these from within the system so that we can reduce or remove human trafficking.  And basically, the young, vulnerable, poor people of India are fooled into coming over as illegal immigrants, and our bigger fight, actually, is against this ecosystem or this system that encourages such gangs to thrive.  And I can tell you that India will completely support your endeavor in achieving this. \n\n(Cross-talk.)\n\nPRESIDENT TRUMP:  Yes.\n\nQ    Thank you.  Thank you, Mr. President.  A question for Prime Minister Modi first, if I may.  I wanted to ask you: Did you discuss any possible business deals with Elon Musk during your — your meetings today, Mr. Prime Minister?\n\nAnd, Mr. President, I wanted to ask you: Today, you spoke about hoping to have three-way talks with President Xi and President Putin.  What would you say to European leaders and other allies who may be concerned that you’re apparently more keen to speak to America’s adversaries than to its allies?   Thank you. \n\nPRESIDENT TRUMP:  Well, maybe I’ll just go and — first on this one.  We had some talks, and we told the European Union, we told the NATO people — largely, they overlap — “You have to pay more money because it’s unfair what we’re doing.  We’re doing a tremendous amount more.”  We’re probably $200 billion more going into Ukraine, using for Ukraine to fight, and Europe has not really carried its weight in terms of the money.  It’s not equitable, and we want to see a counterbalance.  We want to have them put up more money.  They have to do that.\n\nAt the same time, we had a very good conversation with President Putin the other day — yesterday.  And we also had a very good conversation — I did, both — in both cases — with President Zelenskyy.  And I think we’re going to be able to do something.  I think we’re going to be able to make a deal, and I hope so, because it’s a horrible war.  It’s a very terrible, bloody war with a million and a half soldiers, at least, already dead on the battlefield, lying all over the fields like — nobody has ever seen anything like it since — certainly since the Second World War. \n\nAnd so, I think we’re going to be able to do something.  We’re working with President Zelenskyy and with President Putin, and my impression is that they — I know that President Zelenskyy wants to make a deal, and I also feel that — I know that President Putin wants to make a deal.  I wanted to know that before I began any detailed discussions. \n\nBut the meeting and the — the conversation — also, the meeting with Steve Witkoff in Moscow was a very successful one, and my phone call with him was a very successful one. \n\nPlease. \n\nPRIME MINISTER MODI:  (As interpreted.)  You asked a question regarding Elon Musk.  I have known him for a very long time.  I was not even prime minister at the time when I first met him; I was chief minister.  And today he came to meet me along with all his family, with his children.  And so, we had a nice discussion. \n\nAs far as the EV is concerned — EVs are concerned, the EV — the word “EV” has a copyright.  And that is one person who has a copyright for the word “EV,” and that is Trump. \n\n(Cross-talk.)\n\nPRESIDENT TRUMP:  Thank you.  That was very nice.\n\nGo ahead, please.\n\nQ    Thank you, Mr. President.  Can I ask whether you discussed at all today the case of Gautam Adani, who’s one of the weal- — the wealthiest men in Asia and perceived as an ally of Prime Minister Modi? \n\nPrime Minister Modi, have you asked the president to take action on that case?  Thank you. \n\nPRIME MINISTER MODI:  (As interpreted.)  Firstly, India is a democratic country, and our culture and our thought philosophy is *Vasudhaiva Kutumbakam*, which basically means that the entire world is a family.  Every Indian is my own family member.  And when it comes to such personal matters, two cou- — leaders of two countries will not get together on that topic and discuss anything on an individual matter. \n\n(Cross-talk.)\n\nPRESIDENT TRUMP:  Go ahead.  Please.  Yeah.  Please.\n\nQ    Which one?\n\nPRESIDENT TRUMP:   Sir, go ahead, please. \n\nQ    Yeah.  Thank you, Mr. President.  Thank you, Mr. Prime Minister.  I have a question for you as well. \n\nBut, Mr. President, you have suggested — with regards to the Russia-Ukraine war, you’ve suggested several things that Ukraine should give up: the idea of NATO membership, territory that was seized back in 2014 by Russia.  What should Russia give up?\n\nPRESIDENT TRUMP:  Russia has gotten themselves into something that I think they wish they didn’t.  If I were president, it would not have happened — absolutely would not have happened, and it didn’t happen for four years. \n\nIf you look at what has taken place, under President Bush, they lost a lot.  Under President Obama, they lost Crimea.  Under Biden, it looks like they could lose the whole thing.  Under Trump, they lost nothing — Ukraine lost nothing.  They didn’t give up anything.  And you take a look at the other three presidents surrounding me, they gave up a lot. \n\nI think that when you look at Ukraine and when you look at the mess that they’re in, it’s got to be ended, and it’s got to be stopped. \n\nNow, Russia has taken over a pretty big chunk of territory, and they also have said from day one — long before President Putin, they’ve said they cannot have Ukraine be in NATO.  They said that very strongly. \n\nI actually think that that was the thing that caused the start of the war.  And Biden said it, and Zelenskyy said it, and I think that was one of the reasons — one of the starts of the war. \n\nBut from long before Putin, they said you cannot have Ukraine going in, in any way, into NATO.  And I start from that standpoint.  I think everybody knew that. \n\nNow, if a better deal can be negotiated, if they were able to make a deal where they can do that, that’s fine with me.  I really don’t care.  I want that bloodshed to stop.  I don’t want to see — you know, we have an ocean between us and the site we’re talking about — the site of death.  We’re calling it the fields of death.  We have a big ocean in between us.  This is more important for Europe.  We shouldn’t be in — they have to equalize, and they’re going to have to do it fast, but they have to equalize. \n\nBut as far as the negotiation, it’s too early to say what’s going to happen.  Maybe Russia will give up a lot, maybe they won’t, and it’s all dependent on what is going to happen.  The negotiation really hasn’t started. \n\nBut I will say, as far as NATO is concerned, from many years before President Putin, I will tell you that I’ve heard that Russia would never accept that, and I think Ukraine knew that, because Ukraine wasn’t in and never requested to be in until more recently.  So, that’s the way it is, and I think that’s the way it’s going to have to be. \n\n(Cross-talk.)\n\nQ    But, Mr. President — Mr. President, I —\n\nPRESIDENT TRUMP:  Go ahead, please.  All right.  Go ahead, please, with the tie. \n\n(Cross-talk.)\n\nWith the tie, yeah. \n\nQ    Mr. President, I have a question for the prime minister.\n\nQ    Mr. President —\n\nPRESIDENT TRUMP:  Yes, go ahead, please. \n\nQ    This is Saurabh Shukla from NewsMobile.  Mr. President, you spoke about Prime Minister Modi as a tough negotiator.  Who was a tougher negotiator today, and who has a better negotiating tactic when it comes to tariffs with — \n\nPRESIDENT TRUMP:  Oh, he’s a much tougher negotiator than me, and he’s a much better negotiator than me.  There’s not even a contest.  Okay?  (Laughter.)\n\n(Cross-talk.)\n\nYeah, go ahead.  Please go ahead.  Go ahead. \n\nQ    Reena Bhardwaj from ANI.  How do you see this relationship between the India and the United States to counter China?  And what is your vision when it comes to India, you know, brokering peace in the Ukraine and Russia conflict?\n\nPRESIDENT TRUMP:  Well, I think we are going to have a very good relationship with China.  I got along with President Xi very well until COVID.  That was a bridge too far.  But until then, I got along with President Xi very, very well.  We were very close, as leaders go.  I don’t want to be naive, but as leaders go, I think we were very close.\n\nAnd I think that China is a very important player in the world.  I think they can help us get this war over with Ukraine and Russia. \n\nAnd I look at India, I do see the skirmishes on the border, which are quite vicious, and I guess they continue to go on.  If I could be of help, I’d love to help, because that should be stopped.  That’s been going on for a long time, and it’s quite violent.  It’s quite violent. \n\nBut I would hope that China and India and Russia and U.S. and all of us can get along.  It’s very important. \n\nYou know, the power of weaponry today is — and not only nuclear, but nuclear, in particular — the power of weaponry is very important.  I said before that I had very constructive talks in my first term with President Putin about the denuclearization of the two countries.  And then we were going to go to China after we worked some kind of a deal, and we had the confines of a deal.  We were — I thought we — he really wanted to do it and so did I — denuclearize.  And it’s such a beautiful term, when you think about it.  In other words, to bring it down, because the power of those weapons is too great. \n\nAnd I did speak to President Xi about that, and I was getting also a very good response.  He’s building a very strong nuclear power.  He’s not very close to Russia or the United States right now, but he will be soon.  I mean, he’ll catch up over the period of four or five years, they say. \n\nBut it would be a great thing if we could — on a military basis, we’re going to spend this year 900- — let’s say $915 billion on military.  Russia, without the war, was spending close to a hundred, but with the war, I can’t tell you what they’re spending, but they’re spending a lot.  And China is spending $400- and $450 billion.  We’re over $900 billion.  And I said, “You know, it doesn’t really make sense.”  I said, “We’re spending the money against each other, and we could spend that money for better purpose if we got along.”  And I’ll tell you, I think that something like that will happen. \n\nFirst, when I left, as you know, four years ago, we didn’t have Israel and the Middle East.  We didn’t have October 7th — what a disaster — the disaster.  Nothing was happening.  Iran was not going to do anything, because Iran did not have much money at that point.  They were broke.  They were totally broke.  They didn’t have money for Hamas or for Hezbollah.  And you didn’t have Russia with Ukraine, and that would never have happened. \n\nBut now I come back, and I have — the whole world is on fire, so I have to put out the fires.  But after I put out the fires, I’m going to meet with China, and I’m going to meet with Russia, and we’re going to see if we can de-escalate, if we can bring it down — military — especially as it pertains to nuclear. \n\nPlease. \n\n(Cross-talk.) \n\nQ    And India’s role — India’s role in — how do —\n\nQ    Mr. President, you mentioned about American Islamic terrorism —\n\n(Cross-talk.)\n\nQ    Prime Minister, how do you see India play a role in a — in de-escalating the Ukraine-Russia —\n\nINTERPRETER:  Mic, please.\n\nPRIME MINISTER MODI:  (No translation provided.)\n\nQ    (As interpreted.)  Prime Minister, how do you see India’s role?  You have had discussions with President Trump about de-escalating the conflict in Russia and Ukraine.\n\nPRIME MINISTER MODI:  (As interpreted.)  As you know, I have been in constant contact with both Russia and Ukraine.  I have also visited both countries.  And many peoples are mistaken and they feel that India is neutral.  I would like to clarify: India is not neutral.  We have taken a side, and we have taken the side of peace. \n\nAnd it is based on this principle of ours that, in the presence of President Putin, I clearly said in front of the media that this is not the era of war.  And even today, it is my conviction that solutions cannot be found on the battlefield.  Ultimately, you have to come to the negotiating table, and India has constantly made efforts that there are talks that take place where both parties are present.  It is only then that we will find a solution.\n\nThe efforts being made by President Trump — I support them, I welcome them, and I would like that President Trump is successful as soon as possible so that the world is on the path to peace once again.\n\n(Cross-talk.)\n\nPRESIDENT TRUMP:  Everybody, thank you very much.  Thank you very much. \n\n(Cross-talk.)\n\nAnd I very much appreciate the prime minister visiting our great country, and I do really appreciate it.  We have so much in common, and all we want to do is have peace, and we want to have strength, and we want to have lots of different things together, but the relationship with India and with the prime minister has never been better. \n\nThank you very much. \n\nPRIME MINISTER MODI:  Thank you.  Thank you.  (Applause.)\n\nPRESIDENT TRUMP:  Thank you very much.\n\nPRIME MINISTER MODI:  Thank you.\n\nPRESIDENT TRUMP:  A great honor.  Thank you.\n\n     END                6:45 P.M. EST\n",
  "summary": "On February 13, 2025, President Trump and Indian Prime Minister Narendra Modi held a joint press conference at the White House to discuss plans to strengthen economic, defense, and technological ties between the United States and India. They announced an increase in U.S. military sales to India, including advancements towards providing F-35 stealth fighters. The leaders also addressed increasing cooperation to counter radical Islamic terrorism and align economic policies for mutual benefit, such as reducing India's tariffs on U.S. goods.\n\nPrime Minister Modi emphasized the deep partnership between the two countries, highlighting goals to double bilateral trade to $500 billion by 2030. The leaders also discussed energy cooperation and technological collaboration on artificial intelligence and semiconductors. India expressed its commitment to curbing illegal immigration and supporting the extradition of criminals, exemplified by the U.S.'s action to extradite a suspect involved in the 2008 Mumbai attacks.\n\nBoth leaders showcased their synergy by aligning themselves with common goals such as global peace, democratic values, and a robust trade partnership. This initiative is a strategic move to bolster regional security in the Indo-Pacific and enhance mutually advantageous economic practices. They also addressed numerous questions from reporters, covering topics from trade deficits to global peace efforts.",
  "eli5": "President Trump and Prime Minister Modi promised to work together to make their countries stronger friends by selling military equipment, sharing technology, and trading more fairly. They also want to stop bad guys and make new inventions like smart computers while helping each other grow and stay safe.",
  "keywords": [
    "U.S.-India relations",
    "trade",
    "military sales",
    "technology collaboration",
    "counter-terrorism",
    "economic partnership",
    "Indo-Pacific security",
    "artificial intelligence"
  ],
  "issues": [
    "High tariffs imposed by India on U.S. goods",
    "Concerns about radical Islamic terrorism",
    "Extradition of suspects involved in terror activities",
    "Trade imbalance between the U.S. and India",
    "Need for a reciprocal tariff policy"
  ],
  "citations": [],
  "document_type": "Press Release"
}