{
  "title": "Remarks By President Trump at the World Economic Forum – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Remarks By President Trump at the World Economic Forum – The White House",
  "og:description": "REMARKS BY PRESIDENT TRUMP AT THE WORLD ECONOMIC FORUM Via Teleconference      11:06 A.M. EST THE PRESIDENT:  Well, thank you",
  "og:url": "https://www.whitehouse.gov/remarks/2025/01/remarks-by-president-trump-at-the-world-economic-forum/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T18:41:29+00:00",
  "article:modified_time": "2025-01-24T16:33:40+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Remarks](https://www.whitehouse.gov/remarks/)\n\n# \t\t\t\t\tRemarks By President Trump at the World Economic Forum\t\t\t\t\n\nJanuary 23, 2025\n\nREMARKS BY PRESIDENT TRUMP AT THE WORLD ECONOMIC FORUM\n\nVia Teleconference\n\n     11:06 A.M. EST  \n\nTHE PRESIDENT:  Well, thank you very much, Klaus.  And hello to everyone in beautiful Davos.      This has been a truly historic week in the United States.  Three days ago, I took the oath of office, and we began the golden age of America.  The recent presidential election was won by millions of votes and all seven — every one of them — all seven swing states.  It was a massive mandate from the American people like hasn’t been seen in many years.  And some of the political pundits, even some of my so-called enemies, said it was the most consequential election victory in 129 years.  That’s quite nice.      What the world has witnessed in the past 72 hours is nothing less than a revolution of common sense.  Our country will soon be stronger, wealthier, and more united than ever before, and the entire planet will be more peaceful and prosperous as a result of this incredible momentum and what we’re doing and going to do.     My administration is acting with unprecedented speed to fix the disasters we’ve inherited from a totally inept group of people and to solve every single crisis facing our country.      This begins with confronting the economic chaos caused by the failed policies of the last administration.  Over the past four years, our government racked up $8 trillion in wasteful deficit spending and inflicted nation-wrecking energy restrictions, crippling regulations, and hidden taxes like never before.  The result is the worst inflation crisis in modern history and sky-high interest rates for our citizens and even throughout the world.  Food prices and the price of almost every other thing known to mankind went through the roof.      President Biden totally lost control of what was going on in our country but, in particular, with our high-inflation economy and at our border.  Because of these ruinous policies, total government spending this year is $1.5 trillion higher than was projected to occur when I left office just four years ago.  Likewise, the cost of servicing the debt is more than 230 percent higher than was projected in 2020.\n\n     The inflation rate we are inheriting remains 50 percent higher than the historic target.  It was the highest inflation probably in the history of our country.  That’s why, from the moment I took office, I’ve taken rapid action to reverse each and every one of these radical left policies that created this calamity — in particular, with immigration, crime, and inflation.      On day one, I signed an executive order directing every member of my Cabinet to marshal all powers at their disposal to defeat inflation and reduce the cost of daily life.  I imposed a federal hiring freeze, a federal regulation freeze, a foreign aid freeze, and I created the new Department of Government Efficiency.      I terminated the ridiculous and incredibly wasteful Green New Deal — I call it the “Green New Scam”; withdrew from the one-sided Paris Climate Accord; and ended the insane and costly electric vehicle mandate.  We’re going to let people buy the car they want to buy.      I declared a national em- — energy emergency — and it’s so important — national energy emergency to unlock the liquid gold under our feet and pave the way for rapid approvals of new energy infrastructure.  The United States has the largest amount of oil and gas of any country on Earth, and we’re going to use it.      Not only will this reduce the cost of virtually all goods and services, it will make the United States a manufacturing superpower and the world capital of artificial intelligence and crypto.     My administration has also begun the largest deregulation campaign in history, far exceeding even the record-setting efforts of my last term.      In total, the Biden administration imposed $50,000 in additional regulatory costs on the average American household over the last four years.  I have promised to eliminate 10 old regulations for every new regulation, which will soon put many thousands of dollars back in the pockets of American families.     To further unleash our economy, our majorities in the House and Senate — which we also took, along with the presidency — are going to pass the largest tax cut in American history, including massive tax cuts for workers and family and big tax cuts for domestic producers and manufacturers.  And we’re working with the Democrats on getting an extension of the original Trump tax cuts, as you probably know by just reading any paper.     My message to every business in the world is very simple: Come make your product in America, and we will give you among the lowest taxes of any nation on Earth.  We’re bringing them down very substantially, even from the original Trump tax cuts.  But if you don’t make your product in America, which is your prerogative, then, very simply, you will have to pay a tariff — differing amounts, but a tariff — which will direct hundreds of billions of dollars and even trillions of dollars into our Treasury to strengthen our economy and pay down debt.      Under the Trump administration, there will be no better place on Earth to create jobs, build factories, or grow a company than right here in the good old USA.      Already, American’s economic — and you can see this, I think, maybe even in your — in your wonderful, wonderful room that you’re all gathered together — so many of my friends — but, Americans, the economic confidence is soaring like we haven’t seen in many, many decades, maybe not at all.      Upon my election, it was just announced that small-business optimism skyrocketed by 41 points in a single month.  That’s the highest ever.  There’s never been anything like that.      SoftBank has announced between a $100 and $200 billion investment in the U.S. economy because of the election result.  And just two days ago, Oracle, SoftBank, and OpenAI announced a $500 billion investment in AI infrastructure.  Other companies, likewise, have announced billions and billions and billions — adding up to trillions — of investment in America, in the United States.      And it’s also reported today in the papers that Saudi Arabia will be investing at least $600 billion in America.  But I’ll be asking the crown prince, who’s a fantastic guy, to round it out to around $1 trillion.  I think they’ll do that because we’ve been very good to them.  And I’m also going to ask Saudi Arabia and OPEC to bring down the cost of oil.  You got to bring it down, which, frankly, I’m surprised they didn’t do before the election.  That didn’t show a lot of love by them not doing it.  I was a little surprised by that.      If the price came down, the Russia-Ukraine war would end immediately.  Right now, the price is high enough that that war will continue.  You got to bring down the oil price; you’re going to end that war.  They should have done it long ago.  They’re very responsible, actually, to a certain extent, for what’s taking place — millions of lives are being lost.      With oil prices going down, I’ll demand that interest rates drop immediately.  And, likewise, they should be dropping all over the world.  Interest rates should follow us.      All over, the progress that you’re seeing is happening because of our historic victory in a recent presidential election, one that has become quite well known throughout the world. \n\nI think a lot of things are happening to a lot of countries.  They say that there’s light shining all over the world since the election.  And even countries that we aren’t particularly friendly with are happy because they understand what — there is a future and th- — how great the future will be.\n\nUnder our leadership, America is back and open for business.  And this week, I’m also taking swift action to stop the invasion at our southern border.  They allowed people to come in at levels that nobody has ever seen before.  It was ridiculous.  I decided a — and declared to dec- — to — to do — and very, very importantly — a national emergency on our border; immediately halted all entry of illegal border crossers, of which there were many; and began properly returning the illegal trespassers back to the place from which they came. \n\nThat action, as you’ve probably seen, has already started very strongly.  I have deployed active-duty U.S. military and National Guard troops to the border to assist in repelling the invasion.  It was really an invasion.  We will not allow our territory to be violated. \n\nAfter four long years, the United States is strong and sovereign and a beautiful nation once again. It’s a strong, sovereign nation.\n\nIn addition, I’m pleased to report that America is also a free nation once again.  On day one, I signed an executive order to stop all government censorship.  No longer will our government label the speech of our own citizens as misinformation or disinformation, which are the favorite words of censors and those who wish to stop the free exchange of ideas and, frankly, progress.  We have saved free speech in America, and we’ve saved it strongly.\n\nWith another historic executive order this week, I also ended the weaponization of law enforcement against the American people — and, frankly, against politicians — and restored the fair, equal, and impartial rule of law. \n\nMy administration has taken action to abolish all discriminatory diversity, equity, and inclusion nonsense — and these are policies that were absolute nonsense — throughout the government and the private sector.  With the recent, yet somewhat unexpected, great Supreme Court decision just made, America will once again become a merit-based country.  You have to hear that word: merit-based country. \n\nAnd I’ve made it official — an official policy of the United States that there are only two genders, male and female, and we will have no men participating in women’s sports, and transgender operations, which became the rage, will occur very rarely. \n\nFinally, as we restore common sense in America, we’re moving quickly to bring back strength and peace and stability abroad.  I’m also going to ask all NATO nations to increase defense spending to 5 percent of GDP, which is what it should have been years ago — it was only at 2 percent, and most nations didn’t pay until I came along; I insisted that they pay, and they did — because the United States was really paying the difference at that time, and it’s — it was unfair to the United States.  But many, many things have been unfair for many years to the United States. \n\nBefore even taking office, my team negotiated a ceasefire agreement in the Middle East, which wouldn’t have happened without us, as I think most of the people in the room know.  Earlier this week, the hostages began to return to their families.  They are returning, and it’s a beautiful sight.  And they’ll be coming in more and more.  They started coming back on Sunday.\n\nOur efforts to secure a peace settlement between Russia and Ukraine are now, hopefully, underway.  It’s so important to get that done.  That is an absolute killing field. \n\nMillions of soldiers are being killed.  Nobody has seen anything like it since World War II.  They’re laying dead all over the flat fields.  It’s a flat field — farmland, and there’s millions of Russians and millions of Ukrainians.  Nobody’s seen anything like it since World War II.  It’s time to end it. \n\nAnd here in America, we have big events coming up.  Next year we have the 250th anniversary of America’s founding.  I’m so honored to be president during that.  That’s been a big event.  They’ve been talking about it for 10 years.  We also have the World Cup, and I understand Gianni — Gianni is in the room — Infantino.  He was very instrumental in helping us get it — he’s there with you someplace, I think — and I want to thank him for that. \n\nAnd then we have the Olympics coming up, which I was instrumental in getting, also, in my first term.  And who would have known that by skipping a term, I would get the Olympics?  I was upset.  I said, “You know, I got the Olympics to come and I won’t be president.”  But it turned out, through a stroke of luck or whatever you might call it, that I’m going to be president during the World Cup and the Olympics and the 250th\n\nanniversary.  So, that’s going to be three big events.\n\nAnd we’ve accomplished more in less than four days — we have really been working — four days — than other administrations have accomplished in four years, and we’re just getting started.  It’s really an amazing thing to see, and the spirit and the light over our country has been incredible. \n\nUnder the last administration, our nation has suffered greatly, but we are going to bring it back and make it greater, bigger, stronger, better than ever before. \n\nI want to thank everybody for being with you.  I would have been there myself, except the inauguration was two days ago.  I thought it might be a little bit quick to make it the first stop, but we’ll get there one day.  We hope to get there. \n\nBut I — I do appreciate — I heard the audience is fantastic, and many of my friends are in the audience.  And I will be taking questions now from some very distinguished people. \n\nThank you all very much.  (Applause.)\n\nMR. BRENDE:  Thank you.  Thank you very much, Mr.  President, for that very powerful speech, and I think you could hear the applause all the way from Davos to the White House.  But next year, it will be even better, because then you can get the applause here in Davos.  So, we wish you welcome to our village next year.  We hope to see you. \n\nTHE PRESIDENT:  Thank you very much. \n\nMR. BRENDE:  So, we also know, Mr. President, that you open up for interaction here.  We have a great panel with some of the most distinguished businesspeople in the world. \n\nLet me start with someone that you know really well, that I think is almost a neighbor of you in Mal-a- — in — in Florida, Mr. Steve Schwarzman, chairman, CEO, and cofounder of Blackstone Group. \n\nSo, Steve, floor is yours.\n\nMR. SCHWARZMAN:  Well, Mr. President —\n\nTHE PRESIDENT:  Hello, Steve. \n\nMR. SCHWARZMAN:  — I’m sure the crown prince of Saudi Arabia will be really glad you gave this speech today.  (Laughter.) \n\nTHE PRESIDENT:  I hope so.\n\nMR. SCHWARZMAN:  You’ve had the busiest four days that anybody can imagine, and congratulations for that. \n\nAnd my question is — is about some of the things I’ve observed here at Davos.  It’s a terrific forum.  I’ve met lots of people, as usual.  I think I’ve been here 30 years.  And a lot of the European businesspeople have expressed enormous frustration with the regulatory regime in the EU, and they attribute slower growth rates here because of numerous factors, but especially because of regulations. \n\nAnd you’ve taken a completely different approach in this area.  And if you could explain the theory of what you’re doing, how you’re going to do it, and what you expect the outcome to be, I’d appreciate it.\n\nTHE PRESIDENT:  Well, thank you very much.  And congratulations, Steve — you’re a friend of mine — but on a great career.  You have had an amazing career and continues.  So, I just want to congratulate you.  Very inspirational to a lot of people. \n\nI want to talk about the EU, because you mentioned specifically that I’ve also had a lot of friends and leaders of countries.  I’ve gotten to know them all my first term and a little bit during this period of four years and know them well, like them a lot, but they’re very frustrated because of the time everything seems to take to get approved — environmental impact statements for things that you shouldn’t even have to do that, and many, many other ways that it takes. \n\nAnd I’m going to give you a quick little example.  I w- — in the private life, my beautiful private life — before I had all these things happening — the world is a little different — I had a nice, simple life.  You knew that. \n\nBut when I had that simple life, I did projects, and I had a big project in Ireland, and it had to get approval on something that would have made it even better.  And I got the approval from Ireland in a period of a week, and it was a very, very, very efficient, good approval. \n\nAnd they informed me, though, “The problem is you’re going to have to get it from the EU, and we think that’ll take five to six years.”  And I said, “You have to be kidding.”  And this was before politics.  And I said, “Wait a minute.  It’s not that important.  I don’t want to go five or six years.”  But it would have been a big investment.  It would have been nice, and it would have been good for the project. \n\nAnd I sent the people to the EU to see if they could speed it up, and basically it was a five- or six-year wait just to get a simple approval that Ireland gave me in a period of, literally, not much more than a week. \n\nAnd I realized right then — that was the first time I really was involved with the EU, but I realized right then, that’s a problem, and I didn’t even bother applying to do it, and — or if I did, I pulled it very quickly.  I don’t wa- — I have to be very accurate, because I don’t want to be criticized.  “He did apply, actually.”  No, I want to be very accurate.  So, I don’t think I did, but if I did, I pulled it very quickly.  It was just something you — you couldn’t wait five years or six years to get an approval. \n\nSo, a lot of — in a very big business sense, a lot of people are — are claiming that’s the problem.      From the standpoint of America, the EU treats us very, very unfairly, very badly.  They have a large tax that we know about and — a VAT tax — and it’s a very substantial one.  They don’t take our far- — essentially, don’t take our farm products and they don’t take our cars.  Yet, they send cars to us by the millions.\n\nThey put tariffs on things that we want to do, like, for instance, I think they actually — in terms of these are noneconomic or nonmonetary tariffs, and — and those are very bad, and they make it very difficult to bring products into Europe, and yet they expect to be selling and they do sell their products in the United States. \n\nSo, we have, you know, hundreds of billions of dollars of deficits with the EU, and nobody is happy with it.  And we’re going to do something about it, but nobody is happy with it.  So, I think the EU has to speed up their process. \n\nFriends of mine that are in some of the nations within the EU, great people, they — they want to be able to compete better, and you can’t compete when you can’t get — go through the approval process fast.  There’s no reason why it can’t go faster. \n\nSo, you know, I’m — I’m trying to be constructive, because I love Europe.  I love the countries of Europe.  But the process is a very cumbersome one, and th- — and they do treat the United States of America very, very unfairly with the VAT taxes and all of the other taxes they impose.\n\nOne other — just to finish up, I got a call from the head of a major airline, one of the biggest airlines in the world.  And he said, “Sir, could you help us?”  “What?” “Landing in Europe is brutal.  They charge us fees for everything, and it’s so unfair.”  I said, “How does it compare to China?”  He said, “It’s — it’s much worse.” \n\nAnd the other thing, as you know, they took court cases with Apple, and they supposedly won a case that most people didn’t think was much of a case.  They won $15 or $16 billion from Apple.  They won billions from Google.  I think they’re after Facebook for billions and billions. \n\nThese are American companies.  Whether you like them or not, they’re — they’re American companies, and they shouldn’t be doing that.  And that’s — as far as I’m concerned, it’s a form of taxation. \n\nSo, we have some very big complaints with the EU.      Thank you.\n\nMR. BRENDE:  Tha- — thank you very much, Mr. President.  We’ll now go to one of your friends in the EU, Patrick Pouyanné.  He’s the chairman and CEO of TotalEnergies.      I guess you have a question ready, Patrick, for the president.\n\nMR. POUYANNÉ:  Mr. President, as we understand, energy is at the top of your agenda, and it’s an honor for me to represent the energy industry tonight in this panel.  TotalEnergies is indeed the fourth largest oil and gas and electricity company in the world. \n\nI will not ask you a question about the oil price.  It’s quite clear what you expect from us.  I will more go to gas more.  And we, our company, is the largest, number one exporter LNG from the U.S. company.  We are a strong contributor to and we invest in mammoth LNG projects in Texas, $20 billion.  It’s far from $200, but it’s $20 billion.  And we contribute with that to security of supply to Europe as we export this LNG to Europe. \n\nSome experts fear that if there are too many projects developed in the U.S. on LNG, this could have an inflat- — inflationary impact on the U.S. domestic gas price, and they recommend a pause on these projects. \n\nI would ask you the following question: What are your views on — about such a pause on investments on LNG in the U.S.?  What would happen if you would observe an increased domestic gas price because of these exports?  And final question, which is important for Europe: Would you agree to guarantee security of supplies of U.S. LNG to Europe?\n\nTHE PRESIDENT:  Well, on the last part of your question, yes, I would.  I would make sure that you get it.  If we make a deal, we make a deal; you’ll get it.  Because a lot of people do have that problem.  They make a deal, and then it can’t get supplied because of war-type problems and other problems.  So, we would absolutely do that. \n\nLNG is very interesting, because when I took office for the first term, one of the first things I looked at was two — there were two very massive plants in Louisiana, a state that has been very good to me.  I won it by many, many points, and\n\nI felt strongly indebted to it, actually. \n\nAnd they said there are two plants that have been under environmental consideration for more than 10 years, and they were costing — as you say, you know how expensive those plants are — but they were costing like $12 billion and, I think, $14 or $15 billion.  But they couldn’t get their permits.  It was — they were in review for years — many, many years — like a decade or more. \n\nAnd I said, “So ridiculous.”  I know so much about that, because in the construction industry, I had to go through it too, but I got good at it after a while. \n\nBut I — I went — I saw the projects, and you’re talking about a total investment of $25 to $30 billion, and it looked like it was going to end.  They couldn’t get their permits, and I got them done in less than a week.  It was done, completed. \n\nIn fact, when they called them to announce that it was done, the countries — largely countries — Japan was involved and — and another country and some very big investors — they couldn’t believe it.  They actually couldn’t believe it. \n\nAnd I said, “Just do yourself one favor.  Don’t pay any consultants, because the only one that got it done was me.”  I got it done because it was the right thing to do for the U.S. and for the world, but the consultants had nothing to do with it, you know?  The consultants go in and they say, “Give us millions of dollars because Trump did it.”  Nobody called me about it.  I just heard it was a problem for years, and I got it done because it was the right thing to do for the U.S. and the right thing to do for beyond.  It had to do with energy — very important. \n\nSo, I think it’s very important.  I think the — the — you know, I disagree with one.  I think the more that you do, the lower the price is going to go.  And what I’d like to see is rapid approvals. \n\nWe’re going to give very rapid approvals in the United States, like with the AI plants, talking to — many people want to build them.  That’s going to be a very big thing. \n\nWe’re going to build electric generating facilities — they are going to build.  I’m going to get them the approval.  Under emergency declaration, I can get the approvals done myself without having to go through years of waiting. \n\nAnd the big problem is we need double the energy we currently have in the United States — can you imagine? — for AI to really be as big as we want to have it.  Because it’s a very competitive — it will be very competitive with China and others. \n\nSo, I’m going to give emergency declarations so that they can start building them almost immediately. \n\nAnd I’m — I’m — I think it was largely my idea, because nobody thought this was possible.  It wasn’t that they were not smart, because they’re the smartest, but I told them that what I want you to do is build your electric generating plant right next to your plant as a separate building, connected.  And they said, “Wow, you’re kidding.”  And I said, “No, no.  I’m not kidding.”  You don’t have to hook into the grid, which is old and, you know, could be taken out.  If it’s taken out, they wouldn’t have any way to get any electricity. \n\nSo, we are going to allow them to go on a very rapid bas- — basis to build their plant — build the electric generating plant.  They can fuel it with anything they want, and they may have coal as a backup.  Good, clean coal. \n\nYou know, if there were a problem with a — with a pipe coming in — as an example, you’re going with gas — oil or gas — and a pipe gets blown up or, for some reason, doesn’t work, there are some companies in the U.S. that have coal sitting right by the plant so that if there’s an emergency, they can go to that short-term basis and use our very clean coal. \n\nSo, that’s something else that a lot of people didn’t even know about.  But nothing can destroy coal — not the weather, not a bomb — nothing.  It might make it a little smaller, might make it a little different shape.  But coal is very strong as a backup.  It’s a great backup to have that facility, and it wouldn’t cost much more — more money. \n\nAnd we have more coal than anybody.  We also have more oil and gas than anybody. \n\nSo, we’re going to make it so that the plants will have their own electric generating facilities attached right to their plant.  They don’t have to worry about a utility.  They don’t have to worry about anything.  And we’re going to get very rapid approvals.\n\nMR. BRENDE:  Thank you.  Thank you so much, Mr. President.  We’ll now go to another CEO that you know very well: Brian Moynihan, the CEO and chair of Bank of America.\n\nMR. MOYNIHAN:  Good afternoon, Mr. President, and congratulations — an obviously eventful week for you and your family. \n\nIf you remember, five years ago, you came here and we walked among 150 CEOs from all over the world, and you engaged with them about your policies and your procedures.\n\nThis year, you’re not here.  And yet this week was eventful, from the orders that you mentioned earlier — literally a wave of orders coming out on immigration, on trade, and many other matters. \n\nAnd so, as a representative of the United States here,\n\nwe got a lot of questions about what does all this mean and how would the president square this with his clear focus on growth, prosperity, market gro- — stock market growth, a good bond market, and bringing down prices. \n\nSo, how do you think about the impact of all these orders and how fast they come out and how you’re going to balance them with that scorecard of being successful on both contan- — continuing GDP growth, bringing down inflation, and also having a good stock price appreciation for the American citizen?\n\nTHE PRESIDENT: Well, I think it’s going to actually bring down inflation.  It’s going to bring up jobs.  We’re going to have a lot of jobs.  We’re going to have a lot of companies moving in. \n\nYou know, Brian, we’re at 21 percent.  It was at 40 percent, and I got it down to 21 percent — the corporate tax.  And it was — actually, if you look at state and city, it was, in many cases, much higher than 40 percent.  I got it down to 21 percent.  And now we’re going to bring it down from 21 to 15 percent if — this is a big “if” — if you make your product in the U.S.\n\nSo, we’re going to have the lowest — just about the lowest rate.  It will be — the 21 is on the low side worldwide; the 15 is about as low as it gets, and by far the lowest of a large country — a large, you know, rich, powerful country — by far, not even a contest. \n\nSo, we’re going to bring it down to 15 percent if you make your product in the USA.  So, that’s going to create a — a tremendous buzz. \n\nWe’re also probably going back to the one-year deduction, where we deduct — you know, we — we did that originally, and that was amazing what — the impact that that had, the one-year deduction, which built up over a period of time and then it expires.  But we’re going to go back to that when we do the renewal of the Trump tax plan. \n\nWe have to get Democrats to approve it.  But, you know, if the Democrats didn’t approve it, I don’t know how they can survive with about a 45 percent tax increase, because that’s what it would be.  And so, I think they’re going to b- — w- — we’ve been working along with them pretty well. \n\nI think it’s very hard for a political group to say, “Let’s charge people 45 percent more.”  So, I think we’re in good shape.\n\nBut we’re actually doing a reduction for business and small businesses, where you’re going to b- — bring it down to 15 percent, which is really something. \n\nAnd, by the way, speaking of you — and you’ve done a fantastic job — but I hope you start opening your bank to conservatives, because many conservatives complain that the banks are not allowing them to do business within the bank, and that included a place called Bank of America.  This conserve- — they don’t take conservative business.  And I don’t know if the regulators mandated that because of Biden or what, but you and Jamie and everybody, I hope you’re going to open your banks to conservatives, because what you’re doing is wrong.\n\n     MR. MOYNIHAN:  Mr. President —     MR. BRENDE:  (Inaudible.)\n\n     MR. MOYNIHAN:  — I’ll say that your friend Gianni was — said hello — told me tell you hello, and we look forward to sponsoring the World Cup when it comes, both this summer for the club and next year.  So, thank you for getting that for the United States.\n\nTHE PRESIDENT:  Thank you very much, Brian.\n\nMR. BRENDE:  Thank you, Mr. President.  We’ll now go to Ana Botín.  She’s the executive chairman of Banco Santander, one of the big European banks and also in the U.S. \n\nSo, Ana.\n\nMS. BOTÍN:  Mr. President, congratulations on a historic victory. \n\nTHE PRESIDENT:  Thank you. \n\nMS. BOTÍN:  I believe you don’t know me as well as my fellow panelists, so a few words.  Santander is one of the largest banks in the world by number of customers, 170 million.  That’s more than my friend Brian or my friend Jamie have.  (Laughter.)\n\nTHE PRESIDENT:  Wow.\n\nMS. BOTÍN:  And those — (applause) —\n\nMR. MOYNIHAN:  If they fix the regulation (inaudible).\n\nMS. BOTÍN:  That’s coming.  That’s coming. \n\nMR. BRENDE:  That was cheeky.  (Laughter.)  \n\nMS. BOTÍN:  We are — we are a big investor in the United States.  We have many million customer, 12,000 employees.  We’re one of the largest auto lenders, and we recently launched a fully digital bank called Openbank. \n\nWe strongly believe banks have a pivotal role in the economy, and we can accelerate growth and help many more customers.  That’s what we do in the United States.  So, as Brian pointed out, we very much welcome your focus on deregulation and reducing bureaucracy. \n\nSo, my question is: What are your priorities in this regard, and how fast is this going to happen?  Thank you very much. \n\nTHE PRESIDENT:  Well, I think it’s going to — thank you and congratulations.  I know very much about your bank, and you’ve done a fantastic job.  Congratulations. \n\nWe are going to move very quickly.  We’ve moved very quickly.  We’ve done things in the last three days that nobody thought were possible to do in years.  And it’s all taken — it’s all taken effect.  It’s going to have a huge impact on the economy, a huge positive impact.  Money was being wasted on crazy things. \n\nI mean, the Green New Deal was such a total disgrace — what — what — how that was perpetrated.  And it was conceived of by people that were average students — less than average students, I might add — and never even took a course in energy or the environment.  It was just a game.  Remember, the world was going to end in 12 years?  Remember that?  Well, the 12 years has come and gone.  It was going to end.  It was going to all foam into earth.  But, you know, the time has come.\n\nThe — these people — and they — they really — they really scared the Democrats large- — I can’t say the Republicans.  Republicans maybe could have fought harder to stop it, but it’s been a tremendous waste of — a tremendous waste of money. \n\nYou know, during my four years, we had the cleanest air, we had the cleanest water, and yet we had the most productive economy in the history of our country.  We had the most productive economy.  Until COVID came, we had the most productive in the history of our country, by far. \n\nAnd — and actually, you could look worldwide, we — we’re — we were beating everybody from China to everybody else.  So — and we think we really — now, with what we have learned and all of the other things that have taken place, we think we can even far surpass that — a- — actually, far, far surpass it.  But we do — one thing we’re going to be demanding is we’re going to — be demanding respect from other nations. \n\nCanada.  We have a tremendous deficit with Canada.  We’re not going to have that anymore.  We can’t do it.  It’s — it’s — I don’t know if it’s good for them.  As you probably know, I say, “You can always become a state, and if you’re a state, we won’t have a deficit.  We won’t have to tariff you, et cetera, et cetera.” \n\nBut Canada has been very tough to deal with over the years, and it’s not fair that we should have a $200 billion or $250 billion deficit.  We don’t need them to make our cars, and they make a lot of them.  We don’t need their lumber because we have our own forests, et cetera, et cetera.  We don’t need their oil and gas.  We have our — we have more than anybody. \n\nSo, you know, just as an example, with Mexico — we’re dealing with Mexico, I think, very well.  And we’re just — you know, w- — we just want to be treated fairly with other nations, because there’s hardly a nation in the world — and I blame this on us, and I blame it on politicians that for some reason — and probably mostly it’s stupidity, but you could also say other reasons, but mostly stupidity — they’ve allowed other nations to take advantage of the U.S.  And w- — we can’t allow that to happen anymore. \n\nYou know, we have debt.  It’s a very small debt when you compare it to value — the value of the assets that we have, but we don’t want to do that.  We want to just have debt be obliterated, and we’ll be able to do that fairly rapidly.  And a lot of good things are going to happen. \n\nAnd — and honestly, good things are going to happen for the world, and good things are going to happen for the people that are dealing with us — allies and beyond allies. \n\nOne thing — very important — I really would like to be able to meet with President Putin soon and get that war end — ended, and — and that’s not from the standpoint of economy or anything else.  It’s from the standpoint of millions of lives are being wasted.  Beautiful, young people are being shot in the battlefield.  You know, the bullet — a very flat land, as I said, and the bullet goes — there’s no — there’s no hiding.  And a bullet — the only thing going to stop the bullet is a human body.  And you have to see — I’ve seen pictures of what’s taken place.  It’s a carnage. \n\nAnd we really have to stop that war.  That war is horrible.  And I’m not talking economy, I’m not talking economics, I’m not talking about natural resource.  I’m just talking about: There’s so many young people being killed in this war, and that’s not including the people that have been killed as the cities are being, you know, knocked down building by building.  So, we really should get that stopped. \n\nLikewise, in the Middle East, I think we’ve made a lot of progress in the Middle East, and I think that’s going to — that’s going to come along pretty well.\n\nThank you very much. \n\nMR. BRENDE:  Thank you, Mr. President.  We know that most consequential relationship in the world is between the U.S. and China.  U.S., 28 percent of the global economy; China close to 20.  That’s almost half of the global GDP. \n\nAnd we know that you called President Xi Jinping last Friday.  We heard that you had a good discussion. \n\nHow do you see the relationship between the U.S. and China in the next four years under your leadership?\n\nTHE PRESIDENT:  He called me.  But I see it very good.  I think that we’re going to have a very good relationship.  All we want is fairness.  We just want a level playing field.  We don’t want to take advantage.  We’ve been having massive deficits with China.  Biden allowed it to get out of hand.  He’s — $1.1 trillion deficit.  It’s ridiculous, and it’s just an unfair relationship. \n\nAnd we have to make it just fair.  We don’t have to make it phenomenal.  We have to make it a fair relationship.  Right now, it’s not a fair relationship.  The deficit is massive, as it is with other countries — a lot of Asian countries, actually.  But we have deficits that are very big, and we can’t keep doing that, so we’re not going to keep doing that. \n\nBut I like President Xi very much.  I’ve always liked him.  We always had a very good relationship.  It was very strained with COVID coming out of Wuhan.  Obviously, that strained it.  I’m sure it strained it with a lot of people, but that strained our relationship.  But we always had a great relationship, I would say, and we look forward to doing very well with China and getting along with China. \n\n     Hopefully, China can help us stop the war with, in particular, Russia-Ukraine.  And they have a great deal of power over that situation, and we’ll work with them. \n\nAnd I mentioned that with — during our phone conversation with President Xi, and hopefully we could work together and get that stopped. \n\nWe’d like to see denuclearization.  In fact, with President Putin, prior to a — an election result, which was, frankly, ridiculous, we were talking about denuclearization of our two countries, and China would have come along.  China has a — a much smaller, right now, nuclear armament than us or field than us, but they’re — they’re going to be catching it at some point over the next four or five years. \n\nAnd I will tell you that President Putin really liked the idea of — of cutting way back on nuclear.  And I think the rest of the world, we would have gotten them to follow.  And China would have come along too.  China also liked it. \n\nTremendous amounts of money are being spent on nuclear, and the destructive capability is something that we don’t even want to talk about today, because you don’t want to hear it.  It’s too depressing. \n\nSo, we want to see if we can denuclearize, and I think that’s very possible.  And I can tell you that President Putin wanted to do it.  He and I wanted to do it.  We had a good conversation with China.  They would have been involved, and that would have been an unbelievable thing for the planet.\n\nAnd I hope —\n\nMR. BRENDE:  Mr. President, when you’re —\n\nTHE PRESIDENT:  — it can be started up again.\n\nMR. BRENDE:  — back here in Davos next year, will — will there be then a peace agreement with — with Ukraine and Russia by then?\n\nTHE PRESIDENT:  Well, you’re going to have to ask Russia.  Ukraine is ready to — to make a deal. \n\nJust so you understand, this is a war that should have never started.  If I were president, it would never have started.  This is a war that should have never, ever been started.  And — and it wasn’t started during my — there was never even talk about it.  I knew that it was the apple of President Putin’s eye, but I also knew that there was no way he was going in, and he wasn’t going to go in. \n\nAnd then, when I was out, bad things happened, bad things were said, a lot of stupidity all around, and you end up with what you have.  Now you have all these bombed-out cities — they look like demolition sites — with many people killed. \n\nI think the — the thing that you’ll see about Ukraine is that far — far more people have died than is being reported.  And I’ve seen that.  But far, far more people have died.\n\nWhen you look at a city that’s become a demolition site, where big buildings have been collapsed by missiles hitting them and everything else, and they say, “One person was slightly injured.”  No, no, many people were killed.  Those are big buildings.  I was surprised at how — that was my business.  These are buildings that go two and three blocks long.  They’re 20 stories high.  They’re big, powerful buildings.  Then they were knocked down, and there were a lot of people in those buildings.  They had announced that two people were injured.  That’s not true.  So, I think you’re going to find that there were many more people killed in Ukraine and the Ukraine war than anybody has any idea. \n\nBut if you look now, so many of the — the people being killed are soldiers just facing each other with guns, rifles, and drones — the new form of warfare — drones.  And it’s a very sad thing to see.\n\nAnd when you see pictures of the fields that I see, nobody wants to see it.  You’ll never be the same.\n\nMR. BRENDE:  Thank you very much, Mr. President.  On behalf of all the 3,000 participants here in Davos, we really, really underline that joining us, the third day in your presidency, live, taking questions here, it’s so appreciated.  And we are already ready for receiving you next year in person. \n\nSo, thank you very much, and all the best from Davos.  (Applause.)\n\nTHE PRESIDENT:  Thank you.  Thank you very much.  Thank you.  (Applause.)\n\n                             END                11:49 A.M. EST\n",
  "summary": "On January 23, 2025, President Trump delivered remarks at the World Economic Forum via teleconference from the White House. During his speech, President Trump asserted the start of a new era in America following his recent electoral victory, which he described as historic and characterized by a wide margin of votes across all seven swing states. He criticized the previous administration's handling of the U.S. economy, citing excessive government spending and restrictive regulations as contributors to inflation and high interest rates. To address these issues, he outlined various initiatives taken in the early days of his new administration, such as reversing regulations, freezing government hiring, and establishing a Department of Government Efficiency.\n\nTrump emphasized his administration's intention to reclaim America's status as a leading manufacturing and economic power. He detailed various actions aimed at reducing taxes and encouraging domestic production, including a commitment to broad deregulation and significant tax cuts. Additionally, he touched upon foreign policy matters, such as fostering better relationships with China and securing peace in conflict regions like the Middle East and Eastern Europe. Trump also hinted at changes in national policies on social issues and global trade, projecting confidence in his administration's ability to effect swift and meaningful changes.\n\nThe President addressed questions from business leaders regarding regulatory policies, energy production, and international trade. He promised to continue working towards reducing wasteful spending and emphasized restoring merit-based policies and sovereignty at the national border. Trump concluded with a hopeful outlook on international cooperation and the prospects of denuclearization and peace settlement efforts involving key players like President Xi of China and President Putin of Russia.",
  "eli5": "President Trump gave a speech about what he's doing to make America better, like lowering taxes and creating more jobs, and he talked about working with other countries to stop wars and make the world safer.",
  "keywords": [
    "President Trump",
    "World Economic Forum",
    "economic policies",
    "deregulation",
    "international relations",
    "tax cuts",
    "denuclearization",
    "US-China relations",
    "Russia-Ukraine conflict",
    "energy policy"
  ],
  "issues": [
    "Claims of recent election victory and policies may be controversial.",
    "Plans to drastically cut regulations could face opposition.",
    "Potential implications of strong policies on gender and climate change.",
    "Economic and foreign policy strategies might raise questions.",
    "The legality and process of establishing new departments or reversing previous policies rapidly."
  ],
  "citations": [
    "Reference to federal regulations freezes and creation of the Department of Government Efficiency may require legal authority citations.",
    "Claims on trade agreements and tariffs may involve international trade laws or agreements."
  ],
  "document_type": "Presidential Memorandum"
}