{
  "title": "Restoring America's Fighting Force – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Restoring America's Fighting Force",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.  Purpose. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-americas-fighting-force/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-28T03:54:53+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tRestoring America’s Fighting Force\t\t\t\t\n\nJanuary 27, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose*.* As Chief Executive and as Commander in Chief, I am committed to meritocracy and to the elimination of race-based and sex-based discrimination within the Armed Forces of the United States.  No individual or group within our Armed Forces should be preferred or disadvantaged on the basis of sex, race, ethnicity, color, or creed.\n\nUnfortunately, in recent years civilian and uniformed leadership alike have implemented Diversity, Equity, and Inclusion (DEI) programs and their attendant race and sex preferences within the Armed Forces.  These actions undermine leadership, merit, and unit cohesion, thereby eroding lethality and force readiness.  They also violate Americans’ consciences by engaging in invidious race and sex discrimination.\n\nSec. 2.  Policy*.*  It is the policy of my Administration that the Department of Defense, the Department of Homeland Security with regard to the United States Coast Guard (USCG), and every element of the Armed Forces should operate free from any preference based on race or sex.\n\nSec. 3.  Definitions*.*  (a)  A “DEI office” means an office, division, job, or other unit of an institution established for the purpose of:\n\n(i)   influencing hiring or employment practices at the institution with respect to race, sex, color, or ethnicity, other than through the use of color-blind and sex-neutral hiring processes; or\n\n(ii)  promoting differential treatment of or providing special benefits to individuals on the basis of race, sex, color, or ethnicity.\n\n(b)  The term “gender ideology” has the meaning given to that term in section 2(f) of the Executive Order of January 20, 2025, (Defending Women from Gender Ideology Extremism and Restoring Biological Truth to the Federal Government).\n\n(c)  The term “divisive concepts” has the meaning given to that term in section 2(a) of Executive Order 13950 of September 22, 2020 (Combating Race and Sex Stereotyping).\n\nSec. 4.  Abolishing the DEI Bureaucracy*.*  The Secretary of Defense and the Secretary of Homeland Security shall abolish every DEI office within the Department of Defense and the Department of Homeland Security with regard to the USCG, respectively, including any vestiges of DEI offices, such as sub-offices, programs, elements, or initiatives established to promote a race-based preferences system that subverts meritocracy, perpetuates unconstitutional discrimination, and promotes divisive concepts or gender ideology.\n\nSec. 5.  Department of Defense Internal Review*.*  The Secretary of Defense shall conduct an internal review that documents actions taken in pursuit of DEI initiatives, including all instances of race and sex discrimination and activities designed to promote a race- or sex-based preferences system.  The report shall be delivered to the Secretary of Defense within 90 days of the date of this order.\n\nSec. 6.  Protecting American Values.  (a)  The Department of Defense and the Armed Forces, including any educational institution operated or controlled thereby, are prohibited from promoting, advancing, or otherwise inculcating the following un-American, divisive, discriminatory, radical, extremist, and irrational theories:\n\n(i)    “divisive concepts,” as defined in section 3(c) of this order, and “race or sex stereotyping,” or “race or sex scapegoating” as both terms are defined in section 2 of Executive Order 13950, as amended;\n\n(ii)   that America’s founding documents are racist or sexist; and\n\n(iii)  “gender ideology,” as defined in section 3(b) of this order.\n\n(b)  The Department of Defense and the Armed Forces shall not hire employees, contractors, or consultants to teach the theories set forth in subsection (a) of this section.\n\n(c)  The Secretary of Defense and the Secretary of Homeland Security shall carefully review the leadership, curriculum, and instructors of the United States Service Academies and other defense academic institutions associated with their respective Departments to ensure alignment with this order.  In addition, these institutions shall be required to teach that America and its founding documents remain the most powerful force for good in human history.\n\nSec. 7.  Implementation*.*  (a)  The Secretary of Defense and the Secretary of Homeland Security shall issue detailed guidance for the implementation of this order to their respective departments within 30 days of the date of this order.\n\n(b)  Within 180 days of the date of this order, the Secretary of Defense and the Secretary of Homeland Security shall submit a report through the Deputy Chief of Staff for Policy documenting the progress of their respective Departments in implementing this order, and any recommendations for action to fulfill the objectives of this order.\n\nSec. 8.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby. \n\nSec. 9.  General Provisions*.*  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 27, 2025.\n",
  "summary": "# Summary\n\nOn January 27, 2025, a new presidential order was issued by the president of the United States. This executive order mandates the elimination of Diversity, Equity, and Inclusion (DEI) programs across the Armed Forces and related departments, such as the Department of Defense and Homeland Security. The president emphasizes meritocracy and aims to remove any race- or sex-based discrimination within these establishments, asserting that such practices undermine unit cohesion and military readiness. \n\nThe policy outlined in this order calls for an abolition of all DEI offices and related programs. It mandates an internal review by the Department of Defense to identify and document prior DEI initiatives and instances of discrimination. Further, the order prohibits the teaching or promotion of divisive concepts, race, or sex stereotyping within the military and associated educational institutions. Additionally, the measure requires comprehensive guidance and progress reports from relevant departments to ensure effective implementation.\n",
  "eli5": "The president has ordered the military to stop using programs that treat people differently because of their race or gender. People in the military should be judged by their work and skills, not what they look like.",
  "keywords": [
    "Executive Order",
    "DEI programs",
    "Meritocracy",
    "Armed Forces",
    "Race and sex discrimination",
    "Department of Defense",
    "Homeland Security"
  ],
  "issues": [
    "Potential impact on minority hiring",
    "Legal challenges regarding discrimination",
    "Implementation challenges within military institutions",
    "Interpretation of divisive concepts and gender ideology"
  ],
  "citations": [
    "Executive Order of January 20, 2025",
    "Executive Order 13950 of September 22, 2020"
  ],
  "document_type": "Executive Order"
}