{
  "title": "Restoring Names That Honor American Greatness – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Restoring Names That Honor American Greatness",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-names-that-honor-american-greatness/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T02:20:22+00:00",
  "article:modified_time": "2025-01-21T02:20:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tRESTORING NAMES THAT HONOR AMERICAN GREATNESS\t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose and Policy.  It is in the national interest to promote the extraordinary heritage of our Nation and ensure future generations of American citizens celebrate the legacy of our American heroes.  The naming of our national treasures, including breathtaking natural wonders and historic works of art, should honor the contributions of visionary and patriotic Americans in our Nation’s rich past. \n\nSec. 2.  Appointments to the U.S. Board on Geographic Names.  (a)  Within seven days of the date of this order, each agency head with authority to appoint members to the Board on Geographic Names (Board) pursuant to 43 U.S.C. 364a, shall review their respective appointees and consider replacing those appointees in accordance with applicable law.\n\n(b)  The Secretary of the Interior shall review and consider additional appointments to the Board to assist in fulfilling all aspects of this order, subject to all applicable laws.\n\n(c)  With respect to all applications for naming and renaming submitted to the newly constituted Board, the Board shall advance the policy established in section 1 of this order to honor the contributions of visionary and patriotic Americans and may update its principles, policies, and procedures as needed to achieve this policy.\n\n(d)  Where Congressional action is required to establish a renaming in public law, following Board approval on renaming, the Board shall provide guidance to all relevant Federal agencies to use the Board-approved name in the interim in federal documents and achieve consistency across the federal government.\n\nSec. 3.  Renaming of Mount McKinley.  (a)  President William McKinley, the 25th President of the United States, heroically led our Nation to victory in the Spanish-American War.  Under his leadership, the United States enjoyed rapid economic growth and prosperity, including an expansion of territorial gains for the Nation.  President McKinley championed tariffs to protect U.S. manufacturing, boost domestic production, and drive U.S. industrialization and global reach to new heights.  He was tragically assassinated in an attack on our Nation’s values and our success, and he should be honored for his steadfast commitment to American greatness.\n\nIn 1917, the country officially honored President McKinley through the naming of North America’s highest peak.  Yet after nearly a century, President Obama’s administration, in 2015, stripped the McKinley name from federal nomenclature, an affront to President McKinley’s life, his achievements, and his sacrifice.\n\nThis order honors President McKinley for giving his life for our great Nation and dutifully recognizes his historic legacy of protecting America’s interests and generating enormous wealth for all Americans.\n\n(b)  Within 30 days of the date of this order, the Secretary of the Interior shall, consistent with 43 U.S.C. 364 through 364f, reinstate the name “Mount McKinley.”  The Secretary shall subsequently update the Geographic Names Information System (GNIS) to reflect the renaming and reinstatement of Mount McKinley.  The national park area surrounding Mount McKinley shall retain the name Denali National Park and Preserve.\n\n(c)  The Secretary of the Interior shall work with Alaska Native entities and state and local organizations to adopt names for landmarks to honor the history and culture of the Alaskan people.\n\nSec. 4.  Gulf of America.  (a)  The area formerly known as the Gulf of Mexico has long been an integral asset to our once burgeoning Nation and has remained an indelible part of America.  The Gulf was a crucial artery for America’s early trade and global commerce.  It is the largest gulf in the world, and the United States coastline along this remarkable body of water spans over 1,700 miles and contains nearly 160 million acres.  Its natural resources and wildlife remain central to America’s economy today.  The bountiful geology of this basin has made it one of the most prodigious oil and gas regions in the world, providing roughly 14% of our Nation’s crude-oil production and an abundance of natural gas, and consistently driving new and innovative technologies that have allowed us to tap into some of the deepest and richest oil reservoirs in the world.  The Gulf is also home to vibrant American fisheries teeming with snapper, shrimp, grouper, stone crab, and other species, and it is recognized as one of the most productive fisheries in the world, with the second largest volume of commercial fishing landings by region in the Nation, contributing millions of dollars to local American economies.  The Gulf is also a favorite destination for American tourism and recreation activities.  Further, the Gulf is a vital region for the multi-billion-dollar U.S. maritime industry, providing some of the largest and most impressive ports in the world.  The Gulf will continue to play a pivotal role in shaping America’s future and the global economy, and in recognition of this flourishing economic resource and its critical importance to our Nation’s economy and its people, I am directing that it officially be renamed the Gulf of America.\n\n(b)  As such, within 30 days of the date of this order, the Secretary of the Interior shall, consistent with 43 U.S.C. 364 through 364f, take all appropriate actions to rename as the “Gulf of America” the U.S. Continental Shelf area bounded on the northeast, north, and northwest by the States of Texas, Louisiana, Mississippi, Alabama and Florida and extending to the seaward boundary with Mexico and Cuba in the area formerly named as the Gulf of Mexico.  The Secretary shall subsequently update the GNIS to reflect the renaming of the Gulf and remove all references to the Gulf of Mexico from the GNIS, consistent with applicable law.  The Board shall provide guidance to ensure all federal references to the Gulf of America, including on agency maps, contracts, and other documents and communications shall reflect its renaming.\n\nSec. 5.  Additional Action.  The Secretary of Interior may solicit public and intergovernmental input regarding additional patriots to honor, particularly in light of America’s semiquincentennial celebration, and shall recommend action to me, through the Assistant to the President for Domestic Policy.\n\nSec. 6.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20, 2025.\n",
  "summary": "The President of the United States issued an order on January 20, 2025, aimed at restoring historical names that honor American contributions and national heritage. The order focuses on updating national landmarks' names to reflect significant American historical figures and events. A particular change cited is restoring the name 'Mount McKinley' for North America's highest peak, previously changed to 'Denali' in 2015. The order also addresses renaming the Gulf of Mexico to the 'Gulf of America,' aiming to highlight its value to the U.S. economy and heritage.\n\nTo implement these directives, the order tasks the Secretary of the Interior with updating the Geographic Names Information System and working with relevant parties, including state and local organizations, to reflect these changes officially. The U.S. Board on Geographic Names will also undergo changes, with agency heads reviewing and possibly replacing current appointees to align with the new policy priorities. This order also includes provisions for further actions to recognize more American patriots, especially in anticipation of the semiquincentennial celebration of the United States.",
  "eli5": "The President decided to change the names of some important places to make sure people remember big moments and heroes in American history. They're changing the name of a mountain back to 'Mount McKinley' and the Gulf of Mexico to the 'Gulf of America.'",
  "keywords": [
    "Presidential Actions",
    "U.S. Board on Geographic Names",
    "Mount McKinley",
    "Gulf of America",
    "American heritage",
    "Geographic Names Information System",
    "Secretary of the Interior",
    "Semiquincentennial"
  ],
  "issues": [
    "Potential opposition to renaming existing landmarks",
    "Impact on local and indigenous communities' identifiers",
    "Political implications of reversing previous administration's decisions",
    "Need for legislative action for certain changes"
  ],
  "citations": [
    "43 U.S.C. 364",
    "43 U.S.C. 364a",
    "43 U.S.C. 364 through 364f"
  ],
  "document_type": "Executive Order"
}