{
  "title": "Restoring The Death Penalty And Protecting Public Safety – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Restoring The Death Penalty And Protecting Public Safety – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-the-death-penalty-and-protecting-public-safety/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:40:49+00:00",
  "article:modified_time": "2025-01-21T02:21:59+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tRESTORING THE DEATH PENALTY AND PROTECTING PUBLIC SAFETY \t\t\t\t\n\nJanuary 20, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose.  Capital punishment is an essential tool for deterring and punishing those who would commit the most heinous crimes and acts of lethal violence against American citizens.  Before, during, and after the founding of the United States, our cities, States, and country have continuously relied upon capital punishment as the ultimate deterrent and only proper punishment for the vilest crimes.  Our Founders knew well that only capital punishment can bring justice and restore order in response to such evil.  For this and other reasons, capital punishment continues to enjoy broad popular support.\n\nYet for too long, politicians and judges who oppose capital punishment have defied and subverted the laws of our country.  At every turn, they seek to thwart the execution of lawfully imposed capital sentences and choose to enforce their personal beliefs rather than the law.  When President Biden took office in 2021, he allowed his Department of Justice to issue a moratorium on Federal executions, in defiance of his duty to faithfully execute the laws of the United States that provide for capital punishment.  And on December 23, 2024, President Biden commuted the sentences of 37 of the 40 most vile and sadistic rapists, child molesters, and murderers on Federal death row:  remorseless criminals who brutalized young children, strangled and drowned their victims, and hunted strangers for sport.  He commuted their sentences even though the laws of our Nation have always protected victims by applying capital punishment to barbaric acts like theirs.  Judges who oppose capital punishment have likewise disregarded the law by falsely claiming that capital punishment is unconstitutional, even though the Constitution explicitly acknowledges the legality of capital punishment.\n\nThese efforts to subvert and undermine capital punishment defy the laws of our nation, make a mockery of justice, and insult the victims of these horrible crimes.  The Government’s most solemn responsibility is to protect its citizens from abhorrent acts, and my Administration will not tolerate efforts to stymie and eviscerate the laws that authorize capital punishment against those who commit horrible acts of violence against American citizens.\n\nSec. 2.  Policy.  It is the policy of the United States to ensure that the laws that authorize capital punishment are respected and faithfully implemented, and to counteract the politicians and judges who subvert the law by obstructing and preventing the execution of capital sentences.\n\nSec. 3.  Federal Capital Punishment.  (a)  The Attorney General shall pursue the death penalty for all crimes of a severity demanding its use.\n\n(b) In addition to pursuing the death penalty where possible, the Attorney General shall, where consistent with applicable law, pursue Federal jurisdiction and seek the death penalty regardless of other factors for every federal capital crime involving:\n\n(i)   The murder of a law-enforcement officer; or\n\n(ii)  A capital crime committed by an alien illegally present in this country.\n\nThe Attorney General shall encourage State attorneys general and district attorneys to bring State capital charges for all capital crimes with special attention to the crimes described in Subsections (i) and (ii), regardless of whether the federal trial results in a capital sentence.\n\n(d)  The Attorney General shall take all appropriate action to modify the Justice Manual based on the policy and purpose set forth in this Executive Order.\n\n(e)  The Attorney General shall evaluate the places of imprisonment and conditions of confinement for each of the 37 murderers whose Federal death sentences were commuted by President Biden, and the Attorney General shall take all lawful and appropriate action to ensure that these offenders are imprisoned in conditions consistent with the monstrosity of their crimes and the threats they pose.  The Attorney General shall further evaluate whether these offenders can be charged with State capital crimes and shall recommend appropriate action to state and local authorities.\n\nSec. 4.  Preserving Capital Punishment in the States.  (a)  The Attorney General shall take all necessary and lawful action to ensure that each state that allows capital punishment has a sufficient supply of drugs needed to carry out lethal injection.\n\n(b) The Attorney General shall take all appropriate action to approve or deny any pending request for certification made by any State under 28 U.S.C. 2265.\n\nSec. 5.  Seeking The Overruling of Supreme Court Precedents That Hinder Capital Punishment.  The Attorney General shall take all appropriate action to seek the overruling of Supreme Court precedents that limit the authority of State and Federal governments to impose capital punishment.\n\nSec. 6.  Prosecuting Crime to Protect Communities.  (a)  The Attorney General shall appropriately prioritize public safety and the prosecution of violent crime, and take all appropriate action necessary to dismantle transnational criminal activity in the United States.\n\n(b)  To ensure the fullest protection of American communities from violence, the Attorney General shall encourage state attorneys general and district attorneys to adopt policies and practices aligned with subsection (a).  Federal law enforcement should coordinate with State and local law enforcement where possible to facilitate these objectives.\n\nSec. 7.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20, 2025.\n",
  "summary": "On January 20, 2025, a Presidential Executive Order was issued to restore and enforce capital punishment in the United States, emphasizing its role in deterring serious crimes and maintaining public safety. The order seeks to counter what it describes as the subversion of capital punishment laws by previous administrations and judicial actors, particularly criticizing actions taken during President Biden's tenure. It directs the Attorney General to actively pursue the death penalty for severe crimes and to encourage state legal authorities to bring capital charges.\n\nThe order outlines specific directives for the Attorney General, including pursuing the death penalty in cases involving the murder of law enforcement officers or capital crimes committed by illegal aliens. It also mandates evaluating imprisonment conditions for those whose death sentences were commuted. Additionally, it seeks to ensure states have necessary resources for lethal injection and calls for challenging Supreme Court precedents that hinder capital punishment.\n\nThis Executive Order highlights a policy shift towards rigorous enforcement of capital punishment at both federal and state levels, advocating for stronger justice measures against violent crimes. The order underscores the government's obligation to protect its citizens and uphold laws authorizing capital punishment.",
  "eli5": "The President made a new rule to make sure people who do really bad crimes can be punished by death, like in the past. It's to keep everyone safe, and they want all the judges and lawyers to follow this rule.",
  "keywords": [
    "Capital Punishment",
    "Death Penalty",
    "Public Safety",
    "Federal Law",
    "Executive Order",
    "Justice Department",
    "Lethal Injection",
    "Supreme Court"
  ],
  "issues": [
    "Potential legal challenges to reinstating the death penalty",
    "Ethical concerns regarding capital punishment",
    "Impact on states with differing capital punishment laws",
    "Supreme Court precedents related to capital punishment"
  ],
  "citations": [
    "28 U.S.C. 2265"
  ],
  "document_type": "Executive Order"
}