{
  "title": "Restoring Freedom Of Speech And Ending Federal Censorship – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Restoring Freedom Of Speech And Ending Federal Censorship",
  "og:description": "     By the authority vested in me as President by the Constitution and the laws of the United States of America, and section 301 of title 3, United",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-freedom-of-speech-and-ending-federal-censorship/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:53:42+00:00",
  "article:modified_time": "2025-01-21T00:01:32+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tRESTORING FREEDOM OF SPEECH AND ENDING FEDERAL CENSORSHIP\t\t\t\t\n\nJanuary 20, 2025\n\n     By the authority vested in me as President by the Constitution and the laws of the United States of America, and section 301 of title 3, United States Code, it is hereby ordered as follows:\n\n     Section 1.  Purpose.**The First Amendment to the United States Constitution, an amendment essential to the success of our Republic, enshrines the right of the American people to speak freely in the public square without Government interference.  Over the last 4 years, the previous administration trampled free speech rights by censoring Americans’ speech on online platforms, often by exerting substantial coercive pressure on third parties, such as social media companies, to moderate, deplatform, or otherwise suppress speech that the Federal Government did not approve.  Under the guise of combatting “misinformation,” “disinformation,” and “malinformation,” the Federal Government infringed on the constitutionally protected speech rights of American citizens across the United States in a manner that advanced the Government’s preferred narrative about significant matters of public debate.  Government censorship of speech is intolerable in a free society.  \n\n     Sec. 2.  Policy.  It is the policy of the United States to:       (a)  secure the right of the American people to engage in constitutionally protected speech;\n\n     (b)  ensure that no Federal Government officer, employee, or agent engages in or facilitates any conduct that would unconstitutionally abridge the free speech of any American citizen;\n\n     (c)  ensure that no taxpayer resources are used to engage in or facilitate any conduct that would unconstitutionally abridge the free speech of any American citizen; and\n\n     (d)  identify and take appropriate action to correct past misconduct by the Federal Government related to censorship of protected speech.\n\n     Sec. 3.  Ending Censorship of Protected Speech.  (a)  No Federal department, agency, entity, officer, employee, or agent may act or use any Federal resources in a manner contrary to section 2 of this order.\n\n     (b)  The Attorney General, in consultation with the heads of executive departments and agencies, shall investigate the activities of the Federal Government over the last 4 years that are inconsistent with the purposes and policies of this order and prepare a report to be submitted to the President, through the Deputy Chief of Staff for Policy, with recommendations for appropriate remedial actions to be taken based on the findings of the report.\n\n     Sec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)   the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 20, 2025.\n",
  "summary": "On January 20, 2025, the President of the United States issued an executive order aimed at protecting freedom of speech by ending federal censorship. The order emphasizes the importance of the First Amendment, highlighting how the previous administration allegedly interfered with Americans' speech on online platforms by pressuring third parties like social media companies. The order criticizes past governmental actions that suppressed free speech under the pretense of addressing misinformation.\n\nThe order outlines the U.S. policy to safeguard constitutionally protected speech, prohibit federal employees from abridging it, ensure taxpayers' resources are not misused for censorship, and rectify past wrongful governmental censorship behaviors. To that end, the Attorney General is tasked with investigating past government activities over the previous four years that contravened the order's objectives, with a report and recommendations to be submitted to the President.\n\nFinally, the order includes general provisions ensuring no impedance of legally-delegated authority, implementation based on available appropriations, and clarifying that the order does not establish any substantive rights enforceable by law.",
  "eli5": "The President says nobody in the government can stop people from saying what they want online, and there will be checks to make sure nobody in the past did that either.",
  "keywords": [
    "Executive Order",
    "Freedom of Speech",
    "Censorship",
    "First Amendment",
    "Federal Government",
    "Online Platforms",
    "Misinformation",
    "Attorney General"
  ],
  "issues": [
    "How will past censorship activities be identified and verified?",
    "What measures will be taken to ensure compliance with this order?",
    "How will the order impact social media companies' policies on content moderation?"
  ],
  "citations": [
    "First Amendment",
    "United States Constitution",
    "Title 3, United States Code, Section 301"
  ],
  "document_type": "Executive Order"
}