{
  "title": "Restoring Accountability for Career Senior Executives – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Restoring Accountability for Career Senior Executives – The White House",
  "og:description": "January 20, 2025 MEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES   SUBJECT:       Restoring",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-accountability-for-career-senior-executives/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:42:07+00:00",
  "article:modified_time": "2025-01-21T16:40:55+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tRESTORING ACCOUNTABILITY FOR CAREER SENIOR EXECUTIVES\t\t\t\t\n\nJanuary 20, 2025\n\nJanuary 20, 2025\n\nMEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES  \n\nSUBJECT:       Restoring Accountability for Career Senior\n\nExecutives \n\nCareer Senior Executive Service (SES) officials are charged to “ensure that the executive management of the Government of the United States is responsive to the needs, policies, and goals of the Nation and otherwise is of the highest quality,” as required by section 3131 of title 5, United States Code.  SES officials have enormous influence over the functioning of the Federal Government, and thus the well-being of hundreds of millions of Americans.  \n\nAs the Constitution makes clear, and as the Supreme Court of the United States has reaffirmed, “the ‘executive Power’ — all of it — is ‘vested in a President,’ who must ‘take Care that the Laws be faithfully executed.’”  *Seila Law LLC v. Consumer Financial Protection Bureau*, 591 U.S. 197, 203 (2020).  “Because no single person could fulfill that responsibility alone, the Framers expected that the President would rely on subordinate officers for assistance.”  *Id.* at 203–04.  \n\nThe President’s power to remove subordinates is a core part of the Executive power vested by Article II of the Constitution and is necessary for the President to perform his duty to “take Care that the Laws be faithfully executed.”  Because SES officials wield significant governmental authority, they must serve at the pleasure of the President. \n\nOnly that chain of responsibility ensures that SES officials are properly accountable to the President and the American people.  If career SES officials fail to faithfully fulfill their duties to advance the needs, policies, and goals of the United States, the President must be able to rectify the situation and ensure that the entire Executive Branch faithfully executes the law.  For instance, SES officials who engage in unauthorized disclosure of Executive Branch deliberations, violate the constitutional rights of Americans, refuse to implement policy priorities, or perform their duties inefficiently or negligently should be held accountable. \n\nThe President must be able to trust that the Executive Branch will work together in service of the Nation.  My Administration will restore a “government of the people, by the people, for the people.”  Therefore: \n\n(a)  Within 30 days of the signing of this memorandum, the Director of the Office of Personnel Management (OPM), in coordination with the Director of the Office of Management and Budget (OMB), shall issue SES Performance Plans that agencies must adopt;\n\n(b)  Agency heads, who along with their senior staff manage career SES officials as one of their core functions, shall use all available authorities to reinvigorate the SES system and prioritize accountability;\n\n(c)  Each agency head shall, as necessary and appropriate and consistent with the procedural requirements of section 3395 of title 5, United States Code, reassign agency SES members to ensure their knowledge, skills, abilities, and mission assignments are optimally aligned to implement my agenda;  \n\n(d)  Each agency head should terminate its existing Executive Resources Board (ERB), institute a new or interim ERB, and assign senior noncareer officials to chair and serve on the board as a majority alongside career members;\n\n(e)  Each agency head should terminate its existing Performance Review Board membership and re-constitute membership with individuals committed to full enforcement of SES performance evaluations that promote and assure an SES of the highest caliber; and\n\n(f)  Any agency head who becomes aware of an SES official whose performance or continued occupancy of the position is inconsistent with either the principles reaffirmed in this Order or their duties to the Nation under section 3131 of title 5, United States Code, shall immediately take all appropriate actions, up to and including removal of that official, with the support of OPM and OMB.  Restoring an accountable government workforce is a top priority of my Administration.\n",
  "summary": "The document is a Presidential Memorandum issued on January 20, 2025, directed towards the heads of executive departments and agencies. It emphasizes the need for accountability among Career Senior Executive Service (SES) officials, highlighting their significant role in managing the executive functions of the U.S. Government. The President underscores the necessity for SES officials to serve at the President's pleasure to ensure their actions align with national needs and policies. The memorandum outlines specific actions to reinvigorate the SES system, including updating performance plans, reassessing SES roles, and reconstituting evaluation boards to maintain high performance standards.\n\nKey initiatives include revising SES performance plans within 30 days, requiring agency heads to realign SES member responsibilities, and restructuring Executive Resources and Performance Review Boards. The memorandum insists on taking immediate action against SES officials who fail to uphold their duties, with potential removal from positions as an option. These measures aim to restore an accountable government workforce and ensure that the Executive Branch operates in service to the nation effectively.",
  "eli5": "The President wrote a letter to make sure top government workers do a good job. If they're not helpful, they might have to change jobs or even leave!",
  "keywords": [
    "Presidential Memorandum",
    "Accountability",
    "Senior Executive Service",
    "Executive Management",
    "Government Performance",
    "Policy Implementation"
  ],
  "issues": [
    "Potential resistance from SES officials to new accountability measures",
    "The feasibility of implementing new performance plans and evaluations",
    "Impact on morale of government employees due to increased oversight"
  ],
  "citations": [
    "Title 5, United States Code, Section 3131",
    "Seila Law LLC v. Consumer Financial Protection Bureau, 591 U.S. 197, 203 (2020)"
  ],
  "document_type": "Presidential Memorandum"
}