{
  "title": "Sick Politicians Want Killers, Rapists Roaming Our Streets – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Sick Politicians Want Killers, Rapists Roaming Our Streets",
  "og:description": "President Donald J. Trump is removing illegal immigrant killers, rapists, and drug dealers from our streets and sending them back where they belong — but",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/sick-politicians-want-killers-rapists-roaming-our-streets/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-25T18:13:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tSick Politicians Want Killers, Rapists Roaming Our Streets\t\t\t\t\n\nFebruary 25, 2025\n\nPresident Donald J. Trump is removing illegal immigrant killers, rapists, and drug dealers from our streets and sending them back where they belong — but if politicians in so-called “sanctuary” locales had it their way, these vicious criminals would still be free to roam our streets.\n\n**Here is a tiny sample of the illegal immigrant criminals arrested in “sanctuary” destinations under President Trump:**\n    - In Saint Paul, Minnesota,  ICE has arrested a Sudanese national convicted of rape of a victim under 13, a Mexican national convicted of criminal sexual conduct against a victim under 14, and a Laotian national convicted of child endangerment and criminal sexual conduct against a victim under 13.       - Minnesota Attorney General Keith Ellison  warns  law enforcement of “liability if they enforce immigration detainers” and  says  protecting communities from violent illegal immigrant criminals is “not our job.”       - Mayor Melvin Carter  says  targeting violent illegal immigrant criminals is “threaten[ing] our safe spaces” and  calls it  a “rapidly alarming situation.”        - Saint Paul City Council Vice President Hwa Jeong Kim  reminds  constituents that the police department “cannot and does not cooperate with ICE.” \n    - In Chicago, Illinois,  ICE has arrested a Mexican national convicted of drunk driving resulting in a death (who had an order of removal from 2006), a Mexican national convicted of possession of methamphetamine with intent to distribute (who had an order of removal from 2022), and a Mexican national convicted of negligent manslaughter.       - Rep. Delia Ramirez  decries  how “welcoming states and sanctuary cities that defend our neighbors” are a “target.”       - Rep. Chuy García  says  “no one should live in fear” of an “immigration raid.”        - Rep. Mike Quigley  advises  illegal immigrants “to become familiar with their rights.” \n    - In Washington State,  ICE has arrested a Salvadoran national convicted of sodomy/anal intercourse with a victim under 13.       - Washington Attorney General Nick Brown  boasts  that “state or local law enforcement” will not be utilized “for immigration enforcement actions.” \n    - In Los Angeles, California,  immigration authorities arrested a Mexican national convicted of rape (who had an order of removal from 1996).       - Mayor Karen Bass  says  “no one should live in fear due to their immigration status.” \n    - In New York City, New York,  immigration authorities arrested a Chinese national convicted of murder.       - Rep. Alexandria Ocasio-Cortez  reminds  illegal immigrants to “protect” themselves: “ Do not open your door .”\n",
  "summary": "The article discusses the actions taken by President Donald J. Trump to deport illegal immigrants involved in serious crimes from the United States. This initiative targets individuals in 'sanctuary cities' who have been convicted of crimes such as murder, rape, child endangerment, and drug-related offenses. The focus is on several high-profile arrests made by ICE in cities including Saint Paul, Minnesota; Chicago, Illinois; Washington State; Los Angeles, California; and New York City, New York.\n\nDespite these actions, many local politicians in these 'sanctuary' areas oppose this crackdown, citing concerns over jurisdiction and civil rights. For instance, officials in places like Saint Paul and Chicago have expressed resistance to cooperating with ICE, arguing that immigration enforcement should not interfere with local law enforcement responsibilities. Meanwhile, some members of Congress from these areas advocate for the rights of immigrants, stressing the importance of protecting communities and ensuring that individuals know their rights during immigration enforcement actions.",
  "eli5": "President Trump is sending away people who did bad things and are not supposed to be in the country. But some people in cities where these folks were found think it's not fair.",
  "keywords": [
    "Trump",
    "illegal immigration",
    "sanctuary cities",
    "ICE arrests",
    "criminal convictions",
    "local resistance",
    "immigration enforcement"
  ],
  "issues": [
    "Potential bias in representation of politicians' views",
    "Lack of citations for legal arguments",
    "Concerns over civil liberties and immigration rights",
    "Effectiveness of ICE actions in community safety"
  ],
  "citations": [],
  "document_type": "Press Release"
}