{
  "title": "Statement from the National Security Advisor – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Statement from the National Security Advisor",
  "og:description": "\"Today, President Donald J. Trump and his Special Envoy Steve Witkoff are able to announce that Mr. Witkoff is leaving Russian airspace with Marc Fogel,",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/statement-from-the-national-security-advisor/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T23:51:30+00:00",
  "article:modified_time": "2025-02-11T23:51:31+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tStatement from the National Security Advisor\t\t\t\t\n\nFebruary 11, 2025\n\n“Today, President Donald J. Trump and his Special Envoy Steve Witkoff are able to announce that Mr. Witkoff is leaving Russian airspace with Marc Fogel, an American who was detained by Russia. President Trump, Steve Witkoff and the President’s advisors negotiated an exchange that serves as a show of good faith from the Russians and a sign we are moving in the right direction to end the brutal and terrible war in Ukraine. Since President Trump’s swearing-in, he has successfully secured the release of Americans detained around the world, and President Trump will continue until all Americans being held are returned to the United States. By tonight, Marc Fogel will be on American soil and reunited with his family and loved ones thanks to President Trump’s leadership.”\n\n  – National Security Advisor Mike Waltz\n",
  "summary": "***Statement from the National Security Advisor***\n\nOn February 11, 2025, National Security Advisor Mike Waltz announced that President Donald J. Trump, along with his Special Envoy Steve Witkoff, successfully negotiated the release of Marc Fogel, an American previously detained in Russia. This negotiation marks a significant diplomatic achievement, reflecting improved relations and cooperation between the United States and Russia. The release is portrayed as a step towards resolving the ongoing conflict in Ukraine, showcasing the administration's commitment to freeing American citizens held abroad.\n\nPresident Trump has prioritized the return of detained Americans since taking office. This latest development continues a string of efforts to bring home Americans unjustly held overseas. Marc Fogel, a representative American figure in this context, is expected to be reunited with his family on American soil by the end of the day, signaling President Trump's diplomatic efficacy and dedication to national security issues.",
  "eli5": "The President of the USA helped bring a man named Marc back home from Russia, where he was stuck. It shows they are trying to make peace and help people get home safe.",
  "keywords": [
    "Donald J. Trump",
    "Marc Fogel",
    "Russia",
    "Ukraine",
    "diplomatic relations",
    "National Security",
    "Steve Witkoff",
    "American detainees"
  ],
  "issues": [
    "There is no mention of the details regarding the exchange agreement.",
    "The context of the war in Ukraine is not fully explained.",
    "Specific terms of the diplomatic negotiations are unclear."
  ],
  "citations": [],
  "document_type": "Press Release"
}