{
  "title": "Statement from the Press Secretary – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Statement from the Press Secretary",
  "og:description": "\"The Government of Colombia has agreed to all of President Trump’s terms, including the unrestricted acceptance of all illegal aliens from Colombia",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/statement-from-the-press-secretary/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-26T21:03:07+00:00",
  "article:modified_time": "2025-01-28T21:03:57+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tStatement from the Press Secretary\t\t\t\t\n\nJanuary 26, 2025\n\n“The Government of Colombia has agreed to all of President Trump’s terms, including the unrestricted acceptance of all illegal aliens from Colombia returned from the United States, including on U.S. military aircraft, without limitation or delay. Based on this agreement, the fully drafted IEEPA tariffs and sanctions will be held in reserve, and not signed, unless Colombia fails to honor this agreement. The visa sanctions issued by the State Department, and enhanced inspections from Customs and Border Protection, will remain in effect until the first planeload of Colombian deportees is successfully returned. Today’s events make clear to the world that America is respected again. President Trump will continue to fiercely protect our nation’s sovereignty, and he expects all other nations of the world to fully cooperate in accepting the deportation of their citizens illegally present in the United States.”\n",
  "summary": "On January 26, 2025, a statement from the Press Secretary announced that the Government of Colombia has agreed to comply with terms set by President Trump regarding the deportation of Colombian nationals. Under these terms, Colombia will accept illegal aliens returned from the United States without restrictions and delays, even via U.S. military aircraft. In exchange, the United States will hold in reserve any proposed tariffs and sanctions under the International Emergency Economic Powers Act (IEEPA), provided Colombia honors the agreement.\n\nThe statement clarifies that visa sanctions by the U.S. State Department and enhanced inspections at Customs and Border Protection will remain in effect until the first batch of Colombian deportees is successfully sent back. This action is presented as a demonstration of restored respect and sovereignty for America on the international stage. President Trump is committed to enforcing national sovereignty and expects other nations to similarly cooperate in taking back their citizens who are present illegally in the United States.",
  "eli5": "The U.S. and Colombia made a deal where Colombia will take back people who are in the U.S. illegally. If they keep the deal, the U.S. won't charge extra taxes. Some checks and rules will still stay until things start moving.",
  "keywords": [
    "Colombia",
    "deportation",
    "trump",
    "IEEPA",
    "visa sanctions",
    "sovereignty",
    "U.S. military aircraft"
  ],
  "issues": [
    "Potential diplomatic tensions with Colombia",
    "Implications for U.S. immigration policy",
    "Impact on Colombian communities"
  ],
  "citations": [
    "International Emergency Economic Powers Act (IEEPA)"
  ],
  "document_type": "Press Release"
}