{
  "title": "Statement from the National Security Advisor – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Statement from the National Security Advisor",
  "og:description": "\"Today, President Donald J. Trump and his Special Envoy Steve Witkoff are able to announce that Mr. Witkoff is leaving Russian airspace with Marc Fogel,",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/statement-from-the-national-security-advisor/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-11T23:51:30+00:00",
  "article:modified_time": "2025-02-11T23:52:04+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tStatement from the National Security Advisor\t\t\t\t\n\nFebruary 11, 2025\n\n“Today, President Donald J. Trump and his Special Envoy Steve Witkoff are able to announce that Mr. Witkoff is leaving Russian airspace with Marc Fogel, an American who was detained by Russia. President Trump, Steve Witkoff and the President’s advisors negotiated an exchange that serves as a show of good faith from the Russians and a sign we are moving in the right direction to end the brutal and terrible war in Ukraine. Since President Trump’s swearing-in, he has successfully secured the release of Americans detained around the world, and President Trump will continue until all Americans being held are returned to the United States. By tonight, Marc Fogel will be on American soil and reunited with his family and loved ones thanks to President Trump’s leadership.”\n\n  – National Security Advisor Mike Waltz\n",
  "summary": "On February 11, 2025, the National Security Advisor Mike Waltz issued a statement about the release of Marc Fogel, an American detained in Russia, who was leaving Russian airspace. This development was announced by President Donald J. Trump and his Special Envoy, Steve Witkoff, highlighting an agreement made with Russian authorities that marks a positive step towards ending the conflict in Ukraine.\n\nPresident Trump, through negotiations supported by his team, has been active in ensuring the release of American citizens held in other countries. This instance reflects his broader efforts to secure the safe return of U.S. citizens back to American soil. The release of Marc Fogel signifies a diplomatic success under President Trump's leadership, bringing him back to his family and loved ones in the United States.",
  "eli5": "The President helped bring Marc Fogel, who was stuck in Russia, back home safely to America. This is good because it's a sign of peace talks with Russia.",
  "keywords": [
    "Marc Fogel",
    "Donald J. Trump",
    "Steve Witkoff",
    "Russia",
    "Ukraine conflict",
    "American detainees",
    "diplomacy",
    "release"
  ],
  "issues": [
    "Unclear specifics on the exchange negotiated",
    "Long-term impact on the Ukraine conflict",
    "Verification of peace negotiations progressing"
  ],
  "citations": [],
  "document_type": "Press Release"
}