{
  "title": "Statement from the Press Secretary – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Statement from the Press Secretary",
  "og:description": "\"Last night, 29 Mexican Cartel Members were extradited to the United States. President Trump directed the Department of Justice and the Department of",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/statement-from-the-press-secretary-19a9/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-28T16:19:22+00:00",
  "article:modified_time": "2025-02-28T16:19:23+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tStatement from the Press Secretary\t\t\t\t\n\nFebruary 28, 2025\n\n“Last night, 29 Mexican Cartel Members were extradited to the United States. President Trump directed the Department of Justice and the Department of State to make this happen, and Attorney General Bondi and Secretary of State Rubio did a tremendous job in getting this done. The group of cartel members, who will soon arrive on American soil, includes one of the most evil cartel bosses in the world, Rafael Caro Quintero, who tortured and murdered DEA Agent Kiki Camerena in 1985. The previous Administration allowed these criminals to run free and commit crimes all over the world. The Trump Administration is declaring these thugs as terrorists, because that is what they are, and demanding justice for the American people.”\n",
  "summary": "The White House released a statement from the Press Secretary on February 28, 2025, announcing the extradition of 29 members of Mexican cartels to the United States. This operation was directed by President Trump and executed by the Department of Justice and the Department of State, under the leadership of Attorney General Bondi and Secretary of State Rubio. Included among these individuals is Rafael Caro Quintero, a notorious cartel boss linked to the torture and murder of DEA Agent Kiki Camerena in 1985.\n\nThe Trump Administration is labeling these cartel members as terrorists to underscore the severity of their criminal activities and is committed to securing justice for their offenses. The move marks a significant action against international crime syndicates, contrasting the previous administration’s approach, which reportedly did not take similar measures.",
  "eli5": "The President helped bring 29 bad guys from Mexico to the U.S. because they did really bad things. One of them was especially mean, and now they're going to be held responsible.",
  "keywords": [
    "Extradition",
    "Mexican Cartels",
    "Rafael Caro Quintero",
    "Trump Administration",
    "Department of Justice",
    "Department of State",
    "Terrorism"
  ],
  "issues": [
    "No mention of legal basis for extradition or policy change",
    "Potential diplomatic implications with Mexico",
    "Positioning of previous administration's actions"
  ],
  "citations": [],
  "document_type": "Press Release"
}