{
  "title": "Strengthening American Leadership in Digital Financial Technology – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Strengthening American Leadership in Digital Financial Technology – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, and in order to promote United States",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/strengthening-american-leadership-in-digital-financial-technology/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T20:48:21+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tSTRENGTHENING AMERICAN LEADERSHIPIN DIGITAL FINANCIAL TECHNOLOGY\t\t\t\t\n\nJanuary 23, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, and in order to promote United States leadership in digital assets and financial technology while protecting economic liberty, it is hereby ordered as follows:\n\nSection 1.  Purpose and Policies.  (a)  The digital asset industry plays a crucial role in innovation and economic development in the United States, as well as our Nation’s international leadership.  It is therefore the policy of my Administration to support the responsible growth and use of digital assets, blockchain technology, and related technologies across all sectors of the economy, including by:\n\n(i)    protecting and promoting the ability of individual citizens and private-sector entities alike to access and use for lawful purposes open public blockchain networks without persecution, including the ability to develop and deploy software, to participate in mining and validating, to transact with other persons without unlawful censorship, and to maintain self-custody of digital assets;\n\n(ii)   promoting and protecting the sovereignty of the United States dollar, including through actions to promote the development and growth of lawful and legitimate dollar-backed stablecoins worldwide;\n\n(iii)  protecting and promoting fair and open access to banking services for all law-abiding individual citizens and private-sector entities alike;\n\n(iv)   providing regulatory clarity and certainty built on technology-neutral regulations, frameworks that account for emerging technologies, transparent decision making, and well-defined jurisdictional regulatory boundaries, all of which are essential to supporting a vibrant and inclusive digital economy and innovation in digital assets, permissionless blockchains, and distributed ledger technologies; and\n\n(v)    taking measures to protect Americans from the risks of Central Bank Digital Currencies (CBDCs), which threaten the stability of the financial system, individual privacy, and the sovereignty of the United States, including by prohibiting the establishment, issuance, circulation, and use of a CBDC within the jurisdiction of the United States.\n\nSec. 2.**Definitions*.***(a)  For the purpose of this order, the term “digital asset” refers to any digital representation of value that is recorded on a distributed ledger, including cryptocurrencies, digital tokens, and stablecoins.\n\n(b)  The term “blockchain” means any technology where data is:\n\n(i)    shared across a network to create a public ledger of verified transactions or information among network participants;\n\n(ii)   linked using cryptography to maintain the integrity of the public ledger and to execute other functions;\n\n(iii)  distributed among network participants in an automated fashion to concurrently update network participants on the state of the public ledger and any other functions; and\n\n(iv)   composed of source code that is publicly available.\n\n(c)  “Central Bank Digital Currency” means a form of digital money or monetary value, denominated in the national unit of account, that is a direct liability of the central bank.\n\nSec. 3.****Revocation of Executive Order 14067 and Department of the Treasury Framework of July 7, 2022.**(a)  Executive Order 14067 of March 9, 2022 (Ensuring Responsible Development of Digital Assets) is hereby revoked.\n\n(b)  The Secretary of the Treasury is directed to immediately revoke the Department of the Treasury’s “Framework for International Engagement on Digital Assets,” issued on July 7, 2022.\n\n(c)  All policies, directives, and guidance issued pursuant to Executive Order 14067 and the Department of the Treasury’s Framework for International Engagement on Digital Assets are hereby rescinded or shall be rescinded by the Secretary of the Treasury, as appropriate, to the extent they are inconsistent with the provisions of this order.\n\n(d)  The Secretary of the Treasury shall take all appropriate measures to ensure compliance with the policies set forth in this order.\n\nSec. 4.  Establishment of the President‘s Working Group on Digital Asset Markets.**(a)  There is hereby established within the National Economic Council the President’s Working Group on Digital Asset Markets (Working Group).  The Working Group shall be chaired by the Special Advisor for AI and Crypto (Chair).  In addition to the Chair, the Working Group shall include the following officials, or their designees:\n\n(i)     the Secretary of the Treasury;\n\n(ii)    the Attorney General;\n\n(iii)   the Secretary of Commerce;\n\n(iv)    the Secretary of Homeland Security;\n\n(v)     the Director of the Office of Management and Budget;\n\n(vi)    the Assistant to the President for National Security Affairs;\n\n(vii)   the Assistant to the President for National Economic Policy (APEP);\n\n(viii)  the Assistant to the President for Science and Technology;\n\n(ix)    the Homeland Security Advisor;\n\n(x)     the Chairman of the Securities and Exchange Commission; and\n\n(xi)    the Chairman of the Commodity Futures Trading\n\nCommission.\n\n(xii)   As appropriate and consistent with applicable law, the Chair may invite the heads of other executive departments and agencies (agencies), or other senior officials within the Executive Office of the President, to attend meetings of the Working Group, based on the relevance of their expertise and responsibilities.\n\n(b)  Within 30 days of the date of this order, the Department of the Treasury, the Department of Justice, the Securities and Exchange Commission, and other relevant agencies, the heads of which are included in the Working Group, shall identify all regulations, guidance documents, orders, or other items that affect the digital asset sector.  Within 60 days of the date of this order, each agency shall submit to the Chair recommendations with respect to whether each identified regulation, guidance document, order, or other item should be rescinded or modified, or, for items other than regulations, adopted in a regulation.\n\n(c)  Within 180 days of the date of this order, the Working Group shall submit a report to the President, through the APEP, which shall recommend regulatory and legislative proposals that advance the policies established in this order.  In particular, the report shall focus on the following:\n\n(i)   The Working Group shall propose a Federal regulatory framework governing the issuance and operation of digital assets, including stablecoins, in the United States.  The Working Group’s report shall consider provisions for market structure, oversight, consumer protection, and risk management.\n\n(ii)  The Working Group shall evaluate the potential creation and maintenance of a national digital asset stockpile and propose criteria for establishing such a stockpile, potentially derived from cryptocurrencies lawfully seized by the Federal Government through its law enforcement efforts.\n\n(d)  The Chair shall designate an Executive Director of the Working Group, who shall be responsible for coordinating its day-to-day functions.  On issues affecting the national security, the Working Group shall consult with the National Security Council.\n\n(e)  As appropriate and consistent with law, the Working Group shall hold public hearings and receive individual expertise from leaders in digital assets and digital markets.**\n\nSec. 5.  Prohibition of Central Bank Digital Currencies. \n\n(a)  Except to the extent required by law, agencies are hereby prohibited from undertaking any action to establish, issue, or promote CBDCs within the jurisdiction of the United States or abroad.\n\n(b)  Except to the extent required by law, any ongoing plans or initiatives at any agency related to the creation of a CBDC within the jurisdiction of the United States shall be immediately terminated, and no further actions may be taken to develop or implement such plans or initiatives.\n\nSec. 6.  Severability*.***(a)  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.\n\nSec. 7.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person. \n\nTHE WHITE HOUSE,\n\n    January 23, 2025.\n",
  "summary": "### Summary\n\nOn January 23, 2025, a Presidential Executive Order was issued to bolster American leadership in digital financial technology. This directive seeks to enhance the United States' position in the digital asset industry by enabling lawful access and use of blockchain technologies, promoting stablecoins while safeguarding the sovereignty of the U.S. dollar, ensuring fair access to banking services, and establishing clear regulatory frameworks. It also explicitly prohibits the establishment and use of Central Bank Digital Currencies (CBDCs) in the United States to protect economic privacy and financial system stability.\n\nThe order revokes Executive Order 14067 from March 2022 and the Treasury's 2022 framework for digital assets. Furthermore, it creates a President's Working Group on Digital Asset Markets to propose a Federal regulatory strategy for digital assets, evaluate the potential of a national digital asset stockpile, and consult with various federal officials. The group is mandated to submit regulatory recommendations within 180 days, focusing on consumer protection and risk management in the digital asset arena.\n",
  "eli5": "### ELI5\n\nThe U.S. President wants to make sure that America is the leader in digital money and technology. He made new rules to help people use digital money safely, protect the dollar, and said no to government-made digital money. He also set up a team to come up with ideas on how to handle digital money better.",
  "keywords": [
    "Digital Assets",
    "Blockchain",
    "Stablecoins",
    "Central Bank Digital Currencies",
    "Regulatory Framework",
    "Financial Technology",
    "Presidential Executive Order",
    "Digital Financial Technology",
    "United States Dollar",
    "National Digital Asset Stockpile"
  ],
  "issues": [
    "Potential impacts on financial privacy from prohibiting CBDCs",
    "Effects of revoking past executive orders and treasury frameworks",
    "Challenges in implementing fair and open access to banking services",
    "Unclear long-term implications of a national digital asset stockpile"
  ],
  "citations": [
    "Executive Order 14067",
    "Department of the Treasury’s Framework of July 7, 2022"
  ],
  "document_type": "Executive Order"
}