{
  "title": "President Trump Announces Sub-Cabinet Appointments – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Sub-Cabinet Appointments",
  "og:description": "To the Senate of the United States, I nominate Keith Bass, of Texas, to be an Assistant Secretary of Defense, vice Lester Martinez-Lopez. Jayanta",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/sub-cabinet-appointments/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T19:35:00+00:00",
  "article:modified_time": "2025-01-22T19:01:40+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tPresident Trump Announces Sub-Cabinet APPOINTMENTS\t\t\t\t\n\nJanuary 20, 2025\n\nTo the Senate of the United States, I nominate\n\nKeith Bass, of Texas, to be an Assistant Secretary of Defense, vice Lester Martinez-Lopez.\n\nJayanta Bhattacharya, of California, to be Director of the National Institutes of Health, vice Monica M. Bertagnolli, resigned.\n\nJames Bishop, of North Carolina, to be Deputy Director of the Office of Management and Budget, vice Nani A. Coloretti, resigned.\n\nFrank Bisignano, of New Jersey, to be Commissioner of Social Security, vice Martin O’Malley, resigned.\n\nTodd Blanche, of Florida, to be Deputy Attorney General, vice Lisa O. Monaco, resigned.\n\nAdam Boehler, of Tennessee, to be Special Presidential Envoy for Hostage Affairs.\n\nSamuel Brown, of Nevada, to be Under Secretary of Veterans Affairs for Memorial Affairs, vice Matthew T. Quinn.\n\nWalter Clayton, of New York, to be United States Attorney for the Southern District of New York for the term of four years, vice Damian Williams.\n\nElbridge Colby, of the District of Columbia, to be Under Secretary of Defense for Policy, vice Colin Hackett Kahl, resigned.\n\nMonica Crowley, of New York, to be Chief of Protocol, and to have the rank of Ambassador during her tenure of service, vice Rufus Gifford, resigned.\n\nHarmeet Dhillon, of California, to be an Assistant Attorney General, vice Kristen M. Clarke, resigned.\n\nDaniel Driscoll, of North Carolina, to be Secretary of the Army, vice Christine Elizabeth Wormuth, resigned.\n\nMichael Duffy, of Virginia, to be Under Secretary of Defense for Acquisition and Sustainment, vice William A. LaPlante Jr., resigned.\n\nTroy Edgar, of California, to be Deputy Secretary of Homeland Security, vice John K. Tien, resigned.\n\nMichael Faulkender, of Maryland, to be Deputy Secretary of the Treasury, vice Adewale O. Adeyemo, resigned.\n\nStephen Feinberg, of New York, to be Deputy Secretary of Defense, vice Kathleen Holland Hicks, resigned.\n\nDavid Fink, of New Hampshire, to be Administrator of the Federal Railroad Administration, vice Amitabha Bose, resigned.\n\nPaul Atkins, of Virginia, to be Member of the Securities and Exchange Commission for the remainder of the term expiring June 5, 2026, vice Gary Gensler, resigned.\n\nDarío Gil, of New York, to be Under Secretary for Science, Department of Energy, vice Geraldine Richmond, resigned.\n\nPreston Griffith, of Virginia, to be Under Secretary of Energy, vice David Crane, resigned.\n\nJacob Helberg, of Florida, to be an Under Secretary of State (Economic Growth, Energy, and the Environment), vice Jose W. Fernandez, resigned.\n\nDudley Hoskins, of the District of Columbia, to be Under Secretary of Agriculture for Marketing and Regulatory Programs, vice Jennifer Lester Moffitt, resigned.\n\nJared Isaacman, of Pennsylvania, to be Administrator of the National Aeronautics and Space Administration, vice Bill Nelson, resigned.\n\nScott Kupor, of California, to be Director of the Office of Personnel Management for a term of four years, vice Kiran Arjandas Ahuja, resigned.\n\nChristopher Landau, of Maryland, to be Deputy Secretary of State, vice Kurt Campbell, resigned.\n\nLuke Lindberg, of South Dakota, to be Under Secretary of Agriculture for Trade and Foreign Agricultural Affairs, vice Alexis Taylor, resigned.\n\nWilliam Long, of Missouri, to be Commissioner of Internal Revenue for the remainder of the term expiring November 12, 2027, vice Daniel I. Werfel.\n\nMartin Makary, of Virginia, to be Commissioner of Food and Drugs, Department of Health and Human Services, vice Robert McKinnon Califf, resigned.\n\nMark Meador, of Virginia, to be a Federal Trade Commissioner for the term of seven years from September 26, 2024, vice Lina M. Khan, term expired.\n\nTroy Meink to be Secretary of the Air Force, vice Frank Kendall III, resigned.\n\nEmil Michael, of Florida, to be Under Secretary of Defense for Research and Engineering, vice Heidi Shyu, resigned.\n\nJanette Nesheiwat, of New York, to be Medical Director in the Regular Corps of the Public Health Service, subject to qualifications therefor as provided by law and regulations, and to be Surgeon General of the Public Health Service for a term of four years, vice Vivek Hallegere Murthy, resigned.\n\nJames O’Neill, of California, to be Deputy Secretary of Health and Human Services, vice Andrea Joan Palm, resigned.\n\nMehmet Oz, of Pennsylvania, to be Administrator of the Centers for Medicare and Medicaid Services, vice Chiquita Brooks-LaSure, resigned.\n\nKashyap Patel, of Nevada, to be Director of the Federal Bureau of Investigation for a term of ten years, vice Christopher A. Wray, resigned.\n\nJohn Phelan, of Florida, to be Secretary of the Navy, vice Carlos Del Toro, resigned.\n\nAaron Reitz, of Texas, to be an Assistant Attorney General, vice Hampton Y. Dellinger.\n\nMichael Rigas, of Virginia, to be Deputy Secretary of State for Management and Resources, vice Richard R. Verma, resigned.\n\nDean Sauer, of Missouri, to be Solicitor General of the United States, vice Elizabeth Prelogar, resigned.\n\nRodney Scott, of Oklahoma, to be Commissioner of U.S. Customs and Border Protection, Department of Homeland Security, vice Chris Magnus.\n\nAbigail Slater, of the District of Columbia, to be an Assistant Attorney General, vice Jonathan Kanter, resigned.\n\nKeith Sonderling, of Florida, to be Deputy Secretary of Labor, vice Julie A. Su, resigned.\n\nStephen Vaden, of Tennessee, to be Deputy Secretary of Agriculture, vice Xochitl Torres Small, resigned.\n\nDavid Weldon, of Florida, to be Director of the Centers for Disease Control and Prevention. (New Position)\n\nBrandon Williams, of New York, to be Under Secretary for Nuclear Security, vice Jill Hruby, resigned.\n\nKeith Sonderling, of Florida, to be Deputy Secretary of Labor, vice Julie A. Su, resigned.\n",
  "summary": "On January 20, 2025, President Trump announced a series of nominations for key sub-cabinet positions within the United States government. These nominations include appointments to roles across various departments such as Defense, Health, Budget, and Justice. For instance, Keith Bass is nominated as Assistant Secretary of Defense, Jayanta Bhattacharya is nominated as the Director of the National Institutes of Health, and Jayanta Bhattacharya is nominated as Deputy Director of the Office of Management and Budget, among others.\n\nThese appointments seem to revolve around replacing officials who have resigned from their positions. The announcement covers several high-profile roles, such as Commissioner of Social Security, Deputy Attorney General, and the Administrator of NASA. The nominees hail from different states, bringing a wide range of expertise to the administration. Each nominee awaits confirmation by the Senate to officially assume their roles.",
  "eli5": "The President picked a bunch of new people to help run the big government jobs because some others left, and now they need to be checked by a group of people called the Senate before they start.",
  "keywords": [
    "Presidential Appointments",
    "Sub-Cabinet",
    "Nominations",
    "Trump Administration",
    "Senate Confirmation",
    "January 2025"
  ],
  "issues": [
    "Potential concerns about qualifications of certain appointees",
    "Senate confirmation process and potential delays",
    "Political biases in nominations"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}