{
  "title": "SUNDAY SHOWS: Trump Administration Fighting for America First – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "SUNDAY SHOWS: Trump Administration Fighting for America First",
  "og:description": "This morning, the Trump Administration was out in force across the TV networks as they updated the American people on President Trump’s agenda. Here’s",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/sunday-shows-trump-administration-fighting-for-america-first/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-02T20:15:35+00:00",
  "article:modified_time": "2025-03-02T20:15:36+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tSUNDAY SHOWS: Trump Administration Fighting for America First\t\t\t\t\n\nMarch 2, 2025\n\nThis morning, the Trump Administration was out in force across the TV networks as they updated the American people on President Trump’s agenda.\n\n**Here’s what you missed:**\n\n**Secretary of State Marco Rubio on ABC This Week**\n    - On negotiations to end the war in Ukraine : “The sooner everyone grows up around here and figures out that this is a bad war that’s heading in a bad direction… the more progress we’re going to be able to make. But the president is crystal clear… he is going to be a president that tries to achieve peace.”\n    - On President Trump’s desire for peace : “Shouldn’t we all be happy that we have a president who’s trying to stop wars and prevent them instead of start them? And I just don’t get it. I really don’t, other than the fact that it’s Donald J. Trump. If this was a Democrat that was doing this, everyone would be saying, well, he’s on his way to the Nobel Peace Prize. This is absurd. We are trying to end a war. You cannot end a war unless both sides come to the table, starting with the Russians. And – and that – that is the point the president has made.”\n\n**National Security Advisor Mike Waltz on State of the Union**\n    - On the Oval Office meeting between President Trump and Zelenskyy : “It was not clear Zelenskyy was going to go to negotiations at all — that he would ever be able to negotiate with Putin and whether he shared our goal of ending this war… This was a huge missed opportunity for him and for his country.”\n\n**Secretary of Commerce Howard Lutnick on Sunday Morning Futures**\n    - On President Trump delivering results : “We’ve had the lowest crossings ever, ever, under Donald Trump because of his ability to negotiate with Canada and Mexico.”\n\n**Director of National Intelligence Tulsi Gabbard on Fox News Sunday**\n    - On the danger of continuing the war in Ukraine:  “The longer this goes on, not only are more Ukrainians losing their lives, but it increases the potential of this escalation towards World War III … That’s not a cost that President Trump is willing to accept.”\n\n**Secretary of the Treasury Scott Bessent on Face the Nation**\n    - On rebuilding the economy : “President Trump’s been in office five weeks… interest rates — the 10-year bond… have been down every week since President Trump was President. Mortgage rates have been down every week. So, that’s a pretty good start.”\n\n**Press Secretary Karoline Leavitt on Media Buzz**\n    - On cameras being able to witness President Trump’s Oval Office meeting with Ukraine : “President Trump is the most transparent president in history. And as he said, it was great for the cameras to be in there because the American people — and the world — were able to see what the president and his team have seen behind the scenes in negotiating with President Zelenskyy’s team. They have continually denied the pragmatic reality of where their country stands today.”\n",
  "summary": "The text provides an account of the Trump Administration's updates across various TV networks on March 2, 2025, highlighting their ongoing efforts and agenda under President Trump. Secretary of State Marco Rubio discussed the administration's focus on negotiating an end to the war in Ukraine, emphasizing President Trump's peace-driven approach. National Security Advisor Mike Waltz commented on the challenges of engaging Ukrainian President Zelenskyy in negotiations with Russia, considering it a missed opportunity for Ukraine. \n\nMeanwhile, Secretary of Commerce Howard Lutnick highlighted the administration's achievements in reducing border crossings due to effective negotiations with Canada and Mexico. Director of National Intelligence Tulsi Gabbard stressed the dangerous progression of the Ukraine conflict and its potential to escalate into a global confrontation. Secretary of the Treasury Scott Bessent noted the positive economic trends during Trump's term, citing decreasing interest and mortgage rates. Lastly, Press Secretary Karoline Leavitt spoke on the transparency of Trump's presidency, particularly during meetings with Ukraine's leadership.",
  "eli5": "The Trump team was on TV shows explaining how they're trying to end the war in Ukraine and make things better in America. They want everyone to know that President Trump is working hard to keep the peace and improve the economy.",
  "keywords": [
    "Trump Administration",
    "Ukraine",
    "Peace negotiations",
    "Marco Rubio",
    "Mike Waltz",
    "Howard Lutnick",
    "Tulsi Gabbard",
    "Scott Bessent",
    "Karoline Leavitt"
  ],
  "issues": [
    "The potential for escalation in the Ukraine conflict",
    "Challenges in engaging Ukraine in peace negotiations",
    "Transparency of presidential actions and meetings"
  ],
  "citations": [],
  "document_type": "Press Release"
}