{
  "title": "SUNDAY SHOWS: Most Transparent Administration in History – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "SUNDAY SHOWS: Most Transparent Administration in History",
  "og:description": "This morning, the Trump Administration was out in force across the TV networks to update Americans on the progress made in the historic first month of",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/sunday-shows-most-transparent-administration-in-history/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-23T20:00:35+00:00",
  "article:modified_time": "2025-02-23T20:00:36+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tSUNDAY SHOWS: Most Transparent Administration in History\t\t\t\t\n\nFebruary 23, 2025\n\nThis morning, the Trump Administration was out in force across the TV networks to update Americans on the progress made in the [historic first month](https://www.whitehouse.gov/articles/2025/02/america-is-back-and-president-trump-is-just-getting-started/) of President Trump’s second term.\n\n**Here’s what you missed:**\n\n**Special Envoy Steve Witkoff on State of the Union**\n    - On negotiations to end the war in Ukraine : “Deals only work, Jake, when they’re good for all the parties — and that’s the pathway we’re on here.”\n    - On securing a rare earth minerals agreement with Ukraine : “I expect to see a deal signed this week.”\n    - On bringing peace to Europe : “The only way you’re going to end the carnage is if you have a relationship with the leaders of both countries that are involved.”\n\n**Secretary of the Treasury Scott Bessent on Sunday Morning Futures**\n    - On mortgage rates : “Interest rates are down five weeks in a row on the 10-year since President Trump took office — and mortgage rates are down.”\n    - On reciprocal tariffs : “We’re just doing what they’re doing and then adding in these other factors. If they remediate those … the tariffs could drop. If they want to continue these unfair trade practices, then the tariff will go up until they are willing to negotiate.”\n    - On negotiations around a minerals deal with Ukraine:  “This deal is part of President Trump’s long-arc negotiating strategy for peace between Ukraine and Russia … A partnership between Ukraine and the U.S. … It is a win-win.”\n\n**Secretary of Defense Pete Hegseth on Fox News Sunday**\n    - On restoring the Pentagon’s mission : “President Trump has given another set of lawful orders, and they will be followed … If they’re not followed, then those officers will find the door … We feel really good about the direction the Pentagon is headed under President Trump.”\n    - On ending the war in Ukraine : “America more than any other country in the world has invested in helping Ukraine defend itself. Now, it’s time for peace.”\n\n**EPA Administrator Lee Zeldin on Sunday Morning Futures**\n    - On getting back to the agency’s core focus : “It’s time to go back to the basics to ensure we are delivering clean air, land, and water, and we are also unleashing energy dominance … That’s the priority at the EPA under President Trump.”\n\n**Special Envoy Steve Witkoff on Face the Nation**\n    - On President Trump’s plan for peace and stability in Gaza : “He understands that it makes no sense to endorse old policy prescriptions that have not worked.”\n\n**National Security Advisor Mike Waltz on Sunday Morning Futures**\n    - On President Trump’s first month : “What you’re seeing under President Trump’s leadership, in just under a month, is bringing multiple wars to an end. He is a president of peace.”\n",
  "summary": "In February 2025, the Trump Administration made appearances on several TV networks to update Americans on the progress during the first month of President Trump's second term. Special Envoy Steve Witkoff highlighted ongoing negotiations to end the war in Ukraine and secure a rare earth minerals agreement with Ukraine. Secretary of the Treasury Scott Bessent discussed decreasing mortgage rates, strategies to address reciprocal tariffs, and the inclusion of a minerals deal in President Trump's broader peace strategy. Secretary of Defense Pete Hegseth emphasized the renewed focus of the Pentagon and the pursuit of peace in Ukraine.\n\nOn Fox News Sunday, Secretary of Defense Pete Hegseth reiterated the commitment to following President Trump's orders and highlighted the U.S.'s investment in helping Ukraine. The EPA Administrator Lee Zeldin spoke about refocusing on core environmental issues such as clean air, land, water, and energy dominance. National Security Advisor Mike Waltz praised President Trump's leadership in ending multiple wars. Meanwhile, Special Envoy Steve Witkoff pointed to a new approach in achieving peace and stability in Gaza, steering away from outdated policies.",
  "eli5": "President Trump and his team talked on TV about their work on making peace and doing fair deals with other countries. They also want to make sure the air and water are clean and take care of energy needs. Everyone is working together to follow what President Trump asks.",
  "keywords": [
    "Trump Administration",
    "Ukraine",
    "Peace Negotiations",
    "Mortgage Rates",
    "Reciprocal Tariffs",
    "Pentagon",
    "EPA",
    "Energy",
    "Gaza",
    "National Security"
  ],
  "issues": [
    "Lack of detailed outcomes in negotiations with Ukraine",
    "Potential impacts of reciprocal tariffs on international trade",
    "Clarity on the environmental approach under Trump's administration"
  ],
  "citations": [],
  "document_type": "Press Release"
}