{
  "title": "Support Pours in for President Trump, VP Vance’s America First Strength – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Support Pours in for President Trump, VP Vance’s America First Strength",
  "og:description": "Today, President Donald J. Trump and Vice President JD Vance made clear to the world that the United States will not be taken advantage of — a sentiment",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/support-pours-in-for-president-trump-vp-vances-america-first-strength/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-28T20:59:55+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tSupport Pours in for President Trump, VP Vance’s America First Strength\t\t\t\t\n\nFebruary 28, 2025\n\nToday, President Donald J. Trump and Vice President JD Vance made clear to the world that the United States will not be taken advantage of — a sentiment echoed by the cabinet and members of Congress from across the country.\n\n[**Secretary of State Marco Rubio**](https://x.com/SecRubio/status/1895554419305091087): “Thank you @POTUS for standing up for America in a way that no President has ever had the courage to do before. Thank you for putting America First. America is with you!”\n\n[**Sen. Lindsey Graham**](https://x.com/RapidResponse47/status/1895560308133150973): “I’ve never been more proud of President Trump for showing the American people — and the world — you don’t trifle with this man … He wanted to get a ceasefire. He wants to end the war and Zelenskyy felt like he needed to bait Trump in the Oval Office.”\n\n[**Secretary of Homeland Security Kristi Noem**](https://x.com/Sec_Noem/status/1895548785969021053): “I am so proud of our Commander-in-Chief. Thank you President @RealDonaldTrump and @VP for standing up for America. We will not tolerate the political games and disrespect of America. America is back.”\n\n[**Secretary of Defense Pete Hegseth**](https://x.com/PeteHegseth/status/1895541069921866167)**:** “Amen, Mr. President.”\n\n[**Secretary of the Treasury Scott Bessent**](https://x.com/SecScottBessent/status/1895536042188665111)**:** “Thank you, President Trump, for standing up for the American people and our nation on the global stage.”\n\n[**Secretary of the Interior Doug Burgum**](https://x.com/SecretaryBurgum/status/1895546944640205106)**:** “Thank you @POTUS for standing strong for America while working to end the killing abroad.”\n\n[**Secretary of Agriculture Brooke Rollins**](https://x.com/SecRollins/status/1895536214419317190)**:** “American leadership is back — in the Oval Office — and on the world stage. FEARLESS. BOLD. RELENTLESS. We will save America.”\n\n[**Secretary of Transportation Sean Duffy**](https://x.com/SecDuffy/status/1895558190529724594): “Thank you @POTUS for standing up for the United States. The American people will not stand for disrespect of our President, Oval Office, or our generous taxpayers. Peace is only accomplished through strength and our allies need to understand that.”\n\n[**Secretary of Housing and Urban Development Scott Turner**](https://x.com/SecretaryTurner/status/1895539391474684227)**:** “President Trump is standing up for forgotten Americans, not endless foreign wars. Biden’s legacy — increased homelessness, record high interest rates, all-time highs to buy a house, and Americans footing the bill. That ended January 20th. The American people are behind @POTUS.”\n\n[**Sen. Jim Banks**](https://x.com/SenatorBanks/status/1895540268717523433)**:** “Thank you President Trump for standing up for America!”\n\n[**Sen. Marsha Blackburn**](https://x.com/VoteMarsha/status/1895542829604352468)**:** “Thank you President Trump and VP Vance or standing up for America.”\n\n[**Sen. Bill Hagerty**](https://x.com/SenatorHagerty/status/1895547189835006288)**:** “The United States of America will no longer be taken for granted. The contrast between the last four years and now could not be more clear. Thank you, Mr. President.”\n\n[**Sen. Josh Hawley**](https://x.com/HawleyMO/status/1895540163658547576)**:** “Remember: the U.S. Senate has repeatedly and for years voted BILLIONS of taxpayer dollars to Ukraine with no strings attached and with no true oversight. It’s time for some ACCOUNTABILITY.”\n\n[**Sen. Jim Justice**](https://x.com/JimJustice_WV/status/1895541874301288599)**:** “Glad to have a @POTUS and @VP in charge that absolutely put America FIRST.”\n\n[**Sen. Mike Lee**](https://x.com/SenMikeLee/status/1895536905103749249)**:** “Thank you for standing up for OUR COUNTRY and putting America first, President Trump and Vice President Vance!”\n\n[**Sen. Bernie Moreno**](https://x.com/berniemoreno/status/1895536337354440904)**:** “Finally we have a President who will speak the TRUTH and stand up against Washington’s endless wars. American taxpayers have been funding this war, it’s time to stop the killing and stop risking World War 3!”\n\n[**Sen. Markwayne Mullin**](https://x.com/SenMullin/status/1895559920256500213): “Under this President— the greatest, freest, and most generous nation on Earth is putting America First. I’d encourage anyone who has a problem with that to reevaluate their priorities.”\n\n[**Sen. Rick Scott**](https://x.com/SenRickScott/status/1895533337223270787)**:** “Thank you President Trump for standing up for America.”\n\n[**Sen. Eric Schmitt**](https://x.com/Eric_Schmitt/status/1895538306378842296)**:** “It’s about time we have leaders who say what the American people are really thinking and prioritize the core national interests of America. The American taxpayer is tapped out, and President Trump and VP Vance are spot on.”\n\n[**Sen. Tommy Tuberville**](https://x.com/SenTuberville/status/1895534909168771275)**:** “Thank you Mr. President and Vice President Vance for putting America first”\n\n[**Majority Leader Steve Scalise**](https://x.com/SteveScalise/status/1895559287625433106): “President Trump is fighting for PEACE around the world and is putting America First as our best negotiator—he’s the only one to get Russia to the table to consider a serious and lasting peace agreement with Ukraine.”\n\n[**Chairwoman Lisa McClain**](https://x.com/RepLisaMcClain/status/1895559586511536246): “President Trump inherited this war. He has said from the beginning he wants to bring peace. @POTUS is a strong leader, and I know his negotiations will bring a deal together.”\n\n[**Rep. Andy Biggs**](https://x.com/RepAndyBiggsAZ/status/1895554875670610369): “Gone are the days of foreign leaders walking all over us and snubbing their noses at America’s generosity. There’s a new President and Vice President in town. World leaders would be wise to humble themselves.”\n\n[**Rep. Tim Burchett**](https://x.com/RepTimBurchett/status/1895541780910899660): “Job well done by @realDonaldTrump and our VP @JDVance. Give respect to get respect.”\n\n[**Rep. Mike Collins**](https://x.com/RepMikeCollins/status/1895554249570074938): “Thank God we finally have a @POTUS who is willing to put America FIRST. Blessed are the peacemakers.”\n\n[**Rep. Eli Crane**](https://x.com/RepEliCrane/status/1895536291288400374)**:** “America First. Thank you, President Trump and Vice President Vance.”\n\n[**Rep. Dan Crenshaw**](https://x.com/RepDanCrenshaw/status/1895558637063717310): “If you are the leader of a country in a dire situation with no path to peace without American support, do not come into the Oval Office and argue with the President of the United States in public. Just a word of advice.”\n\n[**Rep. Andrew Clyde**](https://x.com/Rep_Clyde/status/1895537781931495485)**:** “President Trump and Vice President Vance are standing up for the AMERICAN PEOPLE. Our great country will NOT be taken advantage of or disrespected.”\n\n[**Rep. Byron Donalds**](https://x.com/RepDonaldsPress/status/1895538671941808491)**:** “This is what putting the AMERICAN PEOPLE FIRST looks like. Thank you @realdonaldtrump and @JDVance for standing up for our nation.”\n\n[**Rep. Brandon Gill**](https://x.com/RepBrandonGill/status/1895541832656044062)**:** “America First in action. Thank you, @realdonaldtrump and @JDVance, for prioritizing our people and for promoting peace!”\n\n[**Rep. Lance Gooden**](https://x.com/Lancegooden/status/1895537705028894727)**:** “President @realdonaldtrump and Vice President @JDVance will never allow the United States to be disrespected or taken advantage of. America First, always!”\n\n[**Rep. Paul Gosar**](https://x.com/RepGosar/status/1895536679651516900)**:** “Thank you, Mr. President and Vice President. The days of the USA getting pushed around are clearly over.”\n\n[**Rep. Marjorie Taylor Greene**](https://x.com/RepMTG/status/1895537523004477786)**:** “President Trump and Vice President Vance will put America First every single time. Putting Zelensky in his place while he disrespects the U.S. in the Oval Office is exactly what American leadership should look like. This is what We The People want to see!”\n\n[**Rep. Pat Harrigan**](https://x.com/RepPatHarrigan/status/1895540991417074088): “America’s priorities come first. @POTUS and @VP made it clear—Ukraine’s interests are not America’s interests. We’ve spent hundreds of billions with no accountability, no clear objectives, and no plan for peace. It’s time to put America first and end this war.”\n\n[**Rep. Mark Harris**](https://x.com/RepMarkHarrisNC/status/1895557561094738170): “Thank you, President Trump and Vice President Vance, for boldly defending America’s interests. This is PEACE THROUGH STRENGTH”\n\n[**Rep. Diana Harshbarger**](https://x.com/RepHarshbarger/status/1895534223936868861)**:** “The act displayed by Zelenskyy in the Oval Office was nothing short of a massive show of disrespect for the Trump Administration and the American people. Despite this, President Trump and Vice President Vance are holding the line and trying to end this conflict peacefully. God bless them both.”\n\n[**Rep. Wesley Hunt**](https://x.com/RepWPH/status/1895533010969321617): “You do NOT blame the people fighting to save your country! America leads—no more excuses!”\n\n[**Rep. Nancy Mace**](https://x.com/RepNancyMace/status/1895537199447490864): “Peace through strength live from the Oval”\n\n[**Rep. Thomas Massie**](https://x.com/RepThomasMassie/status/1895533884995248578): “Is this the end of Zelensky’s presidency? He hitched his wagon to Biden and the deep state. They lost and now he doesn’t seem to be playing his cards well.”\n\n[**Rep. Brian Mast**](https://x.com/HouseForeignGOP/status/1895541775869354071): “American won’t be taken advantage of and America won’t be taken for granted. Thank you, President Trump and Vice President Vance for standing up for America.”\n\n[**Rep. Addison McDowell**](https://x.com/RepMcDowell/status/1895544766944985472): “AMERICA AND THE AMERICAN TAXPAYER ALWAYS COME FIRST”\n\n[**Rep. Mary Miller**](https://x.com/RepMaryMiller/status/1895543442090180938): “What has happened in Ukraine is a travesty. Joe Biden threw “gas on the fire.” Ukraine lost an entire generation, and Americans hundreds of billions in tax dollars. We thank God for giving us strong leadership. Thank you @POTUS and @VP for putting America’s interests first, and working to end this terrible war.”\n\n[**Rep. Riley Moore**](https://x.com/RepRileyMoore/status/1895539789753172173)**:** “It is amazing to have a President and VP who put America First! Thank you President Trump and VP Vance for fighting for our country and our people!”\n\n[**Rep. Troy Nehls**](https://x.com/RepTroyNehls/status/1895536791337517356)**:** “President Trump and Vice President Vance are standing up for the American people. This is America First leadership on display. Thank you POTUS and VP!”\n\n[**Rep. Ralph Norman**](https://x.com/RepRalphNorman/status/1895546705564909613)**:** “THIS is strong leadership that is ensuring we put the American people FIRST. Thank you @realDonaldTrump and @JDVance for standing up for our nation.”\n\n[**Rep. Andy Ogles**](https://x.com/RepOgles/status/1895541144962154540)**:** “This is what it looks like to stand up for America.”\n\n[**Rep. Mike Rulli**](https://x.com/RepMichaelRulli/status/1895534712258724009): “You don’t have the cards!”\n\n[**Rep. Keith Self**](https://x.com/RepTimBurchett/status/1895541780910899660)**:** “TOUGH and FAIR. The world is witnessing American leadership back in the White House. Thank you President Trump and Vice President Vance.”\n\n[**Rep. Victoria Spartz**](https://x.com/RepSpartz/status/1895549184146845752): “Zelensky is doing a serious disservice to the Ukrainian people insulting the American President and the American people – just to appease Europeans and increase his low polling in Ukraine after he failed miserably to defend his country. This is not a theater act but a real war!”\n\n[**Rep. Greg Steube**](https://x.com/RepGregSteube/status/1895541437518983362)**:** “Ridiculous grandstanding by Zelensky in the Oval Office. The United States has spent hundreds of billions of dollars to defend Ukraine. And this is the thanks the American people get?  It’s time to end this war.”\n\n[**Rep. Marlin Stutzman**](https://x.com/RepStutzman/status/1895541157243080861): “TRUMP IS THE GREATEST NEGOTIATOR AMERICA HAS EVER HAD! AMERICA IS BEING MADE GREAT BEFORE OUR VERY EYES!”\n\n[**Rep. Andy Weber**](https://x.com/TXRandy14/status/1895543721753788603)**:** “America FIRST. Strong, unapologetic leadership on the world stage is BACK!”\n\n[**Rep. Joe Wilson**](https://x.com/RepJoeWilson/status/1895526775297646729): “I agree with President Trump that Ukrainian soldiers have been unbelievably brave! Critical Minerals Deal a major step forward toward ending the war responsibly. More sanctions on Russia &amp; arms for Ukraine create maximum leverage for FULL land swap Art of the Deal!”\n",
  "summary": "On February 28, 2025, widespread support has been expressed for President Donald J. Trump and Vice President JD Vance’s America First policies. They have both emphasized a firm stance against foreign powers taking advantage of the United States, reflecting a more assertive international posture. The article features numerous quotes from government officials, including members of Congress and cabinet secretaries, who have expressed support for the administration's stance.\n\nKey figures such as Secretary of State Marco Rubio, Secretary of Defense Pete Hegseth, and several senators and representatives have praised President Trump and Vice President Vance's efforts to prioritize American interests, particularly in the context of ongoing conflicts abroad. The officials criticize what they perceive as previous administrations' excessive spending on foreign entanglements without tangible oversight and emphasize the need for peace through strength.\n\nThe underlying message from these officials is that the current administration is taking a bold and unyielding approach to foreign policy, aiming to ensure American interests are safeguarded and respected on the global stage. There is also a focus on the end of longstanding military engagements and reducing financial contributions abroad, with emphasis on accountability and national interests.",
  "eli5": "Lots of important people in the government are saying thank you to President Trump for standing up for America and trying to make sure we're not being taken advantage of by other countries. They like that he's trying to make peace and keep Americans safe and happy.",
  "keywords": [
    "President Trump",
    "Vice President JD Vance",
    "America First",
    "foreign policy",
    "support",
    "Congress",
    "Secretary of State",
    "ceasefire",
    "war",
    "peace"
  ],
  "issues": [
    "Lack of specific details on the alleged disrespectful act by Zelenskyy",
    "No citation of specific policies or actions taken by the administration",
    "Potential bias in the representation of current events"
  ],
  "citations": [],
  "document_type": "Press Release"
}