{
  "title": "Temporary Withdrawal of All Areas on the Outer Continental Shelf from Offshore Wind Leasing and Review of the Federal Government's Leasing and Permitting Practices for Wind Projects – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Temporary Withdrawal of All Areas on the Outer Continental Shelf from Offshore Wind Leasing and Review of the Federal Government's Leasing and Permitting Practices for Wind Projects",
  "og:description": "January 20, 2025 MEMORANDUM FOR THE SECRETARY OF THE TREASURY                THE",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/temporary-withdrawal-of-all-areas-on-the-outer-continental-shelf-from-offshore-wind-leasing-and-review-of-the-federal-governments-leasing-and-permitting-practices-for-wind-projects/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:42:59+00:00",
  "article:modified_time": "2025-01-21T02:13:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tTemporary Withdrawal of All Areas on the Outer Continental Shelf from Offshore Wind Leasing and Review of the Federal Government’s Leasing and Permitting Practices for Wind Projects\t\t\t\t\n\nJanuary 20, 2025\n\nJanuary 20, 2025\n\nMEMORANDUM FOR THE SECRETARY OF THE TREASURY\n\n               THE ATTORNEY GENERAL\n\nTHE SECRETARY OF THE INTERIOR\n\nTHE SECRETARY OF AGRICULTURE\n\n               THE SECRETARY OF ENERGY\n\nTHE ADMINISTRATOR OF THE ENVIRONMENTAL PROTECTION\n\n   AGENCY\n\nSUBJECT:                  Temporary Withdrawal of All Areas on the Outer\n\nContinental Shelf from Offshore Wind Leasing and\n\nReview of the Federal Government’s Leasing and\n\nPermitting Practices for Wind Projects\n\nSection 1.  Temporary Withdrawal of Areas.  Consistent with the principles of responsible public stewardship that are entrusted to this office, with due consideration for a variety of relevant factors, including the need to foster an energy economy capable of meeting the country’s growing demand for reliable energy, the importance of marine life, impacts on ocean currents and wind patterns, effects on energy costs for Americans –- especially those who can least afford it –- and to ensure that the United States is able to maintain a robust fishing industry for future generations and provide low cost energy to its citizens, I hereby direct as follows:\n\nUnder the authority granted to me in section 12(a) of the Outer Continental Shelf Lands Act, 43 U.S.C. 1341(a), I hereby withdraw from disposition for wind energy leasing all areas within the Offshore Continental Shelf (OCS) as defined in section 2 of the Outer Continental Shelf Lands Act, 43 U.S.C. 1331.  This withdrawal shall go into effect beginning on January 21, 2025, and shall remain in effect until this Presidential Memorandum is revoked.\n\nTo the extent that an area is already withdrawn from disposition for wind energy leasing, the area’s withdrawal is extended for a time period beginning on January 21, 2025, until this Presidential Memorandum is revoked.\n\nThis withdrawal temporarily prevents consideration of any area in the OCS for any new or renewed wind energy leasing for the purposes of generation of electricity or any other such use derived from the use of wind.  This withdrawal does not apply to leasing related to any other purposes such as, but not limited to, oil, gas, minerals, and environmental conservation.\n\nNothing in this withdrawal affects rights under existing leases in the withdrawn areas.  With respect to such existing leases, the Secretary of the Interior, in consultation with the Attorney General as needed, shall conduct a comprehensive review of the ecological, economic, and environmental necessity of terminating or amending any existing wind energy leases, identifying any legal bases for such removal, and submit a report with recommendations to the President, through the Assistant to the President for Economic Policy.\n\nSec. 2.  Temporary Cessation and Immediate Review of Federal Wind Leasing and Permitting Practices**.**(a)  In light of various alleged legal deficiencies underlying the Federal Government’s leasing and permitting of onshore and offshore wind projects, the consequences of which may lead to grave harm — including negative impacts on navigational safety interests, transportation interests, national security interests, commercial interests, and marine mammals — and in light of potential inadequacies in various environmental reviews required by the National Environmental Policy Act to lease or permit wind projects, the Secretary of the Interior, the Secretary of Agriculture, the Secretary of Energy, the Administrator of the Environmental Protection Agency, and the heads of all other relevant agencies, shall not issue new or renewed approvals, rights of way, permits, leases, or loans for onshore or offshore wind projects pending the completion of a comprehensive assessment and review of Federal wind leasing and permitting practices.  The Secretary of the Interior shall lead that assessment and review in consultation with the Secretary of the Treasury, the Secretary of Agriculture, the Secretary of Commerce, through the National Oceanic and Atmospheric Administration, the Secretary of Energy, and the Administrator of the Environmental Protection Agency.  The assessment shall consider the environmental impact of onshore and offshore wind projects upon wildlife, including, but not limited to, birds and marine mammals.  The assessment shall also consider the economic costs associated with the intermittent generation of electricity and the effect of subsidies on the viability of the wind industry.\n\n(b)  In light of criticism that the Record of Decision (ROD) issued by the Bureau of Land Management on December 5, 2024, with respect to the Lava Ridge Wind Project Final Environmental Impact Statement (EIS), as approved by the Department of the Interior, is allegedly contrary to the public interest and suffers from legal deficiencies, the Secretary of the Interior shall, as appropriate, place a temporary moratorium on all activities and rights of Magic Valley Energy, LLC, or any other party under the ROD, including, but not limited to, any rights-of-way or rights of development or operation of any projects contemplated in the ROD.  The Secretary of the Interior shall review the ROD and, as appropriate, conduct a new, comprehensive analysis of the various interests implicated by the Lava Ridge Wind Project and the potential environmental impacts.\n\n(c)  The Secretary of the Interior, the Secretary of Energy, and the Administrator of the Environmental Protection Agency shall assess the environmental impact and cost to surrounding communities of defunct and idle windmills and deliver a report to the President, through the Assistant to the President for Economic Policy, with their findings and recommended authorities to require the removal of such windmills.\n\n(d)  The Attorney General may, as appropriate and consistent with applicable law, provide notice of this order to any court with jurisdiction over pending litigation related to any aspect of the Federal leasing or permitting of onshore or offshore wind projects or the Lava Ridge Wind Project, and may, in the Attorney General’s discretion, request that the court stay the litigation or otherwise delay further litigation, or seek other appropriate relief consistent with this order, pending the completion of the actions described in subsection (a) or subsection (b) of this section, as applicable.\n\nThis memorandum shall be implemented consistent with applicable law and subject to the availability of appropriations. \n\nThis memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person. You are authorized and directed to publish this memorandum in the *Federal Register.*\n",
  "summary": "# Summary\n\nOn January 20, 2025, a Presidential Memorandum was issued, directing the temporary withdrawal of all areas on the Outer Continental Shelf from offshore wind leasing. This directive aims to balance public stewardship with various factors, including energy needs, marine life protection, economic impacts, and support for the fishing industry. The memorandum is effective from January 21, 2025, and calls for a comprehensive review of wind energy leasing and permitting practices by federal agencies, focusing on ecological, economic, and environmental considerations.\n\nAdditionally, the memorandum mandates a temporary halt on new or renewed approvals for onshore and offshore wind projects pending a thorough assessment of current practices and impacts. The Secretary of the Interior is tasked with leading this evaluation, in collaboration with other relevant agencies, and must consider the environmental and economic effects of wind projects. Concerns surrounding legal deficiencies, especially regarding the Lava Ridge Wind Project's approval, are also addressed, requiring a fresh analysis and potential moratorium on project activities.\n",
  "eli5": "The President decided to stop letting people build new wind farms in the ocean for a while to check if they're good or bad for us and the environment, and how they affect things like sea animals and electricity costs.",
  "keywords": [
    "Outer Continental Shelf",
    "wind energy leasing",
    "environmental impact",
    "fishing industry",
    "energy policy",
    "wind projects review"
  ],
  "issues": [
    "Potential conflicts with existing leases",
    "Impact on energy costs",
    "Legal challenges to the memorandum",
    "Environmental and economic implications"
  ],
  "citations": [
    "Outer Continental Shelf Lands Act, 43 U.S.C. 1341(a)",
    "National Environmental Policy Act"
  ],
  "document_type": "Presidential Memorandum"
}