{
  "title": "The National Day of Remembrance of the 80th Anniversary of the Liberation of Auschwitz, 2025 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "The National Day of Remembrance of the 80th Anniversary of the Liberation of Auschwitz, 2025",
  "og:description": "Today marks the 80th anniversary of the liberation of Auschwitz-Birkenau, the Nazi concentration camp in Poland that stood at the center of the Holocaust",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/the-national-day-of-remembrance-of-the-80th-anniversary-of-the-liberation-of-auschwitz-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-28T03:27:13+00:00",
  "article:modified_time": "2025-01-29T14:05:55+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tNational Day of Remembrance of the 80th Anniversary of the Liberation of Auschwitz, 2025\t\t\t\t\n\nJanuary 27, 2025\n\nToday marks the 80th anniversary of the liberation of Auschwitz-Birkenau, the Nazi concentration camp in Poland that stood at the center of the Holocaust and focus for their systematic slaughter of the Jewish people.     Between 1940 and 1945, more than one million Jews, religious leaders, disabled persons, and other innocent victims were viciously and mercilessly executed in Auschwitz at the hands of the evil Nazi regime — culminating in one of the darkest chapters in human history.  On this solemn day, America joins the Jewish community, the people of Poland, and the entire world in mourning the lives lost, the souls battered, the heroes forgotten, and the countless men and women who gave their lives for the cause of freedom.\n\nOver those 5 gruesome years at Auschwitz, mothers and fathers lost their children, daughters and sons lost their parents, and wives and husbands lost their soulmates to the deadly scourge of anti-Semitism — leaving an unfillable void in their hearts.  \n\nTo those who lost family members and loved ones, we pray that Almighty God will grant you comfort and strength.  To those who survived the atrocities at Auschwitz, we honor your courage, we salute your sacrifice, and we offer you our enduring love and unceasing gratitude.  And to every person touched by the calamities of the Holocaust, we give you our unwavering devotion and eternal promise to never forget the evils that took place during that dark time in history.\n\nSadly, despite decades of wisdom shared by survivors, years of reflection on the depravities committed, and decades of progress towards peace, the poison of anti-Semitism still courses through the veins of cowards in dark corners of the world.  So today, we renew our promise that anti-Semitism has no place in a civilized society, no place in our foreign policy, and no place in the United States of America.\n\nIn the years since the liberation of Auschwitz on this day eight decades ago, the grave offenses that took place during the Holocaust and the cries of the Jewish people have echoed throughout the halls of history.  In the wake of the oppression, persecution, and injustice committed at Auschwitz and elsewhere in Europe, the Jewish people gallantly persevered to re-found their homeland in the modern State of Israel — our mighty friend.  To this day, the Jewish people proudly represent the peak of human tenacity and the pinnacle of human triumph.\n\nAs we commemorate this somber occasion, we pay tribute to the undying spirit of the Jewish community.  We reaffirm our commitment to educating our children and every future generation about the horrors that took place within the confines of Auschwitz and other concentration and death camps.  We renew our resolve to end anti-Semitism and religious bigotry of all forms.  We proudly reassert our strong bonds of friendship with the State of Israel.  And we declare the timeless truth that every human being is a child of God and inherently worthy of dignity and respect.\n\nNOW, THEREFORE, I, DONALD J. TRUMP, President of the United States of America, by virtue of the authority vested in me by the Constitution and the laws of the United States, do hereby proclaim January 27, 2025, as a National Day of Remembrance of the 80th Anniversary of the Liberation of Auschwitz.  On this day, I call upon every American citizen to observe this day with programs, ceremonies, and prayers commemorating the victims of the Holocaust and honoring the sacrifices of the men and women who helped liberate the victims of the Nazis at Auschwitz.\n\nIN WITNESS WHEREOF, I have hereunto set my hand thistwenty-seventh day of January, in the year of our Lord two thousand twenty-five, and of the Independence of the United States of America the two hundred and forty-ninth.\n",
  "summary": "# National Day of Remembrance 80th Anniversary of Auschwitz Liberation, 2025\n\nOn January 27, 2025, a proclamation by President Donald J. Trump marks the 80th anniversary of the Auschwitz-Birkenau camp's liberation. Auschwitz was a key site during the Holocaust, where over a million Jews and other victims were murdered by the Nazi regime. This day of remembrance aims to honor the victims and survivors and reaffirm the commitment to eradicate anti-Semitism and religious intolerance. The proclamation highlights the enduring spirit of the Jewish community and the importance of educating future generations about these historical horrors.\n\nPresident Trump calls on Americans to observe this day through programs, ceremonies, and prayers, thereby honoring both the victims and the liberators of the Auschwitz camp. He emphasizes the shared commitment to the Jewish people and the continued support for the State of Israel. This proclamation serves as a reminder of human dignity, resilience, and the rejection of hatred and bigotry.",
  "eli5": "**Auschwitz** was a really sad place where many people suffered. On January 27, 2025, the President wants everyone to remember what happened and promise not to let it happen again.",
  "keywords": [
    "Auschwitz",
    "Holocaust",
    "Remembrance",
    "Anti-Semitism",
    "Jewish Community",
    "President Donald J. Trump",
    "Liberation",
    "Proclamation",
    "State of Israel"
  ],
  "issues": [
    "The document reflects on past atrocities but doesn't address recent incidents of anti-Semitism in detail.",
    "The proclamation focuses positively on US-Israel relations without addressing specific current challenges."
  ],
  "citations": [],
  "document_type": "Proclamation"
}