{
  "title": "The First 100 Hours: Historic Action to Kick off America's Golden Age – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "The First 100 Hours: Historic Action to Kick off America's Golden Age",
  "og:description": "President Donald Trump’s second term is off to an historic start. The President is wasting no time delivering on the promises he made to the American",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/the-first-100-hours-historic-action-to-kick-off-americas-golden-age/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-24T21:09:03+00:00",
  "article:modified_time": "2025-01-24T21:09:41+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tThe First 100 Hours: Historic Action to Kick Off America’s Golden Age\t\t\t\t\n\nJanuary 24, 2025\n\nPresident Donald Trump’s second term is off to an historic start.The President is wasting no time delivering on the promises he made to the American people. The President signed more executive orders on his first day in office than any other president in history.Within the first 100 hours of his second administration, President Trump taken hundreds of executive actions to secure the border, deport criminal illegal immigrants, unleash American prosperity, lower costs, increase government transparency, and reinstitute merit-based hiring in the federal government.The President has already secured over $1 trillion in historic new investments**.**\n\nWe’re witnessing the Trump Effect:\n    - President Trump is securing historic investments just days after being sworn in.       - President Trump  secured  $500 billion in private sector investment for the largest AI infrastructure project in history, with Softbank CEO Masayoshi Son, Oracle co-founder Larry Ellison and OpenAI CEO Sam Altman all  stating  that it would not have been possible if not for President Trump’s election victory and leadership.\n      - Saudi Arabia “ wants to invest $600 billion in the United States over the next four years .”\n      - Stellantis announced it will restart an assembly plant in Illinois and build the new Dodge Durango in Detroit.         - The Detroit Free Press : “The news, announced in a letter Wednesday to employees from North America Chief Operating Officer Antonio Filosa, also provided some good news to workers in Toledo, Ohio, and Kokomo, Indiana, where investments are planned. The Belvidere plant will start production of a new midsize truck in the next two years. The letter said company Chairman John Elkann had met last week with President Donald Trump before his inauguration on Monday. Elkann shared ‘our enthusiasm for his strong commitment to the United States auto industry and all that this means for American jobs and the broader economy.’” \n    - President Trump is already securing the border and arresting criminal illegal immigrants.\n    - The Border Patrol is reporting a significant drop already in attempted illegal crossings.\n    - Fox News : “The U.S. southern border has seen a sharp drop in illegal immigrant encounters in the first days of the Trump administration, compared to the final few days of the Biden administration.”       - ICE is at work rounding up criminal aliens.         - Fox News : “Information obtained by Fox News Digital, shows that between midnight Jan. 21 and 9 a.m. Jan 22, a 33-hour period, ICE Enforcement and Removal Operations (ERO) arrested more than 460 illegal immigrants that include criminal histories of sexual assault, robbery, burglary, aggravated assault, drugs and weapons offenses, resisting arrest and domestic violence.”\n        - Breitbart News : “President Donald Trump’s administration arrested 538 illegal aliens on Thursday, ranging from child predators to gang members and a suspected terrorist.” \n      - The Trump Administration immediately shut down the CBP One app, which “ paroled ” over 1 million illegal immigrants.\n      - Deportation flights have  already  started and the military is assisting with the effort.\n      - The Department of Homeland Security  reinstated  official use of the term “illegal alien” over “undocumented noncitizen,” and the DOJ  announced  it would be taking action against lawless sanctuary city policies.\n      - President Donald Trump  signed  an executive order to designate the cartels as terrorist organizations. \n    - Common sense has been restored to the government.       - President Trump signed a series of executive orders ensuring the elimination of discriminatory DEI practices and ensuring merit-based hiring.\n      - DEI  staff  are being placed on leave.\n      - The Federal Aviation Administration must now  return  to merit-based hiring.\n      - President Trump  ended  an affirmative action mandate in federal government hiring.\n      - President Trump signed an  executive order  affirming the reality that there are only two sexes.\n      - The State Department  issued  guidance that embassies should only be flying the American flag, and not any activist flags.\n      - President Donald Trump signed an  executive order  telling agencies to stop remote work practices and directing workers to return to the office.\n      - The State Department subsequently  ordered  workers to return to working in the office.\n      - President Donald Trump is unleashing American energy.\n      - President Trump declared a  National Energy Emergency  to unlock America’s full energy potential and bring down costs for American families.\n      - President Trump rescinded every one of Joe Biden’s industry-killing, pro-China, and anti-American energy  regulations , empowering  consumer choice  in vehicles, showerheads, toilets, washing machines, lightbulbs ,  and dishwashers.\n      - President Trump withdrew the United States from the disastrous  Paris Climate Agreement  that unfairly ripped off our country.\n      - President Trump paused all new federal leasing and permitting for  massive wind farms  that degrade our natural landscapes and fail to serve American energy consumers.\n      - President Trump reversed the burdensome regulations that impeded  Alaska’s ability  to develop its vast natural resources.\n      - President Trump terminated Biden’s harmful  electric vehicle mandate . \n\nThese opening few days can be summarized as Promises Made, Promises Kept:\n    - President Donald Trump  said  he would declassify the JFK Files. He  did .\n    - President Donald Trump  said  he would end the EV mandate. He  did .\n    - President Donald Trump  said  he would have the backs of the brave men and women in law enforcement. He did just that by pardoning two Washington D.C. Police officers that were unjustly prosecuted. The Metropolitan Police Department  thanked  President Trump for the pardon.\n    - President Donald Trump  said  he would use the military to secure the border. The Pentagon is  deploying  troops to the border and the Coast Guard is  surging  assets to the Gulf of America.\n    - President Trump  said  we would drill, baby, drill. The President signed executive orders to  open  up offshore drilling and  allow  more energy exploration in Alaska.\n    - President Donald Trump  said  he would end the weaponization of government. He signed an  executive order  doing just that.\n    - President Donald Trump said he would pardon the J6 Hostages. He  did .\n    - President Donald Trump  said  he would end government censorship. On his first day in office, he signed an  executive order  restoring freedom of speech and ending government censorship.\n\nPresident Trump is being praised for his historic leadership:[The Steel Manufacturers Association](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=0b0e48209b&amp;e=121170ac34): “President Trump has repeatedly demonstrated his strong support for American steel workers. He reiterated that support on day one by directing his agencies to investigate unfair trade and its impact on domestic manufacturing.”[American Fuel &amp; Petrochemical Manufacturers President and CEO Chet Thompson](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=fee36d859f&amp;e=121170ac34)**:** “President Trump promised to end gas car bans and vehicle mandates on Day 1 of his new administration, and we are pleased to see that work already underway. Thank you, President Trump.”[American Petroleum Institute President and CEO Mike Sommers](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=334e9a3b68&amp;e=121170ac34)**:** “Americans sent a clear message at the ballot box, and President Trump is answering the call on Day 1. U.S. energy dominance will drive our nation’s economic and security agenda. This is a new day for American energy, and we applaud President Trump for moving swiftly to chart a new path where U.S. oil and natural gas are embraced, not restricted.”[Job Creators Network CEO Alfredo Ortiz](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=edfd9dbdc8&amp;e=121170ac34): “Trump’s two-fold approach of boosting oil and gas production and repealing the Biden administration’s green energy mandates will make American energy cheaper, reliable and more efficient.”[Mortgage Bankers Association President and CEO Bob Broeksmit](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=e6259da8c0&amp;e=121170ac34)**:** “President Trump campaigned on lowering costs for Americans, and we appreciate housing supply and affordability being included in an executive order on this issue. We support efforts to cut unnecessary regulatory red tape and to pursue federal housing program enhancements that make renting and homeownership more attainable and sustainable.”[Professional Trucking Association Group](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=ddf0a867a8&amp;e=121170ac34): “President Trump’s decision to freeze regulations and curtail bureaucratic overreach is commendable. This is precisely what America needs: reduced government interference and increased freedom for small trucking businesses and entrepreneurs to flourish.”[NetChoice CEO Steve DelBianco](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=8cb38b70d4&amp;e=121170ac34): “Upon returning to office, President Trump showed that America is ready to lead in tech and innovation again. By repealing Biden’s restrictive rules on energy production and AI development, the president is steering America to remain dominant in creating the best technology in the world.”[United Against Nuclear Iran Chairman Governor Jeb Bush and CEO Ambassador Mark Wallace](https://whitehouse.us10.list-manage.com/track/click?u=dace49741569f7585670378b3&amp;id=fb8c0d36a2&amp;e=121170ac34): “We applaud President Trump for his decision today to redesignate the Houthis as an FTO. UANI in its recommended action plan for the Trump administration’s first 100 days suggested that the president redesignate the Houthis as an FTO. This will now provide the U.S. government additional authorities to hold the Houthis accountable for their threats to international commerce and U.S. allies and partners.”\n",
  "summary": "President Donald Trump began his second term on January 24, 2025, with a series of decisive actions marked by multiple executive orders aiming to fulfill his campaign promises swiftly. These actions focus on securing the U.S. border, removing illegal immigrants, and promoting economic growth through new investments. Some of the significant announcements include securing historic investments in AI infrastructure and revitalizing the manufacturing sector.\n\nIn addition, President Trump initiated urgent measures to strengthen border security by arresting a number of illegal immigrants and deporting those with criminal backgrounds. In an effort to stimulate American energy production, he declared a National Energy Emergency, repealed numerous Biden-era environmental regulations, and recommenced offshore drilling operations. His administration also emphasized a return to traditional hiring practices within the federal government, nullifying various diversity, equity, and inclusion (DEI) initiatives.\n\nNumerous organizations have praised Trump's endeavors, recognizing his efforts to diminish bureaucratic overreach while boosting American industries. The Trump administration's bold initiatives represent a direct response to advocate a pro-American policy shift, withdrawing from international agreements like the Paris Climate Agreement and refocusing on national priorities.",
  "eli5": "President Trump, as soon as he started his second term in 2025, quickly made some big changes. He worked on making America safer and stronger by stopping illegal immigration and supporting American businesses. He also helped America use its own energy more and brought lots of new jobs.",
  "keywords": [
    "Donald Trump",
    "executive orders",
    "border security",
    "deportation",
    "American energy",
    "economic growth",
    "manufacturing",
    "investment",
    "environmental regulations"
  ],
  "issues": [
    "Accuracy of reporting and sources",
    "Political bias in the presentation",
    "Legal ramifications of executive actions",
    "Potential impacts on international relations"
  ],
  "citations": [],
  "document_type": "Presidential Action"
}