{
  "title": "The Iron Dome for America – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "The Iron Dome for America – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including my authority as Commander in Chief",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/the-iron-dome-for-america/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-28T03:46:44+00:00",
  "article:modified_time": "2025-01-28T15:17:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tThe Iron Dome for America\t\t\t\t\n\nJanuary 27, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including my authority as Commander in Chief of the Armed Forces of the United States, it is hereby ordered:Section 1.  Purpose.  The threat of attack by ballistic, hypersonic, and cruise missiles, and other advanced aerial attacks, remains the most catastrophic threat facing the United States.President Ronald Reagan endeavored to build an effective defense against nuclear attacks, and while this program resulted in many technological advances, it was canceled before its goal could be realized.  And since the United States withdrew from the Anti-Ballistic Missile Treaty in 2002 and initiated development of limited homeland missile defense, official United States homeland missile defense policy has remained only to stay ahead of rogue-nation threats and accidental or unauthorized missile launches.Over the past 40 years, rather than lessening, the threat from next-generation strategic weapons has become more intense and complex with the development by peer and near-peer adversaries of next-generation delivery systems and their own homeland integrated air and missile defense capabilities.Sec. 2.  Policy.  To further the goal of peace through strength, it is the policy of the United States that:      (a)  The United States will provide for the common defense of its citizens and the Nation by deploying and maintaining a next-generation missile defense shield;      (b)  The United States will deter — and defend its citizens and critical infrastructure against — any foreign aerial attack on the Homeland; and     (c)  The United States will guarantee its secure second-strike capability. Sec. 3.  Implementation.  Within 60 days of the date of this order, the Secretary of Defense shall:      (a)  Submit to the President a reference architecture, capabilities-based requirements, and an implementation plan for the next-generation missile defense shield.  The architecture shall include, at a minimum, plans for: (i)     Defense of the United States against ballistic, hypersonic, advanced cruise missiles, and other next-generation aerial attacks from peer, near-peer, and rogue adversaries; (ii)    Acceleration of the deployment of the Hypersonic and Ballistic Tracking Space Sensor layer;  (iii)   Development and deployment of proliferated space-based interceptors capable of boost-phase intercept;  (iv)    Deployment of underlayer and terminal-phase intercept capabilities postured to defeat a countervalue attack; (v)     Development and deployment of a custody layer of the Proliferated Warfighter Space Architecture;  (vi)    Development and deployment of capabilities to defeat missile attacks prior to launch and in the boost phase; (vii)   Development and deployment of a secure supply chain for all components with next-generation security and resilience features; and(viii)  Development and deployment of non-kinetic capabilities to augment the kinetic defeat of ballistic, hypersonic, advanced cruise missiles, and other next-generation aerial attacks;     (b)  Review relevant authorities and organization of the Department of Defense to develop and deploy capabilities at the necessary speed to implement this directive;     (c)  Jointly with the Director of the Office of Management and Budget, submit to the President a plan to fund this directive, allowing sufficient time for consideration by the President before finalization of the Fiscal Year 2026 Budget; and     (d)  In cooperation with United States Strategic Command and United States Northern Command, submit to the President: (i)   An updated assessment of the strategic missile threat to the Homeland; and(ii)  A prioritized set of locations to progressively defend against a countervalue attack by nuclear adversaries. Sec. 4.  Allied and Theater Missile Defense Review.  The United States continues to cooperate on missile defense with its allies and partners to aid in the defense of ally populations and troops and of forward-deployed United States troops.  Following the submission to the President of the next-generation missile defense reference architecture under section 3(a) of this order, the Secretary of Defense shall direct a review of theater missile defense posture and initiatives to identify ways in which the United States and its allies and partners can:      (a)  Increase bilateral and multilateral cooperation on missile defense technology development, capabilities, and operations;     (b)  Improve theater missile defenses of forward-deployed United States troops and allied territories, troops, and populations; and     (c)  Increase and accelerate the provision of United States missile defense capabilities to allies and partners.Sec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n    - the authority granted by law to an executive department or agency, or the head thereof; or\n    - the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n     (b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.     (c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    January 27, 2025.\n",
  "summary": "The document, issued by the President of the United States on January 27, 2025, outlines a directive to develop a next-generation missile defense shield to protect against advanced aerial attacks, including ballistic and hypersonic missiles. This effort aims to enhance national security by deploying cutting-edge defense systems and ensuring a secure second-strike capability. The order is a continuation of previous U.S. strategies to maintain military superiority and counter the growing threats posed by peer and near-peer adversaries.\n\nUnder this directive, the Secretary of Defense is tasked with developing a comprehensive plan, including a reference architecture and capabilities-based requirements, for the timely implementation of this defense shield. It emphasizes the importance of accelerating certain technological deployments and strengthening the supply chain's security and resilience. Moreover, the order calls for increased cooperation with allies and partners to improve theater missile defenses internationally, thereby ensuring the protection of allies’ populations and U.S. troops stationed abroad.\n\nThe order also mandates a review of the strategic missile threat to the homeland and identifies prioritized locations for defense deployment, ensuring a methodical approach to counter potential nuclear adversaries. The initiative aligns with the U.S. policy of 'peace through strength' and is subject to the availability of appropriations and existing laws.",
  "eli5": "The President wants to build a super shield to protect America from dangerous missiles. It will use powerful technology to stop bad missiles and help keep everyone safe. They're also asking for friends from other countries to help and keep their own soldiers safe too.",
  "keywords": [
    "missile defense",
    "national security",
    "aerial attacks",
    "U.S. defense policy",
    "allied cooperation",
    "military technology",
    "strategic threat",
    "peace through strength"
  ],
  "issues": [
    "Funding requirements and budget considerations",
    "International cooperation and potential diplomatic challenges",
    "Technological and logistical feasibility of proposed defenses",
    "Potential impact on global arms race dynamics"
  ],
  "citations": [
    "Constitution of the United States",
    "Anti-Ballistic Missile Treaty of 2002"
  ],
  "document_type": "Executive Order"
}