{
  "title": "The President and First Lady’s Message on National Read Across America Day, 2025 – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "The President and First Lady’s Message on National Read Across America Day, 2025",
  "og:description": "Today, we join students, parents, teachers, librarians, and Americans all across our country in commemorating National Read Across America Day—an occasion",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/03/the-president-and-first-ladys-message-on-national-read-across-america-day-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-02T23:41:36+00:00",
  "article:modified_time": "2025-03-02T23:41:37+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tThe President and First Lady’s Message on National Read Across America Day, 2025 \t\t\t\t\n\nMarch 2, 2025\n\nToday, we join students, parents, teachers, librarians, and Americans all across our country in commemorating National Read Across America Day—an occasion to celebrate the importance of reading and the unparalleled power of literacy.\n\nBooks have always been the bedrock of a great life and a great future.  The simple act of opening a new book expands our knowledge, transforms our minds, and inspires strong leaders and thoughtful citizens.  Whether we are turning through the pages of a book on ancient history, an adventure novel, or classic literature, books will always be the frontier of American imagination and the gateway to the American Dream.\n\nLiteracy is a critical component of personal growth, success, and leading lives of happiness and fulfillment, which is why we are fully committed to promoting reading and ensuring America’s children receive the outstanding education they deserve.  The White House has taken direct action through Executive Order to end indoctrination in our classrooms and by directing the Department of Education to empower parents across America to choose the school that best suits their children’s needs and values.\n\nOn National Read Across America Day, and every day, our Administration remains committed to instilling a profound love of reading in our youth and forming the next generation of patriotic leaders.  The next chapter of our Nation’s Golden Age begins with opening a new book—and harnessing the full potential of our youngest generation.\n",
  "summary": "**The President and First Lady acknowledged National Read Across America Day on March 2, 2025.** This day serves to highlight the importance of reading and literacy across the United States. The statement emphasized that books are central to personal growth and achieving the American Dream due to their ability to expand knowledge and foster leadership and citizenship. \n\nThe administration is focused on promoting literacy and ensuring children receive high-quality education, taking steps like issuing an Executive Order to eliminate indoctrination in schools. They've directed the Department of Education to support parental choice in schooling to align with individual values and needs. This commitment to literacy aims to cultivate a new generation of informed and patriotic citizens who contribute to what's termed the Nation's Golden Age.",
  "eli5": "**Reading books is very important because it helps us learn and imagine.** The President and First Lady say that everyone should celebrate National Read Across America Day to become better readers and thinkers.",
  "keywords": [
    "National Read Across America Day",
    "literacy",
    "education",
    "reading",
    "Department of Education",
    "American Dream",
    "Executive Order"
  ],
  "issues": [
    "Possible lack of focus on diverse literature genres.",
    "Details on the Executive Order and its specifics were not provided.",
    "Clarification on how 'indoctrination' is defined and addressed."
  ],
  "citations": [],
  "document_type": "Press Release"
}