{
  "title": "Trump Administration Stops Lowering Standards for Police, Firefighters – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Trump Administration Stops Lowering Standards for Police, Firefighters",
  "og:description": "President Donald J. Trump declared an end to lower standards in the name of discriminatory “diversity, equity, and inclusion” initiatives — and the Trump",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/trump-administration-stops-lowering-standards-for-police-firefighters/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-27T18:16:31+00:00",
  "article:modified_time": "2025-02-27T18:16:32+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tTrump Administration Stops Lowering Standards for Police, Firefighters\t\t\t\t\n\nFebruary 27, 2025\n\nPresident Donald J. Trump [declared](https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-and-wasteful-government-dei-programs-and-preferencing/)[an end](https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/) to lower standards in the name of discriminatory “diversity, equity, and inclusion” initiatives — and the Trump Administration continues to make good on that commitment to prioritize merit, not divisive race-based obsessions, in hiring.Yesterday, Attorney General Pam Bondi [announced](https://www.justice.gov/opa/pr/attorney-general-pam-bondi-dismisses-dei-lawsuits-involving-police-officers-and-firefighters) the Department of Justice (DOJ) dismissed several Biden-era lawsuits against police and fire departments who used race-neutral mechanisms — such as standard aptitude tests, physical exams, and credit checks — in their hiring processes, the result of which lowered standards and endangered public safety.\n    - DISMISSED:  United States v. City of Durham (North Carolina)        - The Biden DOJ  alleged  discrimination because entry-level firefighter applicants were required to pass a written exam. The city was required to provide compensation and preferential hiring to applicants who were not hired. \n    - DISMISSED:  United States v. Maryland State Police        - The Biden DOJ  alleged  discrimination because applicants were required to pass a written exam and basic physical exam. The agency was required to provide compensation and retroactive seniority to applicants who were not hired. \n    - DISMISSED:  United States v. Cobb County (Georgia)        - The Biden DOJ  alleged  discrimination because firefighter applicants were required to complete a written exam and credit check. The county was required to provide compensation and preferential hiring to applicants who were not hired. \n    - DISMISSED:  United States v. City of South Bend (Indiana)        - The Biden DOJ  alleged  discrimination because police applicants were required to pass a written exam and basic physical exam. \n\nAmericans deserve the best of the best keeping them safe — and in the Trump Administration, anything less is unacceptable.\n",
  "summary": "The Trump Administration has officially ended initiatives that lower standards in hiring for police and firefighter positions, which were implemented under a previous government focus on diversity, equity, and inclusion. On February 27, 2025, President Trump confirmed the commitment to prioritize merit-based hiring practices across the board. The decision aligns with an overall policy to emphasize qualifications over racial or diversity considerations.\n\nAttorney General Pam Bondi recently announced that the Department of Justice has dismissed a series of lawsuits initiated during the Biden Administration. These lawsuits involved claims of discrimination against various city and state departments, which had implemented race-neutral hiring practices such as aptitude tests, physical exams, and credit checks. Some notable cases dismissed include those against the City of Durham, Maryland State Police, Cobb County, and the City of South Bend, due to the perceived impact on public safety standards.\n\nThis move is intended to ensure that only the most capable individuals, regardless of background, are hired to safeguard public safety, adhering strictly to merit-based evaluations in these crucial public service roles.",
  "eli5": "The Trump Administration stopped rules that made it easier for lower-qualified people to become police or firefighters, aiming instead to make sure only the best and most qualified people get those important jobs.",
  "keywords": [
    "Trump Administration",
    "merit-based hiring",
    "police",
    "firefighters",
    "diversity",
    "equity",
    "inclusion",
    "lawsuits",
    "Department of Justice"
  ],
  "issues": [
    "Potential backlash from advocates of diversity and inclusion",
    "Impact on diversity within police and firefighter departments",
    "Public perception of merit vs. inclusion in public service roles"
  ],
  "citations": [
    "https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-and-wasteful-government-dei-programs-and-preferencing/",
    "https://www.justice.gov/opa/pr/attorney-general-pam-bondi-dismisses-dei-lawsuits-involving-police-officers-and-firefighters"
  ],
  "document_type": "Press Release"
}