{
  "title": "Unleashing Prosperity Through Deregulation – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Unleashing Prosperity Through Deregulation – The White House",
  "og:description": "UNLEASHING PROSPERITY THROUGH DEREGULATION By the authority vested in me as President by the Constitution and the laws of the United States of America,",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-prosperity-through-deregulation/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-31T05:19:02+00:00",
  "article:modified_time": "2025-02-05T05:19:14+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tUNLEASHING PROSPERITY THROUGH DEREGULATION\t\t\t\t\n\nJanuary 31, 2025\n\nUNLEASHING PROSPERITY THROUGH DEREGULATION\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the Budget and Accounting Act of 1921, as amended (31 U.S.C. 1101 *et seq*.), and in order to promote prudent financial management and alleviate unnecessary regulatory burdens, it is hereby ordered: \n\nSection 1.  Purpose.  The ever-expanding morass of complicated Federal regulation imposes massive costs on the lives of millions of Americans, creates a substantial restraint on our economic growth and ability to build and innovate, and hampers our global competitiveness.  Despite the magnitude of their impact, these measures are often difficult for the average person or business to understand, as they require synthesizing the collective meaning not just of formal regulations but also rules, memoranda, administrative orders, guidance documents, policy statements, and interagency agreements that are not subject to the Administrative Procedure Act, further increasing compliance costs and the risk of costs of non-compliance.  It is the policy of my Administration to significantly reduce the private expenditures required to comply with Federal regulations to secure America’s economic prosperity and national security and the highest possible quality of life for each citizen.  To that end, it is important that for each new regulation issued, at least 10 prior regulations be identified for elimination.  This practice is to ensure that the cost of planned regulations is responsibly managed and controlled through a rigorous regulatory budgeting process.\n\nSec. 2.  Policy.  It is the policy of the executive branch to be prudent and financially responsible in the expenditure of funds, from both public and private sources, and to alleviate unnecessary regulatory burdens placed on the American people. \n\nSec. 3.  Regulatory Cap for Fiscal Year 2025.  (a)  Unless prohibited by law, whenever an executive department or agency (agency) publicly proposes for notice and comment or otherwise promulgates a new regulation, it shall identify at least 10 existing regulations to be repealed.\n\n(b)  For fiscal year 2025, which is in progress, the heads of all agencies are directed to ensure that the total incremental cost of all new regulations, including repealed regulations, being finalized this year, shall be significantly less than zero, as determined by the Director of the Office of Management and Budget (Director), unless otherwise required by law or instructions from the Director.\n\n(c)  In furtherance of the requirement of subsection (a) of this section, any new incremental costs associated with new regulations shall, to the extent permitted by law, be offset by the elimination of existing costs associated with at least 10 prior regulations.\n\n(d)  The Director shall provide the heads of agencies with guidance on the implementation of this section.  Such guidance shall address, among other things, processes for standardizing the measurement and estimation of regulatory costs; standards for determining what qualifies as new and offsetting regulations; standards for determining the costs of existing regulations that are considered for elimination; processes for accounting for costs in different fiscal years; methods to oversee the issuance of rules with costs offset by savings at different times or different agencies; and emergencies and other circumstances that might justify individual waivers of the requirements of this section.  The Director shall consider phasing in and updating these requirements.\n\nSec. 4.  Annual Regulatory Cost Submissions to the Office of Management and Budget.  Beginning with the Regulatory Plans, as required under Executive Order 12866 of September 30, 1993 (Regulatory Planning and Review), as amended, or any successor order for fiscal year 2026, and for each fiscal year thereafter:\n\n(a)  The head of each agency shall identify on an aggregated basis, for regulations that increase incremental cost, the offsetting regulations described in section 3(c) of this order, and provide the agency’s best approximation of the total costs or savings associated with each new regulation or repealed regulation.\n\n(b)  Each regulation approved by the Director during the Presidential budget process shall be included in the Unified Regulatory Agenda required under Executive Order 12866, as amended, or any successor order.  Unless otherwise required by law, no regulation shall be added to or removed from the Unified Regulatory Agenda without the approval of the Director.  To accomplish the purposes of this order, the Director may also require additions to the Unified Regulatory Agenda and Regulatory Plan.\n\n(c)  Unless otherwise required by law, no regulation shall be issued by an agency if it was not included in the most recent version or update of the published Unified Regulatory Agenda as required under Executive Order 12866, as amended, or any successor order, unless the issuance of such regulation was approved in advance in writing by the Director.\n\n(d)  During the Presidential budget process, the Director shall identify to agencies a total amount of incremental costs that will be allowed for each agency in issuing new regulations and repealing regulations for each fiscal year after fiscal year 2025.  No regulations exceeding the agency’s total incremental cost allowance will be permitted in that fiscal year, unless required by law or approved in writing by the Director.  The total incremental cost allowance may allow an increase or require a reduction in total regulatory cost.\n\n(e)  The Director shall provide the heads of agencies with guidance on the implementation of the requirements in this section.\n\nSec. 5.  Definition.  For purposes of this order, the term “regulation” or “rule” means an agency statement of general or particular applicability and future effect designed to implement, interpret, or prescribe law or policy or to describe the procedure or practice requirements of an agency, including, without limitation, regulations, rules, memoranda, administrative orders, guidance documents, policy statements, and interagency agreements, regardless of whether the same were enacted through the processes in the Administrative Procedure Act, but does not include:\n\n(a)  regulations issued with respect to a military, national security, homeland security, foreign affairs, or immigration-related function of the United States;\n\n(b)  regulations related to agency organization, management, or personnel; or\n\n(c)  any other specific regulation or category of regulations exempted by the Director, who shall exempt those regulations or categories of regulations that impose minimal costs or burdens on the private sector or that are requested to be exempted by the Assistant to the President and Chief of Staff or the Assistant to the President and Deputy Chief of Staff for Policy.\n\nSec. 6.  Implementation.  (a)  The Director is charged with implementing this order, including by providing agencies with updated guidance on implementing the ten-for-one rule described in section 3(a) of this order, including processes for identifying regulations for elimination, determining what constitutes, generally and specifically, a “rule” or “regulation” for purposes of this order, estimating and standardizing regulatory costs, and ensuring compliance with the Administrative Procedure Act and other applicable laws.  \n\n(b)  The Director shall revoke OMB Circular No. A-4 of November 9, 2023 (Regulatory Analysis), and all accompanying appendices, guidelines, and documents, and shall reinstate the prior version of Circular A-4, issued on September 17, 2003; and \n\n(c)  The Secretary of the Treasury and the Director shall reinstate the Memorandum of Agreement between the Department of the Treasury and the Office of Management and Budget of April 11, 2018, regarding review of tax regulations under Executive Order 12866.\n\nSec. 7.  Severability.  If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.\n\nSec. 8.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:  \n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or \n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.  \n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.  \n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.  \n\nTHE WHITE HOUSE,\n\n    January 31, 2025.\n",
  "summary": "On January 31, 2025, an executive order was issued by the President of the United States aimed at reducing regulatory burdens and promoting economic prosperity. The order outlines a strategy where for every new regulation implemented, at least ten existing ones must be identified for removal. This policy is intended to simplify federal regulations that often impose significant costs and barriers to economic growth and innovation.\n\nTo ensure financial and regulatory prudence, agencies are directed to manage their regulatory budgets by minimizing the incremental costs associated with new regulations. The Director of the Office of Management and Budget is tasked with providing guidance on measuring regulatory costs, as well as overseeing the implementation and compliance of the regulation cap and incremental cost reduction strategies.\n\nThe order exempts regulations related to national security, military, and immigration functions, among others. The regulatory cap for fiscal year 2025 mandates that the total incremental cost of new and repealed regulations should be significantly less than zero. This is to promote transparency and ensure that regulations are in alignment with executive and legislative priorities.",
  "eli5": "The President wants to make it easier for people and businesses by getting rid of old rules every time a new one is made. So, for every new rule, ten old ones have to go away.",
  "keywords": [
    "deregulation",
    "economic prosperity",
    "federal regulations",
    "regulatory budget",
    "OMB",
    "incremental cost"
  ],
  "issues": [
    "Potential challenges identifying ten existing regulations for removal for each new one.",
    "Impact on industries and sectors reliant on existing regulations.",
    "Ensuring regulations related to essential services like national security are not negatively affected."
  ],
  "citations": [
    "Budget and Accounting Act of 1921",
    "31 U.S.C. 1101 et seq.",
    "Executive Order 12866"
  ],
  "document_type": "Executive Order"
}