{
  "title": "Second Lady Usha Vance\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Second Lady Usha Vance",
  "og:description": "Second Lady Usha Vance is the proud wife of Vice President JD Vance and the mother of their three beautiful children, Ewan, Vivek, and Mirabel.",
  "og:url": "https://www.whitehouse.gov/administration/usha-vance/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-01-21T20:36:07+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Administration](https://www.whitehouse.gov/administration/)\n\n# \t\t\t\t\tUsha Vance\t\t\t\t\n\nSecond Lady of the United States\n\nUsha Vance is the proud wife of Vice President JD Vance and the mother of their three beautiful children, Ewan, Vivek, and Mirabel.\n\nA native of San Diego, California, Ms. Vance is an experienced litigator whose work involved complex civil litigation and appeals in a wide variety of industries. Ms. Vance also clerked for Chief Justice John G. Roberts, Jr. of the U.S. Supreme Court and Judge Brett Kavanaugh, then of the U.S. Court of Appeals for the District of Columbia Circuit. Prior to that, Ms. Vance clerked for Judge Amul Thapar, then of the U.S. District Court for the Eastern District of Kentucky.\n\nThough Usha and JD met while attending Yale Law School, Usha also earned her bachelor’s degree from Yale University and a master’s degree from the University of Cambridge, where she was a Gates Cambridge Scholar.\n\nIn her free time, Ms. Vance is a trustee of the Washington National Opera and has served on the board of the Gates Cambridge Alumni Association and as secretary of the board of the Cincinnati Symphony Orchestra.\n\n[Learn more about Vice President JD Vance here.](https://www.whitehouse.gov/the-administration/jd-vance/)\n",
  "summary": "Usha Vance serves as the Second Lady of the United States. She is married to Vice President JD Vance and they have three children together. Usha, originally from San Diego, California, is a seasoned attorney experienced in complex civil litigation and appeals across various sectors. Her legal career is distinguished by her clerkships with prominent judicial figures, including Chief Justice John G. Roberts, Jr. of the U.S. Supreme Court, Judge Brett Kavanaugh of the U.S. Court of Appeals for the District of Columbia Circuit, and Judge Amul Thapar of the Eastern District of Kentucky.\n\nMs. Vance is an alumna of Yale University, where she also met JD during their law school years, and she holds a master's degree from the University of Cambridge as a Gates Cambridge Scholar. Beyond her professional commitments, Usha actively participates in cultural and educational organizations, serving as a trustee of the Washington National Opera and holding board positions with the Gates Cambridge Alumni Association and the Cincinnati Symphony Orchestra.",
  "eli5": "Usha Vance is a lawyer and the wife of the Vice President. She helps out with important things like opera and loves spending time with her family.",
  "keywords": [
    "Usha Vance",
    "Second Lady",
    "JD Vance",
    "White House",
    "litigation",
    "Yale Law School",
    "Gates Cambridge Scholar",
    "Washington National Opera"
  ],
  "issues": [
    "Accuracy of the roles and affiliations mentioned, specifically within the White House context.",
    "Verification of her exact contributions within the organizations she is a trustee or board member."
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}