{
  "title": "Visit The White House – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Visit The White House",
  "og:description": "Learn how to reserve your White House tour, including steps for booking, requirements, and essential information for a smooth visit.",
  "og:url": "https://www.whitehouse.gov/visit/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:modified_time": "2025-02-12T16:03:51+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/47106599342_693ae9dacb_o.jpg",
  "og:image:width": "2000",
  "og:image:height": "1333",
  "og:image:type": "image/jpeg",
  "markdown": "# \t\t\t\t\tVisit The White House\t\t\t\t\n\nPresident Donald J. Trump and First Lady Melania Trump are delighted to welcome you to tour the White House. Tours can be requested via your Member of Congress (U.S. Representative or U.S. Senator).\n\nYou may reach your Member of Congress through the United States Capitol Switchboard at 202-224-3121 (TTY: 202-225-1904), or online at [www.congress.gov/members](http://www.congress.gov/members).\n\nIf you are a citizen of a foreign country, please contact your country’s embassy in Washington, D.C. \n\n[Book a Tour](https://www.congress.gov/members)\n\n#### Reserve Your Tour\n\n    - White House tour requests should be made through your Member of Congress, which may be submitted 7 – 90 days in advance of the requested tour date.\n    - Tours are generally available 7:30 a.m. to 11:30 a.m. Tuesday through Thursday as well as 7:30 a.m. to 1:30 p.m. Friday through Saturday (excluding Federal holidays or unless otherwise noted). When possible, public tour hours will be extended based on the official White House schedule.\n    - All White House tours are free of charge.\n    - Tour schedules may change at any time, with little notice, due to inclement weather or scheduling conflicts, even after your tour is confirmed.\n\n#### What is included on the White House tour?\n\nTours of the White House include the public rooms in the East Wing and the Residence, which include the Vermeil Room, the Library, the China Room, the Blue Room, Red Room, Green Room, the State Dining Room, and a view of the White House Kennedy Garden. Secret Service Officers are stationed along the tour route and are available to answer questions about each room’s history, art, furnishings, current uses, and beyond.\n\n#### Find Out More\n\n[FAQs](/visit/faqs)\n",
  "summary": "The White House offers guided tours to the public, facilitated by Members of Congress. These tours are available at specific times during the week and on weekends, though they exclude federal holidays. Reservations must be made through a Member of Congress and can be arranged from 7 to 90 days in advance. While tours are free, schedules are subject to change due to unforeseen circumstances such as weather or scheduling conflicts.\n\nThe tours cover several public spaces within the White House, such as the East Wing, the Vermeil Room, and the State Dining Room. Visitors can also view the Kennedy Garden and are accompanied by Secret Service Officers who can provide historical insights. Citizens of other countries should contact their respective embassies for arrangements.\n\nFurther information and tour schedules can be accessed via the Member of Congress or the provided online resources. For additional questions, visitors are directed to consult the FAQs section on the White House's website.",
  "eli5": "You can visit the White House for free! You ask a special person in the government to help you book a tour, which shows you cool rooms like the library and the dining room. Friendly officers are there to help answer your questions.",
  "keywords": [
    "White House Tours",
    "Reservations",
    "Tour Schedule",
    "Public Rooms",
    "Secret Service",
    "Members of Congress"
  ],
  "issues": [
    "No direct information about limitations or accessibility for people with disabilities.",
    "Unclear on how foreign nationals can arrange a tour without a specified contact procedure."
  ],
  "citations": [
    "Contact details via uscapitol.gov",
    "www.congress.gov/members for Member of Congress information"
  ],
  "document_type": "Fact Sheet"
}