{
  "title": "When There Are No Illegal Immigrants, There Is No Need for Shelters – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "When There Are No Illegal Immigrants, There Is No Need for Shelters",
  "og:description": "Two years ago, U.S. Border Patrol agents encountered 1,500 illegal immigrants every day in the El Paso sector alone — now, they’re seeing roughly 80 per",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/when-there-are-no-illegal-immigrants-theres-no-need-for-shelters/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-21T20:19:00+00:00",
  "article:modified_time": "2025-02-21T20:30:37+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tWhen There Are No Illegal Immigrants, There Is No Need for Shelters\t\t\t\t\n\nFebruary 21, 2025\n\nTwo years ago, U.S. Border Patrol agents encountered 1,500 illegal immigrants every day in the El Paso sector alone — now, they’re [seeing](https://www.borderreport.com/hot-topics/border-report-live/border-report-live-where-are-the-migrants/) roughly 80 per day amid President Donald J. Trump’s unprecedented effort to secure the homeland.\n\nNow, organizations that once facilitated the invasion of illegal immigrants are finding out that sheltering them is no longer necessary: **“It’s because migrants are not coming across the border right now,”**[one local reporter said](https://x.com/RapidResponse47/status/1892981316464873632).\n    - Catholic Charities  says  they see only “zero to three families” at their McAllen, Texas, shelter and cut staff in Dallas due to the lack of need.\n    - A Brownsville, Texas, facility  shut its doors  due to the “sudden decrease in asylum seekers” over the past month.\n    - A migrant shelter network in El Paso, Texas,  says  just one or two of its 20 shelters will remain open.\n    - Pima County, Arizona,  shut down  two migrant shelters due to the lack of demand in the aftermath of President Trump’s inauguration.\n    - In San Diego, California, a shelter “has not  had a single migrant  walk through its doors since President Trump took office” and has since closed altogether.\n    - In New York City, a network of shelters that once housed thousands of illegal immigrants have been  closed .\n    - In northern Mexico, local news  reports  the flow of illegal immigrants seeking to enter the United States has “decreased enormously” — with facilities that once held thousands of illegals now seeing  just a tiny fraction .\n",
  "summary": "In February 2025, reports indicate a drastic reduction in illegal immigrant encounters at the U.S. border, particularly in the El Paso sector. This change, attributed to President Donald J. Trump's security measures, has resulted in a significant decrease in the need for migrant shelters across several key locations in the United States, including Texas, Arizona, California, and New York. The decline in illegal crossings has led numerous organizations to either reduce their operations or shut down shelters.\n\nLocal shelters that previously provided refuge to thousands of migrants have seen drastically reduced numbers, compelling them to adjust their operations accordingly. In some areas, such as McAllen and Brownsville in Texas and Pima County in Arizona, shelters are closing due to minimal demand. Reports from northern Mexico also corroborate the reduced flow of migrants attempting to cross into the United States, further affirming the impact of the administration's policies on border security.\n\nThe overall decrease in illegal immigrant numbers reflects the administration’s successful efforts to curtail illegal entry into the country. This has left many facilities, which used to be active in accommodating immigrants, devoid of occupants, leading to closures and layoffs of staff. This state of affairs highlights the significant shifts in immigration patterns and policy effects post-2023 under Trump's presidency.",
  "eli5": "Since President Trump worked hard to stop people from entering the U.S. without permission, places that once gave them a place to stay don't need to be open anymore because very few people are coming.",
  "keywords": [
    "Illegal immigration",
    "Migrant shelters",
    "Border Patrol",
    "Trump administration",
    "Border security",
    "El Paso",
    "Shelter closures"
  ],
  "issues": [
    "The accuracy and objectivity of claims about the effectiveness of border security measures.",
    "The impact of shelter closures on communities and any remaining migrants.",
    "Potential humanitarian concerns."
  ],
  "citations": [],
  "document_type": "Press Release"
}