{
  "title": "White House Office of Management and Budget Announces Incoming Senior Appointees – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "White House Office of Management and Budget Announces Incoming Senior Appointees",
  "og:description": "Washington, D.C. — The Office of Management and Budget (OMB) today announced the addition of several senior appointees who will play critical roles in",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/02/white-house-office-of-management-and-budget-announces-incoming-senior-appointees/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-21T18:12:00+00:00",
  "article:modified_time": "2025-02-27T14:08:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tWhite House Office of Management and Budget Announces Incoming Senior Appointees\t\t\t\t\n\nFebruary 21, 2025\n\n**Washington, D.C.** — The Office of Management and Budget (OMB) today announced the addition of several senior appointees who will play critical roles in advancing the Administration’s priorities. They will reinforce OMB’s mission to serve as the nerve center of federal policy, management, and budget oversight as well as end the fraud, abuse, and weaponization of the federal government and its resources against the American people.\n\nThe following individuals have joined the Office of Management and Budget:\n\n**Stephen Billy – Senior Advisor**\n\nStephen Billy most recently served as Vice President of State Affairs for Susan B. Anthony Pro-life America. During the first Trump Administration, he served in the Office of Personnel Management (OPM), the Department of Commerce, and the OMB, where he drove accountability and oversight of the federal bureaucracy. Billy has also served as Executive Director of the Charlotte Lozier Institute and as Chief of Staff for former Congressman Pittenger.\n\n**Mark Calabria – Associate Director for Treasury, Housing, Commerce**\n\nDr. Mark A. Calabria formerly served as Director of the Federal Housing Finance Agency (FHFA) where he led the agency’s response to COVID and laid the groundwork for a removal of Fannie Mae and Freddie Mac from government conservatorship. As Director, Calabria also revitalized FHFA as a prudential regulator, establishing the agency’s new Research, Accounting Policy, and Resolution Divisions.  Prior to leading FHFA in the first Trump Administration, he served at the White House as Chief Economist to the Vice President. In addition, Calabria previously worked as a senior aide to the United States Senate Committee on Banking, Housing and Urban Affairs and served as the Deputy Assistant Secretary for Regulatory Affairs in the Office of Housing at the U.S. Department of Housing and Urban Development, where he supervised HUD’s regulation of the mortgage and real estate market. He was most recently a Senior Advisor to the Cato Institute.\n\n**Brian J. Cavanaugh – Associate Director for Homeland Security**\n\nBrian Cavanaugh most recently served as Senior Vice President at American Global Strategies (AGS). Prior to that, he served as Senior Director for Resilience on the National Security Council (NSC) during the first Trump administration, where he led efforts to strengthen U.S. preparedness against strategic threats, including cybersecurity, infrastructure vulnerabilities, and foreign adversary threats. Brian also held key roles at the Department of Homeland Security (DHS), including Executive Director for Strategic Planning and Integration, where he oversaw department-wide crisis response initiatives, health security operations, and technical hazard preparedness. He has published extensively on addressing challenges posed by foreign adversaries, including China’s economic influence and drone threats.\n\n**Anne DeCesaro –  Associate Director for Education, Income Maintenance, and Labor**\n\nAnne DeCesaro previously served as the Education Policy Director for the Senate Health, Education, Labor, and Pensions Committee. She has also served as the Republican Policy Director for the House Select Committee on Economic Disparity and Fairness in growth, the Chief of Staff for Food, Nutrition, and Consumer Services at the Department of Agriculture, and the Republican Staff Director for the Worker and Family Support Subcommittee of the Committee on Ways and Means. Anne also worked on the House Agriculture Committee, at the OMB, and at the Social Security Administration. She received her Bachelor’s degree from Saint Mary’s College and here master’s degree from The Johns Hopkins University.\n\n**Don Dempsey – Associate Director for Health**\n\nDon Dempsey most recently served as the Vice President of Policy and Research at the Better Medicare Alliance.  Prior to that, that he was a Managing Director at the Marwood Group, overseeing their Washington, D.C. office.  He was previously the Vice President for Policy and Regulatory Affairs at CVS health, a Government Affairs Counselor at K&amp;L Gates, a Senior Vice President with the Marwood Group, and worked for Breakaway Policy Strategies.  Dempsey served as the Associate Director for Human Resources Programs at OMB during the George W. Bush Administration, where he had direct responsibility for Medicare and Medicaid programs, the National Institutes of Health, the Food and Drug Administration, Social Security, federal funding for the Education and Labor Departments, and many other programs.  Prior to that, he was the Legislative Director for Senator Richard Burr, Director of Health Policy for the Senate Budget Committee and a Legislative Assistant for Senators Jon Kyl and Phil Gramm. \n\n**Amaryllis Fox Kennedy – Associate Director for Intelligence and International Affairs**\n\nAmaryllis Fox Kennedy joined the CIA following 9/11, serving as an Operations Officer in the Clandestine Service where she focused on nuclear nonproliferation, Islamic terror networks, money laundering, and illicit arms markets. She also served two years in the Directorate of Intelligence as an East Asia analyst, writing on issues of counterterrorism and military readiness for the President’s Daily Brief and the Senior Executive Intelligence Brief. She was the recipient of three CIA exceptional performance awards.  Afterwards, Kennedy founded a Natural Language Processing platform in Silicon Valley and served as Head of Product for Consumer Commerce at Twitter, now X. Both roles were focused on the application of NLP and Large Language Models to derive meaning from user-generated content in the early days of AI. Kennedy is a NYT-bestselling author and has produced numerous documentaries on subjects of global security. She was appointed to the President’s Intelligence Advisory Board.\n\n**Daniel Kowalski – Executive Associate Director**\n\nDan Kowalski most recently served as a Senior Fellow at the Center for Renewing America. Prior, he was a Special Advisor to the Secretary of Finance to Governor Glenn Youngkin of Virginia, where he advised on budget and tax matters. In the first Trump Administration, he was Counselor to the Secretary at the U.S. Treasury Department, where he advised Secretary Steven Mnuchin regarding Treasury’s efforts to drive the Trump Administration’s domestic policy agenda. Kowalski has also worked on Capitol Hill as Deputy Staff Director of the Republican Senate Budget Committee and as Director of Budget Review for the Republican House Budget Committee.\n\n**Stuart Levenbach – Associate Director for Natural Resources, Energy, Science, and Water**\n\nPrior to OMB, Dr. Stuart Levenbach was the Director for Government Affairs and Public Policy for the Americas region at the energy technology company, Baker Hughes. In the first Trump Administration, he served as a Senior Advisor in both the National Economic Council and the Council on Environmental Quality and also as the Chief of Staff for the National Oceanic and Atmospheric Administration. Stuart previously worked at OMB for 10 years as both a Program Examiner in the Resource Management Office Commerce Branch and a Senior Policy Analyst in the Office of Information and Regulatory Affairs Natural Resources and Environment Branch. He was a volunteer forester in the U.S. Peace Corps and holds a Ph.D. in marine ecology from the University of California, Santa Barbara.\n\n**Michael Stumo – Associate Director for Economic Policy and the Made in America Office**\n\nMichael Stumo most recently served as the longtime CEO of the Coalition for a Prosperous America, the leading national organization representing exclusively domestic producers and workers across many industries and sectors of the U.S. economy. He is a leading policy expert on trade, tax, manufacturing, industrial policy, currency, and agricultural issues, and has worked closely with a wide range of policymakers, legislators, regulators, and advocacy organizations to advance strategic trade, tax, and growth policies for the benefit of U.S. domestic producers and workers. He previously served as General Counsel for the Organization for Competitive Markets, focusing on agriculture and antitrust issues. Prior to that, he was a lawyer and litigator at Brignole, Bush and Lewis in Hartford, CT, and Domina Law in Omaha, NE.\n\n**Katharine Sullivan – Associate Director for Justice and Transportation**\n\nKatharine Sullivan served in the previous Trump Administration as the Principal Deputy Assistant Attorney General at the Department of Justice Office of Justice Programs and as the Acting Director of the Office of Violence Against Women.  She previously served for over 11 years as a Colorado state trial court judge.  She earned her J.D. from George Washington University School of Law and her B.A. from Syracuse University.\n\n**Thomas Williams – Associate Director for Defense**\n\nDr. Tom Williams most recently worked as a business development executive at Cape, a secure mobile telecom provider. Prior to that, he worked as a federal sales executive for Astra Space Operations, a provider of launch services and spacecraft propulsion. In the first Trump Administration, Tom performed the duties of Under Secretary and Deputy Under Secretary of Defense for Policy in the Office of the Secretary of Defense. He also served on the NSC as Deputy Assistant to the President and Senior Director for European and Russian Affairs, as well as Acting Senior Director for Defense Policy and Strategy. Prior to his government service, he worked at the Center for Naval Analyses’ Strategic Initiatives Group, as a Visiting Assistant Professor of Politics at Washington and Lee University, as a James Hart Fellow at Johns Hopkins University, as a Research Assistant at the Center for Strategic and International Studies, and at The Cohen Group.\n",
  "summary": "**Washington, D.C., February 21, 2025** – The White House Office of Management and Budget (OMB) has announced the appointment of several senior officials to support the Administration’s goals. These appointments aim to bolster the OMB’s mission of being the central hub for federal policy, management, and budget oversight. Their roles will also focus on curbing fraud, government abuse, and misuse of federal resources against citizens. \n\nThe new appointees are diverse in their backgrounds and expertise, bringing experience from previous federal roles and the private sector. Notable appointments include Stephen Billy as Senior Advisor, who has extensive experience in accountability and oversight, and Mark Calabria as Associate Director for Treasury, Housing, and Commerce, recognized for his leadership at the Federal Housing Finance Agency. Other appointees cover a wide array of fields, such as Health, Homeland Security, and Education, bringing skills from both public service and strategic advisory roles in the private sector.",
  "eli5": "**The White House gave important new jobs to several people** to help deal with money and rules for the U.S. government. They are supposed to help make sure everything is fair and stop people from doing bad things with the government’s money.",
  "issues": [
    "Details on how the appointees' past experiences align with their new roles are limited.",
    "There is no mention of potential conflicts of interest with past private sector roles.",
    "The announcement lacks details about specific plans or initiatives that these appointments will prioritize."
  ],
  "citations": [],
  "keywords": [
    "White House",
    "Office of Management and Budget",
    "Senior Appointees",
    "Federal Policy",
    "Budget Oversight",
    "Government Administration"
  ],
  "document_type": "Press Release"
}