{
  "title": "White House Statement on Agreement Extension Between Lebanon and Israel – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "White House Statement on Agreement Extension Between Lebanon and Israel – The White House",
  "og:description": "The arrangement between Lebanon and Israel, monitored by the United States, will continue to be in effect until February 18, 2025. The Government of",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/white-house-statement-on-agreement-extension-between-lebanon-and-israel/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-26T21:56:21+00:00",
  "article:modified_time": "2025-01-26T21:56:22+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tWhite House Statement on Agreement Extension Between Lebanon and Israel\n\nJanuary 26, 2025\n\nThe arrangement between Lebanon and Israel, monitored by the United States, will continue to be in effect until February 18, 2025.The Government of Lebanon, the Government of Israel, and the Government of the United States will also begin negotiations for the return of Lebanese prisoners captured after October 7, 2023.\n",
  "summary": "The United States announced that the agreement between Lebanon and Israel, which it monitors, will be extended and remain in effect until February 18, 2025. This extension reflects continued cooperation among the governments of Lebanon, Israel, and the United States. The arrangement aims at fostering regional stability and peace between the two countries. \n\nFurthermore, negotiations will commence, involving the Lebanese, Israeli, and U.S. governments, concerning the return of Lebanese prisoners who were captured after October 7, 2023. These discussions are expected to facilitate diplomatic engagement and potentially address broader issues of concern between the involved nations.",
  "eli5": "The U.S., Lebanon, and Israel have agreed to keep working together until February 2025. They are also planning to talk about sending people back home who were taken during fights.",
  "keywords": [
    "Lebanon",
    "Israel",
    "United States",
    "agreement extension",
    "prisoner negotiations",
    "regional stability"
  ],
  "issues": [
    "Details on the terms of the agreement extension are not provided.",
    "Clarification on the number and status of Lebanese prisoners to be negotiated.",
    "Potential impacts of the negotiation process on regional relations."
  ],
  "citations": [],
  "document_type": "Press Release"
}