{
  "title": "White House Statement on Hostage Release – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "White House Statement on Hostage Release – The White House",
  "og:description": "“Today the world celebrates as President Trump secured the release of four more Israeli hostages who were, for far too long, held against their will by",
  "og:url": "https://www.whitehouse.gov/briefings-statements/2025/01/white-house-statement-on-hostage-release/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-25T15:54:02+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Briefings &amp; Statements](https://www.whitehouse.gov/briefings-statements/)\n\n# \t\t\t\t\tWhite House Statement on Hostage Release\t\t\t\t\n\nJanuary 25, 2025\n\n“Today the world celebrates as President Trump secured the release of four more Israeli hostages who were, for far too long, held against their will by Hamas in horrific conditions. The United States will continue with its great partner Israel to push for the release of all remaining hostages and the pursuit of peace throughout the region.”\n",
  "summary": "In a significant diplomatic achievement, the White House announced on January 25, 2025, that President Trump successfully facilitated the release of four Israeli hostages held by Hamas. These individuals had been subjected to harsh conditions during their captivity. The President's action reflects a continued commitment by the United States to support Israel and pursue peace in the tumultuous region. \n\nThe statement highlights the strong bilateral partnership between the United States and Israel, emphasizing their joint efforts in negotiating the release of all hostages. The release is presented as part of broader peace efforts in the Middle East, with the United States pledging continued support to Israel. This development underscores ongoing diplomatic initiatives and reflects the administration's dedication to resolving such critical humanitarian issues.",
  "eli5": "President Trump helped free four people from a bad group called Hamas who were keeping them in tough places. The U.S. and Israel are working together to help more people and make the region peaceful.",
  "keywords": [
    "White House",
    "hostage release",
    "President Trump",
    "Hamas",
    "Israel",
    "peace",
    "Middle East",
    "diplomacy"
  ],
  "issues": [
    "Details about the negotiation process were not provided.",
    "The statement does not explain why these hostages were specifically released over others.",
    "Long-term implications for regional peace and stability are not discussed."
  ],
  "citations": [],
  "document_type": "Press Release"
}