{
  "title": "Wins Come All Day Under President Donald J. Trump – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Wins Come All Day Under President Donald J. Trump",
  "og:description": "It was another week filled with endless wins for the American people under President Donald J. Trump. Here are only a few of the many victories from the",
  "og:url": "https://www.whitehouse.gov/articles/2025/02/wins-come-all-day-under-president-trump/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-14T22:33:52+00:00",
  "article:modified_time": "2025-02-14T23:01:48+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tWins Come All Day Under President Donald J. Trump\t\t\t\t\n\nFebruary 14, 2025\n\nIt was another week filled with endless wins for the American people under President Donald J. Trump.\n\n**Here are only a few of the many victories from the past week:**\n    - President Trump brought home an  American citizen  wrongfully detained in Russia and  another American  detained in Belarus — the tenth and eleventh hostages freed since he took office.       - Michael McFaul, U.S. Ambassador to Russia under President Obama, reacted to Marc Fogel’s release and  said : “Hallelujah! Fantastic news! Praise be to President Donald Trump … This is just fantastic news for anybody who cares about patriotic Americans.” \n    - President Trump  restored  a 25% tariff on steel imports and  elevated  the tariff to 25% on aluminum imports to protect these critical American industries from unfair foreign competition.       - The Steel Manufacturers Association  released  a statement applauding “President Trump for putting the American steel industry and its workers first by imposing a 25 percent tariff on all steel imports. President Trump understands that America’s steel industry is the backbone of our economy. A thriving domestic steel industry is critical to U.S. national, energy and economic security.”       - The president of the Aluminum Association  said : “We appreciate President Trump’s continued focus on strong trade actions to support the aluminum industry in the United States.”        - Colorado Springs-based, family-owned Western Steel, Inc.,  praised  the move: “What we hope that the tariffs will bring is some sort of stability to U.S. pricing. It allows a little bit more money to be made … on the intermediate level like us.” \n    - President Trump  unveiled  a plan for fair and reciprocal trade, making clear to the world that the United States will no longer tolerate being  ripped off .       - The Renewable Fuels Association  said : “The Brazilian tariff on U.S. ethanol now stands at 18 percent and has virtually eliminated all market access for U.S. ethanol producers. We thank President Trump for taking this action and hope this reciprocal tariff will help encourage a return to free and fair ethanol trade relationship with Brazil.” \n    - President Trump  spoke  with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy in pursuit of finally securing peace.\n    - President Trump  hosted  Jordan’s King Abdullah II, who  announced  the Kingdom will accept 2,000 sick children from Gaza “as quickly as possible.”\n    - President Trump joined Indian Prime Minister Narendra Modi to  announce  new deals between the two countries on immigration, trade, energy, and artificial intelligence.\n    - The Department of Energy  approved  the first liquefied natural gas project since the prior administration banned LNG exports last year.\n    - President Trump  declared  all foreign policy must be conducted under the President’s direction, ensuring career diplomats reflect the foreign policy of the United States at all times.\n    - President Trump  paused  enforcement of the overregulation of American business practices abroad, which negatively impacted national security.\n    - Hamas  agreed  to free additional Israeli hostages after President Trump  declared  “all hell is going to break out” if the terrorist group delayed.\n    - Taiwan  pledged  to boost its investment in the United States amid President Trump’s tariffs.\n    - President Trump  received  his highest ever approval rating in a CBS News poll — with 70% of Americans agreeing he is keeping his promises.\n    - President Trump attended Super Bowl LIX in New Orleans,  becoming  first sitting President to do so and  bringing back  tradition of pre-Super Bowl interviews.\n    - Illegal border crossings have hit  lows not seen in decades .\n    - Hundreds of illegal aliens from Venezuela were  repatriated  back to their own country on Venezuelan-owned planes.\n    - Illegal aliens have started  turning around  in droves amid the Trump Administration’s crackdown on dangerous illegal immigration.\n    - The Department of Homeland Security  “clawed back”  tens of millions of dollars in funds paid by rogue FEMA officials to house illegal aliens in luxury New York City hotels.\n    - President Trump  instructed  the Secretary of the Treasury to stop production of the penny, which  costs 3.69 cents  to make.\n    - Director of National Intelligence Tulsi Gabbard, Secretary of Health and Human Services Robert F. Kennedy, Jr., and Secretary of Agriculture Brooke Rollins were confirmed by the Senate — continuing the Trump Administration’s  rapid pace  of confirmations.\n    - President Trump signed an executive order barring COVID-19 vaccine mandates in schools that receive federal funding.\n    - President Trump established the National Energy Dominance Council to advise on achieving energy dominance.\n    - President Trump  established  the Make America Healthy Again Commission, which redirects the national focus to promoting health rather than simply managing disease.\n    - President Trump  signed  an executive to end the use of paper straws.\n    - President Trump  shut down  the Biden-era “Climate Corps” work program.\n    - President Trump  secured  the resignations of 75,000+ federal workers, or approximately 3.75% of the federal workforce, in an effort to eliminate inefficiency at taxpayer expense.\n    - President Trump  commenced  his plan to downsize the federal bureaucracy and eliminate waste, bloat, and insularity — including an order that agencies hire no more than one employee for every four employees who leave.\n    - The Trump Administration  ordered  the Consumer Financial Protection Bureau — the brainchild of Elizabeth Warren, which  funneled  cash to left-wing advocacy groups — to halt operations.\n    - President Trump  ended  the wasteful Federal Executive Institute, which had become a training ground for bureaucrats.\n    - President Trump  ordered  the immediate dismissal of the Board of Visitors for the Army, Air Force, Navy, and Coast Guard following years of woke ideologies infiltrating U.S. service academies.\n    - Secretary of Defense Pete Hegseth  restored  Fort Liberty, North Carolina, to “Fort Bragg,” in honor of a World War II hero.\n    - President Trump  instructed  EPA Administrator Lee Zeldin to terminate Biden-era regulations restricting water flow and mandating inadequate lightbulb standards.\n    - President Trump  proclaimed  “Gulf of America Day” after the Department of the Interior officially  changed  the name on its mapping databases.       - Google Maps and Apple Maps both updated their apps to reflect the new name. \n    - The Department of Justice  filed suit  against the State of New York and its elected officials over their willful failure to follow federal immigration law.\n    - The Environmental Protection Agency  canceled  tens of millions of dollars in contracts to left-wing advocacy groups and  announced  an investigation into a scheme by Biden EPA staffers to shield billions of dollars from oversight and accountability.\n    - The Department of Education  announced  an investigation into the Minnesota State High School League and California Interscholastic Federation for violation of federal anti-discrimination law by allowing men to compete in women’s sports.\n    - The Federal Bureau of Investigation  discovered  2,400 additional records on the assassination of President John F. Kennedy, which were never provided to the board tasked with reviewing and disclosing the documents. The discovery happened due to President Trump’s  executive order  calling for the declassification of JFK assassination documents.\n    - The Department of Veterans Affairs  implemented  a new flag policy to promote the prominence of the American flag and ensure consistency among its facilities.\n    - President Trump was unanimously  elected  as Chairman of The Kennedy Center Board of Trustees and  fired  a slew of the Center’s board members over their obsession with perpetuating radical ideologies.\n    - U.S. crude oil stockpiles  continued to rise , which they have done every week since President Trump took office.\n    - Chicago Lurie Children’s Hospital  paused  sex change surgeries for minors in response to President Trump’s  executive order  ending the radical practice.\n    - Taxpayer-funded PBS  closed  its DEI office and Disney  dropped  two of its DEI programs after President Trump’s executive order reining in such discriminatory practices.\n",
  "summary": "In a week marked by several notable developments, President Donald J. Trump achieved significant milestones in various areas of his administration's agenda. On the international stage, the President successfully negotiated the release of American citizens detained in Russia and Belarus, and he engaged in diplomatic discussions with Russian and Ukrainian leaders to secure peace. Domestically, President Trump implemented a suite of economic and regulatory changes, including reinstating tariffs on steel and aluminum imports to protect domestic industries and unveiling a plan for fair trade.\n\nIn further developments, President Trump took actions to streamline government operations, including issuing an executive order to halt the production of the penny and restructuring the federal workforce to reduce inefficiency. He also took steps to redefine foreign policy management, reaffirming that it must be aligned with his administration's priorities. Environmental and policy changes included terminating Biden-era programs and regulations he deemed inefficient and promoting energy projects to enhance U.S. energy independence.\n\nOn the legislative side, several of Trump's cabinet picks were confirmed, including high-profile figures like Tulsi Gabbard and Robert F. Kennedy, Jr. Additionally, President Trump focused on social issues by implementing actions such as banning COVID-19 vaccine mandates in federally funded schools and halting sex change surgeries for minors. The administration also launched investigations into discriminatory practices in state education associations and resumed the declassification of historical assassination documents.",
  "eli5": "President Trump had a busy week doing many things like helping to get people back from Russia, putting rules back to help American workers, and making changes in government and schools to work better; like stopping the schools from making kids get shots they don't want.",
  "keywords": [
    "Donald Trump",
    "American citizen release",
    "tariffs",
    "foreign policy",
    "energy",
    "government efficiency",
    "cabinet confirmation",
    "COVID-19 mandate",
    "declassification",
    "executive action"
  ],
  "issues": [
    "Verification of the events listed",
    "Bias in reporting accomplishments",
    "Lack of sources or references for claims",
    "Partisanship in evaluating successes"
  ],
  "citations": [],
  "document_type": "Fact Sheet"
}