{
  "title": "Withdrawing the United States from and Ending Funding to Certain United Nations Organizations and Reviewing United States Support to All International Organizations – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Withdrawing the United States from and Ending Funding to Certain United Nations Organizations and Reviewing United States Support to All International Organizations – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.  Purpose. ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/02/withdrawing-the-united-states-from-and-ending-funding-to-certain-united-nations-organizations-and-reviewing-united-states-support-to-all-international-organizations/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-02-05T02:15:44+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Presidential Actions](https://www.whitehouse.gov/presidential-actions/)\n\n# \t\t\t\t\tWITHDRAWING THE UNITED STATES FROM AND ENDING FUNDINGTO CERTAIN UNITED NATIONS ORGANIZATIONS AND REVIEWINGUNITED STATES SUPPORT TO ALL INTERNATIONAL ORGANIZATIONS\t\t\t\t\n\nFebruary 4, 2025\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose.  The United States helped found the United Nations (UN) after World War II to prevent future global conflicts and promote international peace and security.  But some of the UN’s agencies and bodies have drifted from this mission and instead act contrary to the interests of the United States while attacking our allies and propagating anti-Semitism.  As in 2018, when the United States withdrew from the UN Human Rights Council (UNHRC), the United States will reevaluate our commitment to these institutions.\n\nThree UN organizations that deserve renewed scrutiny are the UNHRC; the UN Educational, Scientific, and Cultural Organization (UNESCO); and the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA).\n\nUNRWA has reportedly been infiltrated by members of groups long designated by the Secretary of State (Secretary) as foreign terrorist organizations, and UNRWA employees were involved in the October 7, 2023, Hamas attack on Israel.  UNHRC has protected human rights abusers by allowing them to use the organization to shield themselves from scrutiny, while UNESCO has demonstrated failure to reform itself, has continually demonstrated anti-Israel sentiment over the past decade, and has failed to address concerns over mounting arrears.\n\nSec. 2.  UNHRC and UNESCO Participation.  (a)  The United States will not participate in the UNHRC and will not seek election to that body.  The Secretary shall terminate the office of United States Representative to the UNHRC and any positions primarily dedicated to supporting the United States Representative to the UNHRC. \n\n(b)  The United States will also conduct a review of its membership in UNESCO.  This review shall be led by the Secretary, in coordination with the United States Representative to the United Nations (UN Ambassador), and must be completed within 90 days of the date of this order.  The review will include an evaluation of how and if UNESCO supports United States interests.  In particular, the review will include an analysis of any anti-Semitism or anti-Israel sentiment within the organization.  \n\nSec. 3.  Funding.  (a)  Executive departments and agencies shall not use any funds for a contribution, grant, or other payment to UNRWA, consistent with section 301 of title III, division G, of Public Law 118-47 (March 23, 2024).  The Secretary shall withdraw the determination previously made under section 7048(c)(1) of title VII, division F, of Public Law 118-47.  Accordingly, of the funds appropriated for a contribution to the UN Regular Budget under the heading “Contributions to International Organizations” of Public Law 118-47, as most recently continued by Public Law 118-158 (December 21, 2024), the Secretary shall withhold the United States proportionate share of the total annual amount of UN Regular Budget funding for the UNHRC, consistent with section 7048(c) of title VII, division F, of Public Law 118-47.\n\n(b)  Within 180 days of the date of this order, the Secretary, in consultation with the UN Ambassador, shall conduct a review of all international intergovernmental organizations of which the United States is a member and provides any type of funding or other support, and all conventions and treaties to which the United States is a party, to determine which organizations, conventions, and treaties are contrary to the interests of the United States and whether such organizations, conventions, or treaties can be reformed.  Upon the conclusion of that review, the Secretary shall report the findings to the President, through the Assistant to the President for National Security Affairs, and provide recommendations as to whether the United States should withdraw from any such organizations, conventions, or treaties. \n\nSec. 4.  Notification.  The Secretary shall inform the UN Secretary General and the leadership of UNRWA and the UN High Commissioner for Human Rights that the United States will not fund UNRWA or the UNHRC and that the United States will not satisfy any claims to pay 2025 assessments or prior arrears by these organizations.\n\nSec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\n    February 3, 2025.\n",
  "summary": "The United States, under the leadership of the President, has decided to withdraw from certain United Nations (UN) organizations and cease funding several others as of February 4, 2025. This presidential action stems from concerns about anti-Semitism and actions contrary to U.S. interests by specific UN entities. Notably, the UN Human Rights Council (UNHRC), UN Educational, Scientific, and Cultural Organization (UNESCO), and UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) are under scrutiny. The order mandates the U.S. to terminate participation in the UNHRC and conduct a detailed review of its membership with UNESCO.\n\nMoreover, the U.S. will halt funding to UNRWA and undertakes a comprehensive review of all international organizations and treaties it supports to assess their alignment with U.S. interests. This review will help decide if further withdrawals or funding cessations are justifiable. The order also requires notification to relevant UN bodies that the U.S. will not meet its financial obligations for 2025 and previous arrears to these organizations. This action is aligned with applicable laws and is subject to budget availability.",
  "eli5": "The President decided that the U.S. won't be part of or give money to some UN groups because they are not helping the U.S. or its friends like they should.",
  "keywords": [
    "UNHRC",
    "UNESCO",
    "UNRWA",
    "U.S. withdrawal",
    "funding cessation",
    "International organizations",
    "anti-Semitism",
    "foreign policy",
    "Presidential directive"
  ],
  "issues": [
    "Potential diplomatic relations impact with UN and member states",
    "Criticism for halting support to international organizations",
    "Concerns over claims of anti-Semitism in UN bodies",
    "Implications of U.S. withdrawal from UNESCO",
    "How these actions affect global perception of U.S. foreign policy"
  ],
  "citations": [
    "Public Law 118-47",
    "Public Law 118-158",
    "Section 301 of title III, division G, Public Law 118-47",
    "Section 7048(c)(1) of title VII, division F, Public Law 118-47"
  ],
  "document_type": "Executive Order"
}