{
  "title": "Yes, Biden Spent Millions on Transgender Animal Experiments – The White House\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Yes, Biden Spent Millions on Transgender Animal Experiments",
  "og:description": "Last night, President Donald J. Trump highlighted many of the egregious examples of waste, fraud, and abuse funded by American taxpayers, including $8",
  "og:url": "https://www.whitehouse.gov/articles/2025/03/yes-biden-spent-millions-on-transgender-animal-experiments/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-03-05T17:43:53+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "markdown": "[Articles](https://www.whitehouse.gov/articles/)\n\n# \t\t\t\t\tYes, Biden Spent Millions on Transgender Animal Experiments\t\t\t\t\n\nMarch 5, 2025\n\nLast night, President Donald J. Trump [highlighted](https://x.com/RapidResponse47/status/1897118092481945763) many of the egregious examples of waste, fraud, and abuse funded by American taxpayers, including $8 million spent by the Biden Administration “for making mice transgender.”\n\n**The Fake News losers at CNN immediately**[**tried**](https://www.cnn.com/2025/03/04/politics/fact-check-trump-address-congress/index.html#:~:text=DOGE%20and%20transgender,among%20transgender%20women.)**to fact check it, but President Trump was right (as usual).****FACT:** Under the Biden Administration, the National Institutes of Health [doled out](https://www.washingtonexaminer.com/news/investigations/3267269/biden-administration-spent-millions-dollars-creating-transgender-animal-for-studies/) millions of dollars in taxpayer-funded [grants](https://www.washingtonexaminer.com/wp-content/uploads/2024/12/Transgender-mice-WCW-12-2024-v2.docx.pdf) for institutions across the country to perform transgender experiments on mice.\n    - [$455,000](https://reporter.nih.gov/project-details/10849830): “A Mouse Model to Test the Effects of Gender-affirming Hormone Therapy on HIV Vaccine-induced Immune Responses”\n    - [$2,500,000](https://reporter.nih.gov/project-details/10619517): “Reproductive Consequences of Steroid Hormone Administration”        - “These mice manifest defects in ovarian architecture and have altered folliculogenesis.” \n    - [$299,940](https://reporter.nih.gov/search/Y3xbwNgJV0-V2-RIROPR1Q/project-details/10912193#description): “Gender-Affirming Testosterone Therapy on Breast Cancer Risk and Treatment Outcomes”        - “We will compare the incidences and tumor specific survival in female mice (intact) and oophorectomized female mice receiving TT with their respective counterparts that do not receive TT.” \n    - [$735,113](https://reporter.nih.gov/search/-NkoAnjCB0uKdDs0r_5qxw/project-details/10944419): “Microbiome mediated effects of gender affirming hormone therapy in mice”\n    - [$1,200,000](https://reporter.nih.gov/project-details/11000334): “Androgen effects on the reproductive neuroendocrine axis”        - “Aim 2 utilizes transgenic mice to test whether male-level androgens acting via AR specifically in kisspeptin neurons are necessary and/or sufficient for androgen inhibition of in vivo LH pulse parameters, including pulse frequency, and the estrogen-induced LH surge.” \n    - [$3,100,000](https://reporter.nih.gov/project-details/10891526): “Gonadal hormones as mediators of sex and gender influences in asthma”        - “We will study the contributions of estrogens to HDM-induced asthma outcomes using male and female gonadectomized mice treated with estradiol…” \n\n**TOTAL: $8,290,053**\n",
  "summary": "The article discusses claims made by former President Donald Trump, asserting that the Biden Administration has spent $8 million of taxpayer money on transgender animal experiments. This claim was fact-checked by CNN, but Trump insisted on its accuracy. The National Institutes of Health (NIH) awarded grants to several research projects investigating the effects of hormone therapy and other related topics in mice. These grants include studies on hormone impacts on HIV vaccine responses, reproductive consequences in mice, breast cancer risks, microbiome effects, neuroendocrine responses, and asthma outcomes influenced by hormones.\n\nThe NIH projects received a cumulative total of $8,290,053 for conducting detailed biological studies with transgenic and gonadectomized mice, focusing on understanding hormone therapies and their implications. The projects were carried out across various institutions, as documented by the assistance funds allocated for each research aim. This controversy arises over the appropriateness of using taxpayer dollars for such research, sparking debates on wasteful spending allegations.",
  "eli5": "Some people think the government spent a lot of money studying mice to see how they react to different hormones, like those used by transgender people. The money was used to do science on mice to learn more about health topics.",
  "keywords": [
    "Biden Administration",
    "transgender",
    "animal experiments",
    "Trump",
    "NIH",
    "hormone therapy",
    "taxpayer",
    "grants"
  ],
  "issues": [
    "The credibility of the claim made by Donald Trump regarding taxpayer spending.",
    "The ethical implications of using taxpayer money for such research.",
    "The validity and scientific merit of the projects funded by NIH."
  ],
  "citations": [
    "Grant numbers and details provided in URLs but no specific legislation or regulation cited."
  ],
  "document_type": "Fact Sheet"
}