{
  "title": "America First Policy Directive To The Secretary Of State – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nAMERICA FIRST POLICY DIRECTIVE TO THE SECRETARY OF STATE\n========================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose*.*  From this day forward, the foreign policy of the United States shall champion core American interests and always put America and American citizens first.\n\nSec. 2.  Policy*.*  As soon as practicable, the Secretary of State shall issue guidance bringing the Department of State’s policies, programs, personnel, and operations in line with an America First foreign policy, which puts America and its interests first.\n\nSec. 3.  General Provisions*.*  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)  the authority granted by law to an executive department or agency; or\n\n(ii)   the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "America First Policy Directive To The Secretary Of State – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/america-first-policy-directive-to-the-secretary-of-state/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:47:48+00:00",
  "article:modified_time": "2025-01-21T02:17:59+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order establishes an 'America First' directive for U.S. foreign policy. The order instructs the Secretary of State to realign the State Department's operations, policies, programs, and personnel to prioritize American interests. The order contains standard provisions preserving existing executive authority and clarifying that it creates no new legal rights. The directive appears largely symbolic and declaratory in nature, as it provides no specific policy changes or detailed implementation requirements beyond the general 'America First' mandate.",
  "eli5": "This is like a boss telling their workers that from now on, when making decisions about dealing with other countries, they need to think about what's best for America first. It's similar to saying 'our family comes first' when making important choices.",
  "keywords": [
    "Foreign Policy",
    "America First",
    "State Department",
    "National Interest",
    "Diplomatic Relations",
    "Executive Authority",
    "Administrative Policy"
  ],
  "issues": [
    "The order lacks specific definitions of 'American interests' or 'America First'",
    "No clear metrics or guidelines for implementation are provided",
    "Potential impact on existing international agreements and relationships is unclear",
    "Timeline for implementation is vague ('as soon as practicable')",
    "No reporting requirements or oversight mechanisms are specified"
  ],
  "citations": [
    "U.S. Constitution (general reference)",
    "No specific USC, CFR, or other regulatory citations provided"
  ],
  "action_type": "Executive Order",
  "file_name": "america-first-policy-directive-to-the-secretary-of-state"
}