{
  "title": "Application Of Protecting Americans From Foreign Adversary Controlled Applications Act To TikTok – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nAPPLICATION OF PROTECTING AMERICANS FROM FOREIGN ADVERSARY CONTROLLED APPLICATIONS ACT TO TIKTOK\n================================================================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nAPPLICATION OF PROTECTING AMERICANS FROM FOREIGN ADVERSARY CONTROLLED APPLICATIONS ACT TO TIKTOK\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America it is hereby ordered:\n\nSection 1.  Policy.  The Protecting Americans from Foreign Adversary Controlled Applications Act (the “Act”) (Pub. L. 118-50, div. H) regulates “foreign adversary controlled applications,” specifically those operated by TikTok and any other subsidiary of its China-based parent company, ByteDance Ltd., on national security grounds.\n\nSection 2(a) of the Act prohibits entities from distributing, maintaining, or updating certain defined foreign adversary controlled applications within the territory of the United States by providing (A) services for such distribution, maintenance, or updates by means of an online mobile application store or other marketplace; or (B) internet hosting services to enable the distribution, maintenance, or updating of such applications.  Section 2(g) of the Act defines “Foreign Adversary Controlled Application” to include websites, desktop applications, mobile applications, and augmented or immersive technology applications operated directly or indirectly by ByteDance Ltd. or TikTok.  Under section 2(a) of the Act, the prohibitions of the Act with respect to these entities became effective on January 19, 2025.\n\nI have the unique constitutional responsibility for the national security of the United States, the conduct of foreign policy, and other vital executive functions.  To fulfill those responsibilities, I intend to consult with my advisors, including the heads of relevant departments and agencies on the national security concerns posed by TikTok, and to pursue a resolution that protects national security while saving a platform used by 170 million Americans.  My Administration must also review sensitive intelligence related to those concerns and evaluate the sufficiency of mitigation measures TikTok has taken to date.\n\nThe unfortunate timing of section 2(a) of the Act — one day before I took office as the 47th President of the United States — interferes with my ability to assess the national security and foreign policy implications of the Act’s prohibitions before they take effect.  This timing also interferes with my ability to negotiate a resolution to avoid an abrupt shutdown of the TikTok platform while addressing national security concerns.  Accordingly, I am instructing the Attorney General not to take any action to enforce the Act for a period of 75 days from today to allow my Administration an opportunity to determine the appropriate course forward in an orderly way that protects national security while avoiding an abrupt shutdown of a communications platform used by millions of Americans.\n\nSec. 2.  Action*.*  (a)  I hereby order the Attorney General not to take any action on behalf of the United States to enforce the Act for 75 days from the date of this order, to permit my Administration an opportunity to determine the appropriate course of action with respect to TikTok.  During this period, the Department of Justice shall take no action to enforce the Act or impose any penalties against any entity for any noncompliance with the Act, including for distributing, maintaining, or updating (or enabling the distribution, maintenance, or updating) of any foreign adversary controlled application as defined in the Act.  In light of this direction, even after the expiration of the above-specified period, the Department of Justice shall not take any action to enforce the Act or impose any penalties against any entity for any conduct that occurred during the above-specified period or any period prior to the issuance of this order, including the period of time from January 19, 2025, to the signing of this order.\n\n(b)  The Attorney General shall take all appropriate action to issue written guidance to implement the provisions of subsection (a).\n\n(c)  I further order the Attorney General to issue a letter to each provider stating that there has been no violation of the statute and that there is no liability for any conduct that occurred during the above-specified period, as well as for any conduct from the effective date of the Act until the issuance of this Executive Order.\n\n(d)  Because of the national security interests at stake and because section 2(d) of the Act vests authority for investigations and enforcement of the Act only in the Attorney General, attempted enforcement by the States or private parties represents an encroachment on the powers of the Executive.  The Attorney General shall exercise all available authority to preserve and defend the Executive’s exclusive authority to enforce the Act.\n\nSec. 3.  General Provisions*.*  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Application Of Protecting Americans From Foreign Adversary Controlled Applications Act To TikTok – The White House",
  "og:description": "APPLICATION OF PROTECTING AMERICANS FROM FOREIGN ADVERSARY CONTROLLED APPLICATIONS ACT TO TIKTOK By the authority vested in me as President by the",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/application-of-protecting-americans-from-foreign-adversary-controlled-applications-act-to-tiktok/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:10:27+00:00",
  "article:modified_time": "2025-01-21T02:25:48+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order, issued on January 20, 2025, addresses the implementation of the Protecting Americans from Foreign Adversary Controlled Applications Act regarding TikTok. The Order temporarily halts enforcement of the Act's prohibitions for 75 days, allowing the new administration time to assess national security implications and negotiate potential resolutions. The President directs the Attorney General to: (1) refrain from enforcement actions during this period, (2) issue implementing guidance, (3) provide written assurance to providers regarding non-violation, and (4) defend federal exclusivity in enforcement. The Order acknowledges TikTok's widespread use by 170 million Americans while balancing national security concerns regarding ByteDance Ltd.'s control.",
  "eli5": "The President wants to pause a new law that could shut down TikTok for 75 days. This gives the government time to figure out if TikTok is safe to use while making sure millions of Americans don't suddenly lose access to the app.",
  "keywords": [
    "TikTok",
    "ByteDance",
    "National Security",
    "Executive Authority",
    "Foreign Technology",
    "Social Media",
    "Law Enforcement",
    "Foreign Adversary",
    "Communications Platform",
    "Federal Preemption"
  ],
  "issues": [
    "Tension between national security concerns and widespread public use of the platform",
    "Question of federal vs. state enforcement authority",
    "Timing of law's implementation one day before new administration",
    "Balance between executive authority and legislative intent",
    "Potential constitutional questions regarding separation of powers"
  ],
  "citations": [
    "Protecting Americans from Foreign Adversary Controlled Applications Act (Pub. L. 118-50, div. H)",
    "Section 2(a) of the Act",
    "Section 2(g) of the Act",
    "Section 2(d) of the Act"
  ],
  "file_name": "application-of-protecting-americans-from-foreign-adversary-controlled-applications-act-to-tiktok"
}