{
  "title": "President Trump Announces Cabinet and Cabinet Level Appointments – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nPresident Trump Announces Cabinet and Cabinet-Level Appointments\n================================================================\n\nJanuary 20, 2025 \n\n\n\nTo the Senate of the United States, I nominate\n\nScott Bessent, of South Carolina, to be Secretary of the Treasury.\n\nPamela Bondi, of Florida, to be Attorney General.\n\nDouglas Burgum, of North Dakota, to be Secretary of the Interior.\n\nLori Chavez-DeRemer, of Oregon, to be Secretary of Labor.\n\nDouglas Collins, of Georgia, to be Secretary of Veterans Affairs.\n\nSean Duffy, of Wisconsin, to be Secretary of Transportation.\n\nPeter Hegseth, of Tennessee, to be Secretary of Defense.\n\nRobert F. Kennedy, Jr., of California, to be Secretary of Health and Human Services.\n\nHoward Lutnick, of New York, to be Secretary of Commerce.\n\nLinda McMahon, of Connecticut, to be Secretary of Education.\n\nKristi Noem, of South Dakota, to be Secretary of Homeland Security.\n\nBrooke Rollins, of Texas, to be Secretary of Agriculture.\n\nMarco Rubio, of Florida, to be Secretary of State.\n\nEric Turner, of Texas, to be Secretary of Housing and Urban Development.\n\nChristopher Wright, of Colorado, to be Secretary of Energy.\n\nTulsi Gabbard, of Hawaii, to be Director of National Intelligence.\n\nJamieson Greer, of Maryland, to be United States Trade Representative, with the rank of Ambassador Extraordinary and Plenipotentiary.\n\nKelly Loeffler, of Georgia, to be Administrator of the Small Business Administration.\n\nJohn Ratcliffe, of Texas, to be Director of the Central Intelligence Agency.\n\nElise Stefanik, of New York, to be the Representative of the United States of America to the United Nations, with the rank and status of Ambassador Extraordinary and Plenipotentiary, and the Representative of the United States of America in the Security Council of the United Nations.\n\nElise Stefanik, of New York, to be Representative of the United States of America to the Sessions of the General Assembly of the United Nations during her tenure of service as Representative of the United States of America to the United Nations.\n\nRussell Vought, of Virginia, to be Director of the Office of Management and Budget.\n\nLee Zeldin, of New York, to be Administrator of the Environmental Protection Agency.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "President Trump Announces Cabinet and Cabinet Level Appointments – The White House",
  "og:description": "To the Senate of the United States, I nominate Scott Bessent, of South Carolina, to be Secretary of the Treasury. Pamela Bondi, of Florida, to be Attorney",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/cabinet-and-cabinet-level-appointments/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T19:30:00+00:00",
  "article:modified_time": "2025-01-20T22:07:29+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This document represents President Trump's Cabinet and Cabinet-level nominations announced on January 20, 2025. The nominations include all fifteen executive department heads (Secretary positions) and seven additional Cabinet-level positions. Notable nominations include Marco Rubio for Secretary of State, Robert F. Kennedy Jr. for Health and Human Services, and former Representative Tulsi Gabbard for Director of National Intelligence. The nominations require Senate confirmation as per Constitutional requirements.",
  "eli5": "The President has picked new leaders to help run different parts of the government, like someone picking team captains. Each person will be in charge of important things like schools, roads, or keeping the country safe, but they need the Senate to say 'yes' first.",
  "keywords": [
    "Cabinet appointments",
    "Presidential nominations",
    "Executive branch",
    "Senate confirmation",
    "Federal government",
    "Department heads",
    "Cabinet-level positions",
    "Administrative appointments"
  ],
  "issues": [
    "Some nominees may face significant confirmation challenges due to controversial backgrounds or positions",
    "Multiple nominees have previously run against Trump in political races",
    "Several nominees lack traditional experience in their nominated departments",
    "Potential conflicts of interest may need to be addressed during confirmation",
    "Unusual selection of former critics and opponents for cabinet positions"
  ],
  "citations": [
    "U.S. Constitution, Article II, Section 2, Clause 2 (Appointments Clause)",
    "5 U.S.C. § 3110 (Anti-nepotism statute)",
    "28 U.S.C. § 532 (Qualification requirements for certain positions)"
  ],
  "action_type": "Presidential Action",
  "file_name": "cabinet-and-cabinet-level-appointments"
}