{
  "title": "Declassification of Records Concerning the Assassinations of President John F. Kenned – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nDECLASSIFICATION OF RECORDS CONCERNING THE ASSASSINATIONSOF PRESIDENT JOHN F. KENNEDY, SENATOR ROBERT F. KENNEDY, AND THE REVEREND DR. MARTIN LUTHER KING, JR.\n==============================================================================================================================================================\n\nEXECUTIVE ORDER \nJanuary 23, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:\n\nSection 1.  Policy and Purpose.  More than 50 years after the assassinations of President John F. Kennedy, Senator Robert F. Kennedy, and the Reverend Dr. Martin Luther King, Jr., the Federal Government has not released to the public all of its records related to those events.  Their families and the American people deserve transparency and truth.  It is in the national interest to finally release all records related to these assassinations without delay.\n\nThe President John F. Kennedy Assassination Records Collection Act of 1992 required all records related to the assassination of President Kennedy to be publicly disclosed in full by October 26, 2017, unless the President certifies that:  (i) continued postponement is made necessary by an identifiable harm to the military defense, intelligence operations, law enforcement, or conduct of foreign relations; and (ii) the identifiable harm is of such gravity that it outweighs the public interest in disclosure.  President John F. Kennedy Assassination Records Collection Act of 1992, section 5(g)(2)(D), Public Law 102-526, 106 Stat. 3443, 3448–49, codified at 44 U.S.C. 2107 note.\n\nI previously accepted proposed redactions from executive departments and agencies (agencies) in 2017 and 2018, but ordered the continued re-evaluation of those remaining redactions.  See Temporary Certification for Certain Records Related to the Assassination of President John F. Kennedy, 82 Fed. Reg. 50,307–08 (Oct. 31, 2017); Certification for Certain Records Related to the Assassination of President John F. Kennedy, 83 Fed. Reg. 19, 157–58 (Apr. 26, 2018).  In the Presidential Memorandum of April 26, 2018, I also ordered agencies to re-review each of those redactions over the next 3 years and disclose information that no longer warrants continued withholding under the standard set forth in section 5(g)(2)(D) of the President John F. Kennedy Assassination Records Collection Act of 1992.\n\nPresident Biden issued subsequent certifications with respect to these records in 2021, 2022, and 2023, which gave agencies additional time to review the records and withhold information from public disclosure.  See Temporary Certification Regarding Disclosure of Information in Certain Records Related to the Assassination of President John F. Kennedy, 86 Fed. Reg. 59,599 (Oct. 22, 2021); Certifications Regarding Disclosure of Information in Certain Records Related to the Assassination of President John F. Kennedy, 87 Fed. Reg. 77,967 (Dec. 15, 2022); Certification Regarding Disclosure of Information in Certain Records Related to the Assassination of President John F. Kennedy, 88 Fed. Reg. 43,247 (June 30, 2023).\n\nI have now determined that the continued redaction and withholding of information from records pertaining to the assassination of President John F. Kennedy is not consistent with the public interest and the release of these records is long overdue.  And although no Act of Congress directs the release of information pertaining to the assassinations of Senator Robert F. Kennedy and the Reverend Dr. Martin Luther King, Jr., I have determined that the release of all records in the Federal Government’s possession pertaining to each of those assassinations is also in the public interest.\n\nSec. 2.  Declassification and Disclosure.  (a)  Within 15 days of the date of this order, the Director of National Intelligence and the Attorney General shall, in coordination with the Assistant to the President forNational Security Affairs and the Counsel to the President, present a plan to the President for the full and complete release of records relating to the assassination of President John F. Kennedy.\n\n(b)  Within 45 days of the date of this order, the Director of National Intelligence and the Attorney General shall, in coordination with the Assistant to the President for National Security Affairs and the Counsel to the President, review records related to the assassinations of Senator Robert F. Kennedy and the Reverend Dr. Martin Luther King, Jr., and present a plan to the President for the full and complete release of these records.\n\n Sec. 3.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 23, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Declassification of Records Concerning the Assassinations of President John F. Kenned – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows: Section",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/declassification-of-records-concerning-the-assassinations-of-president-john-f-kenned/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T20:53:29+00:00",
  "article:modified_time": "2025-01-23T20:53:30+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order directs the declassification and public release of all federal government records related to the assassinations of President John F. Kennedy, Senator Robert F. Kennedy, and Dr. Martin Luther King, Jr. The order acknowledges that while the JFK Records Act of 1992 required disclosure of JFK assassination records by 2017, multiple administrations have continued to delay full release through various certifications. The order establishes a 15-day deadline for presenting a plan to release JFK assassination records and a 45-day deadline for plans regarding RFK and MLK assassination records. The order requires coordination between the Director of National Intelligence, Attorney General, National Security Affairs, and White House Counsel.",
  "eli5": "The President is ordering the government to share all its secret files about what happened when President Kennedy, his brother Robert Kennedy, and Dr. Martin Luther King Jr. were killed. These files have been kept private for over 50 years, but now the President wants everyone to be able to see them.",
  "keywords": [
    "declassification",
    "assassination records",
    "JFK",
    "RFK",
    "MLK",
    "transparency",
    "national security",
    "public disclosure",
    "government records",
    "presidential records"
  ],
  "issues": [
    "No specific timeline for actual release of records, only for presenting plans",
    "Potential national security concerns not fully addressed",
    "No explanation for why previous administrations deemed continued secrecy necessary",
    "No mechanism for handling potential objections from agencies",
    "Unclear what happens if agencies miss the deadlines"
  ],
  "citations": [
    "JFK Assassination Records Collection Act of 1992, Public Law 102-526, 106 Stat. 3443",
    "44 U.S.C. 2107",
    "82 Fed. Reg. 50,307-08 (Oct. 31, 2017)",
    "83 Fed. Reg. 19,157-58 (Apr. 26, 2018)",
    "86 Fed. Reg. 59,599 (Oct. 22, 2021)",
    "87 Fed. Reg. 77,967 (Dec. 15, 2022)",
    "88 Fed. Reg. 43,247 (June 30, 2023)"
  ],
  "action_type": "Executive Order",
  "file_name": "declassification-of-records-concerning-the-assassinations-of-president-john-f-kenned"
}