{
  "summary": "This Executive Order establishes a process to designate international drug cartels and certain transnational criminal organizations (specifically mentioning Tren de Aragua and MS-13) as Foreign Terrorist Organizations (FTOs) and/or Specially Designated Global Terrorists (SDGTs). The order declares a national emergency due to these organizations' threat to U.S. national security, particularly highlighting their control over illegal border traffic and quasi-governmental control in parts of Mexico. It directs the Secretary of State, in consultation with other agency heads, to make designation recommendations within 14 days. Additionally, it instructs the Attorney General and Homeland Security Secretary to prepare for possible invocation of the Alien Enemies Act, including facility preparation for removal of designated individuals.",
  "eli5": "The President signed a special rule that says dangerous gangs and drug cartels are now going to be treated like terrorist groups. This means the government can use special powers to stop these bad groups from hurting people in America and bringing drugs into our country.",
  "issues": [
    "The broad scope of potential designations could affect a large number of individuals and organizations",
    "Potential international relations implications, particularly with Mexico",
    "Possible constitutional concerns regarding the invocation of the Alien Enemies Act",
    "Lack of specific criteria for what constitutes 'qualifying invasion or predatory incursion'",
    "Time frame of 14 days may be insufficient for thorough assessment and recommendations",
    "Potential humanitarian concerns regarding detention facilities and expedited removals"
  ],
  "citations": [
    "Immigration and Nationality Act (INA), 8 U.S.C. 1101 et seq.",
    "International Emergency Economic Powers Act (IEEPA), 50 U.S.C. 1701 et seq.",
    "8 U.S.C. 1189 (FTO designation authority)",
    "50 U.S.C. 1702 (IEEPA authorities)",
    "Executive Order 13224 (September 23, 2001)",
    "Alien Enemies Act, 50 U.S.C. 21 et seq."
  ]
}