{
  "title": "Designation Of Ansar Allah as a Foreign Terrorist Organization – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nDESIGNATION OF ANSAR ALLAH AS A FOREIGN TERRORIST ORGANIZATION\n==============================================================\n\nEXECUTIVE ORDER \nJanuary 22, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act (8 U.S.C. 1101 *et seq.*) (INA), it is hereby ordered as follows:\n\nSection 1.  Purpose.  This order sets in motion a process by which Ansar Allah, also known as the Houthis, shall be considered for designation as a Foreign Terrorist Organization, consistent with section 219 of the INA (8 U.S.C. 1189).\n\nSupported by Iran’s Islamic Revolutionary Guard Corps Quds Force (IRGC-QF), which arms and trains terrorist organizations worldwide, the Houthis have fired at U.S. Navy warships dozens of times since 2023, endangering American men and women in uniform.  Since seizing most Yemeni population centers by force from the legitimate Yemeni government in 2014-2015، the Houthis have launched numerous attacks on civilian infrastructure, including multiple attacks on civilian airports in Saudi Arabia, the deadly January 2022 attacks on the United Arab Emirates, and more than 300 projectiles fired at Israel since October 2023.  The Houthis have also attacked commercial vessels transiting Bab al-Mandeb more than 100 times, killing at least four civilian sailors and forcing some Red Sea maritime commercial traffic to reroute, which has contributed to global inflation.\n\nThe Houthis’ activities threaten the security of American civilians and personnel in the Middle East, the safety of our closest regional partners, and the stability of global maritime trade.\n\nSec. 2.  Policy.  It is the policy of the United States to cooperate with its regional partners to eliminate Ansar Allah’s capabilities and operations, deprive it of resources, and thereby end its attacks on U.S. personnel and civilians, U.S. partners, and maritime shipping in the Red Sea.\n\nSec. 3.  Implementation.  (a)  Within 30 days of the date of this order, the Secretary of State shall, after consultation with the Director of National Intelligence and the Secretary of the Treasury, submit a report to the President, through the National Security Council, concerning the designation of Ansar Allah as a foreign terrorist organization consistent with 8 U.S.C. 1189.\n\n(b)  Within 15 days after submitting the report required under subsection (a) of this section, the Secretary of State shall take all appropriate action, consistent with 8 U.S.C. 1189, with regards to a designation of Ansar Allah as a terrorist organization.\n\n(d)  Following any designation of Ansar Allah as a foreign terrorist organization under 8 U.S.C. 1189, the Secretary of State and the Administrator of the United States Agency for International Development (USAID) shall jointly conduct a review of the United Nations partners, nongovernmental organizations, and contractors through which USAID works in Yemen, and identify any entities with a relationship with USAID that has:\n\n(i)    made payments to members of, or governmental entities controlled by, Ansar Allah; or\n\n(ii)   has criticized international efforts to counter Ansar Allah while failing to document Ansar Allah’s abuses sufficiently.\n\n(e)  The Administrator of USAID shall take all appropriate action to terminate the projects, grants, or contracts identified under subsection (e) of this section as appropriate.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to and does not create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nDONALD J. TRUMP\n\nTHE WHITE HOUSE,\n\nJanuary 22, 2025\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Designation Of Ansar Allah as a Foreign Terrorist Organization – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/designation-of-ansar-allah-as-a-foreign-terrorist-organization/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T22:41:43+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order initiates the process to designate Ansar Allah (the Houthis) as a Foreign Terrorist Organization under Section 219 of the Immigration and Nationality Act. The order cites multiple hostile actions by the Houthis, including attacks on U.S. Navy vessels, civilian infrastructure in Saudi Arabia and UAE, and disruption of maritime commerce in the Red Sea. It requires the Secretary of State to submit a designation report within 30 days and take appropriate action within 15 days thereafter. Additionally, it mandates USAID to review and potentially terminate relationships with organizations that have made payments to or insufficiently documented Houthi abuses.",
  "eli5": "The President is taking steps to officially call a group called the Houthis 'terrorists' because they have been attacking ships and hurting people in the Middle East. This will make it easier for the U.S. to stop them and protect people and ships.",
  "keywords": [
    "Terrorism",
    "Foreign Policy",
    "National Security",
    "Yemen",
    "Maritime Security",
    "Middle East",
    "Foreign Terrorist Organization",
    "USAID",
    "International Relations",
    "Naval Operations"
  ],
  "issues": [
    "Potential humanitarian impact of FTO designation on aid delivery in Yemen",
    "Effectiveness of designation in deterring Houthi attacks",
    "Impact on regional diplomatic efforts",
    "Enforcement mechanisms and practical implementation",
    "Possible retaliation against U.S. interests in the region"
  ],
  "citations": [
    "Immigration and Nationality Act (8 U.S.C. 1101 et seq.)",
    "Section 219 of the INA (8 U.S.C. 1189)",
    "8 U.S.C. 1189"
  ],
  "action_type": "Executive Order",
  "file_name": "designation-of-ansar-allah-as-a-foreign-terrorist-organization"
}