{
  "title": "ENFORCING THE HYDE AMENDMENT – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nENFORCING THE HYDE AMENDMENT\n============================\n\nEXECUTIVE ORDER \nJanuary 24, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  \nSection 1.  Purpose and Policy.  For nearly five decades, the Congress has annually enacted the Hyde Amendment and similar laws that prevent Federal funding of elective abortion, reflecting a longstanding consensus that American taxpayers should not be forced to pay for that practice.  However, the previous administration disregarded this established, commonsense policy by embedding forced taxpayer funding of elective abortions in a wide variety of Federal programs.  \nIt is the policy of the United States, consistent with the Hyde Amendment, to end the forced use of Federal taxpayer dollars to fund or promote elective abortion.  \nSec. 2.  Revocation of Orders and Actions.  The following Executive Orders are hereby revoked:  \n(a)  [Executive Order 14076](https://www.federalregister.gov/documents/2022/07/13/2022-15138/protecting-access-to-reproductive-healthcare-services) of July 8, 2022; and  \n(b)  [Executive Order 14079](https://www.whitehouse.gov/briefing-room/presidential-actions/2023/01/22/memorandum-on-further-efforts-to-protect-access-to-reproductive-healthcare-services/#:~:text=In%20Executive%20Order%2014076%20of,abortion%20care%2C%20including%20medication%20abortion.) of August 3, 2022.  \nSec. 3.  Implementation.  The Director of the Office of Management and Budget shall promulgate guidance to the heads of executive departments and agencies related to implementation of sections 1 and 2 of this order.  \nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:  \n(i)   the authority granted by law to an executive department or agency, or the head thereof; or  \n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.  \n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.  \n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.  \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \nTHE WHITE HOUSE,  \n    January 24, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "ENFORCING THE HYDE AMENDMENT – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1.  Purpose and",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/enforcing-the-hyde-amendment/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-25T00:58:21+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order revokes two previous executive orders from 2022 (EO 14076 and EO 14079) that expanded access to reproductive healthcare services. The order aims to enforce the Hyde Amendment, which prohibits federal funding for elective abortions. The order directs the Office of Management and Budget to issue guidance to federal agencies on implementation. It includes standard provisions maintaining existing executive authority and clarifying that it creates no new legal rights or benefits. The order reflects a policy shift to restrict federal funding for abortion services, citing a 'longstanding consensus' against taxpayer funding of elective abortions.",
  "eli5": "This is a rule that says the government won't use tax money to pay for most abortions. It cancels some older rules that did allow government money to be used for this purpose.",
  "keywords": [
    "Hyde Amendment",
    "Abortion",
    "Federal funding",
    "Healthcare",
    "Reproductive rights",
    "Taxpayer funds",
    "Executive authority",
    "Budget policy"
  ],
  "issues": [
    "The order may face legal challenges from reproductive rights advocates",
    "Implementation guidance details are not specified",
    "Impact on existing federal healthcare programs is unclear",
    "Definition of 'elective abortion' is not provided",
    "Potential conflicts with state laws and regulations"
  ],
  "citations": [
    "Executive Order 14076 of July 8, 2022",
    "Executive Order 14079 of August 3, 2022",
    "Hyde Amendment (annual appropriations rider)"
  ],
  "action_type": "Executive Order",
  "file_name": "enforcing-the-hyde-amendment"
}