{
  "title": "Establishing And Implementing The President's \"Department Of Government Efficiency\" – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nESTABLISHING AND IMPLEMENTING THE PRESIDENT’S“DEPARTMENT OF GOVERNMENT EFFICIENCY”\n==================================================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Purpose.  This Executive Order establishes the Department of Government Efficiency to implement the President’s DOGE Agenda, by modernizing Federal technology and software to maximize governmental efficiency and productivity.\n\nSec. 2.  Definitions.  As used in this order:\n\n(a) “Agency” has the meaning given to it in section 551 of title 5, United States Code, except that such term does not include the Executive Office of the President or any components thereof.\n\n(b)  “Agency Head” means the highest-ranking official of an agency, such as the Secretary, Administrator, Chairman, or Director, unless otherwise specified in this order.\n\nSec. 3.  DOGE Structure.  (a)  *Reorganization and Renaming of the United States Digital Service.*The United States Digital Service is hereby publicly renamed as the United States DOGE Service (USDS) and shall be established in the Executive Office of the President.\n\n(b) *Establishment of a Temporary Organization*.  There shall be a USDS Administrator established in the Executive Office of the President who shall report to the White House Chief of Staff. There is further established within USDS, in accordance with section 3161 of title 5, United States Code, a temporary organization known as “the U.S. DOGE Service Temporary Organization”.  The U.S. DOGE Service Temporary Organization shall be headed by the USDS Administrator and shall be dedicated to advancing the President’s 18-month DOGE agenda.  The U.S. DOGE Service Temporary Organization shall terminate on July 4, 2026. The termination of the U.S. DOGE Service Temporary Organization shall not be interpreted to imply the termination, attenuation, or amendment of any other authority or provision of this order.\n\n(c) *DOGE Teams*.  In consultation with USDS, each Agency Head shall establish within their respective Agencies a DOGE Team of at least four employees, which may include Special Government Employees, hired or assigned within thirty days of the date of this Order. Agency Heads shall select the DOGE Team members in consultation with the USDS Administrator.  Each DOGE Team will typically include one DOGE Team Lead, one engineer, one human resources specialist, and one attorney.  Agency Heads shall ensure that DOGE Team Leads coordinate their work with USDS and advise their respective Agency Heads on implementing the President ‘s DOGE Agenda.\n\nSec. 4.  *Modernizing Federal Technology and Software to Maximize Efficiency and Productivity*.  (a)  The USDS Administrator shall commence a Software Modernization Initiative to improve the quality and efficiency of government-wide software, network infrastructure, and information technology (IT) systems.  Among other things, the USDS Administrator shall work with Agency Heads to promote inter-operability between agency networks and systems, ensure data integrity, and facilitate responsible data collection and synchronization.\n\n(b)  Agency Heads shall take all necessary steps, in coordination with the USDS Administrator and to the maximum extent consistent with law, to ensure USDS has full and prompt access to all unclassified agency records, software systems, and IT systems.  USDS shall adhere to rigorous data protection standards.\n\n(c)  This Executive Order displaces all prior executive orders and regulations, insofar as they are subject to direct presidential amendment, that might serve as a barrier to providing USDS access to agency records and systems as described above.\n\nSec. 5.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Establishing And Implementing The President's \"Department Of Government Efficiency\" – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered: Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/establishing-and-implementing-the-presidents-department-of-government-efficiency/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:50:14+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order establishes a new Department of Government Efficiency through the reorganization and renaming of the United States Digital Service to the United States DOGE Service (USDS). The order creates a temporary organization within USDS that will operate until July 4, 2026, led by a USDS Administrator reporting to the White House Chief of Staff. It mandates the creation of DOGE Teams within federal agencies, comprising at least four employees including technical, HR, and legal expertise. The order focuses on modernizing federal technology and software systems, promoting interoperability, and ensuring data integrity across agencies. It grants USDS broad access to unclassified agency records and systems while requiring adherence to data protection standards.",
  "eli5": "The President created a new team called DOGE to help make government computers and software work better together. It's like having a group of tech experts help different government offices share their information and work more smoothly as a team.",
  "keywords": [
    "government efficiency",
    "digital service",
    "DOGE",
    "technology modernization",
    "software systems",
    "interoperability",
    "data management",
    "federal agencies",
    "organizational restructuring",
    "temporary organization"
  ],
  "issues": [
    "Broad authority to access agency records could raise privacy and security concerns",
    "18-month timeline may be insufficient for significant technological transformation",
    "Potential overlap with existing agency IT departments and initiatives",
    "No specific funding mechanisms outlined",
    "Unclear metrics for measuring success of efficiency improvements",
    "Question of what happens after the temporary organization terminates"
  ],
  "citations": [
    "5 U.S.C. § 551",
    "5 U.S.C. § 3161"
  ],
  "action_type": "Executive Order",
  "file_name": "establishing-and-implementing-the-presidents-department-of-government-efficiency"
}