{
  "title": "Executive Grant of Clemency for Andrew Zabavsky – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nExecutive Grant of Clemency for Andrew Zabavsky\n===============================================\n\nJanuary 22, 2025 \n\n\n\nExecutive Grant of Clemency  \n**Donald J. Trump**  \n***President of the United States of America***  \nTo All to Whom These Presents Shall Come, Greeting:  \n**Be it Known, that This Day, I, Donald J. Trump, President of the United States, Pursuant to My Powers Under Article II, Section 2, Clause 1, of the Constitution, Have Granted Unto**  \nAndrew Zabavsky  \n**A Full and Unconditional Pardon**  \n  \n**For His****convictions** in the United States District Court for the District of Columbia, on an indictment (Docket No. 1:21-cr-00598-PLF), of violations of section 371, title 18, United States Code, and section 1512, title 18, United States Code, for which he was sentenced on September 12, 2024, to 48 months of imprisonment on each count (to run concurrently); 3 years of supervised release; and a special assessment of two hundred dollars ($200).  \n  \n**I HEREBY DESIGNATE**, direct, and empower, the Pardon Attorney, as my representative, to sign a grant of clemency to the person named herein. The Pardon Attorney shall declare that her action is the act of the President, being performed at my direction.  \n  \n  \n**IN TESTIMONY WHEREOF**, I have hereunto signed my name and caused the seal of the Department of Justice to be affixed.  \n  \nDone at the City of Washington in the District of Columbia this 22nd day of January in the Year of our Lord two thousand twenty-five, and of the Independence of the United States the two hundred forty-ninth.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Executive Grant of Clemency for Andrew Zabavsky – The White House",
  "og:description": "Executive Grant of ClemencyDonald J. TrumpPresident of the United States of AmericaTo All to Whom These Presents Shall Come, Greeting:   ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/executive-grant-of-clemency-for-andrew-zabavsky/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T22:40:57+00:00",
  "article:modified_time": "2025-01-22T22:40:58+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "President Donald Trump issued an Executive Grant of Clemency (full pardon) to Andrew Zabavsky on January 22, 2025. The pardon relates to Zabavsky's convictions in the U.S. District Court for D.C. under 18 USC § 371 (conspiracy) and 18 USC § 1512 (witness tampering), for which he received concurrent 48-month prison sentences, 3 years supervised release, and $200 in special assessments on September 12, 2024. The pardon is issued under the President's Constitutional authority (Article II, Section 2, Clause 1) and delegates authority to the Pardon Attorney to execute the grant.",
  "eli5": "The President used his special power to forgive someone named Andrew Zabavsky who was in trouble with the law and was supposed to go to jail. This means Mr. Zabavsky doesn't have to go to jail anymore and his record is cleared.",
  "keywords": [
    "pardon",
    "clemency",
    "criminal justice",
    "executive power",
    "conspiracy",
    "witness tampering",
    "constitutional authority",
    "Trump administration"
  ],
  "issues": [
    "The timing of the pardon is very close to the end of a presidential term",
    "No specific reasoning or justification for the pardon is provided",
    "The crimes pardoned involve serious charges of conspiracy and witness tampering",
    "The pardon was issued relatively soon after sentencing (about 4 months)"
  ],
  "citations": [
    "U.S. Constitution Article II, Section 2, Clause 1",
    "18 USC § 371",
    "18 USC § 1512",
    "Case No. 1:21-cr-00598-PLF"
  ],
  "action_type": "Executive Grant of Clemency",
  "file_name": "executive-grant-of-clemency-for-andrew-zabavsky"
}