{
  "title": "Executive Grant of Clemency for Terence Sutton – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nExecutive Grant of Clemency for TERENCE SUTTON\n==============================================\n\nJanuary 22, 2025 \n\n\n\n| Executive Grant of Clemency**Donald J. Trump*****President of the United States of America***To All to Whom These Presents Shall Come, Greeting:**Be it Known, that This Day, I, Donald J. Trump, President of the United States, Pursuant to My Powers Under Article II, Section 2, Clause 1, of the Constitution, Have Granted Unto**TERENCE SUTTON**A Full and Unconditional Pardon** **For His** **convictions** in the United States District Court for the District of Columbia, on an indictment (Docket No. 1:21-cr-00598-PLF), of violations of section 2103, title 22, District of Columbia Code; section 371, title 18, United States Code; and section 1512, title 18, United States Code; for which he was sentenced on September 12, 2024, to 66, 48, and 48 months of imprisonment, respectively (all to run concurrently); 3 years of supervised release; and a special assessment of three hundred dollars ($300). **I HEREBY DESIGNATE**, direct, and empower, the Pardon Attorney, as my representative, to sign a grant of clemency to the person named herein. The Pardon Attorney shall declare that her action is the act of the President, being performed at my direction. **IN TESTIMONY WHEREOF**, I have hereunto signed my name and caused the seal of the Department of Justice to be affixed. Done at the City of Washington in the District of Columbia this 22nd day of January in the Year of our Lord two thousand twenty-five, and of the Independence of the United States the two hundred forty-ninth. |\n| --- |\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Executive Grant of Clemency for Terence Sutton – The White House",
  "og:description": "Executive Grant of ClemencyDonald J. TrumpPresident of the United States of AmericaTo All to Whom These Presents Shall Come, Greeting:   ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/executive-grant-of-clemency-for-terence-sutton/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T23:19:33+00:00",
  "article:modified_time": "2025-01-22T23:19:34+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This document is an Executive Grant of Clemency (pardon) issued by President Donald J. Trump to Terence Sutton on January 22, 2025. The pardon absolves Sutton of convictions in the U.S. District Court for D.C. related to violations of DC Code §2103, 18 USC §371, and 18 USC §1512. Sutton had been sentenced to concurrent terms of 66 and 48 months imprisonment, 3 years supervised release, and a $300 special assessment. The pardon is full and unconditional, issued under the President's Constitutional powers of Article II, Section 2, Clause 1.",
  "eli5": "The President used his special power to forgive someone named Terence Sutton who was in trouble with the law and had been sent to prison. This means Mr. Sutton is now forgiven and doesn't have to finish his prison time.",
  "keywords": [
    "pardon",
    "clemency",
    "criminal justice",
    "presidential power",
    "constitutional authority",
    "federal conviction",
    "District of Columbia",
    "executive action"
  ],
  "issues": [
    "The pardon is dated January 22, 2025, which is in the future",
    "The document assumes Donald Trump will be President in 2025",
    "No context is provided about the nature of the underlying crimes",
    "The conviction date (September 12, 2024) is also in the future"
  ],
  "citations": [
    "U.S. Constitution Article II, Section 2, Clause 1",
    "DC Code §2103",
    "18 USC §371",
    "18 USC §1512",
    "U.S. District Court Case No. 1:21-cr-00598-PLF"
  ],
  "action_type": "Executive Grant of Clemency",
  "file_name": "executive-grant-of-clemency-for-terence-sutton"
}