{
  "title": "FACT SHEET: President Donald J. Trump Protects the States and the American People by Closing the Border to Illegals via Proclamation – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nFACT SHEET: President Donald J. Trump Protects the States and the American People by Closing the Border to Illegals via Proclamation\n====================================================================================================================================\n\nJanuary 22, 2025 \n\n\n\nGUARANTEEING THE STATES PROTECTION AGAINST INVASION: Today, President Trump signed an Executive Order that suspends the physical entry of aliens engaged in an invasion of the United States through the southern border.\n\n* In joining the Union, the States agreed to surrender much of their sovereignty in exchange for the federal government’s promise in Article IV, Section 4 of the U.S. Constitution, to “protect each of [the States] against Invasion.”\n* States, such as the Great State of Texas, have asked the Federal Government for protection against invasion during the Biden Administration, but it failed to protect them from millions of illegal aliens entering the United States, invading their communities, and imposing billions of dollars of costs upon State and local governments.\n* The President has the authority under the Immigration and Nationality Act, as well as inherent authority under Article II of the Constitution, to prevent the physical entry of illegal aliens into the United States across the southern border.\n\nDIRECTION TO IMMEDIATELY REPEL, REPATRIATE, AND REMOVE ILLEGAL ALIENS INVOLVED IN AN INVASION:\n\n* Through the exercise of his authority under the Immigration and Nationality Act and the Constitution of the United States, President Trump is authorizing and directing the Department of Homeland Security, the Department of Justice, and the Department of State to take all necessary action to immediately repel, repatriate, and remove illegal aliens across the southern border of the United States.\n* Through the exercise of his authority, President Trump has further restricted access to the provisions of the immigration laws that would enable any illegal alien involved in an invasion across the southern border of the United States to remain in the United States, such as asylum.\n\nPROMISES KEPT: In 2024, President Trump promised to “seal the border on Day 1.”\n\n* As President Trump described in 2018: “Illegal immigration affects the lives of all Americans. Illegal immigration hurts American workers; burdens American taxpayers; and undermines public safety; and places enormous strain on local schools, hospitals, and communities in general, taking precious resources away from the poorest Americans who need them most. Illegal immigration costs our country billions and billions of dollars each year…And I will therefore take every lawful action at my disposal to address this crisis. And that’s what we’re doing.”\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "FACT SHEET: President Donald J. Trump Protects the States and the American People by Closing the Border to Illegals via Proclamation – The White House",
  "og:description": "GUARANTEEING THE STATES PROTECTION AGAINST INVASION: Today, President Trump signed an Executive Order that suspends the physical entry of aliens engaged",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/fact-sheet-president-donald-j-trump-protects-the-states-and-the-american-people-by-closing-the-border-to-illegals-via-proclamation/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T20:18:20+00:00",
  "article:modified_time": "2025-01-22T20:18:21+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Presidential action outlines an Executive Order aimed at addressing illegal immigration at the southern border. The order cites constitutional authority under Article IV, Section 4 and Article II, along with the Immigration and Nationality Act, to authorize immediate action to repel and remove individuals entering illegally. The order specifically references states' rights to protection against invasion and claims the Biden Administration failed to provide such protection. It directs multiple federal departments (DHS, DOJ, State) to take immediate action and restricts access to immigration provisions like asylum for those crossing the southern border illegally.",
  "eli5": "The President made a rule saying that people who try to enter the country without permission at the southern border will be sent back right away. It's like putting up a 'keep out' sign and having guards make sure no one comes in without following the rules.",
  "keywords": [
    "immigration",
    "border security",
    "southern border",
    "states rights",
    "federal protection",
    "asylum",
    "illegal entry",
    "deportation",
    "constitutional authority",
    "homeland security"
  ],
  "issues": [
    "Potential legal challenges regarding constitutional interpretation of 'invasion'",
    "Questions about implementation and enforcement mechanisms",
    "Humanitarian concerns regarding asylum restrictions",
    "Jurisdictional conflicts between federal and state authorities",
    "Practical logistics of immediate removal policies",
    "Potential international law implications",
    "Budget and resource allocation concerns"
  ],
  "citations": [
    "U.S. Constitution Article IV, Section 4",
    "U.S. Constitution Article II",
    "Immigration and Nationality Act",
    "Reference to 2018 presidential statement",
    "Reference to 2024 campaign promise"
  ],
  "action_type": "Executive Order",
  "file_name": "fact-sheet-president-donald-j-trump-protects-the-states-and-the-american-people-by-closing-the-border-to-illegals-via-proclamation"
}