{
  "title": "Fact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nFact Sheet: President Donald J. Trump Rescinds Initial List of Harmful Biden Executive Actions\n==============================================================================================\n\nJanuary 22, 2025 \n\n\n\n**ENDING RADICAL ideology and bad governance:** Today, President Donald J. Trump signed an Executive Order rescinding a record number of damaging executive actions issued by the prior administration.\n\n* This Executive Order rescinds 78 executive actions signed by President Biden, most of them executive orders.\n  + In comparison, President Biden issued 77 executive orders in his entire first year.\n* The 78 rescinded actions cover all manner of policy, with highlights eliminating radical DEI ideology, open border policies, and climate extremism from our federal government.\n  + The American people can expect even more rescissions in the year, as the Order directs review of all of President Biden’s executive actions.\n\n**The Biden Administration caused record damage:** Policies flowing from Biden Executive Orders have made our Country Less Secure, Less Prosperous, and Less United.  A Golden Age for America starts today.  \n\n* President Trump is working to reverse some of Biden’s most harmful policies:\n  + Racial equity: Several EOs (including President Biden’s first EO) imposed illegal racial equity requirements across all levels of government.\n  + Open border policies: Several EOs mandated catch-and-release, stopped deportations of criminals, imported overwhelming numbers of unvetted refugees into local communities, and granted taxpayer-funded benefits to illegal aliens.\n  + Anti-energy climate activism: Several EOs imposed crushing emissions standards designed to end gas powered vehicles, set an electric vehicle mandate by 2030, cancel the Keystone Pipeline, stop drilling, and prevent permitting.\n\n**PRESIDENT trump WILL MAKE AMERICA GREAT AGAIN**\n\n* President Trump: “I can undo almost everything Biden did, he through executive order. And on day one, much of that will be undone.”\n* President Trump: “We will terminate every diversity, equity, and inclusion program across the entire federal government.”\n* President Trump: “On day one, I will terminate every open border policy of crooked Joe Biden and the Biden administration.” “We’re going to have a great border, we’re going to have more energy than you’ve ever had, and we’re never going back.”\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis – The White House",
  "og:description": "ENDING RADICAL ideology and bad governance: Today, President Donald J. Trump signed an Executive Order rescinding a record number of damaging executive",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/fact-sheet-president-donald-j-trump-delivers-emergency-price-relief-for-american-families-to-defeat-the-cost-of-living-crisis-2/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T19:41:52+00:00",
  "article:modified_time": "2025-01-22T19:41:53+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This document outlines President Trump's Executive Order that rescinds 78 executive actions previously issued by President Biden. The order primarily targets three policy areas: Diversity, Equity and Inclusion (DEI) initiatives across federal government, immigration/border policies, and climate/energy regulations. The order specifically aims to eliminate what it characterizes as 'radical DEI ideology,' reverse catch-and-release immigration policies, halt refugee programs, eliminate emissions standards, and reverse electric vehicle mandates. The order also initiates a comprehensive review of all Biden administration executive actions for potential future rescission.",
  "eli5": "The new president (Trump) signed a paper that cancels out many rules the last president (Biden) made. It's like erasing what was written before and writing new rules about things like immigration, climate change, and how the government treats different groups of people.",
  "keywords": [
    "Executive Order",
    "Rescission",
    "DEI",
    "Immigration",
    "Border Security",
    "Climate Policy",
    "Energy Policy",
    "Federal Government",
    "Racial Equity",
    "Environmental Regulations"
  ],
  "issues": [
    "No specific details provided about which 78 executive actions are being rescinded",
    "Lack of transition plan or implementation timeline",
    "Potential legal challenges to wholesale rescission of previous orders",
    "No clear explanation of how existing programs will be wound down",
    "Possible administrative and operational disruption across federal agencies",
    "No cost analysis or impact assessment provided"
  ],
  "citations": [],
  "action_type": "Executive Order",
  "file_name": "fact-sheet-president-donald-j-trump-delivers-emergency-price-relief-for-american-families-to-defeat-the-cost-of-living-crisis-2"
}