{
  "title": "Fact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nFact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis\n===============================================================================================================================\n\nJanuary 22, 2025 \n\n\n\nDELIVERING EMERGENCY PRICE RELIEF: Today, President Donald J. Trump signed a Presidential Memorandum to deliver emergency price relief for American families and defeat the cost-of-living crisis.\n\n* The Presidential Memorandum recognizes a critical component of the crushing cost of everyday living. The Biden Administration imposed complex regulatory burdens and radical policies designed to weaken American production.\n* President Trump is ordering all Federal agencies to untangle the American economy from Biden constraints and improve affordability of necessary goods and services and increase the prosperity of the American workers.\n* This includes action to:\n  + Drastically lower the cost of housing and expand housing supply;\n  + Eliminate unnecessary administrative expenses and rent-seeking practices that drive up healthcare costs;\n  + Eliminate counterproductive requirements raising the costs of home appliances;\n  + Create employment opportunities for American workers including drawing discouraged workers into the labor force; and\n  + Eliminate harmful, coercive “climate” policies driving up the costs of food and fuel.\n\nENDING BIDEN’S WAR ON AFFORDABILITY: The Biden Administration’s destructive policies inflicted an historic inflation crisis on the American people.\n\n* Hardworking families are overwhelmed today by the cost of fuel, food, housing, automobiles, medical care, utilities, and insurance.\n* Unprecedented regulatory oppression from the Biden Administration has imposed almost $50,000 in costs on the average American household, whereas President Trump’s first-term agenda reduced regulatory costs by almost $11,000 per household.\n* Americans are unable to purchase homes at historic rates, in part due to regulatory requirements that alone account for 25 percent of the cost of constructing a new home.\n* Biden’s assault on plentiful and reliable American energy through impossible, unnecessary, and illegal regulatory demands have driven up the cost of transportation and manufacturing.\n  + Biden’s war on energy has been a war on American consumers. American households are paying an average of $1,200 more per year in energy costs under President Biden’s policies. Since he took office, total energy costs rose by 36%, gasoline rose 41%, home energy costs rose 30%, electricity bills rose 29%, and gas bills rose 34%.\n  + After averaging just $2.77 per gallon under President Trump, and a price of $2.33 upon leaving office, the price of gasoline skyrocketed under President Biden, reaching $3.33 a year later. It went on to reach a peak at $5.00 per gallon and remains elevated today.\n* The unlawful regulatory mandate on companies to eliminate gas-powered vehicles has resulted in artificial price increases in order to subsidize electric vehicles, largely disfavored by consumers.\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Fact Sheet: President Donald J. Trump Delivers Emergency Price Relief for American Families to Defeat the Cost-of-Living Crisis – The White House",
  "og:description": "DELIVERING EMERGENCY PRICE RELIEF: Today, President Donald J. Trump signed a Presidential Memorandum to deliver emergency price relief for American",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/fact-sheet-president-donald-j-trump-delivers-emergency-price-relief-for-american-families-to-defeat-the-cost-of-living-crisis/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-22T19:40:05+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "President Trump issued a Presidential Memorandum aimed at addressing the cost-of-living crisis by directing federal agencies to reverse regulatory burdens implemented during the Biden Administration. The memorandum focuses on reducing costs in key sectors including housing, healthcare, appliances, and energy. The document outlines specific areas where Biden-era policies allegedly increased costs for American households, citing statistics about energy price increases and regulatory burden costs. The memorandum directs agencies to eliminate what it terms as unnecessary administrative expenses and counterproductive requirements, particularly focusing on climate policies that the administration claims have driven up costs.",
  "eli5": "The President wrote a special note telling government workers to change rules that make things expensive for families. He wants to make things like houses, doctor visits, and gas cost less money by getting rid of complicated rules.",
  "keywords": [
    "cost-of-living",
    "inflation",
    "regulatory reform",
    "housing costs",
    "healthcare costs",
    "energy prices",
    "administrative burden",
    "climate policy",
    "economic relief",
    "consumer protection"
  ],
  "issues": [
    "No specific metrics or timelines provided for implementation",
    "Lacks detailed explanation of how agencies should implement changes",
    "Claims about regulatory costs need verification",
    "Political rhetoric may overshadow policy substance",
    "No clear funding mechanism identified",
    "Potential conflicts with existing environmental regulations",
    "Questions about legal authority to override existing regulations"
  ],
  "citations": [],
  "action_type": "Presidential Memorandum",
  "file_name": "fact-sheet-president-donald-j-trump-delivers-emergency-price-relief-for-american-families-to-defeat-the-cost-of-living-crisis"
}