{
  "title": "Granting Pardons And Commutation Of Sentences For Certain Offenses Relating To The Events At Or Near The United States Capitol On January 6, 2021 – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nGRANTING PARDONS AND COMMUTATION OF SENTENCES FOR CERTAIN OFFENSES RELATING TO THE EVENTS AT OR NEAR THE UNITED STATES CAPITOL ON JANUARY 6, 2021\n=================================================================================================================================================\n\nJanuary 20, 2025 \n\n\n\nBY THE PRESIDENT OF THE UNITED STATES OF AMERICA\n\nA PROCLAMATION\n\nThis proclamation ends a grave national injustice that has been perpetrated upon the American people over the last four years and begins a process of national reconciliation.\n\nActing pursuant to the grant of authority in Article II, Section 2, of the Constitution of the United States, I do hereby:\n\n(a)  commute the sentences of the following individuals convicted of offenses related to events that occurred at or near the United States Capitol on January 6, 2021, to time served as of January 20, 2025:\n\n•    Stewart Rhodes\n\n•    Kelly Meggs\n\n•    Kenneth Harrelson\n\n•    Thomas Caldwell\n\n•    Jessica Watkins\n\n•    Roberto Minuta\n\n•    Edward Vallejo\n\n•    David Moerschel\n\n•    Joseph Hackett\n\n•    Ethan Nordean\n\n•    Joseph Biggs\n\n•    Zachary Rehl\n\n•    Dominic Pezzola\n\n•    Jeremy Bertino\n\n(b)  grant a full, complete and unconditional pardon to all other individuals convicted of offenses related to events that occurred at or near the United States Capitol on January 6, 2021;\n\nThe Attorney General shall administer and effectuate the immediate issuance of certificates of pardon to all individuals described in section (b) above, and shall ensure that all individuals convicted of offenses related to events that occurred at or near the United States Capitol on January 6, 2021, who are currently held in prison are released immediately.  The Bureau of Prisons shall immediately implement all instructions from the Department of Justice regarding this directive.\n\nI further direct the Attorney General to pursue dismissal with prejudice to the government of all pending indictments against individuals for their conduct related to the events at or near the United States Capitol on January 6, 2021.  The Bureau of Prisons shall immediately implement all instructions from the Department of Justice regarding this directive.\n\nIN WITNESS WHEREOF, I have hereunto set my hand this\n\ntwentieth day of January, in the year of our Lord two thousand twenty-five, and of the Independence of the United States of America the two hundred and forty-ninth.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Granting Pardons And Commutation Of Sentences For Certain Offenses Relating To The Events At Or Near The United States Capitol On January 6, 2021 – The White House",
  "og:description": "BY THE PRESIDENT OF THE UNITED STATES OF AMERICA A PROCLAMATION This proclamation ends a grave national injustice that has been perpetrated upon the",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:03:42+00:00",
  "article:modified_time": "2025-01-21T02:26:07+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Presidential Proclamation, dated January 20, 2025, exercises the President's constitutional pardon power under Article II, Section 2 to address convictions related to the January 6, 2021 Capitol events. The proclamation has two main components: (1) commuting the sentences to time served for 14 specifically named individuals, and (2) granting full, unconditional pardons to all other individuals convicted of January 6-related offenses. The Attorney General is directed to issue pardon certificates, ensure immediate release of imprisoned individuals, and pursue dismissal of pending indictments related to January 6 events.",
  "eli5": "The President used their special power to forgive people who got in trouble during the events at the Capitol building on January 6, 2021. Some people will be let out of jail early, and others will have their records cleared completely.",
  "keywords": [
    "Presidential pardon",
    "Commutation",
    "January 6",
    "Capitol riot",
    "Executive clemency",
    "Constitutional powers",
    "Criminal justice",
    "Federal prosecution",
    "Attorney General",
    "Bureau of Prisons"
  ],
  "issues": [
    "The proclamation appears to be dated in the future (January 20, 2025)",
    "Blanket pardons for unspecified individuals may face legal challenges",
    "No specific criteria provided for determining which cases qualify as 'related to events'",
    "Potential separation of powers concerns regarding directive to dismiss pending cases",
    "No provision for victim consultation or impact consideration",
    "Possible national security implications of pardoning all related offenses"
  ],
  "citations": [
    "U.S. Constitution Article II, Section 2 (Presidential Pardon Power)"
  ],
  "file_name": "granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021"
}