{
  "title": "Initial Rescissions Of Harmful Executive Orders And Actions – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nINITIAL RESCISSIONS OF HARMFUL EXECUTIVE ORDERS AND ACTIONS\n===========================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:\n\nSection 1.  Purpose and Policy.  The previous administration has embedded deeply unpopular, inflationary, illegal, and radical practices within every agency and office of the Federal Government.  The injection of “diversity, equity, and inclusion” (DEI) into our institutions has corrupted them by replacing hard work, merit, and equality with a divisive and dangerous preferential hierarchy.  Orders to open the borders have endangered the American people and dissolved Federal, State, and local resources that should be used to benefit the American people.  Climate extremism has exploded inflation and overburdened businesses with regulation.\n\nTo commence the policies that will make our Nation united, fair, safe, and prosperous again, it is the policy of the United States to restore common sense to the Federal Government and unleash the potential of the American citizen.  The revocations within this order will be the first of many steps the United States Federal Government will take to repair our institutions and our economy.\n\nSec. 2.  Revocation of Orders and Actions.  The following executive actions are hereby revoked:\n\n* Executive Order 13985 of January 20, 2021 (Advancing Racial Equity and Support for Underserved Communities Through the Federal Government).\n* Executive Order 13986 of January 20, 2021 (Ensuring a Lawful and Accurate Enumeration and Apportionment Pursuant to the Decennial Census).\n* Executive Order 13987 of January 20, 2021 (Organizing and Mobilizing the United States Government To Provide a Unified and Effective Response To Combat COVID-19 and To Provide United States Leadership on Global Health and Security).\n* Executive Order 13988 of January 20, 2021 (Preventing and Combating Discrimination on the Basis of Gender Identity or Sexual Orientation).\n* Executive Order 13989 of January 20, 2021 (Ethics Commitments by Executive Branch Personnel).\n* Executive Order 13990 of January 20, 2021 (Protecting Public Health and the Environment and Restoring Science To Tackle the Climate Crisis).\n* Executive Order 13992 of January 20, 2021 (Revocation of Certain Executive Orders Concerning Federal Regulation).\n* Executive Order 13993 of January 20, 2021 (Revision of Civil Immigration Enforcement Policies and Priorities).\n* Executive Order 13995 of January 21, 2021 (Ensuring an Equitable Pandemic Response and Recovery).\n* Executive Order 13996 of January 21, 2021 (Establishing the COVID-19 Pandemic Testing Board and Ensuring a Sustainable Public Health Workforce for COVID-19 and Other Biological Threats).\n* Executive Order 13997 of January 21, 2021 (Improving and Expanding Access to Care and Treatments for COVID-19).\n* Executive Order 13999 of January 21, 2021 (Protecting Worker Health and Safety).\n* Executive Order 14000 of January 21, 2021 (Supporting the Reopening and Continuing Operation of Schools and Early Childhood Education Providers).\n* Executive Order 14002 of January 22, 2021 (Economic Relief Related to the COVID-19 Pandemic).\n* Executive Order 14003 of January 22, 2021 (Protecting the Federal Workforce).\n* Executive Order 14004 of January 25, 2021 (Enabling All Qualified Americans To Serve Their Country in Uniform).\n* Executive Order 14006 of January 26, 2021 (Reforming Our Incarceration System To Eliminate the Use of Privately Operated Criminal Detention Facilities).\n* Executive Order 14007 of January 27, 2021 (President’s Council of Advisors on Science and Technology).\n* Executive Order 14008 of January 27, 2021 (Tackling the Climate Crisis at Home and Abroad).\n* Executive Order 14009 of January 28, 2021 (Strengthening Medicaid and the Affordable Care Act).\n* Executive Order 14010 of February 2, 2021 (Creating a Comprehensive Regional Framework To Address the Causes of Migration, To Manage Migration Throughout North and Central America, and To Provide Safe and Orderly Processing of Asylum Seekers at the United States Border).\n* Executive Order 14011 of February 2, 2021 (Establishment of Interagency Task Force on the Reunification of Families).\n* Executive Order 14012 of February 2, 2021 (Restoring Faith in Our Legal Immigration Systems and Strengthening Integration and Inclusion Efforts for New Americans).\n* Executive Order 14013 of February 4, 2021 (Rebuilding and Enhancing Programs To Resettle Refugees and Planning for the Impact of Climate Change on Migration).\n* Executive Order 14015 of February 14, 2021 (Establishment of the White House Office of Faith-Based and Neighborhood Partnerships).\n* Executive Order 14018 of February 24, 2021 (Revocation of Certain Presidential Actions).\n* Executive Order 14019 of March 7, 2021 (Promoting Access to Voting).\n* Executive Order 14020 of March 8, 2021 (Establishment of the White House Gender Policy Council).\n* Executive Order 14021 of March 8, 2021 (Guaranteeing an Educational Environment Free From Discrimination on the Basis of Sex, Including Sexual Orientation or Gender Identity).\n* Executive Order 14022 of April 1, 2021 (Termination of Emergency With Respect to the International Criminal Court).\n* Executive Order 14023 of April 9, 2021 (Establishment of the Presidential Commission on the Supreme Court of the United States).\n* Executive Order 14027 of May 7, 2021 (Establishment of the Climate Change Support Office).\n* Executive Order 14029 of May 14, 2021 (Revocation of Certain Presidential Actions and Technical Amendment).\n* Executive Order 14030 of May 20, 2021 (Climate-Related Financial Risk).\n* Executive Order 14031 of May 28, 2021 (Advancing Equity, Justice, and Opportunity for Asian Americans, Native Hawaiians, and Pacific Islanders).\n* Executive Order 14035 of June 25, 2021 (Diversity, Equity, Inclusion, and Accessibility in the Federal Workforce).\n* Executive Order 14037 of August 5, 2021 (Strengthening American Leadership in Clean Cars and Trucks).\n* Executive Order 14044 of September 13, 2021 (Amending Executive Order 14007).\n* Executive Order 14045 of September 13, 2021 (White House Initiative on Advancing Educational Equity, Excellence, and Economic Opportunity for Hispanics).\n* Executive Order 14049 of October 11, 2021 (White House Initiative on Advancing Educational Equity, Excellence, and Economic Opportunity for Native Americans and Strengthening Tribal Colleges and Universities).\n* Executive Order 14050 of October 19, 2021 (White House Initiative on Advancing Educational Equity, Excellence, and Economic Opportunity for Black Americans).\n* Executive Order 14052 of November 15, 2021 (Implementation of the Infrastructure Investment and Jobs Act).\n* Executive Order 14055 of November 18, 2021 (Nondisplacement of Qualified Workers Under Service Contracts).\n* Executive Order 14057 of December 8, 2021 (Catalyzing Clean Energy Industries and Jobs Through Federal Sustainability).\n* Executive Order 14060 of December 15, 2021 (Establishing the United States Council on Transnational Organized Crime).\n* Executive Order 14069 of March 15, 2022 (Advancing Economy, Efficiency, and Effectiveness in Federal Contracting by Promoting Pay Equity and Transparency).\n* Executive Order 14070 of April 5, 2022 (Continuing To Strengthen Americans’ Access to Affordable, Quality Health Coverage).\n* Executive Order 14074 of May 25, 2022 (Advancing Effective, Accountable Policing and Criminal Justice Practices To Enhance Public Trust and Public Safety).\n* Executive Order 14075 of June 15, 2022 (Advancing Equality for Lesbian, Gay, Bisexual, Transgender, Queer, and Intersex Individuals).\n* Executive Order 14082 of September 12, 2022 (Implementation of the Energy and Infrastructure Provisions of the Inflation Reduction Act of 2022).\n* Executive Order 14084 of September 30, 2022 (Promoting the Arts, the Humanities, and Museum and Library Services).\n* Executive Order 14087 of October 14, 2022 (Lowering Prescription Drug Costs for Americans).\n* Executive Order 14089 of December 13, 2022 (Establishing the President’s Advisory Council on African Diaspora Engagement in the United States).\n* Executive Order 14091 of February 16, 2023 (Further Advancing Racial Equity and Support for Underserved Communities Through the Federal Government).\n* The Presidential Memorandum of March 13, 2023 (Withdrawal of Certain Areas off the United States Arctic Coast of the Outer Continental Shelf from Oil or Gas Leasing).\n* Executive Order 14094 of April 6, 2023 (Modernizing Regulatory Review).\n* Executive Order 14096 of April 21, 2023 (Revitalizing Our Nation’s Commitment to Environmental Justice for All).\n* Executive Order 14099 of May 9, 2023 (Moving Beyond COVID-19 Vaccination Requirements for Federal Workers).\n* Executive Order 14110 of October 30, 2023 (Safe, Secure, and Trustworthy Development and Use of Artificial Intelligence).\n* Executive Order 14115 of February 1, 2024 (Imposing Certain Sanctions on Persons Undermining Peace, Security, and Stability in the West Bank).\n* Executive Order 14124 of July 17, 2024 (White House Initiative on Advancing Educational Equity, Excellence, and Economic Opportunity Through Hispanic-Serving Institutions).\n* Executive Order 14134 of January 3, 2025 (Providing an Order of Succession Within the Department of Agriculture).\n* Executive Order 14135 of January 3, 2025 (Providing an Order of Succession Within the Department of Homeland Security).\n* Executive Order 14136 of January 3, 2025 (Providing an Order of Succession Within the Department of Justice).\n* Executive Order 14137 of January 3, 2025 (Providing an Order of Succession Within the Department of the Treasury).\n* Executive Order 14138 of January 3, 2025 (Providing an Order of Succession Within the Office of Management and Budget).\n* Executive Order 14139 of January 3, 2025 (Providing an Order of Succession Within the Office of the National Cyber Director).\n* The Presidential Memorandum of January 3, 2025 (Designation of Officials of the Council on Environmental Quality to Act as Chairman).\n* The Presidential Memorandum of January 3, 2025 (Designation of Officials of the Office of Personnel Management to Act as Director).\n* The Presidential Memorandum of January 3, 2025 (Designation of Officials of the Office of Science and Technology Policy to Act as Director).\n* The Presidential Memorandum of January 3, 2025 (Designation of Officials of the United States Agency for Global Media to Act as Chief Executive Officer).\n* The Presidential Memorandum of January 3, 2025 (Designation of Officials of the United States Agency for International Development to Act as Administrator).\n* The Presidential Memorandum of January 3, 2025 (Designation of Officials of the United States International Development Finance Corporation to Act as Chief Executive Officer).\n* The Presidential Memorandum of January 6, 2025 (Withdrawal of Certain Areas of the United States Outer Continental Shelf from Oil or Natural Gas Leasing).\n* The Presidential Memorandum of January 6, 2025 (Withdrawal of Certain Areas of the United States Outer Continental Shelf from Oil or Natural Gas Leasing).\n* The Presidential Memorandum of January 14, 2025 (Certification of Rescission of Cuba’s Designation as a State Sponsor of Terrorism).\n* The Presidential Memorandum of January 14, 2025 (Revocation of National Security Presidential Memorandum 5).\n* Executive Order 14143 of January 16, 2025 (Providing for the Appointment of Alumni of AmeriCorps to the Competitive Service).\n\nSec. 3.  Implementation.  (a)  To effectuate the revocations described in section 2 of this order, the heads of each agency shall take immediate steps to end Federal implementation of unlawful and radical DEI ideology.\n\n(b) The Director of the Domestic Policy Council (DPC) and the Director of the National Economic Council (NEC) shall review all Federal Government actions taken pursuant to the orders, memoranda, and proclamations listed in section 2 of this order and take necessary steps to rescind, replace, or amend such actions as appropriate.  Within 45 days of the date of this order, the Director of the DPC and the Director of the NEC shall submit to the President an additional list of orders, memoranda, and proclamations issued by the prior administration that should be rescinded, as well as a list of replacement orders, memoranda, or proclamations, to increase American prosperity.\n\n(c)  The National Security Advisor (NSA) shall immediately begin a complete and thorough review of all National Security Memoranda (NSMs) issued from January 20, 2021, through January 20, 2025, for harm to national security, domestic resilience, and American values.  No later than 45 days from the date of this order, the NSA shall recommend to the President NSMs for rescission.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Initial Rescissions Of Harmful Executive Orders And Actions – The White House",
  "og:description": "    By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/initial-rescissions-of-harmful-executive-orders-and-actions/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:53:21+00:00",
  "article:modified_time": "2025-01-21T00:01:50+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order, dated January 20, 2025, represents a significant policy shift by revoking numerous Executive Orders and Presidential Memoranda issued during the previous administration (2021-2025). The order specifically targets and rescinds policies related to diversity, equity and inclusion (DEI), climate change, immigration, COVID-19 response, healthcare, education, and various administrative appointments. The stated purpose is to 'restore common sense to the Federal Government' by eliminating what the order characterizes as 'deeply unpopular, inflationary, illegal, and radical practices.' The order directs agency heads to immediately cease DEI implementation and requires reviews by the Domestic Policy Council, National Economic Council, and National Security Advisor to identify additional actions for rescission.",
  "eli5": "The new President signed a paper that cancels many rules the last President made. It's like erasing everything on a whiteboard to start fresh with new rules that the new President thinks will work better.",
  "keywords": [
    "Executive Orders",
    "Rescission",
    "DEI",
    "Climate Policy",
    "Immigration",
    "Federal Workforce",
    "Administrative Law",
    "Policy Change",
    "Presidential Powers",
    "Government Reform"
  ],
  "issues": [
    "The broad scope of rescissions may create operational gaps in federal agencies",
    "No transition plan is provided for ongoing programs affected by the rescissions",
    "Potential legal challenges to wholesale policy reversals",
    "Unclear impact on existing contracts and agreements made under previous orders",
    "Potential conflict with existing statutory obligations",
    "No cost-benefit analysis provided for the policy changes"
  ],
  "citations": [
    "Executive Orders 13985-14143",
    "Presidential Memoranda from January 3-14, 2025",
    "Constitution of the United States (referenced but not specifically cited)",
    "National Security Memoranda (referenced but not specifically cited)"
  ],
  "file_name": "initial-rescissions-of-harmful-executive-orders-and-actions"
}