{
  "title": "MARTIN LUTHER KING, JR., FEDERAL HOLIDAY, 2025 – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nMARTIN LUTHER KING, JR., FEDERAL HOLIDAY, 2025\n==============================================\n\nJanuary 20, 2025 \n\n\n\nMartin Luther King, Jr., Federal Holiday, 2025\n\n– – – – – – –\n\nBY THE PRESIDENT OF THE UNITED STATES America\n\nA PROCLAMATION\n\nOver 60 years ago, Dr. Martin Luther King, Jr., courageously climbed the steps of the Lincoln Memorial and shared his dream for our Nation — that we would fulfill our Founding Principle that all men are created equal.  Dr. King dedicated his life to fighting for every American’s right to pursue their own American Dream, and his courage changed the world.  Today, we honor Dr. King’s legacy of leadership, inspiration, and community service by working to ensure all Americans can share in our Nation’s promise of freedom and equality for all.\n\nFrom the humble beginnings of a Baptist church in Georgia, Dr. King’s faith in God was central to his message that every person should be “judged not by the color of their skin, but by the content of their character.”  Dr. King’s powerful preaching inspired millions to join him in the nonviolent protest of a corrupt system.  While helping to lead the Civil Rights Movement, he faced unjust prosecutions, institutional resistance, and violence against himself and his supporters, overcoming these challenges through his faith in God and dedication to our Founding Principles.  Dr. King’s life reminds us that we are, and have always been, a great Nation.\n\nPresident Ronald Reagan first proclaimed a Federal holiday commemorating Dr. King’s extraordinary life almost 40 years ago, and it was my distinct honor as your President to celebrate the 55th anniversary of Dr. King’s iconic “I Have a Dream” speech during my first Administration.  This Martin Luther King Jr. Day is particularly historic too.  As I take the Oath of Office for the second time, I am honored to celebrate Dr. King’s momentous legacy again and recommit my Administration to fighting for the “equality of opportunity” for all Americans.\n\nJust a few short years ago, my Administration achieved the lowest unemployment and poverty rates for black Americans ever recorded to that point.  We won massive funding for historically black colleges and universities, reformed the criminal justice system, and fought for school choice.  Whatever your color, race, religion, or creed, my Administration ensured neighborhoods were safe, families were secure, and jobs were abundant — and we will do it all again.  As Dr. King courageously marched for jobs and freedom, together, with faith in God and committed to our Founding Principles, we will restore the American Dream for all Americans.\n\nNOW, THEREFORE, I, DONALD J. TRUMP, President of the United States of America, by virtue of the authority vested in me by the Constitution and the laws of the United States, do hereby proclaim January 20, 2025, as the Martin Luther King, Jr., Federal Holiday.  On this day, I encourage all Americans to honor Dr. King’s legacy by praying for our Nation and working to restore the American Dream in their communities through acts of service.\n\nIN WITNESS WHEREOF, I have hereunto set my hand this twentieth day of January, in the year of our Lord two thousand twenty-five, and of the Independence of the United States of America the two hundred and forty-ninth.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "MARTIN LUTHER KING, JR., FEDERAL HOLIDAY, 2025 – The White House",
  "og:description": "Martin Luther King, Jr., Federal Holiday, 2025 - - - - - - - BY THE PRESIDENT OF THE UNITED STATES America A PROCLAMATION Over 60 years ago, Dr. Martin",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/martin-luther-king-jr-federal-holiday-2025/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:58:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Proclamation designates January 20, 2025, as the Martin Luther King, Jr., Federal Holiday. President Trump commemorates Dr. King's legacy of civil rights leadership, particularly highlighting his 'I Have a Dream' speech and commitment to nonviolent protest. The proclamation emphasizes Dr. King's faith-based approach to civil rights advocacy and connects his vision to broader American founding principles. The document also references Trump Administration policies claimed to benefit African Americans, including economic metrics and support for historically black colleges and universities. The proclamation encourages Americans to honor Dr. King through prayer and community service.",
  "eli5": "The President made January 20, 2025, a special day to remember Dr. Martin Luther King, Jr., who worked very hard to make sure everyone in America would be treated fairly and equally, no matter what they looked like.",
  "keywords": [
    "Martin Luther King Jr",
    "Civil Rights",
    "Federal Holiday",
    "Equality",
    "Faith",
    "Community Service",
    "American Dream",
    "Founding Principles",
    "Social Justice",
    "Racial Equality"
  ],
  "issues": [
    "The proclamation appears to blend celebration of Dr. King's legacy with political messaging about the administration's achievements",
    "No specific mention of ongoing civil rights challenges or work still needed",
    "Claims about administration achievements are presented without supporting data",
    "The timing (January 20) differs from the traditional MLK Day observance (third Monday in January)"
  ],
  "citations": [
    "Constitution of the United States",
    "Reference to President Ronald Reagan's original MLK Day proclamation"
  ],
  "action_type": "Proclamation",
  "file_name": "martin-luther-king-jr-federal-holiday-2025"
}