{
  "title": "Promoting Beautiful Federal Civic Architecture – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nPromoting Beautiful Federal Civic Architecture\n==============================================\n\nJanuary 20, 2025 \n\n\n\nJanuary 20, 2025\n\nMEMORANDUM FOR THE ADMINISTRATOR OF THE GENERAL SERVICES\n\nADMINISTRATION\n\nSUBJECT:       Promoting Beautiful Federal Civic Architecture\n\nI hereby direct the Administrator of the General Services Administration, in consultation with the Assistant to the President for Domestic Policy and the heads of departments and agencies of the United States where necessary, to submit to me within 60 days recommendations to advance the policy that Federal public buildings should be visually identifiable as civic buildings and respect regional, traditional, and classical architectural heritage in order to uplift and beautify public spaces and ennoble the United States and our system of self-government.  Such recommendations shall consider appropriate revisions to the Guiding Principles for Federal Architecture and procedures for incorporating community input into Federal building design selections.\n\nIf, before such recommendations are submitted, the Administrator of the General Services Administration proposes to approve a design for a new Federal public building that diverges from the policy set forth in this memorandum, the Administrator shall notify me, through the Assistant to the President for Domestic Policy, not less than 30 days before the General Services Administration could reject such design without incurring substantial expenditures.  Such notification shall set forth the reasons the Administrator proposes to approve such design.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Promoting Beautiful Federal Civic Architecture – The White House",
  "og:description": "January 20, 2025 MEMORANDUM FOR THE ADMINISTRATOR OF THE GENERAL SERVICES    ADMINISTRATION SUBJECT:      ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/promoting-beautiful-federal-civic-architecture/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:41:34+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Presidential Memorandum directs the GSA Administrator to provide recommendations within 60 days regarding Federal building architecture. The directive emphasizes that Federal buildings should be visually recognizable as civic structures and reflect regional, traditional, and classical architectural styles. The memorandum requires reviewing and potentially revising the Guiding Principles for Federal Architecture and establishing procedures for community input in design selection. Additionally, it institutes a notification requirement if the GSA Administrator intends to approve designs that deviate from these principles, requiring 30-day advance notice through the Assistant to the President for Domestic Policy.",
  "eli5": "The President wants government buildings to look nice and special, like important buildings should look. Before building new government buildings, they need to check with local people and make sure the buildings look like they belong in that area.",
  "keywords": [
    "Federal architecture",
    "GSA",
    "Civic buildings",
    "Classical architecture",
    "Community input",
    "Design approval",
    "Public spaces",
    "Traditional architecture",
    "Administrative procedure",
    "Government buildings"
  ],
  "issues": [
    "No specific criteria for what constitutes 'beautiful' architecture",
    "Potential conflict between traditional/classical styles and modern architectural innovations",
    "Unclear standards for measuring community input effectiveness",
    "Possible increased costs for implementing classical architectural features",
    "Potential delays in construction due to additional approval requirements",
    "Subjective nature of architectural beauty and style preferences"
  ],
  "citations": [
    "Guiding Principles for Federal Architecture"
  ],
  "file_name": "promoting-beautiful-federal-civic-architecture"
}