{
  "title": "Promoting Beautiful Federal Civic Architecture – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nPromoting Beautiful Federal Civic Architecture\n==============================================\n\nJanuary 20, 2025 \n\n\n\nJanuary 20, 2025\n\nMEMORANDUM FOR THE ADMINISTRATOR OF THE GENERAL SERVICES\n\nADMINISTRATION\n\nSUBJECT:       Promoting Beautiful Federal Civic Architecture\n\nI hereby direct the Administrator of the General Services Administration, in consultation with the Assistant to the President for Domestic Policy and the heads of departments and agencies of the United States where necessary, to submit to me within 60 days recommendations to advance the policy that Federal public buildings should be visually identifiable as civic buildings and respect regional, traditional, and classical architectural heritage in order to uplift and beautify public spaces and ennoble the United States and our system of self-government.  Such recommendations shall consider appropriate revisions to the Guiding Principles for Federal Architecture and procedures for incorporating community input into Federal building design selections.\n\nIf, before such recommendations are submitted, the Administrator of the General Services Administration proposes to approve a design for a new Federal public building that diverges from the policy set forth in this memorandum, the Administrator shall notify me, through the Assistant to the President for Domestic Policy, not less than 30 days before the General Services Administration could reject such design without incurring substantial expenditures.  Such notification shall set forth the reasons the Administrator proposes to approve such design.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Promoting Beautiful Federal Civic Architecture – The White House",
  "og:description": "January 20, 2025 MEMORANDUM FOR THE ADMINISTRATOR OF THE GENERAL SERVICES    ADMINISTRATION SUBJECT:      ",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/promoting-beautiful-federal-civic-architecture/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:41:34+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Presidential Memorandum directs the GSA Administrator to develop recommendations within 60 days for ensuring Federal public buildings embody civic architecture that reflects traditional and classical design elements while respecting regional architectural heritage. The directive aims to make government buildings clearly identifiable and enhance public spaces. The memorandum requires the GSA to consult with the Assistant to the President for Domestic Policy and other agency heads as needed. Additionally, it establishes a notification requirement if the GSA plans to approve designs that deviate from these principles, mandating 30-day advance notice through the Assistant to the President for Domestic Policy before rejecting alternative designs that would incur substantial costs.",
  "eli5": "The President wants government buildings to look nice and special, like important buildings from history. He's asking people to make rules about how to design new government buildings so they look more beautiful and make people proud of their country.",
  "keywords": [
    "architecture",
    "civic buildings",
    "classical design",
    "federal buildings",
    "GSA",
    "public spaces",
    "traditional design",
    "urban planning",
    "architectural heritage",
    "government facilities"
  ],
  "issues": [
    "No specific definition of 'beautiful' or 'classical' architecture is provided",
    "Potential conflict between regional architectural styles and classical design requirements",
    "Cost implications of implementing stricter design requirements not addressed",
    "No clear metrics for measuring success or compliance",
    "Potential limitation on architectural innovation and contemporary design"
  ],
  "citations": [
    "Guiding Principles for Federal Architecture"
  ],
  "action_type": "Presidential Memorandum",
  "file_name": "promoting-beautiful-federal-civic-architecture"
}