{
  "title": "Putting People Over Fish: Stopping Radical Environmentalism to Provide Water to Southern California – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nPutting People over Fish: Stopping RadicalEnvironmentalism to Provide Water to SouthernCalifornia\n=================================================================================================\n\nJanuary 20, 2025 \n\n\n\nJanuary 20, 2025\n\nMEMORANDUM FOR THE SECRETARY OF COMMERCE\n\nTHE SECRETARY OF THE INTERIOR\n\nSUBJECT:       Putting People over Fish:  Stopping Radical\n\nEnvironmentalism to Provide Water to Southern\n\nCalifornia\n\nI hereby direct the Secretary of Commerce and Secretary of the Interior, in consultation with the heads of other departments and agencies of the United States as necessary, to immediately restart the work from my first Administration by the National Marine Fisheries Service, U.S. Fish and Wildlife Service, Bureau of Reclamation, and other agencies to route more water from the Sacramento-San Joaquin Delta to other parts of the state for use by the people there who desperately need a reliable water supply.\n\nDuring my first term, the State of California, at the direction of its Governor, filed a lawsuit to stop my Administration from implementing improvements to California’s water infrastructure.  My Administration’s plan would have allowed enormous amounts of water to flow from the snow melt and rainwater in rivers in Northern California to beneficial use in the Central Valley and Southern California.  This catastrophic halt was allegedly in protection of the Delta smelt and other species of fish.  Today, this enormous water supply flows wastefully into the Pacific Ocean.\n\nThe recent deadly and historically destructive wildfires in Southern California underscore why the State of California needs a reliable water supply and sound vegetation management practices in order to provide water desperately needed there, and why this plan must immediately be reimplemented.\n\nWithin 90 days of the date of this memorandum, the Secretary of Commerce and Secretary of the Interior shall report to me regarding the progress made in implementing the policies in this memorandum and provide any recommendations regarding future implementation.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Putting People Over Fish: Stopping Radical Environmentalism to Provide Water to Southern California – The White House",
  "og:description": "January 20, 2025 MEMORANDUM FOR THE SECRETARY OF COMMERCE THE SECRETARY OF THE INTERIOR  SUBJECT:       Putting People",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/putting-people-over-fish-stopping-radical-environmentalism-to-provide-water-to-southern-california/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:39:45+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Presidential Memorandum directs the Secretaries of Commerce and Interior to resume previous efforts to redirect water from the Sacramento-San Joaquin Delta to other parts of California, particularly the Central Valley and Southern California. The memo specifically challenges California's previous lawsuit that halted these water infrastructure improvements during the prior administration, which were stopped due to concerns about protecting the Delta smelt and other fish species. The memorandum argues that the current situation results in wasteful water flow into the Pacific Ocean and cites recent wildfires as evidence of Southern California's urgent need for a reliable water supply. The directive requires the Secretaries to report back within 90 days on implementation progress and recommendations.",
  "eli5": "The President wants to change how water flows in California to help more people get the water they need, even though some people are worried this might hurt fish that live in the rivers. It's like choosing whether to share a glass of water with thirsty people or save it for fish in an aquarium.",
  "keywords": [
    "water rights",
    "environmental protection",
    "California",
    "Delta smelt",
    "water infrastructure",
    "Sacramento-San Joaquin Delta",
    "wildlife conservation",
    "drought management",
    "wildfire prevention",
    "federal-state relations"
  ],
  "issues": [
    "Potential conflict between federal and state environmental policies",
    "Environmental impact on endangered species",
    "Balance between human water needs and ecosystem preservation",
    "Legal authority to override state environmental protections",
    "Scientific basis for environmental impact assessments",
    "Long-term sustainability of water redistribution plan",
    "Potential economic impact on fishing industries",
    "Implementation timeline feasibility"
  ],
  "citations": [],
  "file_name": "putting-people-over-fish-stopping-radical-environmentalism-to-provide-water-to-southern-california"
}