{
  "title": "Readout of President Donald J. Trump Call with Crown Prince Mohammad Bin Salman – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nReadout of President Donald J. Trump Call with Crown Prince Mohammad Bin Salman\n===============================================================================\n\nJanuary 23, 2025 \n\n\n\nOn Wednesday, President Donald J. Trump held his first foreign leader call with Crown Prince Mohammad Bin Salman of the Kingdom of Saudi Arabia. The two leaders discussed efforts to bring stability to the Middle East, bolster regional security, and combat terrorism. Additionally, they discussed the Kingdom of Saudi Arabia’s international economic ambitions over the next four years as well as trade and other opportunities to increase the mutual prosperity of the United States and the Kingdom of Saudi Arabia.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Readout of President Donald J. Trump Call with Crown Prince Mohammad Bin Salman – The White House",
  "og:description": "On Wednesday, President Donald J. Trump held his first foreign leader call with Crown Prince Mohammad Bin Salman of the Kingdom of Saudi Arabia. The two",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/readout-of-president-donald-j-trump-call-with-crown-prince-mohammad-bin-salman/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-23T16:25:09+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This document is a readout summarizing President Trump's first foreign leader call with Crown Prince Mohammad Bin Salman of Saudi Arabia in January 2025. The call focused on diplomatic and economic relations between the United States and Saudi Arabia, specifically addressing Middle East stability, regional security, counterterrorism efforts, and bilateral trade opportunities. The leaders also discussed Saudi Arabia's international economic plans for the upcoming four-year period.",
  "eli5": "The President of the United States had a phone call with the leader of Saudi Arabia. They talked about keeping their countries safe, fighting bad guys, and helping both countries make more money by working together.",
  "keywords": [
    "Foreign Relations",
    "Saudi Arabia",
    "Middle East",
    "National Security",
    "Counterterrorism",
    "International Trade",
    "Economic Development",
    "Diplomatic Communications"
  ],
  "issues": [
    "This appears to be dated in 2025, which is a future date",
    "No specific details about concrete agreements or outcomes are provided",
    "Lacks information about any specific security or economic initiatives discussed",
    "No mention of human rights concerns or regional conflicts"
  ],
  "citations": [],
  "action_type": "Presidential Action - Diplomatic Readout",
  "file_name": "readout-of-president-donald-j-trump-call-with-crown-prince-mohammad-bin-salman"
}