{
  "title": "Reforming The Federal Hiring Process And Restoring Merit To Government Service – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nREFORMING THE FEDERAL HIRING PROCESS AND RESTORING MERIT TO GOVERNMENT SERVICE\n==============================================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nREFORMING THE FEDERAL HIRING PROCESS AND RESTORING MERIT TO GOVERNMENT SERVICE\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including sections 3301, 3302, and 7511 of title 5, United States Code, it is hereby ordered:\n\nSection 1.  Policy.  American citizens deserve an excellent and efficient Federal workforce that attracts the highest caliber of civil servants committed to achieving the freedom, prosperity, and democratic rule that our Constitution promotes.  But current Federal hiring practices are broken, insular, and outdated.  They no longer focus on merit, practical skill, and dedication to our Constitution.  Federal hiring should not be based on impermissible factors, such as one’s commitment to illegal racial discrimination under the guise of “equity,” or one’s commitment to the invented concept of “gender identity” over sex.  Inserting such factors into the hiring process subverts the will of the People, puts critical government functions at risk, and risks losing the best-qualified candidates.\n\nBy making our recruitment and hiring processes more efficient and focused on serving the Nation, we will ensure that the Federal workforce is prepared to help achieve American greatness, and attracts the talent necessary to serve our citizens effectively.  By significantly improving hiring principles and practices, Americans will receive the Federal resources and services they deserve from the highest-skilled Federal workforce in the world.\n\nSec. 2.  Federal Hiring Plan*.*  (a)  Within 120 days of the date of this order, the Assistant to the President for Domestic Policy, in consultation with the Director of the Office of Management and Budget, the Director of the Office of Personnel Management, and the Administrator of the Department of Government Efficiency (DOGE), shall develop and send to agency heads a Federal Hiring Plan that brings to the Federal workforce only highly skilled Americans dedicated to the furtherance of American ideals, values, and interests.\n\n(b)  This Federal Hiring Plan shall:\n\n(i)    prioritize recruitment of individuals committed to improving the efficiency of the Federal government, passionate about the ideals of our American republic, and committed to upholding the rule of law and the United States Constitution;\n\n(ii)   prevent the hiring of individuals based on their race, sex, or religion, and prevent the hiring of individuals who are unwilling to defend the Constitution or to faithfully serve the Executive Branch;\n\n(iii)  implement, to the greatest extent possible, technical and alternative assessments as required by the Chance to Compete Act of 2024;\n\n(iv)   decrease government-wide time-to-hire to under 80 days;\n\n(v)    improve communication with candidates to provide greater clarity regarding application status, timelines, and feedback, including regular updates on the progress of applications and explanations of hiring decisions where appropriate;\n\n(vi)   integrate modern technology to support the recruitment and selection process, including the use of data analytics to identify trends, gaps, and opportunities in hiring, as well as leveraging digital platforms to improve candidate engagement; and\n\n(vii)  ensure Department and Agency leadership, or their designees, are active participants in implementing the new processes and throughout the full hiring process.\n\n(c)  This Federal Hiring Plan shall include specific agency plans to improve the allocation of Senior Executive Service positions in the Cabinet agencies, the Environmental Protection Agency, the Office of Management and Budget, the Small Business Administration, the Social Security Administration, the National Science Foundation, the Office of Personnel Management, and the General Services Administration, to best facilitate democratic leadership, as required by law, within each agency.\n\n(d)  The Federal Hiring Plan shall provide specific best practices for the human resources function in each agency, which each agency head shall implement, with advice and recommendations as appropriate from DOGE.\n\nSec. 3.  Accountability and Reporting.  (a)  The Director of the Office of Personnel Management shall establish clear performance metrics to evaluate the success of these reforms, and request agency analysis on a regular basis.\n\n(b)  The Office of Personnel Management shall consult with Federal agencies, labor organizations, and other stakeholders to monitor progress and ensure that the reforms are meeting the needs of both candidates and agencies.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)    the authority granted by law to an executive department, agency, or the head thereof;\n\n(ii)   the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals; or\n\n(iii)  the functions of the Board of Governors of the Federal Reserve System or the Federal Open Market Committee relating to its conduct of monetary policy.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Reforming The Federal Hiring Process And Restoring Merit To Government Service – The White House",
  "og:description": "REFORMING THE FEDERAL HIRING PROCESS AND RESTORING MERIT TO GOVERNMENT SERVICE By the authority vested in me as President by the Constitution and the laws",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/reforming-the-federal-hiring-process-and-restoring-merit-to-government-service/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:56:36+00:00",
  "article:modified_time": "2025-01-21T02:16:08+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order aims to reform federal hiring practices by establishing a new Federal Hiring Plan focused on merit-based recruitment. The order directs the creation of a comprehensive plan within 120 days that prioritizes hiring skilled individuals committed to American values and Constitutional principles while explicitly prohibiting hiring decisions based on race, sex, or religion. The plan mandates improvements in hiring efficiency, including reducing time-to-hire to under 80 days, enhancing candidate communication, and modernizing recruitment technology. It establishes oversight mechanisms through OPM and requires specific improvements for Senior Executive Service positions across major federal agencies.",
  "eli5": "The President wants to make it easier and fairer to hire people to work for the government. The new rules say that jobs should go to people who are good at their work and care about America's laws, not based on what they look like or what they believe.",
  "keywords": [
    "Federal hiring",
    "Merit-based employment",
    "Government reform",
    "Civil service",
    "Executive recruitment",
    "Constitutional values",
    "Administrative efficiency",
    "Human resources",
    "Senior Executive Service",
    "Government modernization"
  ],
  "issues": [
    "Potential conflict with existing diversity and inclusion initiatives",
    "Lack of specific metrics for evaluating 'commitment to American ideals'",
    "Implementation challenges for 80-day hiring timeline",
    "Undefined parameters for 'technical and alternative assessments'",
    "Potential legal challenges regarding religious discrimination prevention",
    "Ambiguity in defining 'democratic leadership' requirements",
    "Reference to 'Department of Government Efficiency' which appears to be a new entity"
  ],
  "citations": [
    "5 U.S.C. § 3301",
    "5 U.S.C. § 3302",
    "5 U.S.C. § 7511",
    "Chance to Compete Act of 2024"
  ],
  "file_name": "reforming-the-federal-hiring-process-and-restoring-merit-to-government-service"
}