{
  "title": "Regulatory Freeze Pending Review – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nRegulatory Freeze Pending Review\n================================\n\nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, I hereby order all executive departments and agencies to take the following steps:\n\n(1)  Do not propose or issue any rule in any manner, including by sending a rule to the Office of the *Federal Register* (the “OFR”), until a department or agency head appointed or designated by the President after noon on January 20, 2025, reviews and approves the rule.  The department or agency head may delegate this power of review and approval to any other person so appointed or designated by the President, consistent with applicable law.  The Director or Acting Director of the Office of Management and Budget (the “OMB Director”) may exempt any rule that he deems necessary to address emergency situations or other urgent circumstances, including rules subject to statutory or judicial deadlines that require prompt action.\n\n(2)  Immediately withdraw any rules that have been sent to the OFR but not published in the *Federal Register*, so that they can be reviewed and approved as described in paragraph 1, subject to the exceptions described in paragraph 1.\n\n(3)  Consistent with applicable law and subject to the exceptions described in paragraph 1, consider postponing for 60 days from the date of this memorandum the effective date for any rules that have been published in the *Federal Register**,* or any rules that have been issued in any manner but have not taken effect, for the purpose of reviewing any questions of fact, law, and policy that the rules may raise.  During this 60-day period, where appropriate and consistent with applicable law, consider opening a comment period to allow interested parties to provide comments about issues of fact, law, and policy raised by the rules postponed under this memorandum, and consider reevaluating pending petitions involving such rules.  As appropriate and consistent with applicable law, and where necessary to continue to review these questions of fact, law, and policy, consider further delaying, or publishing for notice and comment, proposed rules further delaying such rules beyond the 60-day period.\n\n(4)  Following the postponement described in paragraph 3, no further action needs to be taken for those rules that raise no substantial questions of fact, law, or policy.  For those rules that raise substantial questions of fact, law, or policy, agencies should notify and take further appropriate action in consultation with the OMB Director.\n\n(5)  Comply in all circumstances with any applicable Executive Orders concerning regulatory management.\n\nAs used in this memorandum, “rule” has the definition set forth in section 551(4), title 5, United States Code.  It also includes any “regulatory action,” as defined in section 3(e) of Executive Order 12866 of September 30, 1993, as amended, and any “guidance document” as defined in section 2(b) of Executive Order 13891 of October 9, 2019 (Promoting the Rule of Law Through Improved Agency Guidance Documents), when that order was in effect.  Thus, the requirements of this memorandum apply not only to “rules” as defined in section 551(4) of title 5, but also to any substantive action by an agency (normally published in the *Federal Register*) that promulgates or is expected to lead to the promulgation of a final rule or regulation, including notices of inquiry, advance notices of proposed rulemaking, and notices of proposed rulemaking.  They shall also apply to any agency statement of general applicability and future effect that sets forth a policy on a statutory, regulatory, or technical issue or an interpretation of a statutory or regulatory issue.\n\nThe OMB Director shall oversee the implementation of this memorandum, and any communications regarding any matters pertaining to this review should be addressed to the OMB Director.  The OMB Director is also authorized to establish a process to review pending collections of information under the Paperwork Reduction Act of 1995, as codified in chapter 35, title 44, United States Code, and to take actions that the OMB Director deems appropriate based on that review, consistent with applicable law.\n\nShould actions be identified that were undertaken before noon on January 20, 2025, that frustrate the purpose underlying this memorandum, I may modify or extend this memorandum, to require that department and agency heads consider taking steps to address those actions.\n\nThe OMB Director is authorized and directed to publish this memorandum in the *Federal Register*.\n\nThis memorandum shall be implemented consistent with applicable law.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Regulatory Freeze Pending Review – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, I hereby order all executive departments and",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/regulatory-freeze-pending-review/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:54:21+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Presidential memorandum implements a regulatory freeze on pending administrative actions at the start of a new presidential administration (January 20, 2025). It directs all executive departments and agencies to: 1) halt proposing or issuing new rules until reviewed by new agency heads; 2) withdraw unpublished rules from the Federal Register; 3) postpone for 60 days the effective date of published but not-yet-effective rules; and 4) review such rules for questions of fact, law, or policy. The OMB Director can exempt rules needed for emergencies or urgent circumstances. The freeze applies broadly to rules, regulatory actions, and guidance documents as defined in various authorities. The memo empowers the OMB Director to oversee implementation and review pending information collections under the Paperwork Reduction Act.",
  "eli5": "When a new president takes office, they want to pause and check all the new rules that government agencies are working on. This memo tells all government departments to stop making new rules until the president's new team can look at them and decide if they're good ideas.",
  "keywords": [
    "regulatory freeze",
    "rulemaking",
    "administrative law",
    "executive agencies",
    "Federal Register",
    "OMB",
    "presidential transition",
    "administrative review",
    "regulatory oversight",
    "regulatory compliance"
  ],
  "issues": [
    "Potential delay of important regulations that may be time-sensitive",
    "Discretionary authority given to OMB Director for emergency exemptions",
    "Impact on ongoing regulatory processes and stakeholder expectations",
    "Scope of review authority for agency heads",
    "Definition of 'substantial questions' of fact, law, or policy is not provided"
  ],
  "citations": [
    "5 U.S.C. § 551(4)",
    "Executive Order 12866 (September 30, 1993)",
    "Executive Order 13891 (October 9, 2019)",
    "Paperwork Reduction Act of 1995",
    "44 U.S.C. Chapter 35"
  ],
  "file_name": "regulatory-freeze-pending-review"
}