{
  "title": "Restoring Freedom Of Speech And Ending Federal Censorship – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nRESTORING FREEDOM OF SPEECH AND ENDING FEDERAL CENSORSHIP\n=========================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, and section 301 of title 3, United States Code, it is hereby ordered as follows:\n\nSection 1.  Purpose.The First Amendment to the United States Constitution, an amendment essential to the success of our Republic, enshrines the right of the American people to speak freely in the public square without Government interference.  Over the last 4 years, the previous administration trampled free speech rights by censoring Americans’ speech on online platforms, often by exerting substantial coercive pressure on third parties, such as social media companies, to moderate, deplatform, or otherwise suppress speech that the Federal Government did not approve.  Under the guise of combatting “misinformation,” “disinformation,” and “malinformation,” the Federal Government infringed on the constitutionally protected speech rights of American citizens across the United States in a manner that advanced the Government’s preferred narrative about significant matters of public debate.  Government censorship of speech is intolerable in a free society.\n\nSec. 2.  Policy.  It is the policy of the United States to:       (a)  secure the right of the American people to engage in constitutionally protected speech;\n\n(b)  ensure that no Federal Government officer, employee, or agent engages in or facilitates any conduct that would unconstitutionally abridge the free speech of any American citizen;\n\n(c)  ensure that no taxpayer resources are used to engage in or facilitate any conduct that would unconstitutionally abridge the free speech of any American citizen; and\n\n(d)  identify and take appropriate action to correct past misconduct by the Federal Government related to censorship of protected speech.\n\nSec. 3.  Ending Censorship of Protected Speech.  (a)  No Federal department, agency, entity, officer, employee, or agent may act or use any Federal resources in a manner contrary to section 2 of this order.\n\n(b)  The Attorney General, in consultation with the heads of executive departments and agencies, shall investigate the activities of the Federal Government over the last 4 years that are inconsistent with the purposes and policies of this order and prepare a report to be submitted to the President, through the Deputy Chief of Staff for Policy, with recommendations for appropriate remedial actions to be taken based on the findings of the report.\n\nSec. 4.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)   the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Restoring Freedom Of Speech And Ending Federal Censorship – The White House",
  "og:description": "     By the authority vested in me as President by the Constitution and the laws of the United States of America, and section 301 of title 3, United",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-freedom-of-speech-and-ending-federal-censorship/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:53:42+00:00",
  "article:modified_time": "2025-01-21T00:01:32+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order, dated January 20, 2025, addresses concerns about federal government interference with free speech rights, particularly regarding online platforms and social media. The order establishes policy prohibiting federal officials from engaging in or facilitating speech censorship, specifically targeting actions taken during the previous administration. It directs the Attorney General to investigate past government activities related to speech suppression and prepare a report with remedial recommendations. The order includes standard provisions limiting its scope and enforcement capabilities while ensuring compliance with existing laws and budget constraints.",
  "eli5": "This is a rule that says the government can't tell people what they can or can't say on the internet, and they're going to look into times when the government might have done that before.",
  "keywords": [
    "First Amendment",
    "Free Speech",
    "Censorship",
    "Social Media",
    "Government Oversight",
    "Online Platforms",
    "Constitutional Rights",
    "Misinformation",
    "Federal Investigation",
    "Executive Authority"
  ],
  "issues": [
    "The order references actions of the 'previous administration' without specific examples",
    "Implementation details and scope of investigation not clearly defined",
    "No specific metrics or standards for identifying speech censorship",
    "Potential overlap with legitimate government content moderation activities",
    "Question of how 'protected speech' will be defined in practice"
  ],
  "citations": [
    "First Amendment to the United States Constitution",
    "Section 301 of title 3, United States Code"
  ],
  "action_type": "Executive Order",
  "file_name": "restoring-freedom-of-speech-and-ending-federal-censorship"
}