{
  "title": "Restoring Accountability To Policy-Influencing Positions Within the Federal Workforce – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nRESTORING ACCOUNTABILITY TO POLICY-INFLUENCING POSITIONS WITHIN THE FEDERAL WORKFORCE\n=====================================================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including sections 3301, 3302, and 7511 of title 5, United States Code, it is hereby ordered as follows:\n\n  \n            Section 1.  Purpose.  Article II of the United States Constitution vests the President with the sole and exclusive authority over the executive branch, including the authority to manage the Federal workforce to ensure effective execution of Federal law.  A critical aspect of this executive function is the responsibility to maintain professionalism and accountability within the civil service.  This accountability is sorely lacking today.  Only 41 percent of civil service supervisors are confident that they can remove an employee who engaged in insubordination or serious misconduct.  Even fewer supervisors –- 26 percent — are confident that they can remove an employee for poor performance.\n\nAccountability is essential for all Federal employees, but it is especially important for those who are in policy-influencing positions.  These personnel are entrusted to shape and implement actions that have a significant impact on all Americans.  Any power they have is delegated by the President, and they must be accountable to the President, who is the only member of the executive branch, other than the Vice President, elected and directly accountable to the American people.  In recent years, however, there have been numerous and well-documented cases of career Federal employees resisting and undermining the policies and directives of their executive leadership.  Principles of good administration, therefore, necessitate action to restore accountability to the career civil service, beginning with positions of a confidential, policy-determining, policy-making, or policy-advocating character.\n\nSec. 2.  Reinstatement of Prior Administration Policy.  Executive Order 13957 of October 21, 2020 (Creating Schedule F in the Excepted Service), is hereby immediately reinstated with full force and effect, subject to the amendments described in section 3 of this order; provided that the date of this order shall be treated as the date of Executive Order 13957.\n\nSec. 3.  Amendments to Prior Administration Policy.  Executive Order 13957 is amended as follows:\n\n(a)  replace the letter “F” throughout, when used to designate an excepted service schedule, with the words “Policy/Career”;\n\n(b)  in section 1:\n\n(i)   remove the text between the words “make necessary” in the seventh paragraph and “excepting such positions” in the eighth paragraph; and\n\n(ii)  insert the text “competitive service and the” immediately before the words “adverse action procedures” in the eighth paragraph;\n\n(c)  in section 4(a)(i), replace the word “Positions” with the words “Career positions” in the final paragraph;\n\n(d)  in section 4(b)(i), add the text “providing for the application of Civil Service Rule 6.3(a) to Schedule Policy/Career positions and” after the words “as appropriate”;\n\n(e)  in section 5:\n\n(i)   insert the words “recommend that the President” immediately after the words “petition the Director to” in subsection (a)(i);\n\n(ii)  insert the following text at the end of subsection (c):\n\n“(vi)  directly or indirectly supervising employees in Schedule Policy/Career positions; or\n\n(vii)  duties that the Director otherwise indicates may be appropriate for inclusion in Schedule Policy/Career.”; and\n\n(iii)  amend subsection (d) to read “The Director shall promptly recommend to the President which positions should be placed in Schedule Policy/Career.”;\n\n(f)  in section 6:\n\n(i)   designate the existing text as new subsection  \n“(a)”;\n\n(ii)  insert a new subsection (b) that reads:  \n“(b)  Employees in or applicants for Schedule Policy/Career positions are not required to personally or politically support the current President or the policies of the current administration. They are required to faithfully implement administration policies to the best of their ability, consistent with their constitutional oath and the vesting of executive authority solely in the President.  Failure to do so is grounds for dismissal.”\n\nSec. 4.  Conforming Regulatory Changes.  The Director of the Office of Personnel Management (Director) shall promptly amend the Civil Service Regulations to rescind all changes made by the final rule of April 9, 2024, “Upholding Civil Service Protections and Merit System Principles,” 89 *Fed. Reg.* 24982, that impede the purposes of or would otherwise affect the implementation of Executive Order 13957.  Until such rescissions are effectuated (including the resolution of any judicial review), 5 CFR part 302, subpart F, 5 CFR 210.102(b)(3), and 5 CFR 210.102(b)(4) shall be held inoperative and without effect.\n\nSec. 5.  Additional Positions for Consideration.  Within 30 days of the date of this order, the Director shall, after consultation with the Executive Office of the President, issue guidance about additional categories of positions that executive departments and agencies should consider recommending for Schedule Policy/Career.\n\nSec. 6.  Revocation.  Executive Order 14003 of January 22, 2021 (Protecting the Federal Workforce), is hereby revoked, and any rules, regulations, guidance, or other agency policies effectuated under Executive Order 14003 shall not be enforced.  The heads of each executive department and agency shall review and identify existing agency actions relating to or arising under section 3(e)(v) and 3(f) of Executive Order 14003 (relating to suspending, revising, or rescinding revisions to discipline and unacceptable performance policies) and, as soon as practicable, suspend, revise, or rescind such actions identified in the review.\n\nSec. 7.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Restoring Accountability To Policy-Influencing Positions Within the Federal Workforce – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including sections 3301, 3302, and 7511 of",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-accountability-to-policy-influencing-positions-within-the-federal-workforce/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:29:55+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order, dated January 20, 2025, reinstates and modifies Executive Order 13957 from the prior administration, creating a new employment category called 'Schedule Policy/Career' (formerly Schedule F) within the federal workforce. The order aims to increase accountability for federal employees in policy-influencing positions by making them more easily removable and directly accountable to the President. The order cites concerns about career civil servants resisting executive leadership policies and notes low confidence among supervisors in their ability to remove problematic employees. Key changes include new position classifications, modified adverse action procedures, and requirements for employees to faithfully implement administration policies regardless of personal political views.",
  "eli5": "This order makes it easier for the President to hire and fire certain government workers who help make important decisions, even if they usually have special job protection. It's like changing the rules so the boss (the President) can more easily replace workers who don't follow instructions.",
  "keywords": [
    "Federal workforce",
    "Civil service reform",
    "Executive authority",
    "Employment classification",
    "Schedule Policy/Career",
    "Presidential powers",
    "Government accountability",
    "Federal employee removal",
    "Policy positions",
    "Administrative law"
  ],
  "issues": [
    "Potential reduction in civil service protections and job security",
    "Risk of politicization of career civil service positions",
    "Unclear scope of positions that could be reclassified",
    "Possible conflict with merit system principles",
    "Questions about implementation timeline and process",
    "Potential legal challenges from federal employee unions",
    "Impact on institutional knowledge and continuity of government operations"
  ],
  "citations": [
    "5 U.S.C. §§ 3301, 3302, and 7511",
    "Executive Order 13957 of October 21, 2020",
    "Executive Order 14003 of January 22, 2021",
    "5 CFR part 302, subpart F",
    "5 CFR 210.102(b)(3)",
    "5 CFR 210.102(b)(4)",
    "89 Fed. Reg. 24982",
    "Civil Service Rule 6.3(a)"
  ],
  "file_name": "restoring-accountability-to-policy-influencing-positions-within-the-federal-workforce"
}