{
  "title": "Return to In-Person Work – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nReturn to In-Person Work\n========================\n\nJanuary 20, 2025 \n\n\n\nHeads of all departments and agencies in the executive branch of Government shall, as soon as practicable, take all necessary steps to terminate remote work arrangements and require employees to return to work in-person at their respective duty stations on a full-time basis, provided that the department and agency heads shall make exemptions they deem necessary.\n\nThis memorandum shall be implemented consistent with applicable law.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Return to In-Person Work – The White House",
  "og:description": "Heads of all departments and agencies in the executive branch of Government shall, as soon as practicable, take all necessary steps to terminate",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/return-to-in-person-work/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-20T23:54:11+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This presidential memorandum directs all executive branch department and agency heads to end remote work arrangements and require employees to return to in-person work at their designated duty stations on a full-time basis. Department and agency heads retain discretionary authority to grant exemptions as they deem necessary. The memorandum includes a standard implementation clause requiring consistency with applicable law.",
  "eli5": "The President is telling all government workers that they need to stop working from home and come back to their offices to work. Some workers might still be allowed to work from home if their bosses say it's okay.",
  "keywords": [
    "remote work",
    "telework",
    "federal employees",
    "workplace policy",
    "return to office",
    "duty station",
    "executive branch",
    "government agencies",
    "workplace management",
    "administrative policy"
  ],
  "issues": [
    "No specific timeline provided beyond 'as soon as practicable'",
    "No criteria specified for granting exemptions",
    "Potential impact on employee morale and retention",
    "Possible conflicts with existing union agreements",
    "Accommodation requirements under ADA not specifically addressed",
    "No mention of continuity of operations planning",
    "Impact on agency productivity and cost savings not addressed",
    "No transition period specified"
  ],
  "citations": [
    "No specific citations to laws, rules, or authorities are provided in the text"
  ],
  "file_name": "return-to-in-person-work"
}