{
  "title": "Securing Our Borders – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nSECURING OUR BORDERS\n====================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act (INA), 8 U.S.C. 1101 *et seq.*, and section 301 of title 3, United States Code, it is hereby ordered:\n\nSection 1.  Purpose*.* Over the last 4 years, the United States has endured a large-scale invasion at an unprecedented level.  Millions of illegal aliens from nations and regions all around the world successfully entered the United States where they are now residing, including potential terrorists, foreign spies, members of cartels, gangs, and violent transnational criminal organizations, and other hostile actors with malicious intent.\n\nDeadly narcotics and other illicit materials have flowed across the border while agents and officers spend their limited resources processing illegal aliens for release into the United States.  These catch-and-release policies undermine the rule of law and our sovereignty, create substantial risks to public safety and security, and divert critical resources away from stopping the entry of contraband and fugitives into the United States.\n\nWe have limited information on the precise whereabouts of a great number of these illegal aliens who have entered the United States over the last 4 years.\n\nThis cannot stand.  A nation without borders is not a nation, and the Federal Government must act with urgency and strength to end the threats posed by an unsecured border.\n\nOne of my most important obligations is to protect the American people from the disastrous effects of unlawful mass migration and resettlement.\n\nMy Administration will marshal all available resources and authorities to stop this unprecedented flood of illegal aliens into the United States.\n\nSec. 2.  Policy*.*  It is the policy of the United States to take all appropriate action to secure the borders of our Nation through the following means:\n\n(a)  Establishing a physical wall and other barriers monitored and supported by adequate personnel and technology;\n\n(b)  Deterring and preventing the entry of illegal aliens into the United States;\n\n(c)  Detaining, to the maximum extent authorized by law, aliens apprehended on suspicion of violating Federal or State law, until such time as they are removed from the United States;\n\n(d)  Removing promptly all aliens who enter or remain in violation of Federal law;\n\n(e)  Pursuing criminal charges against illegal aliens who violate the immigration laws, and against those who facilitate their unlawful presence in the United States;\n\n(f)  Cooperating fully with State and local law enforcement officials in enacting Federal-State partnerships to enforce Federal immigration priorities; and\n\n(g)  Obtaining complete operational control of the borders of the United States.\n\nSec. 3.  Physical Barriers.  The Secretary of Defense and the Secretary of Homeland Security shall take all appropriate action to deploy and construct temporary and permanent physical barriers to ensure complete operational control of the southern border of the United States.\n\nSec. 4.  Deployment of Personnel.  (a)  The Secretary of Defense and the Secretary of Homeland Security shall take all appropriate and lawful action to deploy sufficient personnel along the southern border of the United States to ensure complete operational control; and\n\n(b)  The Attorney General and the Secretary of Homeland Security shall take all appropriate action to supplement available personnel to secure the southern border and enforce the immigration laws of the United States through the use of sections 1103(a)(2) and (4)-(6) of the INA (8 U.S.C. 1103(a)(2) and (4)-(6)).\n\nSec. 5.  Detention.  The Secretary of Homeland Security shall take all appropriate actions to detain, to the fullest extent permitted by law, aliens apprehended for violations of immigration law until their successful removal from the United States.  The Secretary shall, consistent with applicable law, issue new policy guidance or propose regulations regarding the appropriate and consistent use of lawful detention authority under the INA, including the termination of the practice commonly known as “catch-and-release,” whereby illegal aliens are routinely released into the United States shortly after their apprehension for violations of immigration law.\n\nSec. 6.  Resumption of Migrant Protection Protocols.  As soon as practicable, the Secretary of Homeland Security, in coordination with the Secretary of State and the Attorney General, shall take all appropriate action to resume the Migrant Protection Protocols in all sectors along the southern border of the United States and ensure that, pending removal proceedings, aliens described in section 235(b)(2)(C) of the INA (8 U.S.C. 1225(b)(2)(C)) are returned to the territory from which they came.\n\nSec. 7.  Adjusting Parole Policies.  The Secretary of Homeland Security shall, consistent with applicable law, take all appropriate action to:\n\n(a)  Cease using the “CBP One” application as a method of paroling or facilitating the entry of otherwise inadmissible aliens into the United States;\n\n(b)  Terminate all categorical parole programs that are contrary to the policies of the United States established in my Executive Orders, including the program known as the “Processes for Cubans, Haitians, Nicaraguans, and Venezuelans.”\n\n(c)  Align all policies and operations at the southern border of the United States to be consistent with the policy of Section 2 of this order and ensure that all future parole determinations fully comply with this order and with applicable law.\n\nSec. 8.  Additional International Cooperation.  The Secretary of State, in coordination with the Attorney General and the Secretary of Homeland Security, shall take all appropriate action to facilitate additional international cooperation and agreements, consistent with the policy of Section 2, including entering into agreements based upon the provisions of section 208(a)(2)(A) of the INA (8 U.S.C. 1158(a)(2)(A)) or any other applicable provision of law.\n\nSec. 9.  DNA and Identification Requirements.  (a)  The Attorney General and the Secretary of Homeland Security shall take all appropriate action to fulfill the requirements of the DNA Fingerprint Act of 2005, title X of Public Law 109-162, for all aliens detained under the authority of the United States; and\n\n(b)  The Secretary of Homeland Security shall take all appropriate action to use any available technologies and procedures to determine the validity of any claimed familial relationship between aliens encountered or apprehended by the Department of Homeland Security.\n\nSec. 10.  Prosecution of Offenses.  The Attorney General and the Secretary of Homeland Security shall take all appropriate action to prioritize the prosecution of offenses that relate to the borders of the United States, including the investigation and prosecution of offenses that involve human smuggling, human trafficking, child trafficking, and sex trafficking in the United States.\n\nSec. 11.  Additional Measures.  Within 14 days of the date of this order, the Secretary of State, the Attorney General, the Secretary of Health and Human Services, and the Secretary of Homeland Security shall provide recommendations to the President regarding the use of any other authority to protect the United States from foreign threats and secure the southern border.\n\nSec. 12.  General Provisions.  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Securing Our Borders – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/securing-our-borders/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:39:07+00:00",
  "article:modified_time": "2025-01-21T02:22:31+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order outlines a comprehensive approach to border security and immigration enforcement. It establishes policies to construct physical barriers along the southern border, expand detention capacity, resume the Migrant Protection Protocols (\"Remain in Mexico\"), terminate certain parole programs, and enhance law enforcement efforts. The order directs multiple federal agencies to coordinate on border security, including the Departments of Defense, Homeland Security, State, and Justice. Key provisions include mandating detention of apprehended individuals, ending \"catch-and-release\" practices, implementing DNA testing requirements, and prioritizing prosecution of border-related crimes including human trafficking. The order also calls for new international agreements and cooperation to manage migration flows.",
  "eli5": "The President wants to make the country's borders more secure by building walls, adding more guards, and making sure people who try to enter the country without permission are sent back home instead of being allowed to stay. It's like making sure your house has strong locks and only letting in people who have permission to visit.",
  "keywords": [
    "Border Security",
    "Immigration Enforcement",
    "Border Wall",
    "Detention",
    "Migrant Protection Protocols",
    "Parole",
    "Law Enforcement",
    "International Cooperation",
    "DNA Testing",
    "Human Trafficking",
    "Southern Border"
  ],
  "issues": [
    "Implementation costs not addressed",
    "Potential legal challenges to expanded detention policies",
    "International relations impact with Mexico and other countries",
    "Humanitarian concerns regarding detention conditions",
    "Resource allocation challenges for multiple agencies",
    "Constitutional questions regarding state-federal cooperation",
    "Practical feasibility of complete operational control"
  ],
  "citations": [
    "Immigration and Nationality Act (INA), 8 U.S.C. 1101 et seq.",
    "3 U.S.C. 301",
    "8 U.S.C. 1103(a)(2) and (4)-(6)",
    "8 U.S.C. 1225(b)(2)(C)",
    "8 U.S.C. 1158(a)(2)(A)",
    "DNA Fingerprint Act of 2005, Public Law 109-162, Title X"
  ],
  "action_type": "Executive Order",
  "file_name": "securing-our-borders"
}