{
  "title": "The Organization for Economic Co-operation and Development (OECD) Global Tax Deal (Global Tax Deal) – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nThe Organization for Economic Co-operation and Development (OECD) Global Tax Deal (Global Tax Deal)\n===================================================================================================\n\nJanuary 20, 2025 \n\n\n\nMEMORANDUM FOR THE SECRETARY OF THE TREASURY\n\nTHE UNITED STATES TRADE REPRESENTATIVE\n\nTHE PERMANENT REPRESENTATIVE OF THE UNITED STATES TO THE ORGANIZATION FOR ECONOMIC CO-OPERATION AND DEVELOPMENT\n\nSUBJECT:                  The Organization for Economic Co-operation and Development (OECD) Global Tax Deal (Global Tax Deal)\n\nThe OECD Global Tax Deal supported under the prior administration not only allows extraterritorial jurisdiction over American income but also limits our Nation’s ability to enact tax policies that serve the interests of American businesses and workers.  Because of the Global Tax Deal and other discriminatory foreign tax practices, American companies may face retaliatory international tax regimes if the United States does not comply with foreign tax policy objectives.  This memorandum recaptures our Nation’s sovereignty and economic competitiveness by clarifying that the Global Tax Deal has no force or effect in the United States.\n\nSection 1.  *Applicability of the Global Tax Deal*.  The Secretary of the Treasury and the Permanent Representative of the United States to the OECD shall notify the OECD that any commitments made by the prior administration on behalf of the United States with respect to the Global Tax Deal have no force or effect within the United States absent an act by the Congress adopting the relevant provisions of the Global Tax Deal.  The Secretary of the Treasury and the United States Trade Representative shall take all additional necessary steps within their authority to otherwise implement the findings of this memorandum.\n\nSec. 2.  Options for Protection from Discriminatory and Extraterritorial Tax Measures.  The Secretary of the Treasury in consultation with the United States Trade Representative shall investigate whether any foreign countries are not in compliance with any tax treaty with the United States or have any tax rules in place, or are likely to put tax rules in place, that are extraterritorial or disproportionately affect American companies, and develop and present to the President, through the Assistant to the President for Economic Policy, a list of options for protective measures or other actions that the United States should adopt or take in response to such non-compliance or tax rules.  The Secretary of the Treasury shall deliver findings and recommendations to the President, through the Assistant to the President for Economic Policy, within 60 days.\n\nSec. 3.  General Provisions.  (a)  Nothing in this memorandum shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department, agency, or its head; or\n\n(ii)  the functions of the Director of OMB relating to budgetary, administrative, or legislative proposals.\n\n(b)  This memorandum shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "The Organization for Economic Co-operation and Development (OECD) Global Tax Deal (Global Tax Deal) – The White House",
  "og:description": "MEMORANDUM FOR THE SECRETARY OF THE TREASURY THE UNITED STATES TRADE REPRESENTATIVE THE PERMANENT REPRESENTATIVE OF THE UNITED STATES TO THE ORGANIZATION",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/the-organization-for-economic-co-operation-and-development-oecd-global-tax-deal-global-tax-deal/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:44:20+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Presidential Memorandum addresses the OECD Global Tax Deal supported by the previous administration. The memorandum declares that the Deal has no force or effect in the United States without Congressional action. It directs the Secretary of Treasury and US Representative to OECD to formally notify the OECD of this position. Additionally, it requires the Treasury Secretary and Trade Representative to investigate foreign countries' tax practices that may discriminate against or disproportionately affect US companies, and develop protective measures in response. The memo includes standard provisions regarding implementation within existing legal authority and budgetary constraints.",
  "eli5": "The President wrote a note saying America won't follow other countries' tax rules unless Congress agrees to them. He also asked his team to watch out for other countries trying to be unfair to American companies with their tax rules.",
  "keywords": [
    "OECD",
    "Global Tax",
    "International taxation",
    "Tax treaties",
    "Foreign relations",
    "Economic policy",
    "Treasury",
    "Trade",
    "Sovereignty",
    "Economic competitiveness"
  ],
  "issues": [
    "Potential international backlash from withdrawing from OECD tax agreement",
    "Possible retaliatory measures from other countries",
    "Lack of clarity on what constitutes 'discriminatory' foreign tax practices",
    "Impact on multinational corporations and international trade relations",
    "Question of whether Congressional action is truly required for international tax agreements"
  ],
  "citations": [
    "No specific citations to US Code, CFR, or other authorities are provided in the text"
  ],
  "action_type": "Presidential Memorandum",
  "file_name": "the-organization-for-economic-co-operation-and-development-oecd-global-tax-deal-global-tax-deal"
}