{
  "title": "Unleashing Alaska's Extraordinary Resource Potential – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nUNLEASHING ALASKA’S EXTRAORDINARY RESOURCE POTENTIAL\n====================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1.  Background.The State of Alaska holds an abundant and largely untapped supply of natural resources including, among others, energy, mineral, timber, and seafood. Unlocking this bounty of natural wealth will raise the prosperity of our citizens while helping to enhance our Nation’s economic and national security for generations to come.  By developing these resources to the fullest extent possible, we can help deliver price relief for Americans, create high-quality jobs for our citizens, ameliorate our trade imbalances, augment the Nation’s exercise of global energy dominance, and guard against foreign powers weaponizing energy supplies in theaters of geopolitical conflict.\n\nUnleashing this opportunity, however, requires an immediate end to the assault on Alaska’s sovereignty and its ability to responsibly develop these resources for the benefit of the Nation.  It is, therefore, imperative to immediately reverse the punitive restrictions implemented by the previous administration that specifically target resource development on both State and Federal lands in Alaska.\n\nSec. 2.  Policy.It is the policy of the United States to:\n\n(a)  fully avail itself of Alaska’s vast lands and resources for the benefit of the Nation and the American citizens who call Alaska home;\n\n(b)  efficiently and effectively maximize the development and production of the natural resources located on both Federal and State lands within Alaska;\n\n(c)  expedite the permitting and leasing of energy and natural resource projects in Alaska; and\n\n(d)  prioritize the development of Alaska’s liquified natural gas (LNG) potential, including the sale and transportation of Alaskan LNG to other regions of the United States and allied nations within the Pacific region.\n\nSec. 3.  Specific Agency Actions.(a)  The heads of all executive departments and agencies, including but not limited to the Secretary of the Interior; the Secretary of Commerce, acting through the Under Secretary of Commerce for Oceans and Atmosphere; and the Secretary of the Army acting through the Assistant Secretary of the Army for Public Works, shall exercise all lawful authority and discretion available to them and take all necessary steps to:\n\n(i)   rescind, revoke, revise, amend, defer, or grant exemptions from any and all regulations, orders, guidance documents, policies, and any other similar agency actions that are inconsistent with the policy set forth in section 2 of this order, including but not limited to agency actions promulgated, issued, or adopted between January 20, 2021, and January 20, 2025; and\n\n(ii)  prioritize the development of Alaska’s LNG potential, including the permitting of all necessary pipeline and export infrastructure related to the Alaska LNG Project, giving due consideration to the economic and national security benefits associated with such development.\n\n(b)  In addition to the actions outlined in subsection (a) of this section, the Secretary of the Interior shall exercise all lawful authority and discretion available to him and take all necessary steps to:\n\n(i)       withdraw Secretarial Order 3401 dated June 1, 2021 (Comprehensive Analysis and Temporary Halt on All Activities in the Arctic National Wildlife Refuge Relating to the Coastal Plain Oil and Gas Leasing Program);\n\n(ii)      rescind the cancellation of any leases within the Arctic National Wildlife Refuge, other than such lease cancellations as the Secretary of the Interior determines are consistent with the policy interests described in section 2 of this order, initiate additional leasing through the Coastal Plain Oil and Gas Leasing Program, and issue all permits, right-of-way permits, and easements necessary for the exploration, development, and production of oil and gas from leases within the Arctic National Wildlife Refuge;\n\n(iii)     rescind the final supplemental environmental impact statement entitled “Coastal Plain Oil and Gas Leasing Program Supplemental Environmental Impact Statement,” which is referred to in “Notice of Availability of the Final Coastal Plain Oil and Gas Leasing Program Supplemental Environmental Impact Statement, Alaska” 89 *Fed. Reg.* 88805 (November 8, 2024);\n\n(iv)      place a temporary moratorium on all activities and privileges granted to any party pursuant to the record of decision signed on December 8, 2024, entitled “Coastal Plain Oil and Gas Leasing Program Record of Decision,” which is referred to in “Notice of Availability of the Record of Decision for the Final Supplemental Environmental Impact Statement for the Coastal Plain Oil and Gas Leasing Program, Alaska,” 89 *Fed. Reg.* 101042 (December 13, 2024), in order to review such record of decision in light of alleged legal deficiencies and for consideration of relevant public interests, and, as appropriate, conduct a new, comprehensive analysis of such deficiencies, interests, and environmental impacts;\n\n(v)       reinstate the final environmental impact statement entitled “Final Environmental Impact Statement for the Coastal Plain Oil and Gas Leasing Program,” which is referred to in “Notice of Availability,” 84 *Fed. Reg.* 50472 (September 25, 2019);\n\n(vi)       reinstate the record of decision signed on August 21, 2020, entitled “Coastal Plain Oil and Gas Leasing Program Record of Decision,” which is referred to in “Notice of 2021 Coastal Plain Alaska Oil and Gas Lease Sale and Notice of Availability of the Detailed Statement of Sale,” 85 *Fed. Reg*. 78865 (December 7, 2020);\n\n(vii)     evaluate changes to, including the potential recission of, Public Land Order 5150, signed by the Assistant Secretary of the Interior on December 28, 1971, and any subsequent amendments, modifications, or corrections to it;\n\n(viii)    place a temporary moratorium on all activities and privileges granted to any party pursuant to the record of decision signed on June 27, 2024, entitled “Ambler Road Supplemental Environmental Impact Statement Record of Decision,” which is referred to in “Notice of Availability of the Ambler Road Final Supplemental Environmental Impact Statement, Alaska,” 89 *Fed. Reg.* 32458 (April 26, 2024),  in order to review such record of decision in light of alleged legal deficiencies and for consideration of relevant public interests and, as appropriate, conduct a new, comprehensive analysis of such deficiencies, interests, and environmental impacts; and reinstate the record of decision signed on July 23, 2020, by the Bureau of Land Management and United States Army Corps of Engineers entitled “Ambler Road Environmental Impact Statement Joint Record of Decision,” which is referred to in “Notice of Availability of the Record of Decision for the Ambler Mining District Industrial Access Road Environmental Impact Statement,” 85 *Fed. Reg.* 45440 (July 28, 2020);\n\n(ix)      rescind the Bureau of Land Management final rule entitled “Management and Protection of the National Petroleum Reserve in Alaska,” 89 *Fed. Reg.* 38712 (May 7, 2024);\n\n(x)        rescind any guidance issued by the Bureau of Land Management related to implementation of protection of subsistence resource values in the existing special areas and proposed new and modified special areas in the National Petroleum Reserve in Alaska, as published on their website on January 16, 2025;\n\n(xi)      facilitate the expedited development of a road corridor between the community of King Cove and the all-weather airport located in Cold Bay;\n\n(xii)    place a temporary moratorium on all activities and privileges granted to any party pursuant to the record of decision signed on April 25, 2022, entitled “National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision,” (NEPA No. DOI-BLM-AK-R000-2019-0001-EIS), in order to review such record of decision in light of alleged legal deficiencies and for consideration of relevant public interests and, as appropriate, conduct a new, comprehensive analysis of such deficiencies, interests, and environmental impacts;\n\n(xiii)   rescind the Bureau of Land Management final rule entitled “Management and Protection of the National Petroleum Reserve in Alaska,” 89 *Fed. Reg.* 38712 (May 7, 2024), and rescind the Bureau of Land Management notice entitled “Special Areas Within the National Petroleum Reserve in Alaska,” 89 *Fed. Reg.* 58181 (July 17, 2024);\n\n(xiv)    reinstate Secretarial Order 3352 dated May 17, 2017 (National Petroleum Reserve – Alaska), which is referred to in “Final Report:  Review of the Department of the Interior Actions that Potentially Burden Domestic Energy,” 82 *Fed. Reg.* 50532 (November 1, 2017), and the record of decision signed on December 31, 2020, entitled “National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision,” which is referred to in “Notice of Availability of the National Petroleum Reserve in Alaska Integrated Activity Plan Final Environmental Impact Statement,” 85 *Fed. Reg.* 38388 (June 26, 2020);\n\n(xv)     reinstate the following Public Land Orders in their original form:\n\n1. Public Land Order No. 7899, signed by the Secretary of the Interior on January 11, 2021;\n   1. Public Land Order No. 7900, signed by the Secretary of the Interior on January 16, 2021;\n   1. Public Land Order No. 7901, signed by the Secretary of the Interior on January 16, 2021;\n   1. Public Land Order No. 7902, signed by the Secretary of the Interior on January 15, 2021;\n   1. Public Land Order No. 7903, signed by the Secretary of the Interior on January 16, 2021; and\n   1. any other such Public Land Order that the Secretary of the Interior determines would further the policy interests described in section 2 of this order.\n\n(xvi)    immediately review all Department of the Interior guidance regarding the taking of Alaska Native lands into trust and all Public Land Orders withdrawing lands for selection by Alaska Native Corporations to determine if any such agency action should be revoked to ensure the Department of the Interior’s actions are consistent with the Alaska Statehood Act of 1958 (Public Law 85-508), the Alaska National Interest Lands Conservation Act (ANILCA) (16 U.S.C. 3101 *et seq.*), the Alaska Native Claims Settlement Act of 1971 (43 U.S.C. 1601, *et seq*.), the Alaska Land Transfer Acceleration Act (Public Law 108-452), and the Alaska Native Vietnam-era Veterans Land Allotment Program under section 1629g-1 of title 43, United States Code.\n\n(xvii)   rescind the record of decision “Central Yukon Record of Decision and Approved Resource Management Plan,” signed on November 12, 2024, which is referred to in “Notice of Availability of the Record of Decision and Approved Resource Management Plan for the Central Yukon Resource Management Plan/Environmental Impact Statement, Alaska,” 89 *Fed. Reg.* 92716 (November 22, 2024);\n\n(xviii)  reimplement the draft resource management plan and environmental impact statement referenced in the National Park Service notice entitled “Notice of Availability for the Central Yukon Draft Resource Management Plan/Environmental Impact Statement, Alaska,” 85 *Fed. Reg.* 80143 (December 11, 2020);\n\n(xix)    rescind the National Park Service final rule entitled “Alaska; Hunting and Trapping in National Preserves,” 89 *Fed. Reg.* 55059 (July 3, 2024), and reinstate the National Park Service final rule entitled “Alaska; Hunting and Trapping in National Preserves,” 85 *Fed. Reg.* 35181 (June 9, 2020), in its original form;\n\n(xx)     deny the pending request to the United States Fish and Wildlife Service to an establish indigenous sacred site in the Coastal Plain of the Arctic National Wildlife Refuge;\n\n(xxi)    immediately conduct a review of waterways in the State of Alaska and direct the Bureau of Land Management, in consultation with the State of Alaska, to provide recommendations of navigable waterways subject to the equal footing doctrine and the Submerged Lands Act of 1953, as amended, 43 U.S.C. 1301 *et seq.*, and prepare Recordable Disclaimers of Interest pursuant to section 315 of the Federal Land Policy and Management Act of 1976, 43 U.S.C. 1745, to restore ownership of said waterways to the State as appropriate;\n\n(xxii)   direct all bureaus of the Department of the Interior to consider the Alaskan cultural significance of hunting and fishing and the statutory priority of subsistence management required by the ANILCA, to conduct meaningful consultation with the State fish and wildlife management agencies prior to enacting land management plans or other regulations that affect the ability of Alaskans to hunt and fish on public lands, and to ensure to the greatest extent possible that hunting and fishing opportunities on Federal lands are consistent with similar opportunities on State lands; and\n\n(xxiii)  identify and assess, in collaboration with the Secretary of Defense, the authorities and public and private resources necessary to immediately achieve the development and export of energy resources from Alaska — including but not limited to the long-term viability of the Trans-Alaska Pipeline System and the associated Federal right-of-way as an energy corridor of critical national importance — to advance the Nation’s domestic and regional energy dominance, and submit that assessment to the President.\n\n(c)  In addition to the actions outlined in subsection (a) of this section, the Secretary of Agriculture shall place a temporary moratorium on all activities and privileges authorized by the final rule and record of decision entitled  “Special Areas; Roadless Area Conservation; National Forest System Lands in Alaska,” 88 *Fed. Reg*. 5252 (January 27, 2023), in order to review such rule and record of decision in light of alleged legal deficiencies and for consideration of relevant public interests and, as appropriate, conduct a new, comprehensive analysis of such deficiencies, interests, and environmental impacts.  Further, the Secretary of Agriculture shall reinstate the final rule entitled “Special Areas; Roadless Area Conservation; National Forest System Lands in Alaska,” 85 *Fed. Reg.* 68688 (October 29, 2020).\n\n(d)  In addition to the actions outlined in subsection (a) of this section, the Secretary of the Army, acting through the Assistant Secretary of the Army for Civil Works, shall render all assistance requested by the Governor of Alaska to facilitate the clearing and maintenance of transportation infrastructure, consistent with applicable law.All such requests for assistance shall be transmitted to the Secretary of Defense, Secretary of the Interior, and Assistant to the President for Economic Policy for approval prior to initiation.\n\n(e)  The Assistant Secretary of the Army for Civil Works, under the direction of the Secretary of the Army, shall immediately review, revise, or rescind any agency action that may in any way hinder, slow or otherwise delay any critical project in the State of Alaska.\n\n(f)  The Secretary of Commerce, in coordination with the Secretary of the Interior, shall immediately review, revise or rescind any agency action that may in any way hinder, slow or otherwise delay any critical project in the State of Alaska.\n\nSec. 4.  General Provisions.(a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Unleashing Alaska's Extraordinary Resource Potential – The White House",
  "og:description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  Section 1.",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-alaskas-extraordinary-resource-potential/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:45:57+00:00",
  "article:modified_time": "2025-01-21T02:19:15+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order focuses on maximizing resource development in Alaska by reversing various environmental and regulatory restrictions implemented during 2021-2025. The order directs multiple federal agencies, particularly the Department of Interior, to rescind previous orders, reinstate prior policies, and expedite permitting for energy and natural resource projects. Key areas include the Arctic National Wildlife Refuge, National Petroleum Reserve, and Alaska LNG development. The order emphasizes economic development, energy security, and state sovereignty while directing reviews of land management, hunting rights, and infrastructure projects.",
  "eli5": "The President signed an order saying Alaska can use more of its natural resources like oil, gas, and minerals that are found in its land. This would help create jobs and make America less dependent on other countries for energy.",
  "keywords": [
    "Alaska",
    "Natural Resources",
    "Energy Development",
    "Oil and Gas",
    "Environmental Policy",
    "Arctic National Wildlife Refuge",
    "National Petroleum Reserve",
    "LNG",
    "Land Management",
    "Hunting Rights",
    "Infrastructure"
  ],
  "issues": [
    "Potential environmental impact from increased resource development",
    "Conflicts between economic development and conservation goals",
    "Impact on indigenous communities and rights",
    "Legal challenges to regulatory changes",
    "Implementation timeline and practical feasibility",
    "Balance between federal and state control"
  ],
  "citations": [
    "Alaska Statehood Act of 1958 (Public Law 85-508)",
    "Alaska National Interest Lands Conservation Act (16 U.S.C. 3101)",
    "Alaska Native Claims Settlement Act of 1971 (43 U.S.C. 1601)",
    "Alaska Land Transfer Acceleration Act (Public Law 108-452)",
    "Submerged Lands Act of 1953 (43 U.S.C. 1301)",
    "Federal Land Policy and Management Act of 1976 (43 U.S.C. 1745)",
    "85 Fed. Reg. 35181",
    "89 Fed. Reg. 88805",
    "89 Fed. Reg. 38712",
    "85 Fed. Reg. 68688"
  ],
  "action_type": "Executive Order",
  "file_name": "unleashing-alaskas-extraordinary-resource-potential"
}