{
  "title": "Withdrawing The United States From The World Health Organization – The White House\n",
  "markdown": "\n[Presidential Actions](https://www.whitehouse.gov/presidential-actions/) \n\nWITHDRAWING THE UNITED STATES FROM THE WORLDHEALTH ORGANIZATION\n===============================================================\n\nEXECUTIVE ORDER \nJanuary 20, 2025 \n\n\n\nWITHDRAWING THE UNITED STATES FROM THE WORLD\n\nHEALTH ORGANIZATION\n\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\n\nSection 1**.**  Purpose*.*The United States noticed its withdrawal from the World Health Organization (WHO) in 2020 due to the organization’s mishandling of the COVID-19 pandemic that arose out of Wuhan, China, and other global health crises, its failure to adopt urgently needed reforms, and its inability to demonstrate independence from the inappropriate political influence of WHO member states.  In addition, the WHO continues to demand unfairly onerous payments from the United States, far out of proportion with other countries’ assessed payments.  China, with a population of 1.4 billion, has 300 percent of the population of the United States, yet contributes nearly 90 percent less to the WHO.\n\nSec. 2**.**  Actions*.*  (a) The United States intends to withdraw from the WHO.  The Presidential Letter to the Secretary-General of the United Nations signed on January 20, 2021, that retracted the United States’ July 6, 2020, notification of withdrawal is revoked.\n\n(b)  Executive Order 13987 of January 25, 2021 (Organizing and Mobilizing the United States Government to Provide a Unified and Effective Response to Combat COVID–19 and to Provide United States Leadership on Global Health and Security), is revoked.\n\n(c)  The Assistant to the President for National Security Affairs shall establish directorates and coordinating mechanisms within the National Security Council apparatus as he deems necessary and appropriate to safeguard public health and fortify biosecurity.\n\n(d)  The Secretary of State and the Director of the Office of Management and Budget shall take appropriate measures, with all practicable speed, to:\n\n(i)    pause the future transfer of any United States Government funds, support, or resources to the WHO;\n\n(ii)   recall and reassign United States Government personnel or contractors working in any capacity with the WHO; and\n\n(iii)  identify credible and transparent United States and international partners to assume necessary activities previously undertaken by the WHO.\n\n(e)  The Director of the White House Office of Pandemic Preparedness and Response Policy shall review, rescind, and replace the 2024 U.S. Global Health Security Strategy as soon as practicable.\n\nSec. 3.  Notification.  The Secretary of State shall immediately inform the Secretary-General of the United Nations, any other applicable depositary, and the leadership of the WHO of the withdrawal.\n\nSec. 4.  Global System Negotiations.  While withdrawal is in progress, the Secretary of State will cease negotiations on the WHO Pandemic Agreement and the amendments to the International Health Regulations, and actions taken to effectuate such agreement and amendments will have no binding force on the United States.\n\nSec. 5.  General Provisions*.*  (a)  Nothing in this order shall be construed to impair or otherwise affect:\n\n(i)   the authority granted by law to an executive department or agency, or the head thereof; or\n\n(ii)  the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n\n(b)  This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n\n(c)  This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n\nTHE WHITE HOUSE,\n\nJanuary 20, 2025.\n\n\n\n",
  "og:locale": "en_US",
  "og:type": "article",
  "og:title": "Withdrawing The United States From The World Health Organization – The White House",
  "og:description": "WITHDRAWING THE UNITED STATES FROM THE WORLD HEALTH ORGANIZATION  By the authority vested in me as President by the Constitution and the laws of the",
  "og:url": "https://www.whitehouse.gov/presidential-actions/2025/01/withdrawing-the-united-states-from-the-worldhealth-organization/",
  "og:site_name": "The White House",
  "article:publisher": "https://www.facebook.com/WhiteHouse/",
  "article:published_time": "2025-01-21T01:27:04+00:00",
  "article:modified_time": "2025-01-21T02:25:15+00:00",
  "og:image": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png",
  "og:image:width": "1200",
  "og:image:height": "628",
  "og:image:type": "image/png",
  "summary": "This Executive Order directs the withdrawal of the United States from the World Health Organization (WHO). The order cites concerns about WHO's handling of the COVID-19 pandemic, lack of reforms, alleged political influence from member states, and disproportionate financial burden on the US compared to other nations. Key actions include: revoking the 2021 retraction of withdrawal notice, halting fund transfers to WHO, recalling US personnel, identifying alternative partners, reviewing global health security strategy, and ceasing negotiations on the WHO Pandemic Agreement. The order includes standard provisions about implementation within existing legal frameworks and appropriations.",
  "eli5": "The President decided that America should leave a big international health group called WHO because he thinks they didn't do a good job during COVID-19 and it costs America too much money compared to other countries.",
  "keywords": [
    "WHO",
    "World Health Organization",
    "withdrawal",
    "COVID-19",
    "global health",
    "international relations",
    "pandemic response",
    "public health",
    "biosecurity",
    "United Nations"
  ],
  "issues": [
    "Potential impact on global health coordination and pandemic response",
    "Absence of specific transition plan for US global health initiatives",
    "No detailed analysis of financial implications",
    "Unclear timeline for complete withdrawal process",
    "Potential diplomatic consequences with WHO member states",
    "Impact on ongoing international health programs and research"
  ],
  "citations": [
    "Executive Order 13987 of January 25, 2021",
    "2024 U.S. Global Health Security Strategy",
    "WHO Pandemic Agreement",
    "International Health Regulations"
  ],
  "action_type": "Executive Order",
  "file_name": "withdrawing-the-united-states-from-the-worldhealth-organization"
}